{"Petersen Automotive Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Petersen Automotive Museum", "url": "/Attraction_Review-g32655-d116989-Reviews-Petersen_Automotive_Museum-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/f0/33/7a/lightning-mcqueen-outside.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1621"}, "address": {"@type": "PostalAddress", "streetAddress": "6060 Wilshire Blvd", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90036-3605", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Porsche Exhibition", "Fantastic looking building that houses some off the best cars that I have ever seen had to go back to see the new exhibit the Porsche Effect as last March they had the Bugatti exhibition. One highlight was the Ford GT40 holographic display went for around 4 minutes very good integration of technology used with a real display. Highly recommend to any car enthusiast. Cool as.\nCheers Brett from Hastings Point NSW Australia.\nShow less"], ["Reviewed 2 days ago", 5.0, "Basment Treasure", "Private tour of the basement collection. Last time I was there was over 30 years ago and didn't know about the basement."], ["Reviewed 3 days ago", 5.0, "Impressive", "A nice modern museum with a great collection of cars. The vault ticket is in my opinion worth the price. In general I believe one of their sponsors are Porsche, I’m not a big fan of Porsche but was interesting."], ["Reviewed 1 week ago", 5.0, "Excellent Vault Tour & Collection", "My husband and I have loved cars for a long time but we'd never been to the Petersen Automotive Museum. The building which houses the collection is a architectural masterpiece! Once inside, start on the third floor where the history of the automobile is well curated. Lots of gorgeous cars or all types and ages. We opted to take the Vault tour which is where Mr. Petersen's personal collection is housed. Our guide, Andy, did an excellent job of relating the provenance of most of the cards. So many interesting stories behind these beautifully restored cars. A real plus was the nice restaurant, Dra Go. We stayed for lunch and the food was very good and the prices reasonable.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing Car Collection. Worth the Price for the Car Lover.", "I have been here a few times and have seen a few changing exhibits. Some amazing classics, cars from the silver screen and some bizarre cars you have never heard of. (A Steam Car?! What?!) Finish the day at Johnny Rockets. I am a car guy, and a museum buff and this is my heaven.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Museum", "A very comprehensive museum of cars. History, development, technology and design. Very enjoyable to kill a couple of hours."], ["Reviewed 1 week ago", 4.0, "Vault tour is a must, otherwise lots of Porsches", "I spent a very happy morning at the Peterson. The vault tour is a good idea as you see many cars stored there. the guide gave a very full history including how Lincoln and Cadillac got there names. There are vintage and classic cars, and some race cars. We saw presidents cars and movie cars from green hornet and fast and furious. Bugatti and Rolls Royce were valued in millions, and some owners garage there cars at the Peterson due to insurance. I liked the 1972 Renault Alpine rally car, the 1987 F1 McLaren of Alain Prost. But my favourite was the Toyota 2000 GT (James Bond you only live twice). It was a real shame no photos were allowed on the vault tour.\nthe rest of the museum is interesting. they have the Batman car from the Michael Keaton films, and the Bale Bat bike. A lots of Porsches road and race. Some nice Ferraris and some classic bikes (Harley and Indian) some cars decorated for art (not my thing). a gift shop and restaurant.\nShow less"], ["Reviewed 1 week ago", 4.0, "Cool Cars", "Part of the show being in California is seeing all the nice cars on the roads. Yet, I heard about the Porsche exhibit, and decided to make a visit. I spoke with a security guard and started at the top and worked my way down. You get a sense of car history and finer appreciation of automobiles. I was even wowed by the \"Batmobile.\" The sheer beauty of the sports cars, including early year models was amazing. They also have a great collection of motorcycles. And the design studio was interesting. I wished they had included Lamborgini. Fine collection nevertheless. Some type of interactive display would have been nice. It's possible there was something in the family section, which I didn't visit. My only downside was being shadowed by a security guard. I never had this experience at the British Museum, Met, Louvre, et al. I did see a fellow African-American, an employee--cleaning the cars....\nShow less"], ["Reviewed 1 week ago", 4.0, "Great museum, but lacks a sense of place", "Filled with beautiful cars and some interesting exhibits, the Petersen left me disappointed in its lack of emphasis on the Southern California car culture that sparked America's love of custom and hot rod autos. There was a superb display of Bugattis that seemed out of place here.\nOn the plus side, various exhibits that trace the history of automotive history and development were interesting and informative.\nA small exhibit of low riders seemed like an afterthought, and showed only famous and highly detailed cars; I'd like to have seen some more representative of what's on the street.\nGiven the location, and Hot Rod magazine heritage of Petersen, I think there should be a permanent exhibit on the SoCal car culture and the cars and companies that created American auto customization and racing development.\nShow less"], ["Reviewed 1 week ago", 5.0, "Vault tour amazing.", "We opted to see the vault tour, which lasted well over 90 minutes. It was worth the money to see the cars acquired. Some are worth millions. There was an official car that came fron Jordan, another couple from Russia, some past presidents' cars, cars that had been made and used on Hollywood sets. Some porches, cadillacs, an amazing Rolls Royce with circular doors and windows. A Honda, the original that sold well in USA in the 60's for an economical family car.\n\nThe tour guide was really knowledgeable and towards the end of the tour he had to hurry to finish. We were lucky that our group was split in two, so there were only 12 so we could see and hear fine. Perhaps seeing less vehicles might give more time for questions etc.\n\nThere is a shop and restaurant inside and the staff are helpful. If I hadn't done the vault tour I would have thought it average.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A Car Collectors Dream", "For anyone interested in classic cars this is the place. Once of the largest collections under one roof. Very enjoyable way to spend an afternoon."], ["Reviewed 2 weeks ago", 3.0, "Nice collection", "What I would call an upscale car museum. Several cars that were used in movies and some concept cars made by different companies and a few other special exhibits. If you are looking for a bunch of old muscle cars, you won't find them here. Still worth checking out if you are in the area.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Casual sunday", "Went on super bowl sunday and managed to avoid a crowd. Enjoyable and educational. Fun checking out some one of a kind cars and motor bikes"], ["Reviewed 2 weeks ago", 4.0, "Nice museum", "I've wanted to visit this museum for a long time. We we're visiting in the area, and with the current Porsche exhibit, I couldn't resist. The vault tour was interesting, if maybe a little overpriced. The regular collection was nice and worth the price of admission. The Porsche Effect exhibit was terrific. Porsche fans should not miss it. Drago restaurant on site is very nice, but consider making a reservation.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great car museum", "Our family of three (two adults and one 13 year old boy) visited the Petersen Automotive Museum on Sunday, 2/4/18. While we like cars, we are in no way car enthusiasts but there was enough variety that all of us thoroughly enjoyed the museum. We went at opening and were able to find free parking on the street one block from the museum. We did not get tickets for the Vault but found there was enough to enjoy with the standard ticket.\n\nHighlights: Porsche and Ferrari exhibits, art cars, Lightening McQueen, Back to the Future Delorean, Ford Model T, McLaren P1, concept cars and race simulation. The building itself is very cool as is the museum shop.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Pretty cool auto museum!", "I have not been to the Petersen Auto Museum since after the renovation in 2015. Altho, I did see some of the Petersen Collection when they had them on exhibit at the Reagan Library during renovation.\nLove to see the variety of autos and motorcycles from Hollywood exhibit to all the red Ferrari vehicles and modern technology of Tesla brand. We just missed the special Porsche exhibit as they were setting it up for that Saturday opening. Return visit!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great car Museum", "Did a tour of the museum and then a tour downstairs of all their more unusual cars. Very knowledgeable tour guide, great videos, and beautiful cars."], ["Reviewed 3 weeks ago", 4.0, "Showcase museum", "Worth a visit for those interested in beautifully restored cars, especially Porche fans. It is already has pricey entrance fees excluding car parking of $15. But a small rebate of $6 if dining at the onsite restaurant but you do need to ask for the eligible card. Car parking is free for purchases >$75 at the gift shop.\nMuseum is interesting with over 100 cars on display. For those interested in visiting the ‘vault’ too, it is an additional $20 and there are timed tours for this.\nPersonal preference is the Carroll Shelby Museum in Las Vegas, being a ‘working’ Museum.\n\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "very cool, appreciated by adults, kids, males and females", "this place provides history of automobiles, explanation of how autos work, including a children section. Nice design college on site to help explain more auto design. Hollywood cars, antique cars and alternative fuel cars - it has everything. reasonable parking"], ["Reviewed 3 weeks ago", 5.0, "Outstanding Auto Museum", "The Petersen is one of the world's outstanding auto museums and a definite must see for any auto enthusiasts when in Los Angeles. They have special and standing exhibits and an excellent \"Hidden Garage\" that you can visit for a fee and appointment. That is hosted by a guide under the museum with many restored and unrestored autos, most with interesting histories. During our visit, the underground museum had just acquired the original \"Back to the Future\" Delorean that was used in the movie. Several one of a kind Ferrari's and exotic cares were also there. The restored 1930's exhibit was beautiful. Be sure to bring your cameras and allow several hours with comfortable walking shoes.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "For the car lover", "What is unique about the Petersen Museum is the \" Hollywood\" influence, i.e, Batmobile, cars used in movies, the \"southern California \"influence i.e. hot rods, the \" Latino\" influence, along with several presentations of historical autos.\n\nAlthough this museum has its share of expensive, impeccable foreign cars, this , in my opinion, is not the primary theme.\n\nBecause this museum is downtown, ( I think) the grounds are not spacious. One will need to know in advance where the museum is located; the likelihood of finding it fortuitously seems somewhat unlikely to me.\n\nIf you are any type of car (and motorcycle ) buff, you would clearly enjoy this.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Must See If You Like Cars", "We live in L.A. and I surprised my husband with a visit to the Petersen for his birthday. He loves cars, I like me them. Yet I think I enjoyed the tour even more than he did. It was really cool! You really want to splurge for the Vault Tour. That’s a must see. We thoroughly enjoyed the whole museum. We will be going back as the exhibits change. There’s a nice restaurant on the premises too. Wear comfortable shoes because you will walk a lot and it’s concrete flooring.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Gearhead must see in LA.", "Great museum. The vault tour was interesting and worth the extra money. Start at the top floor and work your way down. Every floor has a unique display."], ["Reviewed 3 weeks ago", 5.0, "Awesome museum!", "We recently visited this museum for the first time and spent even more time there than expected. The quality of displays was TOP SHELF! Special exhibit on Ferrari, and loads of extra info. From the security guards scattered about. Also really enjoyed the Indian/Harley display and couldn’t believe the details in the Chicano art showcased in the High Art of Riding Low gallery. Outstanding!\nDid the extra tour option the the vault which was super interesting. Since many items in the vault are on loan to the museum, you never know what be there. Some of the vehicles there were truly one of a kind. Highly recommend.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful musuem, children's section too small/limited", "The Petersen Automotive Museum is conveniently located in the Miracle Mile district in the heart of Los Angeles, the building itself, from the outside, is a work of art. I visited the museum with my husband and our 3 year old daughter, we are not car enthusiasts however we found the museum to be quiet entertaining and aesthetically pleasing, the cars were gorgeous and the layout was very well done. The highlight for me was the bat-mobile. Having a 3 year old daughter, I thought the section dedicated to children was very small, and heavy screen based, I think there were missed opportunities for tinkering projects/activities, as for the rest of the museum it's pretty much no touch which is challenging with kids under 5.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The \"Car Culture\" is alive and well....AND \"on display\" at the Petersen Automotive Museum!", "As a car enthusiast I have visited the Petersen Automotive Museum many times over the years, but my most recent experience last weekend reminded me of what a gem this is in my own corner of the world. The Petersen often has \"Cruise-Ins\" to honor various automotive legends, and/or certain car makes, These are held on the rooftop parking structure and are free to the public.Last Saturday my car club, the Los Angeles Shelby American Automobile Club was involved in a Tribute to Carroll Shelby and there was a very large turnout of the cars he was involved in building. It was a wonderful exhibition! Inside the museum, at this time, there is a display featuring \"Lowrider cars\" with bright metalflake paint and lots of chrome everywhere. I also discovered a new restaurant has been added since my last visit and what a wonderful surprise that was. Drago Ristorante features very tasty Italian food at reasonable prices and my Mufalette sandwich was very fantastic. It came with a cup of cold diced potatoes that had been sprinkled with olive oil and a hint of garlic....oh my, I will be returning just for those. A great place to view the history of the automobile and have some good food at the same time. I recommend it highly.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "They usually have a good assortment of vehicles there.", "Being a car-guy, I am usually pleased with what I see there, but getting there is usually the frustrating part"], ["Reviewed 4 weeks ago", 3.0, "Amazing Collection of Cars", "This museum had am amazing collection of cars displayed. Many of them are historical such as the Model T, some are from the movies such as Herbie and the Batmobile, but my favorite section was the 'Lowrider' gallery. Here the cars are lovingly decorated and painted but there is also a lot about the importance of these cars to the group people who had them.\nWe were disappointed with the museum since in the end it seemed that it was just a bunch of cars rather than any explanation of why this was important. The goal of the museum was to 'present the history of the automobile and its impact on American life and culture.' We found lots of cars but not much impact.\nShow less"], ["Reviewed January 23, 2018", 5.0, "A great place for young kids or teens.", "Lots of gorgeous cars are on display here. Great for young kids, teens or anyone interested in cars of film and television. There are several displays which change regularly."], ["Reviewed January 22, 2018", 5.0, "If you're not into cars, go anyway! You will be!", "We gained such an appreciation for the beauty, art and history of cars. They are kept in such pristine condition, and the stories told on the vault tour were amazing. If you go, make sure to sign up for the vault tour."], ["Reviewed January 22, 2018", 5.0, "Very suprising", "My company took us here for the afternoon and I was delighted with the museum. They have done a great job of setting up the museum for people of all ages."], ["Reviewed January 22, 2018", 5.0, "If You Love Cars, You'll Love The Petersen", "A brilliant museum that houses some of the most interesting cars ever made. If you are a devout Petrolhead, then make this a 'must-see' when you're in LA."], ["Reviewed January 21, 2018", 5.0, "Another wasome museum in Los Angeles", "While in Los Angeles, fighting the traffic make time to visit this awesome museum. It is quintessential LA with an exceptional collection of automobiles on display. The building itself is worth the visit. The cars are fantastic. And the Los Angeles Museum of Art is just a few steps away.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Super fun for all ages boys and girls!!!", "This has something for everyone! The batmobile! Lightning McQueen from Cars, stuff for car buffs, race fans, luxury, Bugatti timeline, pimped out lowriders with funky paint, first cars that are unique, made 1 and they have it.. This collection is absolutely stunning! I'm a girl and don't know anything about cars and I had an amazing time!!! We just went cause we had extra time before our plane left and my husband likes cars. I would recommend this to anyone ! Kids, grownups alike.\nShow less"], ["Reviewed January 17, 2018", 5.0, "What an amazing collection", "My husband and I paid to do the vault tour and I recommend anyone who visits do the same. The cars and history of the cars you see in the vault is beyond amazing. No pictures are allowed during the vault tour but I can vividly remember many of the rare cars we saw, one of kind automobiles. You are in a group and move around in a group so if you do not like to stay in a group you may not like this. My husband is not big on group tours but he enjoyed the vault tour very much. Vault tour aside, the museum itself if full of beautiful automobiles from past and present as well as motorcycles and movies cars. You can take all the pictures you'd like in the museum. We loved our time here. We would go back again and would recommend others to do the same.\nShow less"], ["Reviewed January 14, 2018", 3.0, "Rather expensive, but worth a see", "I've been here two times now and while it's cool for car fans, it's kind of small. I've never done their vault tour, which is even more pricey, but apparently this is where you will see a lot more cars. Still, worth a visit if you like cars. I enjoyed it. Just wish there was more. Maybe I'll break down and do the vault one day.\nShow less"], ["Reviewed January 9, 2018", 3.0, "I wish there was a way to do just \"The Vault\" tour as that was the highlight of the place......", "and that being said the entire thing was vastly over-priced.\n\nThe regular museum part was interesting. The \"Art of Bugatti\", apparently on tour, was a fascinating look at the car building family and their art--not just automobiles. The \"low riders\" was not particularly appealing to me but in LA I can see how it would be an attraction. The \"regular\" part of the museum could use some serious signage as there were cars displayed and described but nowhere--at least that I saw--was any reason that a manufacturer of heavy machinery and farm equipment would make a personal pick-up truck (they could take some lessons fr/ the Studebaker Museum in South Bend there).\nCars fr/ the movies and television shows were fun to see and brought back memories but none were particular \"stand outs\".\nPerhaps touring \"the Vault\" first jaded things for the rest of the museum but that being said......\n\n\"The Vault\" tour was fascinating BUT it seemed as if there was a 90 minute time period and woe be unto a docent who exceeded that limit as we were rushed through a mass of cars (I heard a boy tell his dad, \"I think I am about 'carred' out\" as they were leaving) w/ little time to actually examine what we were seeing.\n\nThere were way too many people on the tour so it was hard to either see or hear (at one point I went down another aisle in order to better see what the docent was describing and to better hear her and was approached by a security person asking me to \"stay w/ my tour\". I told him I had paid for the tour and could not see nor hear if I was w/in the group. He relented but watched me like a hawk the rest of the time).\nOur docent had favorites and it was apparent as those were described and others given something of a short shrift but she admitted that her favorites were \"hot rods\" and that was the focus of her tour.\nTours are supposedly scheduled a couple of hours apart but we arrived in the basement as another tour was going on and yet another tour started while we were in the midst of ours so the echoes of each of those tours made it even more difficult to hear/focus on our tour.\nNo pictures are allowed and the explanation given was it had nothing to do w/ the cars on display but for insurance purposes as they were afraid thieves might discover a way to steal the automobiles on display (huh?).\nAnd as w/ the signage upstairs not enough explanation was given as to why a particular car or innovation was important---w/ the exception of, in our case, the muscle cars/ hot rods.\nCars were bunched together in such a way that it was difficult to see inside and get the interesting aspects of how passenger areas changed--especially when it was mentioned as part of the tour.\nAll-in-all I felt as if we were rushed through w/ little time to actually appreciate the automobiles on display--especially after paying $30 for the tour ON TOP OF the regular fee to tour the museum.\nDo not get me wrong as the cars are fascinating there was just little time to appeciate them and I am not certain it was worth the price of admission.\n\nShow less"], ["Reviewed January 8, 2018", 5.0, "Very Elite! Wonderful for car enthusiasts!!", "Very elite collection of cars! A must see museum for car enthusiasts!! Be sure to do the Vault tour. It is well worth the $! Our tour guide Pete was very knowledgeable & kept the tour interesting. The upper levels of the museum are laid out very well & easy to get through. The store had some great deals on souvenirs so don't overlook the store! Museum is easy to find & parking is easy!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Just amazing", "Such well presented exhibits, great balance of history and more recent together with famous movie cars. One of the best car museums."], ["Reviewed January 6, 2018", 5.0, "An impressive exhibition of the history of automobiles", "The museum occupies three floors. The museum has automobiles that where first invented, high performance road cars and also Formula One racing cars and motorcycles. The museum has a new exhibit every month or so. When we visited the museum the exhibit was 'The art of Bugatti' which focused on the Bugatti family, their cars and a family of artists.\n\nThe museum has parking on site (free for 30 minutes and $13 for the day). Admission is $16 for adults, $13 for seniors 62 +, and children (3 to 12) $8.All the galleries are wheelchair accessible. Complimentary wheelchairs are available.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great for the car nut", "Really enjoyed my trip here. Well laid out and very informative. Spent a lot of time in the Bugatti Section. i would suggest getting there early as the parking lot was full when I got there."], ["Reviewed January 3, 2018", 5.0, "A car lovers paradise", "For old and young alike, this four floor collection of motor vehicles from 1886 to the present, includes exquisite examples of antique, exotics, classics, muscle cars, race cars, motor cycles and children's cars. Presently an exhibit of low rider cars is featured.\nAdditionally there are examples of the the Art Center design process and a childrerns room. It is an all day feast for car lovers\nShow less"], ["Reviewed January 3, 2018", 5.0, "Great for car enthusiasts of all ages", "If you love cars, you have to visit one of the largest automobile collections there is. Learn about the history of cars, with some rare examples of early vehicles. Rotating exhibits fills the other floors of the building. When we were there, they were about Ferrari, Bugatti, famous movie vehicles, hot rods and the art of the low rider, with stunning examples of each. In the kids' room, they can see how critical components of the car work, do art, and play with toy cars and track. Look for extended opening hours during peak weeks to avoid the crowds. Parking is in a dedicated parking garage that can fill up at busy times, but other parking is available in the area. Expect to spend an morning or afternoon here and, if you live in the area, get a membership and come back throughout the year for new exhibitions. If you have the time, you can buy the 'vault' tour, where the museum stores vehicles not currently on display. Worth it if you want to get the most out of your time there. Admission is a bit pricey, so only plan to go if you have the time to spend absorbing all the exhibits.\nShow less"], ["Reviewed January 3, 2018", 4.0, "For car lovers and then some.", "A wide variety of beautiful old vintage cars and some motorcycles. Also some specialty cars. They sure don't make them like they used to. Anyone, even if you aren't \"into\" cars can appreciate the exquisite design."], ["Reviewed January 1, 2018", 5.0, "Early car history + high end cars", "Three floors with well-labeled cars. From early model T to Maclaren hyper-cars. Also collections of motorcycles, cars used in movies, and lots of educational videos and even interactive games."], ["Reviewed January 1, 2018", 4.0, "Went there and saw a bunch of cool cars", "Very cool cars, on this second visit in 10 years, and seemed a lot smaller than I remember. Many cool cars, but only took an hour if you dont read all of the placards."], ["Reviewed December 31, 2017", 5.0, "Awesome way to spend an afternoon", "A friend took me to the Peterson Museum while on a business trip because he knows I'm a car guy. The place was absolutely awesome. they have a great collection of very cool cars ranging from extremely old to the most modern. There are plenty of exhibits for people of all ages to enjoy this place. Highly recommend it if you love cars.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Great car collection", "I highly recommend a visit to this museum. Not being a petrol-head, I was unsure if a visit would be worth it, but walking into the foyer the cars on display had me hooked. The thematic layout of the museum floors is insightful. My son, who normally doesn't like museums, was enthusiastic. I highly recommend a visit.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Fabulous car musem", "Kids out of school and decided to venture into LA and take in the Petersen Automotive Museum. They have rotating exhibits and the last time we visited many years ago they had the Mattel Hot Wheels. This time around they had the low riders, Disney Cars, Ferrari and Bugatti exhibits. I like how they breakdown the floors with the history and design of automobiles. There are may touch and feel areas for little kids also. There is also a display of cars from the movies like Batman, Thelma & Louse, Back to the Future, and Herbie the Love Bug. This is a great place to visit if you enjoy cars. They even have a restaurant on the lower level next to the gift shop.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Must see for car enthusiasts", "A large collection housed in a beautiful building. There are three floors with a wide range of cars, ranging from yellow 1929 Duesenberg from The Great Gatsby to futuristic cars that were never manufactured.\n\nWe reserved the 90 min vault tour and it was very informative and should not be missed. The guide was well-informed and full of facts\nShow less"], ["Reviewed December 29, 2017", 5.0, "Two years on, the reborn Petersen Automotive Museum is coming into its own.", "Two years ago, the board of directors of the Petersen museum decided to take a risk: to change the comfy, familiar, and much beloved diorama based exhibits, and move the museum into the forefront of worldwide automotive museums. The bet paid off, big time.\nThere's an impressive permanent collection, but the curators have stepped up the game with an amazing round of shows assembled from all over the world. Bugatis? check. Ferrari's? Check. How about motorcycles -- check...an impressive collection there too.\nThe museum looks at the automobile, now, in sever different contexts: as an object of engineering advancement , as art, and from a social context - what represented freedom for the common man in the 20th century more than the private automobile?\nOne thing about this museum that always strikes me is that everyone seems to be smiling as they explore the museum's collections. It's just a fun, interesting and educational place, and the positive energy really rubs off.\nThe other plus, is that it's a relatively inexpensive place to take the whole family. There's an area on the 2nd floor that is specially designed for younger kids, but they'll enjoy the exhibits as much as the grownups. And don't miss the Forza motorsport simulator on the second floor, either. It's worth the wait.\nOne caution: there's a very good fine dining restaurant on the ground floor with an Italian menu. But, if you're on a budget, you'll want to either pack a lunch or visit one of the other less pricey options in the area. Don't get me wrong, the food's great, but if you've got the whole family on an \"economical\" outing, this might not fit the bill.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Excellent automotive display, don't miss the Vault tour", "This is a very good automotive collection, and worth goign through. If you do go, do not miss the vault tour. That is the best part of the museum, and you will only get a 1/4 experience without it."], ["Reviewed December 29, 2017", 3.0, "You should have an option to rate good not great", "This museum tries hard and look at the website before you go as they have rotating specialty exhibits which are very good. I like the Nethercutt collection more as it's just more varied. In this museum you will see some great cars but you'll still leave with a kind of meh feeling and your kids who really don't get to do anything will be glad to be back in fresh air again. It could be so much more with interactive exhibits, a tie in with lego for kids to build cars, scalectrix to race cars, audio tours etc. It doesn't generate excitement with the most exciting part being how they dress the outside of the building for different themes.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Don't miss this museum", "Spent 5 hours here and loved it. Do not miss the \"vault\", pay the fee. That is where the exceptional value is with low production vehicles, one of a kind and movie star cars. The tour is $33 per person including the vault. Parking can be a little difficult in their structure die to space, as others have indicated. Do not miss this attraction!\nShow less"], ["Reviewed December 22, 2017", 5.0, "A MUST SEE", "If you like cars, or if you like art, go before January 18, 2018 to see the \"Art of Bugatti\" exhibit. You learn that the Bugatti family was very artistic, which explains why their vehicles are so gorgeous. Just seeing the new facade is worth the trip. We did not do the Vault, and we heard that it was not worth the price.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Bugattis, Ferraris - Free Parking in garage with Restaurant purchase", "Great automotive museum for the auto enthusiast. Definitely recommend the Vault tour - it is a guided 90 minute tour with stories on the cars. The cafe has great food too and they will validate your parking ticket."], ["Reviewed December 21, 2017", 5.0, "Interesting even if you aren't into cars", "This is a can't miss if you love cars! But even if you don't, the automobiles from history and entertainment make it a worthwhile visit none the less.\n\nDuring our visit we were surprised how big it was and how crowded. Possibly we picked a busy time of day.\n\nOne last thing, if you haven't seen the outside of the building, it is super cool - Especially at night!\nShow less"], ["Reviewed December 20, 2017", 5.0, "A fun place to visit", "This was my first time visiting the Petersen since its remodel and I brought my friends visiting my family from Australia with me. The remodel is great and the cars and motorcycles incredible. It's an easy layout to follow and very interesting. I'm also not car guy but really loved the visit. I must point out that entering the museum from their parking lot is pretty weird. You'll know what I mean when you visit!!! Or not. All in all a great visit.\nShow less"], ["Reviewed November 30, 2017", 5.0, "A must see for gear heads", "Hey this is the place to see and learn about cars. The selection is awesome and the joint is all spiffed up."], ["Reviewed November 29, 2017", 5.0, "A dream for the pasionate", "An amazing place with so many unique cars . First you have THE CLASSICS ( Europe GTO Ferraris etc , old mustangs ) . Then the Hollywod ( Batman's car , back to future , etc ) , then the motorcycles : every Harley and Indian that was produced ( until about 1990 ) side by side . Then its the Bugatti expo . And only sometimes - The special Exhibition- The Vault\nShow less"], ["Reviewed November 22, 2017", 5.0, "Not just a bunch of old cars", "I have wanted to visit this museum for a long time. Since we were visiting Southern California for Thanksgiving this year I made sure a trip to the Petersen Automotive Museum was our first stop.\n\nThe girls in our family went to the Grove Shopping center near by.\n\nThe cost to enter the museum isn't horrible but it's not cheap. If you choose to add a visit to the Vault like my son and I did it can get a bit expensive.\n\nThe vault has some really cool cars and our tour guide was very knowledgeable.\nWe grabbed lunch at DRAGO between our tour to the Vault and the rest of the museum. The food and service were both good.\n\nThe room full of Bugatti's was amazing. The display showing competitive models from Indian and Harley Davidson was super cool. The room full of Ferrari's felt like it could be valued at $100 million plus.\n\nThis is not a display of old cars. This is a museum with cars as the art.\n\nGlad I went!\nShow less"], ["Reviewed November 20, 2017", 5.0, "100,000 sq feet for Car ENTHUSIASTS to explore", "A Museum of CARS and their impact on American culture and life. This attraction is open daily from 10am-6pm, excluding Thanksgiving & Christmas. Parking available on site. Aside from the entry level (which is fee-free), there are an additional 3 floors plus the Basement VAULT. Admission to 3 levels is $15 per adult with discounts for students, seniors and youth; 3yo & under are Free Entry. For an additional $20, visitors aged 10+ can take a Vault Tour.\n\n1st Floor = Artistry of the Automobile\n2nd Floor = Automotive Design - its diversity & technology\n3rd Floor = History & Nostalgia\nVAULT Floor = Representations of over 100 years of auto history\n\nMy boys thoroughly enjoyed this attraction and were only annoyed with one thing ... not ENOUGH time, both walked out saying, \"we could have spent at least a half day in here\" !!\nShow less"], ["Reviewed November 18, 2017", 5.0, "A Must See While in LA", "Even if you are not an automobile enthusiast as myself, you will really enjoy your visit to the Petersen. The facility is large, organized, immaculately clean, well staffed and secured. The cost is $ 16 per adult plus and extra $20 per person for the vault tour (discussed below). Parking is $ 13. The displays are well presented. Each display presents a discussion of its history and fun facts. Overall, a unique collection of historical, contemporary, and futuristic machines. We spent about 90 to 120 mins to visit all three floors. Our disappointment was the Vault Tour. The Vault Tour is a presentation of about 180 cars located in the basement of the museum and not on display on the museum floor. The 90 minute tour lasted two hours and could actually be presented in one hour tops. The docent was informative and eager to share his knowledge, however, it was much too drawn out and dragged on. We were actually relieved once the Vault tour was complete. So, enjoy the Museum and the regular tour. We highly recommend the visit. But unless you are interested in automotive history, pass on the Vault Tour.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Great place for car lovers", "This is a very modern nice place to go and look at some great cars. Classic and modern cars are beautifully displayed over 3 floors. The building itself is very nice and modern. The outside looks very sharp as well as the inside. It’s located in the Miracle Mile surrounded by other museums. It’s also about 10 blocks from The Grove and the original Farmers Market.\n\nThe museum has a section where you can play Xbox One Forza which is very cool.\n\nThe vault tour is ok. Some interesting cars but you cannot take pictures in the Vault. The guided tour felt rushed but was understandably as the guide has to work his way over 100 cars in only 90 minutes. We got bored before the end and elected to leave but I guess people really into cars would enjoy the tour.\n\nThe gift shop has plenty of collectibles to buy. Didn’t see anything spectacular or that you can’t buy somewhere else.\n\nThe restaurant inside the museum was good. Great food at reasonable prices.\n\nA great way to spend a couple of hours\nShow less"], ["Reviewed November 15, 2017", 5.0, "Sophisticated car displays", "Yes, it is expensive to visit when you factor in the $13 parking fee but it is a car museum not to be missed by gear heads. Every thing from a collection of Bugatti's (which for me was educational but the least interesting display) to a number of custom lo-riders with the most awesome paint jobs I have ever seen on any vehicle. In between are cars with a movie history, extremely rare cars and some high quality hot rods. Also some special displays like the all American racer Dan Gurney. I spent 5 hours here.\nThere is a cloth napkin Italian restaurant on the first floor\nThe exterior sucks in my opinion. This is about cars not psychedelic mushrooms.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Fabulous Collection!", "I think we spent nearly four hours in the Petersen wandering round admiring the collection of gorgeous cars and bikes, and enjoying a surprisingly tasty lunch!\nAbsolutely loved it especially the collection of Bugattis. The attention to design on them is divine especially compared with the boring cars we are surrounded by on the roads today. It is well laid out and the staff are friendly and informative and are happy to share their passion for pistons with you! If you are in the area give it a try I'm sure you will not be disappointed!\nShow less"], ["Reviewed November 10, 2017", 5.0, "Well Worth the Visit! Go for the Vault too!", "The parking might be expensive ($15+) and the admission prices reasonable, but the exhibits and the optional admission to the Vault make it all worth it! They have some of the rarest and most recognizable cars on display that keeps you walking to every level they have just to see them all! If you can pre-arrange a time/date to visit the Vault, it is worth the extra ($20+) fee just to see more cars that are not on the floor yet for the public to see!\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great collection in an iconic building", "This museum amazes and delights with various collections on three levels for the basic admission and a fourth, underground, for those willing to spend extra for \"The Vault\". (Recommended.)\n\nThe three public floor collections currently on display have cars famous from movies and TV including the Batmobile, the De Lorean from Back to the Future, Herbie from the Disney movies, and even the yellow VW bus from Little Miss Sunshine. They also have many cars owned by actors like Steve McQueen and cars designed by the kings of high-end L.A. mods like Chet Foose and Boyd Coddington.\n\nThe collection also includes a lot of one-offs or almost one-offs from the earlier parts of this century that never made it into big production, a Ferrari collection, a couple Bugatti's, and some rare motorcycles. I loved that they expanded the definition of 'classic car' to include low riders (especially Gypsy Rose, the intricately painted '64 Impala)--a uniquely Los Angeleno experience.\n\nThe Vault tour, for an additional $20 each, gets you a two hour guided tour underground where the collection's garage and overflow storage includes historically significant cars, like the limousine owned by Saddam Hussein and a Mercedes that belonged to Imelda Marcos--they say the trunk is full of shoes. There's even an old Rolls Royce that you expect to be told belonged to Alfred Hitchcock, but no--it belonged to the Kennedy family friend and Malibu producer who drove Bobby Kennedy in it to the Ambassador Hotel in Los Angeles--where Bobby was assassinated.\n\nDon't miss this!\nShow less"], ["Reviewed November 10, 2017", 5.0, "A fascinating tour of the vault and a good Museum", "The vault tour was fascinating and well worth the money. We were down there for about 1 and a half hours. Part of the charm was not being able to take photographs; sometimes you want the element of surprise and this was full of that. It serves as a place also where people garage their cars for insurance purposes. It is a wide and excellent colllection through the ages aincluding some really famous cars including many wonderful exaples of Rolls Royces, Sports Cars, cars connected to famous actors, actresses, politicians and others. Even if cars are not really your \"thing\", this was a very good tour. The guide made it so interesting and his knowledge was fantastic.\nThe rest of the Museum had some amazing cars, motorbikes and other vehicles. I really recommend this place. Go see it.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Even non- car folks love this place", "Like the Louvre for cars-- explains america's love affair with the automobile....show cases eras, types of cars, cars in the movies-- with interactive and 'sidebar' details."], ["Reviewed November 8, 2017", 4.0, "A small but impressive collection", "Even if you are not interested in cars, this museum is worth a visit. The artifacts are well displayed and interpreted that make a visit easy and joyful. Recommanded"], ["Reviewed November 8, 2017", 5.0, "Time well spent", "Had an extra hour or so to kill before a flight so I decided that it’d be awesome to go for this vault tour that everyone was talking about.\n\nIncidentally you can’t take any pictures in the vault, but it was definitely worth it. The guide was very knowledgeable and fun walking through a chronological timeline of the creation of the automobile and its subsequent refinement.\n\nNext time I’ll check out the rest of the museum for sure lol\nShow less"], ["Reviewed November 8, 2017", 5.0, "Amazing Automotive History", "I recently visited the Petersen Automotive Museum with a group of automotive enthusiast. We took a tour bus from San Diego up to the location on Wilshire Blvd. in Los Angeles. We had heard about the museum, but no one in our group had ever seen it in person. I must tell you, our \"socks were blown off\"!\n\nThe exterior is like a multistory jewel box. You can hardly wait to walk through the front doors. Once inside you are like a kid in the most spectacular toy store in the world. Your visual stimulation goes into overdrive.\n\nJust of few of the outstanding exhibits are:\n1. The Art of Bugatti. In today's world conformity it hard to believe that such\nexceptional creativity once existed in the world of automotive design.\n\n2. 70 Years of Ferrari. At one time Ferrari owned the world of professional auto racing.\n\n3. The Corvette-An American Supercar. Proud of our American made car that put such\nan exceptional car into the hards of everyday Americans; even to today.\n\n4. The High Art of the American Low Riders. Great tribute to such creativity put into\nthese cars, mostly by the very owner of the car.\n\n5. Harley Davidson vs The Indian. Another great tribute to a race for dominance in the\nworld of motorcycles and to conquering the race track plus the American road.\n\n6. The Vault. The ultimate place to visit while at the Petersen Museum. Rare behind\nthe scenes tour of some of the most unique cars in the world-100 years of\nAutomotive History. None seen in other parts of the museum.\n\nWhile touring the museum be sure to make time for a visit to their Drago Ristorante. Great food at reasonable prices.\n\nWear good walking shoes and allow plenty of time to \"oh and ah\".\n\nThe Petersen Automotive Museum was named Museum of the Year by the International Historic Motoring Awards.\n\nYou will not be disappointed!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Outstanding!!!!", "Living in a house of petrol heads from young to old this place has been on our bucket list for a long time and let me say it was well worth the wait!!!\n\nSome of the cars are absolutely mind blowing, throw backs from yesteryear (the batman motorbike from the original series!!!) all the way up to the McLaren P1.\n\nAbsolutely Fabulous!!!!!!\nShow less"], ["Reviewed November 7, 2017", 5.0, "An unexpected highlight of our trip!!!", "The museum had been pointed out to us whilst on our Bikes & Hikes LA tour earlier in the week so we decided to take a look. We were impressed!!! we stayed all afternoon, about 4 hours with our 7&10 sons. The vehicles in the museum were amazing. The kids activity room was very engaging and educational. The staff shared their knowledge about the vehicles and also engaged with our boys. A hidden gem in LA\nShow less"], ["Reviewed November 5, 2017", 5.0, "I Needed More Time", "This was my third attempt to see the museum and my first success! The LA traffic changed my earlier plans. I had three hours to look at the amazing exhibits. I knew there was no way to see the vault but I could have used more time on the three floors.\nShow less"], ["Reviewed November 5, 2017", 5.0, "One More Off Bucketlist!", "The museum presentation works for car lovers, autohistorians,and those with a creative & artistic interest. It is not just a big building filled with cars. There is also a section geared toward children. You will pay to park and if you do not fit the description of one of my earlier mentioned people you will probably find the entrance fee pricey. The “Vault Tour” is an additional cost to see 100 cars in the basement. If you are not car crazy save your money. The main museum will suffice. They have a convenient restaurant if you are looking for a meal and the gift shop has plenty to offer.\nShow less"], ["Reviewed November 5, 2017", 5.0, "fun museum", "even if you are not a car enthusiast..(I am not), this museum was a lot of fun to walk thru. Interesting building architecturally all by itself and the cars are great. I particularly like the cars from the movies exhibit."], ["Reviewed November 4, 2017", 5.0, "Wonderful variety of motor cars and motor bikes", "What a wonderful place, lots of extraordinary motor vehicles and bikes to view with the added advantage of a private tour in the basement with the motor vehicles and bikes not currently on exhibition."], ["Reviewed November 4, 2017", 5.0, "A museum that all of the family can enjoy", "We travel through LAX almost every year and have never before spared the time to go to the Petersen. It is a truly magnificent establishment with something to appeal to all. My wife is not a car buff but she had a really enjoyable day, and the in-house Italian restaurant and bar is of a high standard. True enthusiasts should also take-in the Vault tour which brings into play another 300-odd cars, all of which are of interest. This is a special place housed in an architecturally stunning building, and as the exhibits are changed regularly one could return and see many new things. Really excellent.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Excellent...One of a kind.....Trend setting", "I've been to The Petersen four times, and each time EVERY car in it has been different. That alone makes it different. I have read some \"criticisms\" of this place which say they should more-or-less crowd more cars in. Please don't. This is one of the few auto museums that actually give the cars on display \"breathing room\", and I like it like that as opposed to the sardine-can school where you really can't observe a car from almost every angle, as you can here. The Indianapolis Museum is a good comparison; great collection but the cars are crowded too closely together, and they have a fantastic collection...including a few of the cars that I saw at The Petersen this time. If you're in LA, go here. Even if you aren't \"car people\" this is a real museum and there will be things of interest here. The present display on Bugatti is a good example. Not just Bugatti cars, but artworks from the Bugatti family including sculpture, paintings, sketches, furniture (yes) and much more. As I said, go here. best dollar-to-experience you'll get at a museum.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Great place for both car enthusiasts and those that arent", "This is a great museum if you love cars and even if you don't. It's also affordable at $16pp ($36 for the vault tour). It is a well displayed museum with easy to read and informative facts about the cars/motorcycles. If you're wondering whether to pay extra for the vault, it's a definite 'yes' if you love cars but I'm not an enthusiast and I enjoyed it too. There are over 100 vehicles not displayed on the main 3 levels and the guide is very informative and well spoken. We spent just over 3hrs here and then strolled down to the farmers market for lunch and a little shopping - best of both worlds.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Fantastic Museum and great restaurant!", "We had such a fun day at the Petersen Museum! Our visit coincided with the Bugatti and Ferrari exhibits. We did the vault tour which was fantastic!! I took my 10 and 12 year old. The tour was a little long for my kids but they made it! The regular exhibits are wonderful as well. We had lunch in the restaurant and it was just lovely. We're not really car people and we still managed to thoroughly enjoy a 4-hour visit to the Peterson.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Petersen Automotive Museum Los Angeles CA.", "Without a doubt one of the best automotive museums in the USA. Just undergone a major renovation. The building is now an architectural wonder, inside and out. If you like cars and everything that goes with them, this is a MUST SEE place in LA."], ["Reviewed October 24, 2017", 5.0, "Boys Day Out", "The wedding was to be on Saturday but Friday was a pretty free day so my husband, his brother and my husbands oldest friend, all in CA for our daughters wedding on Sat decided to do a boys day out and the destination without hesitation was the Petersen. We have been there many times before and as members of the National Corvette Museum, get in for free. The vault tour was $20 and it was the vault that my husband was most anxious to see.\nThe guys were all impressed with the displays and the way they were arranged. Some were the same as they had been on previous visits since the remodel and others were different but all were enjoyed.\nThey ate at the 'fru-fru' Italian restaurant which was a bit pricey. The old Johnny Rockets was more in keeping with this museum. The guys were not impressed but you are a bit of a captive as there is no longer in and out privileged for parking and handicap spaces are at a premium.\nGreat day was had by all and it is recommended by two guys from GA and one from OH\nShow less"], ["Reviewed October 21, 2017", 5.0, "AMAZING!", "Just a stunning collection of vintage automobiles. Serene atmosphere to soak up the history of motor vehicles. The design studio was interesting, talking to young designers who are the future of the automotive industry. Enjoyed this very much."], ["Reviewed October 20, 2017", 3.0, "Ok place to spend an hour", "A bit pricey at $16. The whole museum can be gone through in a half hour if you’re in a hurry. A decent collection of cars and motorcycles but I was disappointed. Not that many cars."], ["Reviewed October 20, 2017", 5.0, "Add my name to the impressed, very impressed!", "I like cars and have been in many automobile and motorcycle museums and have enjoyed them all but Petersen - well this is a must visit! What a collection of exceptionally displayed and well lighted vehicles - it is just incredible! Do yourself a favor and take the tour of the vault, we had Jeff as our guide and he should be listed as a national treasure. His knowledge and easy-going style made the 90 minute tour fly by. I can't say this enough if you like cars, motorcycles or exceptional museums, find the corner of Fairfax and Wilshire, pull into their lot and plan to be there for several hours of shear enjoyment.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Truly Amazing", "Cars today are becoming a bit boring as just utilities, so I appreciate the old models with some design flair. I am also not a museum lover, but Petersons Automotive just displays what it has in quiet and pleasant surroundings and allows you respectfully to get really close. They have a fantastic selection set out over three floors in groups including Ferrari, Jaguar, McLaren, Bugatti, Ford, movie cars and much more. There is a nice shop, a restaurant and also parking on site which is a boon because the parking nazis in the street are red hot. We went round without hurrying in about an hour. Recommend it strongly\nShow less"], ["Reviewed October 16, 2017", 5.0, "Amazing", "We toured the auto museum and did the vault tour it was amazing. We really enjoyed seeing all the really rare cars."], ["Reviewed October 16, 2017", 5.0, "Fun even for a non-car person", "I have no interest in cars, but I very much enjoyed this museum. You can learn about the history of cars and appreciate the beauty of some of them even if you care less about what's under the hood. We highly recommend paying the extra for the vault tour, Our guide was Jason, the Director of Education, who missed his calling; he should have been on the screen! For an hour and a half, he provided non-stop, entertaining, informative, commentary while showing us some amazing cars. The only downside of this place is the restaurant. If you want trendy, expensive Italian food, it's fine, but if you just want a quick lunch, or a snack to fortify yourself, forget it; it's not there. The restaurant seemed an odd choice for a museum like this that probably attracts a lot of families. Otherwise, though, we loved the museum and would go back.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Unbelievable collection of automobiles", "We booked a tour that included a visit to The Vault where hundred of vehicles are stored when not on public display. The tour guide explained the history of each, adding in little bits of fascinating trivia that added colour to the commentary. There are too many items to name but it is an awesome collection.\n\nWe then climbed to the top floor and slowly worked our down through the public galleries to the ground floor. Some displays are semi-permanent, other galleries change regularly. If you like 'big boys toys' then the Peterson Museum is a must on a visit to LA.\nShow less"], ["Reviewed October 13, 2017", 5.0, "So glad I came!", "They have Automotive history, design, race cars, motorcycles, low-riders -- an eclectic mishmash of displays that were 100% perfect and fascinating. We had a great time."], ["Reviewed October 10, 2017", 5.0, "Fantastic museum even if you are not a car aficionado.", "I have been here a few times with my now teenage son. It is very well curated and fun. There is an interactive room for younger kids. The building itself is very cool architecturally."], ["Reviewed October 8, 2017", 5.0, "A must for intense and casual car lovers, alike", "Nothing less than a complete history of the automobile in a single building, the Petersen should get more acclaim than it does. Beginning on the top floor, then working your way down, a visit includes the invention of the motorcar to the present, special section of movie/tv vehicles, as well as many special rotating exhibits.\n\nTop-notch museum store is a must for car lovers, as well.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Terrific!!", "I love this place. The displays were awesome. The staff were super friendly and helpful, particularly the young lady with the bob who helped us with the virtual demo. She was a delight! There were so many beautiful and amazingly odd pieces on each floor, and I found the Bugatti and Lowrider areas near the entrance especially intriguing. The prices weren't outrageous, and I even got a terrific poster in the gift shop. I didn't have the chance to eat at their restaurant, but I will definitely be giving it a try on my next visit!\nShow less"], ["Reviewed October 6, 2017", 3.0, "Some good, some not so good", "I don't get it.The chairman of the board of governors is Peter Mullin, who has the Mullin Automotive Museum in Oxnard, Ca. This typically opens only two days a month.\nPetersen was full of cars from the Mullin collection, at the expense of cars owned by Petersen.\nSo Mullin had a good showing, Petersen not.\nSome of it was good, very good. Possibly too much space and not enough cars in it. The visit was certainly not as good as previous visits ( before the refurb )\nThe girl in charge of the race simulators on I think the first floor has a lot to learn about people skills. She certainly needs some training, and a little common politeness and courtesy would go a long way. Maybe the Petersen is not for her.\nThe Ferrari exhibit was very good but with the space available more cars could have been included.\nIt felt a bit too 'arty' and not enough cars. I know Petersen, in common with other museums, share their cars all around the world. But a bigger focus here would make visits more enjoyable for people who have come to visit the Petersen !\nShow less"], ["Reviewed October 5, 2017", 5.0, "Great collection of specialty cars!", "My father was visiting from out of town so we wanted to go to a museum on a Monday and realized that many are closed on Mondays. After a little research, we decided on the Petersen automotive museum in Los Angeles. We were able to buy out tickets online and the cost for the three of us was $49. There is a student and senior discount so that helped a little with the cost. Parking is onsite at $12 a car. The museum was not crowded on a Monday and so we were able to see everything fairly easily. We spent about 2 hours there and liked the diverse collection of cars on three different levels. Our favorite room was probably the Ferrari room as it was filled with beautiful Ferraris from past to present. We also were able to race in a simulated racing game which was fun. Overall, we enjoyed our time here. A tip for discounted entry cost would be to see if Groupon has a special.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Petersen Automotive Museum", "If you enjoy seeing great cars this is a great place. One of the great car museums in the country. This is a history lesson of cars."], ["Reviewed October 4, 2017", 4.0, "Wow this place is amazing", "Not being a car enthusiast I wasn't sure about a visit, but WOW the cars are incredible and the displays of cars and bikes worth seeing. It isn't just about cars there are wonderful history and stories to be read as well as training for future designers.\nThe Petersen family are to be congratulated on this venue.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Awesome, the least known but best of L.A.'s museums?", "The cars are always changing, the displays impeccable and if you have time I strongly recommend the tour of the Vault. A superb experience."], ["Reviewed October 2, 2017", 5.0, "Well worth seeing", "Did a tour of the Petersen and a tour of the Vault. The Rolls in the Vault was fabulous. Loved the building a Maserati exposition."], ["Reviewed September 29, 2017", 5.0, "Awesome cars", "We had a team building event at the Petersen Automotive Museum. It was raining hard the day we went. Once we got inside the museum, the rain did not border us. We went to the Vault to see their exclusive collection. It was really meant for the car enthusiasts. For me, the cars on first to third floors are good enough. They have really awesome cars there, many of them were used in movies. The life size McQueen was awesome!!\nShow less"], ["Reviewed September 26, 2017", 5.0, "A dozen or so things to see for free...", "If you've got limited time (like maybe after viewing the couple of free things to see across the street at the LA County's Museum of Art, you can walk into the ground floor of the Peterson (the outside is very cool by the way) and see at least 10 to 12 wow-looking cars. We didn't have time for the $12 tour so we just checked it out and it's worth the look. Maybe we'll come back and drop the dime, but you should check it out for free - it's worth it if you don't have to worry about parking. We didn't, as we've bee taking advantage of the Metrolink's Weekend Day Pass - 10 bucks for each day on Saturday or Sunday and we can ride anywhere on the system - from Riverside to Oceanside, to Ventura. Then you can use the same pass for MetroRail which is the two subway lines in LA and the lightrail system that goes out to Santa Monica, up past Pasadena, or down toward Long Beach. Anyway, the Petersen is cool even if you just visit the ground floor, use their clean restrooms, and maybe buy a pizza or something at the restaurant on the ground floor.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Excellent Museum of \"Special\" Cars", "This museum, which seems fairly new, appears to focus on \"special\" or rare cars. You won't find any run-of-the-mill Ford Mustangs or VW Beetles here. Instead, you'll see a Batmobile, the actual Ferrari 308 from the Magnum TV series, a Tesla, Porsche racecar, Maserati, the modified Delorean from the \"Back to the Future\" movies, etc. There's also an excellent exhibition of vintage Ferraris.\n\nEverything is well laid-out and displayed. I was able to find on-street parking on a side street a couple of minutes from the museum.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Must see for car enthusiasts", "We have wanted to visit the Petersen for years, but never seemed to find the time. We were not disappointed! The Ferrari exhibit was exceptional and what collection would be complete without a few special low riders? The school lab was also fascinating--be sure to see their Segway-like people mover that folds up the size of a small briefcase. If we had time, I would have loved to take the Vault Tour of their collection of vehicles not on display. Next time!\nShow less"], ["Reviewed September 26, 2017", 3.0, "Hoped for more movie cars", "We got here on a quiet Monday morning and were glad of the crowd-less environment!\nThere are a couple of options there, you can get the regular museum admission or add on the 90 minute \"Vault\" option which includes a guided tour and 100 more vehicles, i would have taken this but the group that was with were not as much of a petrol head as i.\nThe regular museum is on 4 floors, i was little disappointed in the cars of TV and movie section as there were only a few cars, maybe 8 or so and some photo's, i would have thought an auto museum in Los Angeles/Hollywood would be able to appropriate at least a whole floor to the industry that put it on the map.\nThat being said perhaps there were more cars of TV and movie in the vault but shame its not included in the main museum if there are.\nAs for the rest of the museum it was very well laid out and informative, highlights for me were the Bugatti section and the Chicano cars, amazing paintwork and attention to detail.\nThe place is spotlessly clean and not a finger print to be seen on any car!\nShow less"], ["Reviewed September 24, 2017", 4.0, "Deserves its title as America's best automobile museum", "The building houses some of the rarest cars in the world and a few Hollywood vehicles such as the 1989 Batmobile and The Governator's motorcycle from Terminator 2. I am knocking off a point because of The Vault tour. Lots of awesome vehicles lay in the museum's basement but in order to see them you cannot take pictures or tell anyone online what they are.\n\nI understand the reason is so they don't get robbed as thieves could break in and steal the vehicles below if they found out, but it feels like a cheat when you shill $140 for three people and can't provide evidence to friends and family that you saw the Vault vehicles other than your own memory. Aside from that, I'm sure any auto enthusiast would love to see what the Peterson has to offer!\nShow less"], ["Reviewed September 22, 2017", 4.0, "Great Place to Go for Car Lovers", "Great place to see cars with history. It contains some of the rarest cars you may not have even known existed for the novice car lover. It's clean and the people who work there are polite gentlemen who exemplify the experience. The only drawback was the wait times for the guided tours for the vault. It would have been nice to go right in even for a self-guided tour. Alas, it was still a nice site to stop in while here in LA.\nShow less"], ["Reviewed September 18, 2017", 5.0, "If you like Bugattis....", "I've been to auto museums around the world, but had never made it to Petersen's museum. It's very well done, with the cars well lit and spread far enough apart to be able to walk around them and take a good look. In the interest of time and budget, I only went to the main part of the museum, and missed the Vault, which would have added $20 to the admission price.\n\nThe museum has numerous vehicles that were used in well-known movies, including a Batmobile and a 1981 DeLorean used in Back to the Future. For me, the high point is the collection of Bugattis, which were easily worth the price of admission.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Car lovers must see", "Recomended to this museum by a car freind so glad he told me about this was amazing would love to return some day as it was so good"], ["Reviewed September 16, 2017", 5.0, "Bucketlist Check. I am a kid again.", "I didn't know what to expect as I only had a say to kill in transit. I am a car enthusiast.\n\nMan was I impressed. 3 levels of cars sorted by car maker, innovation etc... I even got a Batmobile and deLorean from Back to the future thrown in.\n\nAttached some pics. Nothing more needs to be said here.\n\nSo had lunch at the restaurant there. Italian fare.\n\nThe diid was delightful with the mussels and vongole (cozze e vongole) devine. AMatriciana pasta was al dente. I would have likes a little mire sauce.\n\nA little pricey for US but this is LA and the service was very good.\n\n$15 entry and $12 parking is a goid day out!\n\nYou can also see the \"vault\" for $35, this is a guided tour for 90 mins with over 100 cars in the basement not on display!\n\nEnjoy and live your inner childhood.\nShow less"], ["Reviewed September 15, 2017", 5.0, "This place is a must see", "If you love cars, hollywood, and all the movie magic then this place is a must see. It's filled with historic cars of all ages and its really worth the ticket price."], ["Reviewed September 15, 2017", 5.0, "Fun for all, even if you only like cars a little.", "Definitely worth a visit. Never disappointing. The displays change frequently. Cool stuff always. Kids section is also fun."], ["Reviewed September 15, 2017", 4.0, "Behind the doors and under the hood", "The striking exterior of this museum gives little hint as to what is inside. It's like a beautiful car: looks good on the outside, but how does it perform? What's under the hood? Or, in this case, what's behind the doors?\n\n\nIt does the things a museum should do, and does it pretty: engages the visitor by its use of space and thoughtful displays of its permanent and special exhibits. Visitors get to ogle the outsides of automobiles as well as the inside. The choice to feature a section on the design of automobiles (and a chance to watch actual designers in action), as well as taking an in depth look at development of a car, is a nice touch. The exhibit for the movie Cars is fun, and possibly the most kid-friendly section of the museum. I do wish the museum took greater efforts to explain some of their interactive exhibits so you could decide if it was something worth waiting in line for. When I went, there was a section that seemed like a video game and people sitting to wait their turn to be escorted into the back video game section. I can't say for sure if this was the case because there was very little signage or information about it in the museum map. Museum personnel were busy with other visitors. I have no idea if I missed out on something fun.\n\nThe museum does a nice job of providing phone charging cords at many outlets. Look for a bench to sit on and it probably has a phone charger nearby. The size of the museum was easily manageable; bathrooms and drinking fountains were easy to find and get to without having to snake through a warren of galleries. I wish I had a purchased my ticket online so as to avoid the line to the ticket counter. I was able to get to the museum easily via public transit but there is a parking lot available.\n\nI appreciated the exhibit on lowrider art that was a featured during my visit. Automobiles are feats of design and engineering, but they also play a cultural role and shape the way we live. I appreciated that the museum had an exhibit that embraced and displayed how a car engages with our lives and imagination.\nShow less"], ["Reviewed September 9, 2017", 5.0, "I love cool cars!", "If you like cars, this is the place to go. The museum is reasonably priced, but if you want to go to the \"vault\" on a guided tour it is extra. You don't have to pay extra to see great vehicles. Old Fords and some of the first motorcycles are on display. It was interesting to see vehicles used on tv shows too. I would definitely recommend a visit!\nShow less"], ["Reviewed September 8, 2017", 5.0, "Parallel Journey of Los Angeles and the Automobile", "Uniquely designed as a evolving story of the growth of Los Angeles with the parallel growth of the car culture, this amazingly beautiful car museum will not disappoint you. The inventory alone is enough to keep you engaged for a few hours. Additionally, the location and new facade will impress you, as well! Put this auto museum on your bucket list!\nShow less"], ["Reviewed September 6, 2017", 4.0, "A cool afternoon of loking at great cars", "We and some friends went ot the museum and paid extra for the private tour. The tour showed incredible vehicles and the guide was extremely knowledgeable. Sometimes he got a little teechie on us but it was fun even for the ladies who were not necessarily car buffs.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Went with my son in law for a boys day out", "The exhibit was great and laid out well. We reconized a number of the special editions from shows or know to havew been owned by celebritires. Very enlightening day"], ["Reviewed September 6, 2017", 5.0, "A FUN TIME FOR AUTO ENTHUSIASTS", "even if you are not a car nut, a day at the Petersen Museum is a lot of fun. Check out every floor of amazing automobiles. You will find yourself amazed at technology,"], ["Reviewed September 6, 2017", 4.0, "Great car museum, exotics and unusual cars", "We've been to many car museums across the country and this was the first one that featured more exotic, one of a kind cars. We really enjoyed the cars used in movies and the Bughatti exhibit was fascinating! Did have to pay $12 for parking, not sure if this is normal for CA or not.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Very interest venue", "From the beginning of the auto a historical view of the car to modern day and everything in between. A remarkable collection to view and interactive things to do for young and old. Great take"], ["Reviewed September 5, 2017", 5.0, "Realh Cute Car Museum", "This museum has been totally renovated and really is worth a visit especially if you love cars...a great selection of classic cars in a great location easy parking\nEven though I am not a motor bike fan it was so much fun looking as these classic bikes\nThis is really great place to take teenagers to a museum they barely realize they are in one tons of fun\nShow less"], ["Reviewed September 4, 2017", 3.0, "Nice and boring", "It was a nice visit for the kids, only 4 known cartoon cars for them. Mcqueen, Hodson, Batman and more seeing for old cars to newest. Price is 15 💵"], ["Reviewed August 30, 2017", 5.0, "Best Automotive Museum Ever", "Visited 8-25-17. I was very amazed at the outside of the building. VERY PRETTY. I saw the outside and had to make my way inside. I said something amazing has to be inside there and it was. Lots of older model cars, motorcycles, bicycles, boats, and photos, bugatti cars and precious furniture pieces and more. Paint jobs on some if these autos were beautiful. I have never seen anything like whats in that museum before. Definitely recommend a visit.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Enjoyed every moment", "My husband is a car guy and he is the one wanted to go there. He bought the tickets on line with his iPhone. After purchased the tickets he read that he would need to print the tickets. He called the museum and found out that he would not need to print them as long as he could show them on the phone. When he called it was Round 7 pm, I said to him that there would be no body answer the phone. But there was some one responded and being very helpful. I usually don't care about car shows or museums but this one I enjoyed very much. It wasn't just about cars but about history of the designers and or builders. Overall it was well presented and the exhibit was informative. We parked our car on the street across from the museum we didn't pay a dime for parking just a little walk.\nShow less"], ["Reviewed August 26, 2017", 5.0, "RPMs on Wilshire!", "The visitor experience begins before you even enter the museum: the massive building is encased in bright red undulating steel ribbons that convey a sense of speed and grace from blocks away. The extensive collection (only a portion of which is on display at any given time) features everything from the Batmobile to a deconstructed Maserati to a life-sized pink low-rider pinata suspended from the ceiling. Very well-curated exhibits include the history (and future) of the car engine, the Bugatti family story, and the evolution of \"car culture\" in the US. There is something here for everyone - whether you appreciate the beauty and art of car bodies or of the engineering within them. Guided tours of the vault (to see more of the collection) are available; enthusiasts of all ages (but not heights) can play Xbox's Forza; the requisite gift shop & a good Italian restaurant may be accessed without buying tickets (you can also peek at several exhibits from the lobby). The Petersen is only a few blocks from the La Brea Tar Pits and LACMA, so there's really no excuse to miss it!\nShow less"], ["Reviewed August 26, 2017", 5.0, "Very nice auto museum", "I'm a car enthusiast.. This museum is definitely one of the best. Very nice Ferrari exhibition, Bugatti cars Amazing, overall worthwhile. Also for kids there are exhibits and Xbox ."], ["Reviewed August 25, 2017", 4.0, "Good variety of exhibits", "This museum is good and well laid out I was surprised with the variety of vehicles which one associates with USA Vault Tour was very interesting but we had a great tour leader"], ["Reviewed August 25, 2017", 5.0, "Different", "This is NOT your typical automotive museum. Similar museums are pretty much just warehouses or large garages filled with cars of all types, depending on the collectors' whims and tastes. This one is very contemporary, open, airy, relaxing and California-centric. It does have a section on the history of the automobile, but with a focus on southern California. It's exceptionally well-organized around different themes, such as: cars from movies, evolution of cars from gasoline to electric, the car culture of southern California (including racing), etc. For an extra fee, you can take a guided tour of their \"Vault,\" which is a separate collection of some exceptional cars located in the basement. This part is \"similar\" to what you'd see in some other automotive museums. But the rest, is very unique, and well worth visiting; especially so when there are \"special\" exhibits. When we were there, they had special exhibits on the LA low-rider car culture and the Bugatti brand and history --- both excellent! Reasonably-priced parking is adjacent to the museum, which makes it very convenient.\nShow less"], ["Reviewed August 25, 2017", 5.0, "AWESOME!", "Fantastic collection of \"one off\" cars, Bugatti's and Ferrari. A number of movie cars are also on display Great parking, knowledgeable docents."], ["Reviewed August 22, 2017", 5.0, "If you like cars, you need to visit", "Add the Vault tour to your visit. It is 90 mins and worth it! The collection is truly amazing and the building itself is a work of art. Also, they have an on site parking deck so no worries"], ["Reviewed August 19, 2017", 5.0, "This is the apex of general automotive museums. You MUST visit if you care about cars.", "The depth and breadth of the collection puts Jay Leno's collection to shame. Carrol Shelby's original concept car using a cheve engine is here. The official cars of most of the world's dictators and bad president's are here. The cars that created the signature cars in the movie CARS are here. One offs. Customs. Low riders. Concepts. There is more than you can really comprehend in one visit.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Amazing museum", "Superb collection of cars. Old, very old, sport cars, racing cars they have it all. I loved the Harley-Davidson vs Indian exhibition. My favorite was Ferrari exhibition. There is also a design center, where you can see how cars are designed. I loved the section with cars from movies and series. There was no line at the entrance, but they will make you leave your bag – you can’t take it inside. You can take photos, just no flash photography. There is a coffee shop, a restaurant and a gift shop available at the premises. The restaurant was too expensive for us. The gift shop was nothing special. They also offer tours of the vault, where they keep the most valuable things.\nShow less"], ["Reviewed August 16, 2017", 4.0, "If you like cars then go", "I was attracted to this initially by the architecture of the building. It is a fun place to view a lot of eye candy cars and learn tech data about the automobile. Lots of beautiful old cars, hands on for the kids (both little and big), and design information (clay models). I wish I had enough time for the vault tour. Call them because the online reservation system was not working before.\nIt also the restaurant in side has a great menu but I didn't have a chance to try it.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Love this museum", "Being a member of the Petersen, i make it a point to visit as often as I can...which translates into at least 2 times a month. I also participate in the Breakfast Cruise-ins on Sunday mornings. A great time to visit to check out other enthusiasts vehicles...Everyone has a story. They also have monthly movies in the museum....a cool experience to say the least.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Very cool place - some amazing cars", "If you are in LA and have a passion for cars, then a visit to peterson is a must. They have some unreal cars on display - both new and old."], ["Reviewed August 13, 2017", 5.0, "Amazing!!", "I reluctantly visited with my car mad husband and teenage boys but had a great time! Definitely do the vault tour..amazing unique cars but also fascinating history and stories from the excellent guide. We spent about 4 hours here !"], ["Reviewed August 12, 2017", 3.0, "Nice but missing cars", "The Petersen Museum was great but some cars were missing especially the Bugatti Royale which was the star lot in every magazines!!\nThe Bugatti Chiron was missing too. The celebration of the 70th Ferrari anniversary was nice unfortunately the Ferrari 250 GT Tour de France was missing!\nShow less"], ["Reviewed August 12, 2017", 5.0, "A MUST see if you love Cars", "This museum is a must if you love old or new cars!! It's a fun museum with lots of history and cars to look at."], ["Reviewed August 12, 2017", 5.0, "Boys day out!", "My fiance went to this museum on a visit to LA and came home raving about it. He absolutely loved it! He didn't do the vault tour but would like to on another trip."], ["Reviewed August 11, 2017", 5.0, "Petersen - The Automotive Smithsonian", "Incredible time. The vault had some of the most amazing things imaginable. After that we went to the third floor and worked our way down. Everywhere you looked there was more to see. Would like to go again and spend much more time."], ["Reviewed August 11, 2017", 5.0, "If you like cars, this is a must see!", "This was a fun outing while on vacation in LA. The museum is very well organized and the cars on display are beautiful. Our children are into cars and their history so the Vault tour was a real highlight. There are cars in this museum that you will not see anywhere else in the world!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Should be high on your family list", "Our family tries to stop at different kinds of attractions on vacation. If yours does then this is a good choice.. If your family loves cars its an obvious choice. But also if they like movies. There are cars that played large roles in different kinds of movies ... \"Batman\", \"Back to the Future\", comedies like the Herbie movies, the animated movie \"Cars,\" etc and TV series like \"Magnum PI.\" Interested in history then there are cars to see. Want to know about engineering there is something for you. Do your kids like video games - then there are video screens connected to seats simulating the race car driving experience.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Do the Vault for the Whole Experience", "My son is obsessed with cars so we had to go. I was not excited to go, but I ended up really enjoying looking at all the movie cars and I especially enjoyed the Vault tour. The tour guide had tons of interesting information about each car. He tried to focus on what the group was interested in. I did get a little tired during the vault tour since we were standing for about 90 minutes listening to the stories of the cars. It gave me a new understanding of cars as art.\nShow less"], ["Reviewed August 10, 2017", 5.0, "excellent collection of cars", "excellent collection of cars. One must see. old cars and great price (entry ticket) and worth it. clean and good for family trip."], ["Reviewed August 10, 2017", 5.0, "Great if you really like cars", "Beautifully laid out museum - allow a few hours. The vault tour was interesting but unless you're really into cars, it may be a bit too long in duration for you."], ["Reviewed August 9, 2017", 4.0, "Awesome experience", "Let me start by saying I'm not really a 'car' person, yes expensive cars are nice but ... my expectations were ok we will kill a few hours. OMG was I wrong. We pretty much ended up staying for hours. I went with 2 thirteen year olds. We had a fantastic time. So interesting. Awe inspiring. (A 52 million dollar Ferrari, still can't wrap my head around that) So impressed with the low rider paint jobs. Truly works of art. So much to do and see. Per an employee the change the exhibits up every 6months or so to make it interesting. The kids loved it. We did take the private vault tour. The only negative to it was it was a bit to long (1.5hours) and the kids were fidgeting towards the end. Will definitely visit the next time we travel to LA:)\nShow less"], ["Reviewed August 8, 2017", 5.0, "You don't have to love cars to love Petersen Museum", "This place is just gorgeously laid out. If you are into: cars (obvs), design, history, pop culture, tech, racing, or are just a generally curious person, go. Spouse loves cars, I don't, but we both thoroughly enjoyed Petersen Automotive Museum."], ["Reviewed August 8, 2017", 4.0, "Get the private tour", "Our son is a big car nut but was disappointed in the upstairs (main) showroom and the exhibits there. However we did do the private tour of the basement cars. With a tour guide and around 20 other folks had a cool experience downstairs. The cars and the stories that went along with the cars was much better and much more interesting.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Cars - Motorcycles and. . .more cars!", "My 13 year Nephew was in heaven. I gather there are cars there that are \"awesome\". I found Steve McQueen's D type Jag and old Indian motorcycle so I was happy.\nThe 1.5 hour Vault Tour is a little intense if you are not a true enthusiast but the restaurant made up for that.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Best Auto museum in California", "Great place. Easy to find, though their parking garage does fill-up (like everything else in Cali, parking is an adventure). Beautifully done, nice collection and variation. You won't find many muscle or sports cars; a handful of ferrari's were in a certain area, but otherwise they are lacking any Corvettes or other domestic favorites. Some old roadsters and some newer cars, lot of unique ones. There are a few Movie-type cars like the delorean from back to the future and magnum pi's ferrari and herbie. Great Bugatti collection, only wish they had one of the newer models from the last 15 years, they were all old school. Couple of race cars, and an homage to Maserati. Great staff, very clean place. Overall this car enthusiast give it a big THUMBS UP. Best car museum in all of Cali without a doubt.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Not just for car people", "We headed to LA early before a evening concert. The kids chose the Petersen Museum and a good choice it was. The museum is reasonably priced and has something for everyone. The Bugatti and Ferrari exhibit that they have right now is worth the trip alone. You can see the entire museum in a couple hours or take your time and spend five. I really want to go back and just look at the cars because the first time we went I spent more time reading.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Grand day out!", "Peterson is truly a most enjoyable day out with great vecheals of varied marquesa do memorabilia. The movie cars to the batbike it's most diverse PS-This is the second time Ive left you feedback without success!"], ["Reviewed August 7, 2017", 5.0, "What an amazing display!", "We took our group of exotic car owners who were participating in our 100|OCT Experience 2017 to the Petersen Automotive Museum last month. What a treat this place is! Between the building's architecture and the amazing automotive content, everybody loved it. My personal favorites were the very complete Bugatti exhibit and the all red exhibit for Ferrari's 70th anniversary.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Amazing Museum", "The Museum is well thought out on the floor plan. Very awesome to see the auto mobiles from the beginning to the future and even celebrity auto mobiles featured in movies. I took my boyfriend for his birthday and he loved it!"], ["Reviewed August 7, 2017", 5.0, "Deuce Day 2017 - 85th Anniversary of the 1932 Ford - Honoring Pete Chapouris & Vic Edelbrock , Jr.", "Five Stars. From the award winning architecture, to the sparkling displays, to the top tier food service, outstanding by every measure."], ["Reviewed August 7, 2017", 5.0, "Peterson automotive", "It was very interesting but if you have already been in the vault you don't need to go a second time"], ["Reviewed August 7, 2017", 5.0, "Great even if your not a car nut.", "Ok I'm crazy for cars but my wife is not. Nevertheless she tagged along and loved it. Pay the extra to go tour the vault where the best stuff is kept. Probably the best museum for cars in the world."], ["Reviewed August 5, 2017", 5.0, "the louvre of cars", "Amazing experience, the most exclusive cars, race, historical, all of them...tried a simulator, really fun."], ["Reviewed August 5, 2017", 5.0, "Epic", "This car museum is amazing is a must visit probably a hidden gem if you asked me so many cars do you learn so much but it's more of a short time killer whilst you may be checking into a hotel or something but really good for the kids well worth the money recommend to small families\nShow less"], ["Reviewed August 5, 2017", 5.0, "Must see in LA", "The Petersen Auto Museum was a highlight of our visit to Los Angeles. The display of Bugatti cars and art pieces was unbelievable. The display of all the Dan Gurney racing cars showing the evolution of each car was fantastic. A visit to the Vault had us head swivelling in all directions. With the display of motor cycles to enhance the inventory, it was one of the best Museums we have been to yet.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Automobile lovers paradise.", "What a collection of cars. Bugatti Ferrari etc. A so wide a variety of cars is hard to find. Well organized on three floors. A vault tour exists for cars not on show."], ["Reviewed August 4, 2017", 4.0, "Lots of cars", "This was the first place we stopped as we had time to kill before we could check in. Great place, interesting. My son, 13, thought there would be more newer sports car types - there weren't. Fun to see some movie cars, also a good display of Harley and Indian motorcycles.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Great Museum to Visit - Great History Lesson in Cars", "Loved this museum. The workers who checked us in were very nice. The museum was beautiful, just as the cars were. I am not a car buff, but I really enjoyed learning about how the automobile evolved and seeing that evolution in person. We did the vault tour which was great. Our tour person was very knowledgeable. She actually worked for Mr. Peterson and had so much knowledge about each of the vehicles we saw. You should definitely do the tour. We also drove the video game cars in the family area. You should do that also. The driving is so real and different that what you would drive in an arcade. It was fun. Overall- great place to visit.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Car Guys kinda place", "This museum is awesome. spent about two hours there looking at cars I have never seen and admiring ones I have dreamed of owning. Found $5 off ticket coupons in LA visitors guide book"], ["Reviewed August 3, 2017", 5.0, "Lazy Saturday turns into amazing Saturday", "Always wanted to go and we had a free Saturday, no kid sports and nothing on the calendar. So time to check off a bucket list item. Many dream cars and cars I have always wanted to see."], ["Reviewed August 2, 2017", 4.0, "Big smile on car lovers' face:)", "I'd recommend a Vault tour. It's worth paying additional for it! They'll tell you amazing stories behind beautifully restored vehicles in the Tour."], ["Reviewed August 2, 2017", 5.0, "Excellent, especially the vault tour", "We toured the entire museum and I could not recommend it more highly to anyone who enjoys cars. The collection in the vault was amazing so spend the extra money to go on the tour!!!!!"], ["Reviewed August 2, 2017", 5.0, "Low Rider Exhibit", "Although I would have liked to see more low-riders, the cars that were displayed were outstanding examples of that genre. The rest of the car collection was spectacular."], ["Reviewed August 1, 2017", 5.0, "Superb Auto Museum", "We took our adult children and upper teenage grandchildren to the Peterson Museum's Vault Tour, as well as the general admission tour. All of us truly enjoyed and appreciated the entire Peterson Automotive experience. Spectacular! An extra plus is the modestly-priced restaurant on the premises."], ["Reviewed August 1, 2017", 5.0, "Car utopia", "I had a fantastic time at the museum with my friend and her six-year-old son. I haven't been there since you've read done and you see him, and it was amazing! Can't think of a better place in Los Angeles or anywhere, to view cars like that . The price to get in was fine, the only thing is the parking is too pricey to add another $12 on top of what you pay to get in !\nShow less"], ["Reviewed August 1, 2017", 5.0, "Love it!", "My favorite museum!!!! Love the new layout and the great selection of cars! This museum never get's old, I discover new items every time I go there."], ["Reviewed August 1, 2017", 5.0, "Awesome collection of cars", "My first time visiting and I was really amazed by all the different types of cars, some which were one off's. Also, I recommend doing the vault tour as well, I saw some pretty cool stuff down there."], ["Reviewed August 1, 2017", 2.0, "Underwhelmed", "When I bought the tickets (2) via email, I understood the tickets covered the main museum along with the vault. My vault tour was at 7:00 pm so I got there early enough to see it all. I was told my tickets were only good for the vault tour. So I got to sit in the lobby for a long time. My wife was unable to attend with me due to illness. So What? Too bad for me. We finally went to the penthouse where the DJ was blasting the neighborhood with sound. It did not seem to me that people were enjoying the music. We then went in two groups to the vault. The guide knew a little about the cars. The people that could not hear her grouped in the back and I helped them with questions. If I were doing this trip over, I would go the Parks museum at Pomona. Much more relevant to me. To pay the prices and then be shown to a parking garage and herded by security, I was underwhelmed. This was a bucket list trip. Loved LA. Ate a lot of good food. Saw the Peterson.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Great Cars", "Although they didn't have a Japanese Vehicle collection on show that day, it was still a very cultivating experience. The Vault is a must-see, I cant say much because you have to see for yourself."], ["Reviewed August 1, 2017", 5.0, "Great Place to See, Even if You're Not a Car Person!", "Go for the \"Vault\" tour. The docent we had, Peter, was amazing. He made the 1.5 hour tour very interesting. It wasn't all about a car's internal dimensions and specs, the tour was about the history of the cars, how they were designed, their owner's, etc, etc. Many of the cars were in motion pictures! The docent tour is like your own private tour. We took the 10:30 am Vault tour then had an amazing lunch at Drago on the ground floor.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Fantastic afternoon out", "Having always had an interest in cars, I wanted to check out this museum, when I said to people that I was going on holiday to Los Angeles and said I was going to a museum they looked at me funnily. Well I had the last laugh. Excellent vault tour with various interesting collectors cars from the round door rolls royce to the history of the porche 911 or (901), and movie cars.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Vault is a must see.", "This was my first visit to the Petersen after their dramatic remodel. On Monday AM museum was not crowded. Easy to park and tour through exhibits. Cars were well displayed with interesting written info. I did miss the diorama displays from the original museum. However, the new vault tour more than made up for that.loss. Peter is an amazing tour guide with many interesting background stories about the cars. Drago is a great on-site Italian restaurant. Well worth a lunch stop,\nShow less"], ["Reviewed August 1, 2017", 5.0, "Fun to visit and friendly staff!", "The main museum did not take as long as we had thought it might to see everything and that was without really rushing. The vault tour is well worth it!"], ["Reviewed August 1, 2017", 4.0, "Vault Tour", "I was very impressed by the vault tour and the Docent was very excellent.\nHer knowledge of the cars on display and automotive history was impressive.\nA couple of \"fine tuning\" suggestions;\nStart the lecture only when all participants are present.\nHave a discussion of the rules before the tour.... the tour was interrupted many times due to people walking between cars.\nShow less"], ["Reviewed August 1, 2017", 3.0, "First visit", "Exhibits were excellent....particularly Ferrari and Bugatti. Vault tour was good, not a particularly good value for the money however.\nOnly detraction of a wonderful visit was a surly Petersen security guard at the front door before the museum opened. He could not care less or be bothered with questions about the museum. The last thing you want is a bad first impression before your customers even walk in the door.\nShow less"], ["Reviewed August 1, 2017", 3.0, "Hypocrit", "Took the vault tour which was not worth the money and was asked by security to not use my phone. I was not talking, making noise, or taking pics. The guard then used his phone off and on for the rest of the tour. There aren't any indications of this policy, only the no photography rule which I believe is silly.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Definitely worth it!", "For every car freak a must, but also for everyone else worth visiting. Fantastic and interesting exhibitions throughout the museum. The building itself is an architectural highlight, the museum's shop is huge and the restaurant serves good Italian dishes.\nStaff is very friendly, premises clean and nicely cooled - so this museum should be on the must-see-list of every L.A. traveller.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Spectacular Automotive Museum", "I couldn't have picked a better car and motorcycle museum to go see. The cars were breath taking and the history behind each car just amazing! I could have spent one more day there. I highly recommend going to the Vault also. The story behind each car told by the tour guide was impressive. I would recommend this museum to any one who is passionate about the automobile history!\nShow less"], ["Reviewed July 31, 2017", 4.0, "A bit expensive", "A bit expensive, but interesting. More interactive exhibits for kids would be great. Maybe they could actually sit in the driver's seat of a racecar, etc.?"], ["Reviewed July 31, 2017", 5.0, "enjoyable day with my favorite subject cars", "We spent the entire morning looking at the vast array of different cars which for me is a treat any time."], ["Reviewed July 31, 2017", 5.0, "Great Low Rider and other motor vehicle car show", "Our daughter attended Cal State Northridge and she informed us of the Lowrider and Chicano Art. We loved it and enjoy the whole Petersen museum. Excellent show"], ["Reviewed July 31, 2017", 5.0, "Impressed", "Down to earth way to spend and afternoon chilling out around cool cars and going for a ride in vintage style cars."], ["Reviewed July 31, 2017", 5.0, "For The Love of Cars", "My family visited Petersen on a Friday evening Vault tour. The building is really nice, the roof deck was entertaining the cars were amazing. We have a few suggestions- make the groups of tours smaller and hand out headsets or amplify the tour guide. Unless you pushed to the front, you missed out on the special histories behind the vehicles- and hearing the stories behind the unique vehicles is the point of the Vault night.\nShow less"], ["Reviewed July 31, 2017", 5.0, "LOVED IT!", "The docents were very kind and informative. I especially enjoyed the presentation by Harley Davidson."], ["Reviewed July 31, 2017", 5.0, "Great Place", "Have been here a few times and always great and interesting. Displays change so always different. Recommend the vault tour, had a great guide and get to see a lot of different cars."], ["Reviewed July 31, 2017", 5.0, "Beautiful museum, and gorgeous vehicles!", "My husband is a classic car enthusiast, so when we visited California recently, the Petersen Automotive Museum was a must see!"], ["Reviewed July 31, 2017", 5.0, "Great visit Peterson museum", "Parking, exhibits, staff- all excellent. A variety of informative displays, beautiful cars, art, history. Not just for gear heads."], ["Reviewed July 31, 2017", 5.0, "Had a terrific time", "Make sure to book an advance reservation to the Vault Tour. Hugely interesting. The docent was very informative and the cars amazing, including a Ferrari 250 GTO, just to drop a name."], ["Reviewed July 31, 2017", 1.0, "Horrible tour", "We were told there was a Chiron in the vault so we got the vault tour. Not only was there no Chiron, but the thing lasted an hour and a half. An hour and a half of a sassy, cowboy tour guide trying to be funny and passive aggressively reprimanding you for either falling slightly behind, getting slightly ahead, or just standing an inch too close to the cars.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Autoventure!", "Beautifully laid out museum that allows you to actually get up close to the exhibits (don't touch) with very knowledgeable docents. I cannot wait to return."], ["Reviewed July 31, 2017", 5.0, "Wow! Definitely worth a visit if you care at all about cars", "The Petersen was a late add to our Los Angeles itinerary -- we decided to visit on a whim on the last day of our long weekend trip. All I can say is, wow!\n\nMy first key piece of advice: do the vault tour. It is an extra add-on to the ticket, but that's where many of the goodies are -- an odd combination of unique custom cars, cars relevant to automotive history (think Tucker, DeLorean, Tesla, Model T), and cars relevant to world history (limos of FDR, Saddam Hussein, Marcos, etc.) In the vault tour, you walk through an unadorned basement garage with one interesting vehicle after another. It is surprisingly long at 90+ minutes, so eat some food and use the bathroom in advance. The docent who led the tour was outstanding.\n\nThe rest of the museum is very interesting as well, but the vault was the capstone, I wasn't sure what was permanent display and what was special exhibition, but we saw an exhibit of Ferraris, an exhibit of cars from movies and TV (e.g, Magnum PI's Ferrari, the DeLorean from Back to the Future, the T-Bird from Thelma and Louise, etc.), and a Bugatti exhibit, among others.\n\nI suppose some love of automobiles is important to having a good experience, but if you care at all about cars, this is a must-see destination.\nShow less"], ["Reviewed July 31, 2017", 5.0, "If you love cars this is a cant miss experience.", "The Petersen Automotive Museum is an amazing place. You can see cars of all kinds here. From cars that had a staring role in movies to cars that helped inspire the cars we have today. They have a kids area that is more hands on but I loved that area too as an adult.\nWe passed on the restaurant. It didn't have a lot of space and seemed pricey. I have no clue if the food was any good though.\nTip: Don't bring a backpack. They won't let you bring it in. Instead they will have you check it in at the desk, but really it would be easier if you left it at home.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Has everything with a motor", "A car buff will really enjoy this museum. Old, new different - you name it and it is here. It is fun to see even if you are not a car person."]]}}