{"Pfeiffer Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Pfeiffer Beach", "url": "/Attraction_Review-g240329-d283149-Reviews-Pfeiffer_Beach-Big_Sur_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/2b/3b/16/big-sur.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1135"}, "address": {"@type": "PostalAddress", "streetAddress": "Sycamore Canyon Road", "addressLocality": "Big Sur", "addressRegion": "California", "postalCode": "93920", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 5.0, "A very special place", "Pfeiffer Beach is on the agenda every time we visit Big Sur. Perfect every time. Only minor complaint is that they do not honor the Senior Card."], ["Reviewed 6 days ago", 5.0, "Purple streams", "Well worth finding and a quick stroll. Lots of photo ops. BUT, reserve if busy time of year. Ranger told me a recent weekend sold out by 10:00 a.m"], ["Reviewed 2 weeks ago", 5.0, "Worth the ride", "Two miles down the curvy one lane road (pullovers so cars can squeeze by each other) & a true pleasure- “window” rocks on an easily accessible beach, a photographer’s favorite. The road is hard to spot - not marked as beach access until you make the very sharp right...\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Dont miss this!", "Hard to find, ask for directions, well worth it! absolutely amazing, gorgeous. great for photography, listening to waves roll in, catching some rays, making sand castles."], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "We went to the beach for sunset, which wasn't much as it was too cloudy, but I loved the \"purple\" sand. I have been to a lot of colored sand beaches, but I believe this one is by far the best I have ever seen. It was cold when we were there, so we didn't stay very long, but I would love to go back when it is warmer and a little less windy. Our friends were fascinated by the sea creatures in the tide pools. We took lots of pictures, and enjoyed the place very much.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth the trip and the 10 dollars", "Looking for a beautiful secluded beach? Do not need any cafe or ice cream or anything just beach and sun and sea. Happy to pay 10 dollars to park. This is the one for you. Parking limited so I expect in high season you may struggle to get in. It looked as if the gate closed when the parking was full. From the parking short walk to a lovely Cornish type beach worth taking some provisions with you and staying a couple of hours.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful.", "Gorgeous beach with crashing waves and purple sand. The first time we went around 4:30 pm on a Saturday, the parking lot was full so the ranger didn’t allow any more visitors. We attempted the next morning and got in. The one way road is rather long and I would imagine dangerous in bad whether. The parking lot looked like it could hold about 30 cars. Short easy walk to the beach. Beautiful secluded beach. I will be returning with the kiddos.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Breathtaking", "Allow lots of time to stop and admire the jaw dropping views and scenery. Honestly don't try to rush anywhere or have a tight schedule you'll regret it!"], ["Reviewed January 22, 2018", 4.0, "Worth vistinbg", "Very attractive beach down long steep road labelled NARROW ROAD. Presumably the beach gets enough visitors without advertising its presence. Two natural arches and sandy beach to walk along. You pay for entry whereas you don't at some of the other stopping off points on the highway - didn't bother us!\nShow less"], ["Reviewed January 21, 2018", 4.0, "Good Beach, crazy tourist attraction, barely any purple sand", "If you come here and expect purple sand all over the beach, you will probably be disappointed. There are patches of purple sand near the rocks, but it's barely visible. Maybe it will be more apparent under special lighting. Limited parking space, so you might have to wait around if the parking lot is full (probably will be if you go too close to sunset hours). I came here at 3PM to wait for sunset and basically everyone is situated in front of the arched rock waiting for sunset. You got photographers on the cliffs and on the beach. Can be hard to get the shot without someone in front of you given how many people are there. Overall, the beach itself is nice and would visit again.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Do not skip a visit to Pfeiffer Beach!", "The drive down to the beach is long, and it’s easy to miss the turn off when you are coming in from the Carmel area, but you will be richly rewarded for your efforts. Pfeiffer Beach is a magical place!"], ["Reviewed January 2, 2018", 4.0, "You're not going to get a clean photo", "Clayton C summed it up nicely. The beach is definitely nice, the road to get there is bumpy and single lane, there's a $10 parking fee for the day (cash only), and it's not a good beach for swimming. The only thing I'd like to add is... no doubt you've seen photos and are hoping to get a decent one yourself. Be prepared for a hoard of people with tripods at sunset. If you want even a remote chance at getting a shot without other people in it, you'll need to camp out for the best/front spot on the beach or go at a time other than sunset. This applies to all seasons as well, it was packed even on a super cold and windy winter day in December.\nShow less"], ["Reviewed January 2, 2018", 4.0, "Nice beach, treacherous road, $10 entrance fee, decent parking, not good for swimming", "You've got to know where you're going to find this hideaway because it isn't marked off of Hwy 1. This is certainly an icon to visit and note that this isn't a state park but a privately managed park with a $10 cash only entrance fee. Is it worth coming, sure for sightseeing. The water is a bit rough for wading and swimming, I'd go elsewhere for that. Watch out for the road, it's in poor condition and very narrow. Large trucks should think twice. There are classic pit toilets on site.\nShow less"], ["Reviewed December 24, 2017", 5.0, "One of a Kind Beach", "The drive along the coast was a beautiful precursor to this beach. There is limited parking and it was busy so we had to wait briefly. The drive to the beach is long, narrow and quite bumpy. We were glad we were in a truck. It wasn't pleasant meeting cars and trying to squeeze by each other. Once parked it is a short walk to the beach. It opens up into paradise! The beach is clean with breathtaking views! We were in awe of the pink and purple sand. Several brave people were climbing the huge rough rock formations and I'm sure they got quite a view. The ocean provides beauty with rolling waves washing through big crevices in the rock. There were little sea urchins to watch on the rock further down on the beach. Sea lions popped up and down. Very relaxing and quite a sight at sunset. We're glad we ventured this far to see such beauty!\nShow less"], ["Reviewed December 23, 2017", 5.0, "Secret hideaway beach", "Hard to find but so worth the effort. Look for the yellow narrow road warning on the west side of the road. The drive down is narrow and bumpy but at the bottom it is a treasure. The beach feels secluded and unique. Rock archways, roiling surf, and blue water abound. Pit toilets are not so cool but there IS a toilet! Sunset here is worth planning for.\nShow less"], ["Reviewed December 20, 2017", 2.0, "not impressiv at all", "I love the beach but found this quite unimpressive. we only stayed 15 minutes. The drive along the coast to get to this area is the highlight. The road to the beach is narrow but drive to the speed limit and all is fine, it is not dangerous.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Place is great, but let's talk about the road.", "Great beach and picturesque location. At the beach, i made the mistake thinking that the first rock was the main one with the opening, but it is the second one that is it. Everything is great about the beach as others have reviewed. There are 2 parking lots, a closer one that is a loop and an upper lot. I just parked in the upper and walked to avoid the people waiting for spots at the lower lot.\n\nLet's talk about the one lane road that leads to the beach. It is narrow. There are blind turns. It is bumpy at times. Please have courtesy and do not tail gate. I had another car tail gate me from the start up at highway 1. I went as fast as I cautiously could with the bumps and curves, but he was on my tail the whole time. About half way down, I pulled to the side to let another van pass coming up. He tried to get around me, but then saw the van and slammed on his brakes and had to reverse back up. I think that gave him a hint. He was better the rest of the way. I went into the upper lot and he sped past to the lower lot. When we were leaving he was somehow behind me again, but this time he wised up. He kept a safe distance and just let me go at it at my pace.\n\nIt is easier to see ahead on the way out of the beach than on the way to it, in my opinion. Please turn your lights on. It really helps as I would look through the trees up ahead to see if there were any lights coming.\n\nAll in all, you gotta check the place out. Just drive slow on the road and let a tailgaters pass.\n\nAlso be prepared for your feet to get wet. We tried the our best, but some of those sneaker waves just get you.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Wow", "Great place to visit and see Beauty on the California coast...Nice places to stop and see from different angles and nice bridges along the way...Visit at Sunset"], ["Reviewed November 17, 2017", 5.0, "Great place to walk in the sand and watch the crashing waves", "We stopped here on a windy day in October, which made for quite a cold visit, but the big surf that day was spectacular to watch as it crashed on the large rocks.\nIt is a fairly expansive beach with lovely sand (some purple) and the water was cold!\nWe read reviews about how difficult it was to find the beach, but google maps took us right to the parking lot. The road leading to the beach is narrow, but not as bad as we were lead to believe and there are lots of wider spots in the road to let cars pass each other.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Magical must see", "Drive through the tree filled woods to arrive at a beautiful beach with mountains at the shores & a huge rock with a hole where u can enjoy watching the surf crashing through it. The sand is the softest in CA! This is a magical spot, don’t miss it!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Amazing!!!", "Truly one of the prettiest spots at Big Sur! The beach us breathtaking! We got so many amazing photos here. The sand is purple in some areas. Highly recommend bringing water socks or sandals that you are ok with getting wet if you climb on any of the rocks and to walk thru all the sand.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Wonderful Stop Along Your Coastal Road Trip!", "If driving up OR down the coast on a road trip, this is a wonderful place to stop. Depending how much time you have, you can make it a quick stretch OR spend the whole week here (camping on the campgrounds).\n\nTravel Tip: Catch the Sunset:\nI just ended up stopping by for the day while doing a road trip and loved it. I've seen sunset shots here and unfortunately I wasn't able to catch a sunset, but if you can stay around for sunset, you will most likely get an outstanding picture if it is a clear day.\n\nLet me know if these tips are helpful by clicking the like button so I know I'm helping someone. Even if this review helps one person then it is worth the time to me.\n\nAlso feel free to follow along on here or IG (@neonorth) for more travel tips & inspiration to hopefully make your upcoming trip better.\n\nSafe Travels!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Beautiful, hard to find Beach", "Finding Pfeiffer Beach is definitely a challenge, but worth it. I had read previous reviews that said it would be difficult to find and thought I was prepared from all my research. Another review said to look for a narrow road sign when headed south on route 1. I was looking for a sign that was narrow. Oops. No the sign said Narrow Road. Saw it and passed right by. Once we hit Big Sur restaurant I knew we had passed it. We asked for directions and we turned around and headed back north and it is the first street on the left after the little bridge. The road is a steep decline on the left when headed north. The road is very narrow so watch out for oncoming cars because you will have to find a place to pull over. Once we got there we parked and walked to the beach. You’ll see a couple of rock formations as you are entering the beach that have some openings in them. Don’t think that is Keyhole Rock because it is not. Continue around the beach and you will see Keyhole Rock. Loved it.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Purple sand!!!", "Fun to spend a few hours. The beach wasn’t overly crowded in October. Was $10 to enter. The sand really is purple in area. Lots of kelp has washed ashore."], ["Reviewed October 21, 2017", 5.0, "The Purple Beach", "Amazing beach with purple sand. It's 10 dollars for park entrance and then a quick walk to the beach. It's one of the nicest beaches in California"], ["Reviewed October 16, 2017", 5.0, "Simply iconic", "This is an amazing area: you have the ocean and beach with great views, the rugged coast and, as we were fortunate, a stunning day with the sun up in the air.\n\nI am sure that it would look equally amazing even on a very cold day with the wind in your face, smelling the fresh air and the sea and hearing the noises of some crazy seals.\nShow less"], ["Reviewed September 25, 2017", 5.0, "You can't beat it!", "Seriously stunning! Beautiful sunset. A bit difficult to get to/hard to find/hard to park, but very pretty. The waves are pretty rough, though, so I wouldn't recommend swimming."], ["Reviewed August 13, 2017", 3.0, "A great beach with spectacular views.", "It's a great beach to pack a lunch or lite snack and watch a sunset. The jagged rocks create amazing opportunities for taking pictures. The rough water and jagged rocks make it a little difficult for young ones to swim or play in the water."], ["Reviewed July 19, 2017", 4.0, "Purple sand beautiful & rock formations, great place to hang out", "Too bad the beach is closed, we really enjoyed the unusual rock formations and the sea roaring in. I like to visit beaches of different colors, and this beach did not disappoint. The beach has streaks of purple, from eroded crystals of garnet. The short hike from the parking lot is worth seeing the purple sparkling sand. When the park opens, you should go and stop at Big Sur Deli for the fabulous burritos and have picnic on the beach. You don't see sights like this everywhere, this is an iconic California beach.\nShow less"], ["Reviewed July 7, 2017", 1.0, "Beach is closed", "The beach is currently closed because of road closures. The sign to say the beach is closed is about .5 mile before the road shuts 😤, long way to drive for nothing! The park is open though"], ["Reviewed June 28, 2017", 1.0, "Pfeiffer Beach is closed", "We were so sad to find out that Pfeiffer Beach is closed. We made an assumption that since the park was open, that the beach would be as well, but sadlly, not so."], ["Reviewed June 20, 2017", 5.0, "Great beach to cool your feat after a hike", "We loved the beach. Beautiful and fun place to see the place where the water from the waterfall meets the ocean."], ["Reviewed May 28, 2017", 5.0, "Beautiful Beach ! Purple Sand !", "Beautiful empty beach with the two big rocks making it a nice dramatic scenery on PCH drive. Great for sunsets or just some picturesque shots. Dont miss the exit to go to this beach on the PCH, its kinda tricky to notice. Unpaved road leads to the beach. Waves crashing thru the hole in the rock looks pretty epic !\nShow less"], ["Reviewed May 24, 2017", 5.0, "Beautiful!!!!", "Absolutely one of the most beautiful beaches ever! A must see place to view a sunset at least once in your life!"], ["Reviewed May 19, 2017", 5.0, "Purple Sand!", "My favorite color is purple; naturally this beach was on my bucket-list. While it was tricky to find and there was a small entry fee (sorry don't remember what it was), it was absolutely worth it for me to see purple sand. The beach is a short walk from the parking lot (which has basic latrine-style bathroom facilities). There were not many people while we were there (late September) but the beach was beautiful, rocky and wild. It was windy while we were there, and we needed our light-weight jacket.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Purple sand!", "Being a Florida boy I've never seen anything like it. From the purple sand to the smooth stones, the rock formations the waves are crashing through the caves in the rocks. Must see!"], ["Reviewed May 12, 2017", 3.0, "a nice road trip", "Nice road tr but a bit long and quite foggy, sometimes the road is a bit scary to be honest, but the view is impressive"], ["Reviewed April 21, 2017", 3.0, "rugged and wild", "I liked this beach but the reason for not giving it a higher score is that I tend to go for more pretty beaches I loved Andrew Molera beach, and found this to have a more rugged and wild feel,but still very interesting to see and loved the rock formations and purple sand. We visited in October so not too busy but still a good few people around, like other reviews have said it's very easy to miss the turn for it we passed by twice before asking directions, it is also a very narrow road down to it lucky we did not meet many cars. You are charged $10 to park and it is not owned by the state like other parks and beaches in Big Sur so you have to pay separately. I would definitely visit if you have the time but if you are limited on time I would not as it really is off the beaten track and not worth paying $10 if you have not the time to explore.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Beautiful Indeed", "This was a beautiful beach. Wish we had spent the whole day there. We went to see the sunset. Fortunately we walked down, because there were a lot of other people with the same idea and a huge line to get in and no parking. Go early.\nShow less"], ["Reviewed April 10, 2017", 4.0, "good place", "found this place good, you might also the same. lovable breeze beaches and tiny mountains would just make you surprisingly feel good."], ["Reviewed April 5, 2017", 5.0, "Beautiful Site!", "Oh this place was pretty on the Pacific Coast, and the sunset are the best! You can visit the Park nearby as well with trails too."], ["Reviewed April 5, 2017", 5.0, "Beautiful", "This is a beautiful stop along the California coast. We enjoyed walking around the beach and taking pictures."], ["Reviewed March 23, 2017", 5.0, "Location of Burton/Taylor beach scenes in The Sandpiper", "There is nothing quite like the Big Sur south of Carmel, CA. My wife is a huge Elizabeth Taylor fan and that made a stop at Pfeiffer Beach a must. We were so pleased that we took the time to find it and enjoy the raw nature and spectacular views it provides. We visited early in the morning when the air was fresh and the beach relatively uninhabited. Seeing the waves crash upon and through the huge rock with the rectangular hole that appeared in The Sandpiper with Burton and Taylor was the frosting on the cake.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Stunning", "Love this beach. Great little walk out to view the falls or to hike up and around the bluffs. Awesome ocean views. Can be really windy and chilly so go prepared and be sure to take your camera."], ["Reviewed March 14, 2017", 3.0, "Unsuspecting Tourists", "A beautiful location that is visited by thousands of people every year. It offers gorgeous views, is so scenic and photogenic, and it's hard not to want to visit this hot spot. The thing I hated about this spot that I hadn't read about"], ["Reviewed March 10, 2017", 5.0, "Such a beautiful place!", "The purple sand is surreal, and it's so far off the beaten path, it's quite a find! You really have to know where you are going because there aren't signs for this. Worth seeing though for sure if you are traveling through the area!"], ["Reviewed February 16, 2017", 4.0, "Spectacular natural beauty", "Scenery is spectacular. Few services available. My disappointment is the extremely high population, but that is only because I prefer my getaways to be quiet and serene and less congested. Overall not a bad choice for Bucket List, just be prepared to share your space;)"], ["Reviewed February 3, 2017", 4.0, "Worth visiting only for photographers with a lot of time to spare", "Great landscape for photography but surely you can skip it if you have some plans for the day and want to save some valuable time."], ["Reviewed February 2, 2017", 5.0, "Great place for a picnic.", "Not a safe swimming beach so keep an eye on the kids but a great place for a picnic. There is a short walk through a tree tunnel to get to the beach. Some times is can get windy even in the summer so bring a jacket.\nShow less"], ["Reviewed January 28, 2017", 5.0, "Unspoilt beach", "We came here on the strength of a recommendation from another couple we met on the road. It's a very tucked away beach approx 2 miles from Hwy 1, the turning is sharp and easily missed. If you have a sat nav, ensure it is set and you are prepared to turn with plenty of time! It's a winding single lane towards the beach so proceed with caution in case of oncoming traffic. Not sure if you can get down there in a camper van or anything larger than a Land Rover.\nIt costs 10$ to enter and park up, please be aware parking is limited so try and go early morning or late afternoon as we did.\n\nA short walk and you're on Pfeiffer beach. It's wild, it's windy and it's stunning. A perfect place to wile away an hour or more. We didn't regret our little detour here (especially as the majority of Julia Burns Pfeiffer State Park was closed due to wild fires in the area, this was our first major stop along the Big Sur).\nDue to the rocks in the area, there are streaks of purple sand all along the beach. So pretty and unique. I highly recommend a detour to this beautiful and unspoilt beach.\nShow less"], ["Reviewed January 17, 2017", 4.0, "Beach/hike combo", "Great campground with lots of areas to explore. Easy hiking with children. One of my favorite spots in Norcal"], ["Reviewed January 15, 2017", 4.0, "off the beaten path", "This one can be tricky to find. The turnoff from Highway 1 is not well marked. Its just south of the bridge that is just south of the entrance to Pfieffer Big Sur State Park"], ["Reviewed January 12, 2017", 5.0, "Majestic and a must see while in Big Sur", "Beautiful and is a must see while visiting Big Sur. Parking is a bit limited down at the bottom of the trail which is beach front however you do have the option to park up on the highway and can bike ride down to the beach. It is a 2 mile bike ride and makes a for about a 30 min walk. The beach is an incredible place if you like photography, while others enjoy casting a fishing line, but the most popular activity was picnicking and it is dog friendly!!!\n\nSuggestion is to visit earlier in the morning or early afternoon as it does become busy and parking is first come first serve basis and has a $10 cost. Don't let that deter you, it's an absolutely beautiful place to visit for families, tourists or an escape to just get away.\nShow less"], ["Reviewed January 11, 2017", 5.0, "June 2014: Easy to miss", "This is on the way to Pfeiffer Beach. Make sure you get a map at the Monterey info building when you drive into the city. They can give you a map of all of Big Sur and the location to this place, which is a narrow road fit for only one car at a time. It's great for getting iconic photos but you don't need to be here for too long. Try to locate the place and take photos of other locations like McWay Falls and then return for beautiful sunset photos.\nShow less"], ["Reviewed January 10, 2017", 5.0, "One of the finest in CA", "This is one special place, well worth the visit. There will be others I'm sure to walk on the purple sand and take that photo of the hole in the rock, but it is worth it"], ["Reviewed January 7, 2017", 4.0, "Beautiful beach", "This stop took us a little longer than I expected... I've been here twice, in the beginning of May and it was pretty crowded, and the second time was mid November at night to shoot the stars... It is a nice beach, but if you're pressed for time I'd definitely put the other stops in Big Sur above this one.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Fabulous place even on a freezing day", "This is a beautiful, unique place that is great for taking pictures. It was very cold when we visited but there were still many people. Well worth the trip down the small road and the $10 fee."], ["Reviewed January 4, 2017", 4.0, "Purple sand", "Heard a lot about this place from friends and a drive to this place is finally planned!\n\nAfter pulling off from the main road, the drive took us through a narrow and bumpy road. Looks like a drive through the forest. Drive slowly and carefully as you will find cars coming from the opposite direction and may need some kind of concession at times.\n\nThe place is awesome. Rocks, sand, waves, and patches of purple grains of sand. This is real. Come early if you want to avoid the crowds. Noon is the peak when the crowds arrive. A simple walk down the beach, a bit of exploration, try to stand in the way of the waves, and enjoy Mother Nature.\n\nShow less"], ["Reviewed January 3, 2017", 4.0, "big sur", "this beach is one of the best beaches of California. the location and site is very beautiful. the ideal place for surfers. it has good sandy beach very naturally formed. there is always crowd, taking photographs from all directions. it is one of the most visited site by tourists.\nthe entire site has a limited parking slots, and hence there is park staff monitoring the movement and parking of cars in the location. when one vehicle moves out, another vehicle is allowed in near the beach parking slot, and parking is not free but chargeable.\nShow less"], ["Reviewed January 2, 2017", 4.0, "Amazing beach with a bad view?", "This beach was really really cool but literally filled with tourists who did not seem to be there to enjoy the view but to take photos to enjoy later? It was actually annoying as they were unmovable for those who wanted to take the scene in real time. If you walk all the way to the end of the beach the tourists fall off. Much more pleasant.\nShow less"], ["Reviewed January 1, 2017", 5.0, "Big Sur's Best Treasure", "One of the best treasures in and around Big Sur - and that's saying a lot given the entire coastal area is chock full of wondrous redwoods, waterfalls, creeks, sea gardens, cypress trees, bridges and gorgeous rugged coastline. The purple sand is truly phenomenal.\nTraveller Tip:\n$10 parking fee.\nDrive minimum 90 minutes before sunset as the parking is limited. Else if planning to stay for sunset, the rangers land up recommending people to walk 2.2 miles from Ca-1 (which i would advise against as it is quite a long and cold walk on the return in the dark )\nDO stay for sunset. ~40minutes before the sun sets the rays flow throw the natural bridge and gives a most mystical effect. Love the effect of the water droplets bathed in the sun's rays.\nNot swim friendly.\nDress warm. Big Sur evenings are always chilly.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Secret Paradise", "Hard to find, but worth the extra work to find it. Just beautiful and not many people! Coming from the North, make the first left after the bridge 1/4 mile past Big Sur Bakery, there are mail boxes at the end of the paved road. You will see a sign after you turn in the road that says 2 miles to Pfeiffer Beach.\nShow less"], ["Reviewed December 30, 2016", 5.0, "Paradise", "Excellent beach to relax on, the drive down the mountain is a little tight but that's what makes it worth spending a little bit of time at this excellent spot."], ["Reviewed December 30, 2016", 5.0, "One of best beaches ever", "Just a lovely beach. Best to go at low tide--you can walk a ways! Great wave action, great rocks, great purple sand!"], ["Reviewed December 27, 2016", 5.0, "Beautiful", "Gave this high rating because it is one of the few places you can be on the beach. Plus the sun sets and go down where you can see it through a hole in the rock. See the purple sand too. Bring a picnic dinner and enjoy. It is hard to find the turning. It is an unmarked road Stop at the visitor center north of the beach and they'll give you directions. $10 park fee. Federal park.\nShow less"], ["Reviewed December 22, 2016", 5.0, "The ultimate Big Sur beach experience", "We visited Molera Beach as well as this one, and this beach is far easier to access and just stunning in the views of the rocks and surf. Parking is very close to the beach, easy to access if you have small children, and there is plenty of space to spread out and watch the waves crashing through the keyholes in the rocks. A can't-miss experience at Big Sur and a highlight of our trip.\nShow less"], ["Reviewed December 21, 2016", 5.0, "A true piece of paradise", "This was my third time in Big Sur and I only now discovered Pfeiffer beach. Whoa! Actual sparkly purple sand! My 3.5 year old was in snadcastle heaven!\n\nSeeing the waves crash through the stone archway was simply majestic. We took a walk all the way down the beach and saw beautiful pink stones, shells and birds on a serene and very quiet beach.\n\nWe spent a good 2 hours there and had we brought a picnic could have stayed all day!!! Simply breathtaking!\nShow less"], ["Reviewed December 19, 2016", 5.0, "Pfeiffer Beach / Big Sur", "A stop here, down to this beach ... stunning place, famous, so a natural beauty you never have seen, and when evening falls it's also a dreaming sunset , a real highlight, be sure to kick back, super nice, enjoy the place !"], ["Reviewed December 18, 2016", 5.0, "Famous archway", "The turn off for this is not marked and there is a yellow sign saying “Narrow road, No RVs” just before the turn for Pfeiffer Big Sur SP on the left side (if driving north). This road goes on for about 2 miles before you get to the car park and there is nowhere easy to park along here, so prepare to pay the $10 parking fee. I wouldn’t want to park on the main road as it would be at least a 45m walk one way to the beach. It’s a short walk to an impressive beach with crashing waves and the large familiar arch. We visited around 3.15pm and there were people lining up their cameras for the sunset. The beach was very windy as well compared to the other places we had visited that day, so would recommend a jacket.\nShow less"], ["Reviewed December 14, 2016", 5.0, "Stunning--MUST see at Sunset!!!", "We drove along the PCH from Hearst Castle to Monterey and Pfeiffer Beach was a must stop on my list. Not only that, but from my research, we HAD to see it at sunset, and wow, it did not disappoint. Be sure to check the sunset time (weather apps) when you'll be there and plan accordingly. Google maps worked for us to find the right spot. The road down to it was a bit rough--slow down along the 1 as you come up to it, because it's easily missable. It's 1.5 lanes wide, so be prepared to pull over to let people pass, there are no lines or reflectors and no lights, which makes navigating it at night a bit more difficult than usual. Just when you think you might turn around, because really, it seems pretty creepy, you reach the main parking lot. The lot isn't large, but a couple of people were leaving when we got there. We were there just before Thanksgiving, so with the wind, it was chilly--bring a fleece and windbreaker! But that also meant people typically didn't seem to stay more than 20-30 minutes (so pull over and wait for a parking spot). You walk a couple of blocks-worth across mostly flat sand, and if you go at sunset, you'll see the jaw dropping beauty of the sun about to come through the main arch. Be patient with all the people trying to get the same pictures from the same spot--the sun moves slowly, so you'll get your chance. The drone was a bit annoying though--ruined a few pictures. Experiencing sunset here at Pfeiffer Beach was the highlight of our trip.\nShow less"], ["Reviewed December 7, 2016", 5.0, "Hidden delight", "You probably won't be alone on this beach. The road down to the beach is an adventure, and opens up into the parking lot. A brief walk to the beach affords you a treat beyond compare. Be prepared for strong winds...I have NEVER been to this beach when it wasn't windy.\nShow less"], ["Reviewed December 1, 2016", 5.0, "Lovely beach", "The drive down to the car park is a surprisingly long one, but the car park was pretty much empty on the day that we visited so there were no issues with queues or getting a spot. The beach is just a short walk from the car park and it's pretty impressive. I had to do a fair bit of squinting to make out any purple sand but I think the light was against us at first. The waves crashing on the rocks is a sight to behold, and there were a couple of sea lions (I think) playing in the water. It's small and didn't strike me as a 'fun' beach, but I imagine it would be lovely to spend a couple of hours there reading a book and eating delicious snacks.\nShow less"], ["Reviewed November 25, 2016", 5.0, "Go prepared", "Many visitors try to get to the beach but the parking is limited. You may have to park on the main road. After that it is 45' walk. We were lucky, and we found some very nice people who live there and they took us by car. The beach is nice but it is a bit chilly. Take a pair of flip flops and a towel if you want to put your feet in the sea. Charge your cameras and enjoy the view\nShow less"], ["Reviewed November 25, 2016", 5.0, "Nature on its best", "A pretty cold beach, make sure to bring a jacket. The moment the waves hits the rock is an incredible moment. Really worth the trip."], ["Reviewed November 22, 2016", 5.0, "Magnificent.", "After visiting McWay Falls and then having a late lunch at Nepenthe restaurant, we drove to Pfeiffer Beach to see the famous Keyhole Arch. We were losing day light, which means we'll probably be missing the sun through the hole sighting. What complicated things more was the lack of signs. I blew right past the road that I was supposed to turn in and we continued on for 8 miles before I said this doesn't look right (because I Google mapped and looked at the images of the route ahead of time). Note that cell phone service is spotty here. My wife's T-Mobile was not helpful, and my AT&T was random. We lost about 15 minutes having to back track. Anyways, the road down to the beach was not easy. It is narrow, bumpy and when there is a car coming up from the beach... you better dip on the side of the road or reverse with some pro skills. Good thing we didn't come when there was a potential of a lot of cars exiting, we only ran into two.\n\nOnce down to the beach, the sun was still setting and the orange hue of the sky and the rock formations, it is one of the prettiest sights I have ever seen. My wife was really enjoying it tremendously. She did not want to leave. I can see why people come here and set up their tripods just to get that perfect picture. HOWEVER, because they like to set up their tripods, they affect other visitors from getting their own pictures.\nShow less"], ["Reviewed November 15, 2016", 5.0, "Scenic drive in", "We were told by the volunteer at Point Lobos State Preserve that we couldn't miss this but it's very easy to miss it in that there are no signs on Hwy 1. Going south on 1 look for a row of about 5 -6 mailboxes on the right before you get to the town of Big Sur, make a really sharp turn then you see the sign. The drive in is a very narrow but scenic adventure. We were so glad we decided to stop. The beach is absolutely breathtaking. The rock formations, the waves and the solitude made us all want to stay for hours. We visited many state parks during our 3 week adventure in California and were charged a fee at all of them. California does such a great job keeping their parks pristine and natural and none of us had any complaint with the fees charged. Keep up the good work!\nShow less"], ["Reviewed November 15, 2016", 5.0, "Stunning", "Off route 1...take right turn sign posted narrow road one mile south of BIG SUR LODGE. Follow road for two miles. Costs 10 Dollars to park but well worth it. Stunning purple Beach. Lovely walk but not suitable for swimming. Unusual seaweed."], ["Reviewed November 5, 2016", 5.0, "beautiful experience", "this is probably the most beautiful beach on the planet. the waves are hugs and amazing. the rock formations are spectacular and the beach is fine white sand. it was truly an unbelievable experience. worth the $10 parking fee and more..."], ["Reviewed November 2, 2016", 5.0, "Splendid and unforgettable", "The nature around you is gorgeous. You may walk barefoot in the laguna for hours hypnotized. No where more than here do you experience the grandness of the Pacific, no matter what kind of weather."], ["Reviewed October 29, 2016", 5.0, "Amazing Flora and Fauna everywhere you can see! Stunning Drive too!", "I have been there many times thru my life and place stands still. The beach has crazy natural illuminating seas, the bridges coming into the beach are amazing stunning architecture structures! the beach is rocky and has beaches to sun bath or nature photography! love all streams and tide pools. I will be back and back...\nShow less"], ["Reviewed October 28, 2016", 5.0, "Beautiful natural beach", "I spent hours hear watching the birds land on the beach and eat little crabs. The tide pools are beautiful with starfish and other colorful creatures. Just a great place to stop and spend hours just enjoying it's beauty. Big Sur is one of my favorite places in the world\nShow less"], ["Reviewed October 27, 2016", 4.0, "Great view point", "The beach gives a chance to enjoy the scenic beauty to nature lovers. A nice place to visit. One can see the purple sand during the sunset time. A nice beach with fairly clear water."], ["Reviewed October 26, 2016", 4.0, "Great views for sunsets!", "One of the hidden beaches on the west coast! It's hard to really find it unless you're sure where to make the right turns. The big beach with lots of space is really nice for a day's fun activity. This place can also have amazing shots of the sunsets if you're there on right time. The water is usually cold but is fairly cleaner. However the beach is not that clean itself.\nShow less"], ["Reviewed October 24, 2016", 4.0, "Visiting", "They say the beach has purple sand. When we first walked onto the beach we did not see any purple sand. But when we were leaving the sun was hitting the sand just right, and indeed you were able to see the purple sand. A must see\nShow less"], ["Reviewed October 23, 2016", 5.0, "famous purple sand", "Pfeiffer beach has unusual purple sand which looks absolutely fantastic! But not all sand on the beach is purple, the best time to see purple sand is after rains."], ["Reviewed October 22, 2016", 5.0, "Stunning at sunset", "We got to Pfeiffer beach just before sunset. It was absolutely beautiful. At certain times of the year (February I believe) the sunset shines through the arch. But it was amazing to see even without this. Just be aware that there's a 2 mile drive down to the beach where there's only room for 1 car so if you meet another car you'll have to pull in. The car park isn't huge either but if you go a bit later in the day this shouldn't be a problem.\nShow less"], ["Reviewed October 22, 2016", 5.0, "Love This Beach", "Located at the end of a 1.5 to 2 mile trek on a 1 lane winding dirt stone road from Hwy 1. Driving down this road and coming back up from the beach and getting back onto Hwy 1 can be a somewhat harrowing experience. All I can say is please be a cautious & considerate driver. If faced with oncoming traffic & you can get over, please do it. No joke.\n\nThere is a $10 charge to park a car for a day. (All the parks in California that I have been to charge this unless you are a \"park\" member.\n\nIf you start off for your hike to the beach at one of the parking lots or even if you are dropped off, on the path that takes you to the beach you are going to be navigating in sand and pebbles. (This is not a Southern Cali beach, with beautiful sands that you would want to throw down a beach towel to catch a few rays on). This is one the \"Wild Children\" of Cali beaches. Once you hit the beach area you become one with nature and her elements. It gets somewhat windy, and misty and there is lots and lots of Kelp that has washed up onto the beach to navigate around. Everytime that I've been here it's been chilly and the sky is gray, but I've enjoyed watching the rolling waters of the Pacific crash in along all the rocky outcrops that make up this beach along with a seagull buddy of mine we spent a good portion of the time watching people scaling to the top of one of the outcrops, \"Just because it's there\" or so I was told by one of my friends who did the climb.\n\nWe were there while the majority of if not almost all of the parks and beaches in Sur were closed (baracaded was/is a more apt description) but very understandable due to the Soberanes Wild Fire that was still burning around us. To find Pfeiffer Beach open at that time was nothing short of amazing.\n\nI'm sure that if I find myself back in the Big Sur area, which I hope that I do, I'll look forward to a revisit.\nShow less"], ["Reviewed October 22, 2016", 5.0, "Beautiful Beach!", "If you are in the Big Sur area do not miss a visit to Pfeiffer Beach. You will not be disappointed! It is a true natural beauty!"], ["Reviewed October 17, 2016", 5.0, "Over run with Tourists", "This was once a beautiful must see beach but now it has been overrun with tourists. It requires a long windy drive from the highway down to the beach and once there you must pay and then walk a good distance to get to the beach so I would not recommend for parties traveling with older folk.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Cozy beach with some purple hue to the sand --interesting sea stacks", "This one can be a bit hard to find and requires there to be enough parking to be granted entrance from the main highway. Unless you have 2-4 hrs to spend hiking in and out, you'll need to drive to the parking lot that is then another ?100 yd walk to the beach. It is a pretty walk but we just didn't have that kind of time so thankfully we got right in. Water was too cold to swim even in mid-July but it is quite picturesque with the interesting doorway sea stack and sand that has a dark purple silk-like ribbon running through it. We were of course expecting crushed amethyst and it was far less dramatic than that but still worth a visit.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Nice casual experience", "We went in October so not the best swimming time but that's not what this beach is for. Pfeiffer Beach offers beautiful scenery with a lovely beach and gorgeous rock formations. On the park premises there are no picnic accommodations that we saw but made do with a spot on fallen tree on hillside. Nice place to stop in Big Sur. Downside is $10 parking for a brief visit.\nShow less"], ["Reviewed October 17, 2016", 5.0, "My favorite beach in all of California", "I am a native Californian who has visited this beach many times over the years. It will continue to be a favorite. I was lucky to visit this beach early on a Tuesday morning when there was no rain wind, or fog. I took lots of pictures of the natural tunnels in the rocks. There was plenty of parking in September between 8 and 10 am. I did pass a few cars on the very windy and narrow road, but it was worth the caution necessary.\nShow less"], ["Reviewed October 16, 2016", 3.0, "Visited when weather was bad", "We ended up visiting this place when the weather was bad. We did not get to enjoy the place with intermittent rain and cold winds...it its a small beach but couple of rocks make it scenic...it is a narrow road from the highway and one needs to drive carefully...\nShow less"], ["Reviewed October 12, 2016", 4.0, "Pretty beach off the beaten path", "The beach is located 3 miles south of The River Inn. Turn at the sign that says no RV's. Its about 2 miles to the parking lot on a narrow road. You may have to use pullouts provided to let cars pass. The road is paved and in pretty good condition. We took our classic car down it with no problems, just driving slow over speed bums and ruts. There is an attendant collecting the $10 fee for parking. He would REALLY like it if you had $10 and didn't need change!! The beach isn't large, but it's very dramatic. The sun portals are cool, especially when the waves crash through them. There is some purple sand, but the whole beach isn't purple or anything. My husband thought the purple sand was a stretch. A nice stop to stretch your legs and maybe picnic. I wouldn't attempt it on a weekend during heavy tourist season, but a weekday in mid-october was just fine.\nShow less"], ["Reviewed October 3, 2016", 5.0, "Great stop for a beach break...look for Narrow Road on right going south on 1", "Great stop which was recommended by our son; going south on 1, if you get to Big Sur Deli on right, you are about 1/2 mile too far; we got directions at Deli but road is marked Narrow Road, no RV's,etc. about a 2 mile wiggle down a 1.5 lane road; worth it for sure, great beach and views; fix of people some for a break, some for the day; waves excellent for surfing;\n\nWould definitely do this stop again\nShow less"], ["Reviewed October 2, 2016", 5.0, "a little hard to find but worth it", "So, from many things I had read, I wanted to try and find this place. Based on the directions of \"its an asphalt road with the sign of narrow road no RVs or trailers\", we somehow found it. There is no other indication that an amazing beach is at the end of this road. It is a challenge to get down this road, but worth it. It is a State Park, so there is a fee of $10 to enter. I was ready to be disappointed, as it did not look too promising from the parking lot. And not too promising as you are walking in. And then you get to the beach and your jaw drops and you don't want to leave and you cannot believe what all is before you. Can you say purple sand? Can you say waves crashing against huge rocks and walls? Can you say sun peeking through arches through rocks? I think everyone of my pics from this place could be on a postcard. Try to find this place and let your sensory experience go on overload. You will be greatly rewarded.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Pfeiffer Beach at sunset is amazing", "This beach is so beautiful. We went once during the day and once at sunset. At sunset, there is no comparison--really an experience that stands out among the best in a lifetime."], ["Reviewed September 22, 2016", 5.0, "Amazing", "One of the amazing locations to watch a sunset in the continental United States. The road to the beach is very narrow; drive carefully."], ["Reviewed September 19, 2016", 5.0, "Lovely Iconic Beach! Do not miss it", "Lovely Beach, not to be missed. Easy walk from parking lot. We saw surfers, dolphins swimming-really nice."], ["Reviewed September 18, 2016", 5.0, "Purple sand beach and great rocks!", "Beautiful hidden beach with cool purple sand! Neat rocks! Easy to miss the turn off of CA 1. Narrow road to entrance of park, but worth the effort. Fun place to explore"], ["Reviewed September 17, 2016", 5.0, "A lesser-known beach with purple sand and stellar views - don't miss it!", "This beach is not marked well at all - just do some research or ask around and you will be given directions. Entrance is limited as the small parking lot does fill up. We felt fortunate to get in and are glad we made the effort to find the beach. The views truly are spectacular and the purple sand is intriguing. I wished we had had time to stay much longer just to sit and gaze. This is a place I will visit again and again. Photos don't do it justice!\nShow less"], ["Reviewed September 17, 2016", 5.0, "Not easy to find but worth it", "Not an obvious beach to find on Highway 1 but worth looking out for. Going south it's a sharp right handed just before Big Sur Bakery. It's the usual $10 entry but worth it for a few hours to top up your tan. The road down twists and turns but it's ok. Nice views with purple sand and didn't seem too busy during the week.\nShow less"], ["Reviewed September 16, 2016", 5.0, "Pretty scenic beach", "Definitely worth checking out ion the road trip through Big Sur area.. the Julia Pfeiffer National Park is also stunning."], ["Reviewed September 15, 2016", 5.0, "Purple sand", "Beautiful beach that has purple sand! water was too cold for swimming without a wetsuit but its very beautiful"], ["Reviewed September 13, 2016", 5.0, "Needed more time", "Wish I had planned for a longer stay. Beach is beautiful, great views. Will be coming back. A little hard to find, needs better signage."], ["Reviewed September 13, 2016", 5.0, "Che vento!!!!", "You need to go there: you need to see the power of the elements.... if there's no wind? then a beatifull day on the beach!"], ["Reviewed September 12, 2016", 4.0, "Hidden Gem", "You have to get advice from locals on where to turn to get into the park. It was nice, however, not the prettiest beach I have seen. \"Purple\" sand was a stretch....."], ["Reviewed September 9, 2016", 5.0, "Breathtaking views", "When we decided to go to Carmel I knew I had to see Pfeiffer Beach. Not easy to find. From Carmel head south on US 1. Look for the River Inn at Big Sur. Exactly 3 miles south look for a small yellow sign on the right that says narrow road. Make hairpin right turn. About a 2 mile single lane road to the beach. Open sunset to sundown $10 per car to go in. Parking is extremely limited and you can't park on the road in so go early we went about 45 minutes before sunset and had no trouble parking. The beach does have purple sand in some areas which is very cool. The key hole is pretty awesome. Depends on the time of year but you might be able to catch the sunset through the key hole. As a special note like for Bubbles, the beautiful greyhound. When we arrived she was running around the parking lot. Thought she was lost. She walked/led us to the beach and ran around with us while we were there. I asked several people if she belonged to them and no one knew where she came from. When I looked at her tags it said \" Bubbles. Please don't take me I live near Pfeiffer Beach\" considered it a bonus that we got to share the beauty of the beach with one of the \"locals\". Sunset was beautiful there. Bring a jacket, it was cold!\nShow less"], ["Reviewed September 7, 2016", 5.0, "Scenic Hike", "If you're headed to Big Sur you don't want to miss this very special hike. The views of the Pacific are amazing. Definitely bring your camera."], ["Reviewed September 1, 2016", 5.0, "A Stunning Place To Watch The Sun Set", "If you can get a parking spot, this beach is a beautiful place to watch crashing waves on a beach in a rocky cove. I watched the sunset here and it's one of my most memorable California travel experiences !"], ["Reviewed September 1, 2016", 5.0, "Beautiful", "Amazing views - purple sand. Great park to spend a while at taking in the scenery! Windy and cool but beautiful!"], ["Reviewed September 1, 2016", 5.0, "This is our soul place", "I straight up love this beach. If you're gonna go on the weekend, get there early, cause that parking lot fills up quick. Such amazing rock formations. My wife and I visited this place multiple times, most specially during our recent Honeymoon. Seriously, this beach is not to be missed. Just be prepared to pay for parking when you get down there - it's definately worth it!\nShow less"], ["Reviewed August 30, 2016", 5.0, "One of our favorite places...", "Got some great photos on a past trip. Will try to post them later. This is one of the MUST DOs if you come to Carmel/Big Sur. It can get windy at times but still a lot of fun! Parking gets full so arrive early or late in the day.\nShow less"], ["Reviewed August 27, 2016", 5.0, "My Most Favorite Beach", "Such a picturesque beach that words cannot describe it. I love, LOVE this beach. It is usually windy and cool but I find it breathtaking. The road down is a bit slow and rough which is why this park is not \"advertised\". It is basically a one track road with lots of pull-offs allowing cars to get around each other. The only sign by the road that you will find is a yellow sign that says \"narrow road\". It does not indicate there is a beach nor does it reference that it is Pfeiffer Beach. Just take your time getting down and enjoy the beauty once you get there. Don't forget your camera and $10 cash to give to the ranger. It will be the best $10 you spend!\nShow less"], ["Reviewed August 24, 2016", 5.0, "PURPLE SAND!!", "My favorite beach and visit it every time we go- it has purple sand, peace and quiet, away from people... definitely a must see!"], ["Reviewed August 14, 2016", 4.0, "Gorgeous and Breathtaking", "This is a very special beach in Big Sur. The California Coast is to die for and spending time on Pfeiffer Beach is a peaceful exilerating experience. If you get to Big Sur spend the extra time to hike down to Pfeiffer Beach. It will be well worth it!\nShow less"], ["Reviewed August 13, 2016", 5.0, "Beautiful Purple Sand", "A little to difficult to find but worth it. Located off Sycamore Canyon Road in Los Padres National Forest. Be prepared to be patient to get to the beach as it is down a one lane road, and if it is a busy day the rangers have you wait until a parking space opens up. There was a decent amount of auto traffic but everyone was patient and took their turns on the way in and out. Take it slow getting to the parking area because you never know what is around the bend. Parking is $5 cash only. At the beach there is plenty to see and wonderful hikes. Not recommended for swimming very strong rip currents. Great place to spend a few hours or a day\nShow less"], ["Reviewed August 11, 2016", 5.0, "Nice beach that was not packed", "This was a great beach to watch the sunset on without the crowds. The turn off of the main road is not well marked so make sure to ask for specific directions. The beach is unusual because the top layer of sand is actually purple!"], ["Reviewed August 8, 2016", 4.0, "Beautiful--once you find it!", "There is no road marker indicating to turn for this beach. At the nearby visitor center, they showed us the yellow warning sign that is right by the road. Going south it's a very hard right. Then once you find the road it's a long two miles down a one lane road. You have to pull over when you meet a car going the opposite direction. Once you get there the beach is beautiful and worth the $10 admission. The bathrooms are awful--we wouldn't even go in. It was extremely windy the day we visited, so we took pictures, walked around, had lunch in the car then left. A beautiful stop though!\nShow less"], ["Reviewed August 7, 2016", 5.0, "Must visit when travelling along PCH 1", "Amazing beach at sunset! Loved how the light hits the waves and the rocks. Parking is 10 dollars but I arrived at 6:45 pm and there was nobody there so apparently its is free after 6 I guess"], ["Reviewed August 4, 2016", 2.0, "Not very purple", "We went here hoping to see purple sand, but in reality there is very little of it. We were disappointed to see that because there was so little purple sand it looked more dirty than pretty. We did not go right after the rain so maybe we would have seen more in other circumstances, but for the long wait to get into the parking lot and the high winds that whipped our faces, we didn't find this beach worth it.\nShow less"], ["Reviewed August 3, 2016", 5.0, "Great ocean views", "Worth the $10 per car. Off the beaten path, a little hard to find, near the state park entrance. Very windy, not a good place for a picinic, but great for taking pictures and viewing the sunset."], ["Reviewed July 30, 2016", 4.0, "Worth seeing!", "This gem of a place is worth the stop. The entrance isn't marked, so make sure you know where to look. The entrance has a fee (can't remember, but I think it was around $10/car) and is a very narrow road that mostly fits only one car, so you'll likely have to pull over when you come in contact with someone coming from the other direction. I'm not super good with miles, but I'd guess it to be about 3/4 of a mile in until you get to the parking lot. There are bathrooms in the parking lot, which is convenient. The beach is beautiful and the 2x I've been there it's been very windy and chilly (July 2015 and July 2016). Not a great swimming beach, but very pretty and great place for pictures and to sit and relax (in a jacket).\nShow less"], ["Reviewed July 30, 2016", 4.0, "Purple sand beach was very nice place", "I visited Pfeiffer Beach to see the purple sands and was not disappointed. However, the spectacular ocean view and the multitude of rocks and other formations make this a wonderful place to relax and spend the day. Unfortunately the currents are too strong so that swimming is prohibited.\nShow less"], ["Reviewed July 27, 2016", 5.0, "Gorgeous beach", "My husband and I made a stop to Pfeiffer beach on the way to San Simeon - I'm glad we stopped. The view was gorgeous with the key holes in the rock formations and the waves crashing through. We must've come at a busy time because we had to wait a fair bit to get in but it was worth it.\nShow less"], ["Reviewed July 27, 2016", 5.0, "Nice beach and good hangout place for couples", "Sunset view from inside the rock is really good. The purple sand adds to the beauty of the beach. A good romantic get away for couples."], ["Reviewed July 27, 2016", 5.0, "Favorite place on earth", "The road isn't marked. Get good directions at the Ranger Station or post office if you can. 10 dollar fee. It's a state park...no passes accepted. Dogs welcome!! It's windy...bring a sweater even if it's hot. Enjoy the magic."], ["Reviewed July 27, 2016", 5.0, "amazing", "one of the best beaches ive ever gone to. great views from anywhere you are at, great place to take photos"], ["Reviewed July 25, 2016", 5.0, "Purple Sand...need I say more!?", "This little peice of heaven is not really well marked or easy to find, it can even be easily confused with other \"Pfeiffer\" parks in the area. It is well worth the hunt to find this beach with rare purple sand! There was one sign, right at the turn off, and if you blink, you miss it. Luckily we had it in our GPS so we kept our eyes peeled. Then a little drive down a narrow dirt road, that made it tricky to pass oncoming vehicles(not for RVs), for about 10 mins. We happen to arrive at sunset (in May), and it was an experience I'll never forget...beautiful scenery, whales breaching in the distance, surfers, waves crashing on the rocks, and purple sand marbled in with black and regular sand...so beautiful it's hard to find words. It was a bit windy, but I was still fine in shorts with a windbreaker jacket. There are also toilets available by the parking lot.\nShow less"], ["Reviewed July 24, 2016", 4.0, "Interesting Beach, Dress in Layers!", "All the previous reviews are correct - hard to find, narrow road, beach is 2 miles from Hwy 1. Get there early because parking fills up fast in the summer. It's $10 and managed by the Forest Service, so your State Parks Parking Pass won't work.\n\nIt will be nice and sunny at your campground... and then it may be cold and foggy at the beach! (Darn microclimates!) Bring a hoodie.\n\nThere's a sand dune that my kids had a blast running up and rolling down. I wouldn't recommend swimming, the waves are too choppy. But a real interesting beach otherwise. Big Sur isn't much for \"beachy\" beaches - too much private land and cliffs for that. I recommend finding swimming holes along the Big Sur River for water fun. (Go camping at the Big Sur Cabins & Campground or at the Pfeiffer State Park).\nShow less"], ["Reviewed July 24, 2016", 4.0, "Nice beach", "The beach was nice and relaxing. It was not to crowded when we went so it was a good day to go. There is some purple sand and it was fun for the kids to see. We had to drive by the entrance every day when we left our campground. Some days there was an electronic sign stating they were out of parking, so beware that you might have to park along highway 1 and hike the two miles into the beach. It was $10 to park or you can park for free on Highway 1.\nShow less"], ["Reviewed July 23, 2016", 4.0, "Crazy wind and beautiful scenery", "The day that we were there the wind was really strong and forceful. There was a strong current off the beach so swimming was not a good idea but wading was fine. If you walk around to the right of the beach you will come to lots of little statues that people have made with rocks. You can make your own and contribute to the quaint rock formations! It cost $10 to park.\nShow less"], ["Reviewed July 22, 2016", 5.0, "Pfeiffer beach", "Not to be confused with Jennifer Pfieffer state park. Go as early As you can because the parking lot will fill up. No sign for the sycamore canyon road that takes you down the one lane road to the beach. Turn not far past Pfeiffer big Sur state park at the yellow warning sign that says Narrow Road, No Trailers. The coolest thing about this beach is that it has purple sand. The whole beach isn't purple but there are washes if it as you enter the beach. Also a cool sea stack with a keyhole in it. It's a great must-see stop when traveling down big Sur Hwy 1.\nShow less"], ["Reviewed July 21, 2016", 5.0, "Go early!!", "I'm not sure if this will actually count as a review because we never gained entry to the beach. We really wanted to see the purple sand, the rock with the keyhole cut out of it and the redwood deck. The beach is difficult to find because the entrance is not clearly marked. Everyone told us to look for the \"narrow road\" sign at the top of a steep hill. After about 3 attempts, we finally found it. Others clearly didn't have that trouble. We were told the lot was full and to come back in about 15 minutes. We returned in about 20 and were told the same thing. There is nowhere in the area to wait. They make you do a u-turn and leave. If you want to\nsee the things we missed, I would suggest stopping here early and make sure you look for the sign!\nShow less"], ["Reviewed July 19, 2016", 5.0, "Stunning", "One of the most stunning beaches around!!! The waves crashing on the rock formations totally make this a \"must see.\" It is huge and expansive as well. Only problem: parking is limited during the summer, and it's a loooooong walk from Highway 1 to the beach, 2 miles to be exact. And even longer on the way back up!\nShow less"], ["Reviewed July 12, 2016", 5.0, "It's true- purple sand", "A nice small public - but $10 to park - public beach with amazing purple sand and spectacular rock formations."], ["Reviewed July 11, 2016", 5.0, "Loved it!!!", "Probably one of my favorite beaches in all of California, Pfeiffer Beach is not to be missed. Beautiful purple sand and the keyhole arch make this beach a great photo opp.\nIt's not as difficult to find as some people say, just look for the yellow \"narrow road\" sign( on the right if you're driving south)\nThe 2-mile road to get to the beach is narrow and single lane only, just make sure to drive slow and take your time. There are several pull offs along the way, so as long as you drive slowly, it's not too bad!\nThe cost is $10 to park, so bring cash and parking can get full by mid-day. We were there at 11 on a Tuesday and there was still plenty of parking but by the time we left at 1, the lot was full.\nDon't let that scare you though, this place is not to be missed when you're in Big Sur!\nShow less"], ["Reviewed July 11, 2016", 5.0, "Beautiful", "Big Sur is beautiful! It lines the CA coast, with easy access view points. Bring wind breaker, it's pretty windy. Pfeiffer Beach is super cool with beautiful unique purple sand, totally worth a visit down, again very windy so wear layers with a windbreaker! Can be a day trip from the bay area, lots of food places and Inns, grocery store, restrooms. Camping is beautiful too!\nShow less"], ["Reviewed July 8, 2016", 5.0, "Beautiful beach", "Purple coated sand and wonderful rock formations. Small area with a number of people but never felt over-populated. Nice for a picnic and sand play, but you can't swim there. Great picture opportunities. Worth the drive even if it's a short stay."], ["Reviewed July 7, 2016", 4.0, "Spectacular view without the swim", "Loved this beach for its rugged topography and crashing waves. We went on a Wednesday, and the beach was fairly crowded. We waited about 5 minutes for a car to leave so we could get in. The water is dangerous, so not friendly for young children. Fascinating surrounding hills to explore for 12+. No lifeguards. Public bathrooms a few minutes from the beach. It reminded me if hidden beaches in Cornwall England. Glad we went.\nShow less"], ["Reviewed July 7, 2016", 5.0, "Pfeiffer Beach", "Such a beautiful beach! The natural terrain and rock formations are simply stunning. The beach was crowded and felt small, but nobody felt like we were right on top of each other. SO much fun to be had. You could climb on the rocks, sit on the beach, play in the water. It was a wonderful experience. Had read several reviews about the treacherous road leading down to it. Did not feel unsafe traveling on road. Was a one way road with traffic coming both ways, but everybody went slow and used the \"pullouts\" along the way to make it safe. We rented a 4 cylinder Nissan Versa that made the journey just fine. Was a little difficult to find. After you pass Pfeiffer Big Sur State Park, there is a road (unmarked) that has a yellow narrow road sign. This is your turn. Once you turn on the road, you will see the Pfeifer Beach entrance. Would love to go again.\nShow less"], ["Reviewed July 7, 2016", 5.0, "Incredible!", "This is one of the most beautiful places we have ever visited. The rock formations, purple streaked sand, the winding stream meeting the ocean. It's all just too magical to explain. At sunset the sun shines through the caves. Very windy in June though. Does not matter. The children were in awe. Can't wait to go back!\nShow less"], ["Reviewed July 5, 2016", 4.0, "Purple sand but cold and windy!", "The purple sand is cool but it isn't all over the beach as we'd read. Very blustery and cold unless you are flat to the sand and lying down! Pretty and good for a day out but there are other warmer places which will be more enjoyable!\nShow less"], ["Reviewed July 4, 2016", 4.0, "Classic Big Sur with Purple Sand", "Try to arrive off peak for a parking space and a little more privacy. It is a beautiful beach. Classic bug Sur scenery with the uniqueness of purple sand. A great place to play in the waves and take in nature's beauty."], ["Reviewed July 4, 2016", 4.0, "Lovely beach, hard to reach", "We drove down to Big Sur from the Bay Area on a holiday weekend. Traffic getting to Big Sur was terrible (10 miles an hour). The scenery along route 1 was beautiful. When we finally made it to Pfeiffer Beach, the parking lot was full so we parked along the road and walked the two miles to the beach (along with many other people). We did not anticipate the hike and would have worn sneakers had we known this was a likelihood. The beach was crowded but the scenery was stunning. Loved the time we spent there. Unfortunate that so much of our day was spent in slow moving traffic.\nShow less"], ["Reviewed July 3, 2016", 5.0, "Glorious!", "Viewing the sunset from this beach was the perfect end to a perfect day! However, we almost missed it because it was hard to find and passed the turnoff from the highway several times."], ["Reviewed July 2, 2016", 2.0, "Disappointment", "I wish I could write a review of this beach, but we never saw it. We were turned away by the park ranges multiple times. We were trying to go on a Sunday around 2/2:30. They don't tell you the lot is full at the top so you drive in and then a guard (one who was very rude) tells you to leave. Our first guard said we just weren't going to get to see it. How sad for folks who travel so far to encounter someone who is utterly unsympathetic. The walk down is 2 miles and we didn't want to do that with young kids on a narrow road. We came back later and were still turned away and not allowed to wait - down below- even though cars were coming up from the canyon. The ranger said the folks at the bottom didn't radio him to send someone and told us to leave. Luckily we found Point Lobos and went to a beach there that also had a keyhole rock. It was nearly deserted and gorgeous. Still, we were very disappointed and shocked by the rudness of the ranger.Don't have your heart set on this one.\nShow less"], ["Reviewed July 1, 2016", 4.0, "So beautifully windy!", "The entrance can be somewhat hard to find. We missed it the first time. Heading north on PCH, you'll pass a sign for Pfeiffer State Park, if you pass a second sign that says the same thing then you have gone to far. It's $10 to park and parking can be challenging to find. It was super windy when we got down there so much so that we were pelted with sand. The beach was still beautiful and we enjoyed seeing the purple sand.\nShow less"], ["Reviewed June 29, 2016", 3.0, "Keyhole rock", "Pretty and pretty windy! Once you get in and park it is a short 5 minute walk to the beach. However it was very windy and chilly, so we didn't stay long. But there were plenty of people set up to play awhile!"], ["Reviewed June 27, 2016", 4.0, "Great beach but a hike", "This is a great beach. You do have to hike down to it so you have to watch out for poison oak also. The surf is good and the sand is great. If you need a restroom you have to hike back up for it."], ["Reviewed June 23, 2016", 4.0, "A stroll on the beach.", "It's a little tricky to find and I'm sorry that I can't give an exact position on where to turn.\nYou have to look for a a sign that says narrow road to the right. That is if you come from the north and it's after pfieffer state park.\n\nIt's a beautiful beach and when we were there it was really calm and not a lot of people. You can just hang there and chill out.\nShow less"], ["Reviewed June 19, 2016", 5.0, "Perfection", "Really doesn't get much better than this little part of heaven. One of the best secluded beaches of Southern California...that's all that needs to be said."], ["Reviewed June 16, 2016", 4.0, "love this place", "i love this beach specially they have this keyhole which you can take nice pictures of the sunset .if it is a busy time of the year it will be tricky to find parking since parking spaces are very limited near the beach.keep in mind.nice views in the evening so plan for a sunset visit\nShow less"], ["Reviewed June 7, 2016", 5.0, "AMAZING", "This beach and it's views and wonders of nature are everything I've heard it to be. It's a bit interesting getting to it... but well worth it!!"], ["Reviewed June 6, 2016", 5.0, "Nature's majesty", "I'm pretty sure this is one of the most beautiful beaches in California. We only got to go for one day, but I can't wait to go back!"], ["Reviewed June 5, 2016", 5.0, "Hidden gem; a balm for the busy soul", "You don't have to have a perfect, sunny blue sky day to enjoy the rugged beauty of this hidden beach. Located at the end of a winding, one lane road ($10 fee to enter the beach , payment taken at the main road entrance), a small, paved parking lot has room for a limited number of vehicles. A short walk beneath a thick canopy of trees leads you out onto a wide, sandy beach. Strewn with rocks tumbled by the crashing waves, the sand is a rainbow of colors. Shallow tidal pools provide habitat for small crustaceans, so spend a little time observing these sea creatures. If you have the time and inclination, settle on the beach, close your eyes and allow the steady waves to lull you into a meditative state.\nShow less"], ["Reviewed June 4, 2016", 5.0, "Lovely little beach", "Beautiful little beach. Expect some trouble or delay when traint to find a parking place. But don't let this keep away from this beach. Lovely to stay on a sunny day or just for a couple of nice pictures."], ["Reviewed June 3, 2016", 5.0, "Beautiful Spot!!", "Pfeiffer Beach is a really beautiful, fun place! It is a little hard to find as there are no signs on the highway directing or even labeling the turnoff. Once you drive down the winding path quite a while, there is finally a sign. But that's okay, it does limit the amount of people who are there. Nice sand and beautiful rocks out in the ocean. And purple sand!\nShow less"], ["Reviewed June 1, 2016", 5.0, "Beautiful. Just beautiful.", "This place is not an easy find, since there is no sign off of Highway 1. To get to the parking lot you have to make a sharp turn off of the highway, and then 2 miles down. The last time I went, there was a ranger at the beginning of the entrance regulating the parking lot, since there is very limited space. They had people turning around at some point because the parking lot was full. We parked along the road and walked the 2 miles which took approximately 30 minutes each way. Once you're there it's quite beautiful. You can see the purple sand in some areas. Bring food, spend a few hours here and take in this hidden gem.\nShow less"], ["Reviewed May 26, 2016", 5.0, "Beautiful photo ops!", "Great place. hiked...relatively easy for us old folks. flowers, water, mountains...great experience and would come again"], ["Reviewed May 26, 2016", 5.0, "Pink sand!", "Wowzers. Definitely go here. Your trip to Big Sur wouldn't be complete without a walk on this beach. The sand is pink/purple when you look beneath the very top layer. Very cool! Plus, there are some lovely rock formations and a sea arch you can watch the sunset through. Highly recommended. Easy to park (park and then short walk to beach).\nShow less"], ["Reviewed May 25, 2016", 5.0, "Tide Pool Fun", "When the weather is lovely, make your way to the beach for tide pool adventures. Rolling up your pants to wade in the Pacific Ocean may seem like smart way to stay dry but you will discover that it is far more fun to let yourself be a child and just embrace getting wet.\nShow less"], ["Reviewed May 23, 2016", 5.0, "A must see lavender/pink beach with huge boulders with cave holes", "It is hard to find the exit off Hwy 1 in Big Sur to go the 2 mile winding road down to this beach. When you are going NORTH and you pass the Post Office, you take the 3rd driveway on left, you will see a sign saying NARROW ROAD, NO RVS OR TRAILERS...TURN THERE and go 2 miles to park. You will need to pay $10 CASH or CHECK, no Credit cards. Once you park, there are huge Cedar trees lining the entrance to the lavendar/pink white sand beach. As you walk out on the sand make sure to walk over to the right side to be able to see the 2nd huge hole through the giant boulder in the ocean, looks like a doorway-cave. There are 2 holes, so make sure to see the one on the right too. Well worth your time and effort. Also there are restrooms.\nShow less"], ["Reviewed May 23, 2016", 5.0, "Purple Sand Beaches", "Simply beautiful. Hard to find, rough road in and a walk to the beach at the end, but it is all worth it!"], ["Reviewed May 21, 2016", 5.0, "Really great to unwind", "Beware of the fog, but i love it. Unplugging is always hard, but this place is awesome. Went with my dog and fiancee and had a blast!!"], ["Reviewed May 19, 2016", 5.0, "Gorgeous Views. Really.", "The road to the beach is a fun drive and as you walk to the beach there are gorgeous evergreens framing the view, and then the view... simply amazing! There were lots of people there at sunset but it was still nice to be there and you could walk a little farther to get away from everyone. Definitely worth a visit. One of the most beautiful beaches we have seen.\nShow less"], ["Reviewed May 19, 2016", 5.0, "Like a beach from a Ray Harryhausen movie!", "This beach was the highlight of our journey along the Big Sur. The weather was a little mean, and huge, aggressive waves were hitting the rocks hat line this extraordinary beach. Well worth the 2 mile drive down the steep,narrow winding road to reach it. \n\nWe passed the turning without noticing it the first time, as there is no obvious indication that you need to turn off the highway, so it's worth googling it and making a note of the mileage from wherever you're travelling.\n\nWear good shoes. All the best views involve a little bit of scrambling on wet, slippery rock!\nShow less"], ["Reviewed May 17, 2016", 5.0, "Beware the Tides of March", "We had to ford a very full stream in an SUV after heavy March rainfall to get there. I'm so glad we did and we were there at low tide to be able to traverse to areas that allowed for unique views through rock portholes above sand tinted purple by minerals.\nShow less"], ["Reviewed May 17, 2016", 5.0, "Scenic Coast", "Nice stop along the route. So many places to stop and hike a little, this is just one of many. Good spot to relax awhile."], ["Reviewed May 16, 2016", 5.0, "One of most picturesque beaches in the world", "Pacific Ocean tides break through huge rocks with holes. Dolphins, whales and seals play out a ways. A stroll north on the beach eludes the crowds and allows for a peaceful reside. The granite sand does not stick to your feet and is colorful too. This is one of my favorite beaches in the world. Not to be missed when on Highway 1.\nShow less"], ["Reviewed May 16, 2016", 5.0, "One of most interesting beaches I have accountered.", "Great beach with impressive view. We have been there at the dawn but it was beautiful anyway. Don't know if it is good for sunbathing or swimming but take a moment and go there if you are driving through Big Sur. It is forth it."], ["Reviewed May 15, 2016", 5.0, "Ah. The Sun Portal.", "Simply an amazing must stop when adventuring in Big Sur. It can be found by making a sharp right turn shortly after Big Sur Station at a yellow Narrow Road sign. Then you will follow a LONG, NARROW, WINDING road to the beach where you will pay $10 for access. There are 2 parking lots then it is a short walk to the amazing beach.\n\nYou will see the Sun Portal quickly. And there are amazing rock formations right beside it. You'll be mesmerized by the ocean waves crashing onto the shore.\n\nYou will also find purple sand on this beach but for the deepest purple you should definitely walk along the beach to the area where there will also be less people.\nShow less"], ["Reviewed May 14, 2016", 5.0, "Tricky to find but SO worth it", "Not a beach to sun yourself. DRAMATIC views of crashing waves against rock formations and a purple cast to the sand. An adventure to find and drive down to the parking lot."], ["Reviewed May 12, 2016", 3.0, "Getting close to the water", "Pfeiffer is a narrow strip of beach, its windy and the water is rough, so don't imagine anything else, but its one way to get close to the water, and it gives you some memorable photos. The parking at $10 is expensive and if i remember they only take cash and that, too, they prefer exact change! The road down from the main road is narrow and takes about 15 minutes to negotiate the 2 mile stretch. Round trip with the visit to the beach strip could well take an hour and thats if you're fairly quick.\nShow less"], ["Reviewed May 11, 2016", 3.0, "Purple sand", "Pretty coastline, and purple sand was unique, but otherwise not much to do. Beach was also smaller than expected."], ["Reviewed May 11, 2016", 5.0, "Impressive place on earth", "The nature is breath taking. You need car to reach it but it is worth to go there and enjoy the nature and the amazing pacific coast."], ["Reviewed May 10, 2016", 5.0, "Great Beautiful Beach", "This is a Hidden Beach and very hard to find,we were told to look for the yellow sign \"Narrow Road\", which you can see if you're driving south of Pfeiffer Big Sur State Park,The turnoff to get to the beach is about a mile. Then a two mile drive on a one lane 2 way narrow windy road leads to the entrance to Pfeiffer Beach,you may have to pull over( turnouts )to let someone pas .you have to pay a $10 admission fee which is well worth it. Luckily we found a Parking space in the parking lots as it is limited. It's a bit of a walk to the beach from the Parking Area\nThe beach is Absolutely beautiful with the small river and the patches of Purple Sand,it was fun walking on the beach and enjoying the natural beauty of the rock formations and coves with waves crashing through .\nThis is one of the best beach at the Big Sur,and definitely a must go if you are in the Big Sur area.\nShow less"], ["Reviewed May 5, 2016", 5.0, "One of the most beautiful places on earth", "Very difficult to get to, $10.00 for parking, and it gets packed with people. Go early! Totally worth the hassle though."], ["Reviewed May 1, 2016", 3.0, "Hidden away and HIGH WINDS!", "It's a 2 mile drive down a narrow, winding road to a gatehouse that takes $10 to let you park. There's a sign that says high winds, but there's enough people going I just though it meant blustery. The man working the gate said nothing.\n\nIt's HIGH DRIVING WINDS that beat sand into every pore of your body and the fabric of your clothing. It's HIGH WINDS that push you down the beach. It's unpleasant at best. Wild and beautiful terrain that could be wonderful to enjoy on a calm day.\n\nIf you do go there, be sure there are NO WHITE CAPS on the ocean. That is perfectly still. Then go. Take pictures in the gorgeous archway and marvel at the streaks of purple sand.\nShow less"], ["Reviewed April 30, 2016", 4.0, "Great stop", "Two miles down a narrow, curving road and then a $10 entrance fee made me wonder if this famous stop off Hwy 1 was worth it, but it was! The rocks and pounding surf was beautiful! The purple sand really is purple and was really interesting. This isn't a stop you will stay at too long, but it is great for the beauty and opportunity to stretch your legs and get some sand between your toes.\nShow less"], ["Reviewed April 29, 2016", 4.0, "Price steep if you are just dropping by", "We stopped here for about twenty minutes, so felt the $10 was a bit much to get in. The big rocks were cool and so was the pink sand ."], ["Reviewed April 24, 2016", 5.0, "Gorgeous!", "the views here are amazing. it is very hard to find the turn off road to get here the only way we found it was by looking for the mile marker. you have to go down Sycamore Canyon Road at mile marker 45.64. you will drive down 2 miles along a very narrow bumpy road . the parking fee is 10.00 cash. then you have to walk a bit to get to the beach it so worth the trouble!! the views are amazing. the sand is really purple and the waves crashing through the keyhole in the rock is very cool!\nShow less"], ["Reviewed April 24, 2016", 5.0, "Paradise", "You have to drive 2 miles down a narrow road, and pay $10, but it is definitely worth the effort. We lucked out the weather, sunny and warm, might not be so pleasant on a colder windy day. You can walk along pretty far down the beach if you want to stretch your legs. The rock formations and crashing waves are stunning.\nShow less"], ["Reviewed April 24, 2016", 2.0, "Disappointed", "We had just left Julia Pheiffer park thinking we could have beach access and found out we couldn't. Off to Pheiffer Beach to find the beach! We waiting in a line of cars for about 10 minutes only to find out the beach access was NOT easily accessible. The Ranger told us it was about a 2 mile walk to the beach. What?! Reviews on TA said it was easy access to the beach from the parking lot. Unreal...we spent most of the day trying to find a beach and were striking out. So I would have liked to see the purple sand beaches and big rock formations to report to other travelers, but we weren't ready to drag all of our beach gear two miles.\nShow less"], ["Reviewed April 20, 2016", 5.0, "Purple Sand!!!", "This beach is so beautiful. It's not to big but a great place to relax and enjoy the ocean breeze. It's true the sand is purple. The parking fee is $10 make sure to take cash. A must if your in Big Sur!"], ["Reviewed April 20, 2016", 5.0, "Beautiful!!", "Easy to get to (there was a path that takes you right down to the beach) and the sunset was amazing!! I loved the photos I was able to get that day. Be careful driving in though. The road is crazy narrow."], ["Reviewed April 19, 2016", 5.0, "Make sure you notice the purple sand!", "We went there for a photo opportunity at sunset. FORGET THE ROCK WITH THE TUNNEL. This photo only happens once a year when the sun lines up with the tunnel at sunset. The beach has many wonderful photo opportunities. It is NOT a swimming beach. The tide will rip you in two don't be fooled.\nShow less"], ["Reviewed April 18, 2016", 5.0, "Off highway 1", "Narrow track leads down from highway for approximately two miles.10 US dollars entrance fee for cars.Beautiful Pacific beach with pounding surf !"], ["Reviewed April 18, 2016", 5.0, "Wow! Beautiful sand and sights!", "Worthy of a trip, boulders with water holes were breath taking. Sand was warm and soft. Windy but fun."], ["Reviewed April 17, 2016", 5.0, "quite literally a \"hidden\" gem", "Thankfully I read some reviews online before trying to hunt this beach down! If you're driving south Hwy 1, watch for a yellow sign on the right side of the road that reads \"narrow road.\" It's very easy to miss...we did twice! You'll then drive about 2 miles down a one way road to get to the beach. TAKE CASH! They do not accept credit card to pay for parking. This beach is beautiful, peaceful, amazing! ! ! I probably took 200 photos and had my jaw hanging open for a couple of hours because I was so in awe at the views!\nShow less"], ["Reviewed April 11, 2016", 3.0, "Tortential Winds in the afternoon detract from the beauty of this state beach", "Get there early or be pelted with sand. Literally. After 1:30pm the wind kicked up sand storms, sand tornadoes, and biting cold sand pellets. I'm sure it's lovely early in the day, but we got there far too late."], ["Reviewed April 10, 2016", 5.0, "Purple Sand!", "For beginners, it's $10 to drive in and park\n\nLoved it, couldn't stop staring at it or taking several of the same pictures of it. I mean, purple sand? Yes, it's various shades and hues of purple, fuscia, and burgundy sand. The rock formations are beautiful as well with natural cave openings that the waves splash through. It was too early in the day for any gorgeous sunset photos and the weather was a bit rainy and overcast anyway, but still an awesome experience. I'd definitely come back here again for an evening shot.\nShow less"], ["Reviewed April 7, 2016", 5.0, "Lovely beach in Big Sur - bring your camera, too.", "We could have spend all day at Pfeiffer Beach. There is so much beach to explore and enjoy. We got there a few hours before sunset. There are a lot of photographers there, trying to get THE image of the hole in the rock at sunset... We loved seeing the purple sand too. This is a must for Big Sur.\nShow less"], ["Reviewed April 4, 2016", 5.0, "Beautiful!", "What a breathtaking place. Cant wait to go back! I went here with my husband at the time, and it was very beautiful."], ["Reviewed April 4, 2016", 5.0, "A thrillist must visit", "A beach that's a little adventurous, a little thrilling and a lot beautiful! It's really a hidden gem. Finding parking can be an ordeal but once you are through, it's an absolute delight! It has soft purple sand, amazing rock and cave formations that you experience very close by and extraordinary views!\nShow less"], ["Reviewed April 3, 2016", 5.0, "Beautiful beach, very popular", "We tried for hours to get to the beach and kept getting turned away at the top of the road because the parking lot was full. Finally at around 5pm when the guy saw us return for the 4th or 5th time he let us pass to the parking lot. From the top of the road it is about a 3 mile drive to the parking lot on a 2 way 1 lane road. Curves in the road made the trip very exciting, never knowing if there would be a car head on around the corner. Right before the parking lot entrance was a flooded dip in the road, that I'm sure would have been a challenge if we were in a smaller car. Parking was $10/cash only. Bathrooms located by the parking lot. Short sand path to the beach. Beach is beautiful with rock formations, huge waves and purple sand. So glad we were persistent and kept trying back for open parking, had never seen a beach quite like this before. Waves so strong when we were there you could hear the rocks tumbling in the surf. Well worth the effort to get to!\nShow less"], ["Reviewed April 2, 2016", 5.0, "Breathtaking!!!", "Off the beaten path with built in crowd control. They only let in a limited number of vehicles, so be prepared for a potential wait. It is so worth it and likely had a spectacular sunset. I wish we could have spent more time here!"], ["Reviewed April 1, 2016", 5.0, "Beautiful!", "My girlfriend and I made the hour trip south from Monterey to explore Big Sur. Pfeiffer Beach was our first stop as I had read that it gets packed early. We arrived around 10:30 and there were a max of 10 cars in the parking lot. I don't know how \"early\" Californians get going, but we left the beach around 11:30 and there were still lots of spots in the lot.\n\nThe beach itself is awesome- lots to explore. The purple sand is a unique feature. Personally, I enjoyed being able to explore and climb on the rocks to get photo opportunities.\n\nI would highly recommend this stop and if you get there \"early\"- ie. before 11 (that's not really early) you'll have plenty of parking and space to roam the geologic beauty which is Pfeiffer Beach\nShow less"], ["Reviewed March 27, 2016", 5.0, "Most Amazing Beach", "We arrived at Pfeiffer Beach first thing in the morning and were told the lot was already full. We reluctantly turned around and parked across the street ready to hoof it the 2 miles in. Well, it is not an easy hike. Down would be easier than out but the road is narrow and not in great condition. We hitchhiked and caught a ride both ways. To our surprise when we arrived the lot was not even close to full. The short walk to the beach is very wooded and pretty but this beach - one of the most beautiful. The purple sands and rock formations. I give it a 10. I would spend a whole day here if the sun was out, unfortunately it was cloudy when we were there. Note - this is a dog-friendly beach and there will be lots of dogs here. I didn't note any waste though, so thank you for picking up after them!\nShow less"], ["Reviewed March 26, 2016", 4.0, "It's true! There is purple sand!", "I was very skeptical about seeing purple sand, but we saw it. Now, the entire beach is not purple, but there truly is some purple sand. The turnoff to get to the beach is very hard to see but I took a quick picture of the entrance right after we turned off the highway to show you. The name of the road is Sycamore Canyon Road. Also, it's a very narrow 2 miles to get to the parking lot and you are wondering at times where in the world you are going! But that made for the adventure of getting there and a more exciting trip. Parking is limited but we were able to find a spot. The restrooms have no running water but are clean, A quick hike on a well marked trail and we were there. I'm glad we took the time to find this gem. Note: I believe your pass to this park gets you in to other state parks so keep that in mind if you are planning to stop at other spots along the coast!\nShow less"]]}}