{"Pier 39": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Pier 39", "url": "/Attraction_Review-g60713-d102779-Reviews-Pier_39-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/4a/17/02/pier-39.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "16876"}, "address": {"@type": "PostalAddress", "streetAddress": "Beach Street & The Embarcadero Parking area", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94133", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Pleasantly surprised", "We came here just to get a sneak of the sea lions but we noticed there were tons of great restaurants, really reasonably priced shops, tons of stuff for kids to do, and then of course the sea lions. Another huge plus was the frequent bathrooms. They were around every turn and so clean. We could have stayed there all day.\nShow less"], ["Reviewed 2 days ago", 4.0, "40 years of fun", "Pier 39 opened 40 years ago. Shops have come and gone but the carousel lives on. Great place to take kids. Lots of fun shops and restaurants and entertainment. Great place to watch and listen to Sea Lions. You can check out all the restaurant menus ahead of time and pick which one suits you. We had a wonderful couple of hours there.\nShow less"], ["Reviewed 2 days ago", 2.0, "Very crowded and tourist trap feel", "Lots of shops and restaurants crammed into a small area; so you are walking shoulder to shoulder with lots of tourists. Bathroom line was extremely long, I counted 29 women in line! Basic restaurants and cheezy souvenirs. Not worth it for us!"], ["Reviewed 2 days ago", 5.0, "Must see", "We started out at Hard Rock café and wended our way around the whole area shopping. It is a must see if you are in the area and a stop on the Hop on/off bus."], ["Reviewed 2 days ago", 4.0, "Busy, lots to see", "Bust part of the pier. Lots to do and see, lots of shops and food stalls. Offers nice walks in summer along waterfront."], ["Reviewed 3 days ago", 3.0, "Too crowded! Too many tourists", "Avoid going there on weekends! All the tourists gather , queue for food , queue for restrooms! But you have to be there to get on the cruises. The seafood is overpriced and doesn’t look that appetising."], ["Reviewed 3 days ago", 5.0, "Oh the shopping you can do...", "I am new to California and everyone said go to Pier 39. I went, I saw, and I conquered. What an amazing place. I've been twice and saw new things the 2nd time. Once in January, more sea lions than a few weeks ago. Glad I went earlier and was able to see them at that time. It's a must see.\nShow less"], ["Reviewed 3 days ago", 4.0, "Great walking", "We went to 39 pier. It is a great place to spend time with family. You can find pretty stores and good restaurants. A lot interesting attractions."], ["Reviewed 3 days ago", 4.0, "Clam Chowder Amazing!!", "Make sure you walk the pier and stop at least for a sourdough bread bowl of clam chowder at Chowders!"], ["Reviewed 3 days ago", 2.0, "Tourist Trap AVOID", "Do you like being surrounded by tourist and chain restaurants? Then Pier 39 is the place for you! Extremely Crowded and not worth going to. The places here are all chains except maybe one or two."], ["Reviewed 3 days ago", 4.0, "It was fun to go back", "The last time I was there it was called Fisherman's Wharf 35 years ago. It was fun to go back and wee how it has grown. We wandered the shops for about an hour waiting on dinner reservations. I would recommend this as a tourist destination in S.F.\nShow less"], ["Reviewed 3 days ago", 1.0, "Filthy- Nasty- Dirty Tourist Trap", "I have visited tourist hot-spots around the world and this is one of the worst, including third world nations. Every shop sells junk and trinkets you could buy at home for 1/4th the price. The public restrooms on the Embarcadero are unsafe, filthy bum housing. So called \"street performers\" are pretty lame and in the end are just beggars, sanctioned by the City. If you don't give them money, prepare to be rudely berated. Restaurants serve barely average food at inflated prices because of the location. You will need to buy several meals a day to use a presentable restroom. Also- the communist City of SF charges an extra 4% surcharge on top of the highest state tax in the nation to provide medical care to the bums- so plan on that added expense. If you want to visit any of the special area attractions, bring a stack of $100 bills. Every attraction has a high entry fee ranging from $20 to step foot on the WWII supply ship or sub (that's $20 EACH) and on up from there. Oh ya- parking will set you back another $50 and the City gridlock is the worst you will see, anywhere in the world. Last warning- If you want to visit Alcatraz, this is where you catch the only ferry. Buy your tickets online in advance. It is unlikely you will be able to just show up and have a vacancy. If you are not visiting Alcatraz, avoid this money pit like the plague.\nShow less"], ["Reviewed 3 days ago", 5.0, "It has it all!", "The pier is the main attraction in this area, lots of bars, resaurants and shops plus the sea lions at the end, just follow the noise and you will come across them!"], ["Reviewed 4 days ago", 4.0, "So much to see", "It's a great location to shop, eat, drink and stroll around the pier. They have music, live entertainment and even a giant merry-go-round. You can get plenty to eat from snacks to fine dining. One of the best places is Pier Market, they have amazing clam chowder! You can also get Mexican food or. French crepes....plenty of other food choices in-between. A great spot to look out over the bay to Alcatraz or watch the sea lions....\nShow less"], ["Reviewed 4 days ago", 5.0, "Touristy but Fun", "This is a total tourist trap but nonetheless totally fun.\nLots of restaurants to choose from, lots of SF souvenir stores next to magic & candy shops,and one can't help but go see the SEA LIONS as they lounge, battle for the best napping spot and bark a lot of noise.\nShow less"], ["Reviewed 4 days ago", 5.0, "Fun place to stroll", "Admittedly it was not crowded when we were here. I can see this place being easily skipped if it's busy. We saw the seals (awesome! -and free). Played in the arcade, had some mini donuts (you can skip them). We really enjoyed the mirror maze-granted we were the only ones there so that probably made it more fun...BTW- Pro tip- be careful and DONT RUN!). A fun night amidst the t-shirt shops and souvenir stands.\nShow less"], ["Reviewed 4 days ago", 1.0, "Don't bother", "Ok. Here's the thing. This is borderline tourist trap. I say that cuz it has two things to see and only unless you like jogging then it's nice for that. The only things to see is Alcatraz and the open market. This place is design for dumb tourists too scared to venture out and be scammed out of their money. Everything is overpriced. Homeless hangout here and people hustling money. Food is overpriced and not worth it. A good warning sign is when you see a hard rock cafe or a bubba Gump shrimp restaurant you know it's overpriced mediocre food. They have both. Just don't\nShow less"], ["Reviewed 4 days ago", 5.0, "A must see", "A fabulous place to visit amazing place to walk and shop — gorgeous places to sit out in the sunshine and take in the surroundings . The ferry building is a must visit for fresh produce and artisan shopping . Loved it can’t wait to visit again.\nShow less"], ["Reviewed 4 days ago", 5.0, "A must see!", "You have to see Pier 39 on your visit to San Francisco. The seals are an amazing sight lying on the decks in the sunshine. Plenty of restaurants and souvenir shops."], ["Reviewed 4 days ago", 4.0, "Live sea lions", "This area has so many restaurant,gift shop and the activities. We could see the sea lions. ランチをしに訪れました。たくさんのレストランと土産物屋そしてトランポリンのようなアクティビティもありました。 アルカトラズ島も見えましたが何よりアシカの大群が間近に見れ皆盛り上がってました！"], ["Reviewed 4 days ago", 4.0, "Go early in the morning to avoid crowds", "Its a tourist trap but those seals have to be seen ! Go early in the morning but be aware the restaurants dont seem to open until 10am. Seals. Amazing !"], ["Reviewed 4 days ago", 5.0, "Great place to walk around", "You get some lovely views from the upper deck and the shops and restaurants/cafes are very good. Not too expensive either. Well located on the waterfront and close to other attractions. Very good atmosphere and fun."], ["Reviewed 4 days ago", 5.0, "Take a stroll,", "enjoy the atmosphere and visit the information center about the sea lions. It's really worth a visit! Watch the sea lions play and sunbathe (but be aware: they smell awfull ;)) Wonderful view of the bay."], ["Reviewed 5 days ago", 5.0, "Must visit", "If you are going to San-Francisco, you also must visit pier 39, Sea lions are always over there! They are really cute!"], ["Reviewed 5 days ago", 4.0, "Tons of cool stuff", "Lots of shops to browse in & restaurants to choose to eat from! It was pretty crowded on a Saturday in February. The sea lions hang out at the pier which is very entertaining! It was very crowded in that area. Most food places had huge lines. We were there from 1:00- 4:30 pm very crowded.\nShow less"], ["Reviewed 5 days ago", 2.0, "a total tourist trap", "a place full of tacky souveniours but it does have fairly good bathrooms. You can see the sea lions sitting on top of the barges. They do have a carousel so you can go around in circles if you want. You do have a good view of Alcatraz island\nShow less"], ["Reviewed 5 days ago", 4.0, "Tourist Attraction Place", "Pier 39 is tourist attraction place spotting bridges and shops, restaurants, pub, arcade and so many people walking around the place. Its beautiful weather and time to spend place"], ["Reviewed 5 days ago", 5.0, "Loved the Taffy!", "Could happily spend a day just wandering here then watch the Sealions. Feels a really comfortable place to be with lots of little shops and restaurants. We got lots of Taffy and watched (and listened) the Sealions."], ["Reviewed 6 days ago", 5.0, "Family holiday", "Exciting place lots to do and see The restaurant choices were great. We were a party of 6 so finding something for everyone’s taste can be challenging but not here the variety was excellent. Looking at the sea lions was amazing"], ["Reviewed 6 days ago", 4.0, "A fun place", "This is a collection of shops and restaurants catering to tourists. The views are amazing. You can see both the bridges and Alcatraz. I spent a long time just watching the sea lions."], ["Reviewed 6 days ago", 5.0, "Worth it!", "It is touristy, but one of our favorite stops with kids under 12. Tons of shops, restaurants, live entertainment, an arcade, Sea Lions, Trish's Mini Donuts (AMAZING) ... there is so much in this one spot. It felt cleaner and safer to us the Fisherman's wharf.\nShow less"], ["Reviewed 6 days ago", 5.0, "Sea Lions", "Pier is like a carnival. Tons of places to eat a meal, get a snack and purchase souvenirs. Best part was the sea lions laying in the sun. It was windy and cold the day we visited and the sea lions were barking and sunning themselves. Not very crowded this time of year which is nice\nShow less"], ["Reviewed 6 days ago", 5.0, "As touristy as it gets - but that’s a plus", "Sea Lions Sea Lions Sea Lions - u can spend hours watching them, but then you would miss some good food and fun shops. Parking isn’t easy but no reason not to. Walk around and have a great day. Plenty of restaurant variety and kitschy places to peruse. Good for all ages.\nShow less"], ["Reviewed 1 week ago", 5.0, "So much fun!", "Go to Wipe Out Grill- The food and atmosphere is amazing! This pier has a ton of cool and funky shops, along with places to eat and desserts. I had a flight at night, and came to the pier for the day. I was able to check all luggage ($5 a bag for the entire day!!!!!) That was a steal, and it allowed me to enjoy the pier that much more. Pay a visit here!! It is right down the street form Fisherman's wharf as well.\nShow less"], ["Reviewed 1 week ago", 5.0, "A must see", "Lots of great things to eat and see. The mini donuts are a must, and clam chowder, you’d be a fool not to get. This was later in the day so it got cold and windy but still great time."], ["Reviewed 1 week ago", 5.0, "Blackpool in California but with taste!", "Loads of bodies all having fun. This is a happy place and a pleasure to visit. Lots of places to eat, and the best view of sea lions I have ever seen among civilisation!"], ["Reviewed 1 week ago", 5.0, "So much to see and do", "From the seals welcoming us to shopping in amazing stores with finds we don't get back home to Hard Rock Cafe we had a great time. There was a mirror maze for both kids and adults and a few carnival rides. We spent a few hours there and went back 2 more times as it was so much fun. Great choice of food stalls as well as sit down restaurants. Can't go to San Francisco without going here!\nShow less"], ["Reviewed 1 week ago", 4.0, "Lots to do", "I visited Pier 39 with my family. My two young children loved all the activities, but mom and dad didn't like the prices. Everything there is nice, but VERY overpriced."], ["Reviewed 1 week ago", 4.0, "Cool place", "We ended up at the Pier every day of our trip. I really enjoyed the live street performances. Be sure to go to Biscoff's coffee."], ["Reviewed 1 week ago", 4.0, "Food and People Watching", "A great place for many different types of food and people watching. Pier 39 also offers tours of the SF Bay."], ["Reviewed 1 week ago", 4.0, "Basic Restaurant/Shops/Tourist Attraction", "We go here almost every time we are in San Francisco because it is such a tourist magnet and you can see the sea lions. A little bit of everything here including a carousel. Get your parking validated!"], ["Reviewed 1 week ago", 5.0, "pier 39 is definitely a sight to see", "Lots of things to do and see. Shops after shops. Restaurants and more restaurants. Water front is another er thing to see."], ["Reviewed 1 week ago", 5.0, "Sea Lions, Alcatraz, Restaurants, Shopping, Golden Gate Bridge, what's not to love?!", "Pier 39 is an awesome place. There is so much to do here you could spend an entire day! Yes, this place is a tourist trap but one worth going to. Only negative is the cost of parking is ridiculous, I understand it's downtown San Francisco but plan to spend more money on parking than dinner.\nShow less"], ["Reviewed 1 week ago", 4.0, "It's another shopping and eating venue!", "Pier 39 has the sealions 'dossing' about on their lilo's, and plenty of eating and drinking places. It's a good place to while away a few hours, either by day, or in the evening when it comes alive. We spent time just walking around, or sitting with cocktails, people watching.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful", "Excellent wharf. Very pretty, clean. We had a great time here and in San Fran over Christmas. Spent a lot of time at the pier in the shops and restaurants. A very friendly crowd and enjoyed every second of it."], ["Reviewed 1 week ago", 5.0, "Stuffed full of touristy shops and restaurants", "It is definitely worth a visit. Full of restaurants and shops. Great views on the bay side. It is a bit touristy so expect prices to be inflated."], ["Reviewed 1 week ago", 3.0, "Typical tourist area", "A lot of shops selling all sorts of souvenir merchandise and fast food. There are sit down restaurants. Saving grace is the sea lions which hang out at the pier."], ["Reviewed 1 week ago", 4.0, "Historic Fisherman's warfe", "Lovely place to relax and souvenir shop, lovely restaurants, and the historic merry go-round adds to the attraction along with the seal observatory. Great views of the San Francisco bay."], ["Reviewed 1 week ago", 5.0, "Great place to check out", "Check out the sea lions, even though there were not many when we went...it was fun to watch them. There is shopping, games, food, and more here. Great people watching, tourist and locals come here."], ["Reviewed 1 week ago", 4.0, "Very Interesting Shops", "Bought 3 shirts for $12.95 at a souvenir shop. Had been to Pier 39 decades ago and of course the area had expanded and new shops. A lot of interesting shops and boutique stores., well worth visiting"], ["Reviewed 1 week ago", 4.0, "Fun times", "What a great, fun place. Lots of stuff to look at, the sea lions are super cute. Expensive though, but that’s like every other tourist place."], ["Reviewed 1 week ago", 5.0, "The best walk in SF", "We were lucky and it was a sunny day so we enjoyed the funfair , the shops, the sea lions attractions. And don't forget to eat crabs in the crab market where it is cheaper. You can find nice offers for gifts and souvenirs. You can get free parking for 2 hours if you buy crabs\nShow less"], ["Reviewed 1 week ago", 4.0, "A Nice Pier and stroll", "Some good attractions for kids, nice eateries with good views and plenty of memorabilia to pick up well worth a visit."], ["Reviewed 1 week ago", 2.0, "Really not my taste", "I had gone our for a walk along the various Piers and started from Pier 15 and walked down the Pier 39. A pretty decent walk.\n\nI had been looking for somewhere to get dinner and fancied something with a local feel to it. Everything all along the shoreline was dead quiet. Until I reached Pier 39. It was rammed with tourists. It is a tourist magnet ad features many shops selling touristy things like San Francisco T-shirts, hoodies, mugs, plates, etc.\n\nIt is full of restaurants but they have very little character and are seriously busy. The Crab Shack looked interesting but had a queue running easily 10 metres out of the doors. The shrimp place was the same. There was a Swiss Italian restaurant that was less buy, in fact almost empty, but looked very cold and unappealing to us.\n\nI suspect that it is a venue that many tourists will enjoy (in fact, the crowds there prove that) but its not my kind of place.\nShow less"], ["Reviewed 1 week ago", 4.0, "A little on the touristy side, but worth a visit.", "There are lots of shops and restaurants at Pier 39 and they even have a merry go round.\nYou can see the Sea Lions sunbathing from here as well. Had a good time walking around and you can see some great views from the end of the pier.\nShow less"], ["Reviewed 1 week ago", 5.0, "Bustling with fun", "Lots of fun to walk around. My younger kids loved all the street performers. So many great restaurants and stores. Lots of fun to spend the day."], ["Reviewed 1 week ago", 5.0, "Must visit place when at SFO", "This place is bustling with activity. It offers a variety of restaurants. Great place for purchasing souvenirs. The marina and the sea lions lazing here are worth spending some time."], ["Reviewed 1 week ago", 5.0, "Busy place but a good feel", "This pier is always busy, boat trips go from here, full of resturants and shops, not the cheapest area to shop. Street entertainment and music always happening."], ["Reviewed 1 week ago", 4.0, "Great Place to walk around", "Pier39 is one of main attractions in SF.Its got something for everybody- food, entertainment, sea lion gazing, walking around, performances and shopping. One can easily spend a few hours here taking in the sights and sounds."], ["Reviewed 1 week ago", 5.0, "Cute", "A cute little shopping area of mainly restaurants and gift shops. You can hear the sealions barking."], ["Reviewed 1 week ago", 5.0, "Touristy, but not cheesy", "This place offers great views of the Bay, some pretty good shopping, and several very nice seafood restaurants. Make sure you visit Mirror Maze - that's one of the largest / most interesting I've ever been to. Easy (although paid) parking nearby. Highly recommended!"], ["Reviewed 1 week ago", 4.0, "Tourist central", "This is a well-kept up area on the waterfront. Lots of small shops, treats, coffee, etc. You could definitely spend a day here just killing time if you wanted. Really not my thing but pretty neat all the same. Very busy."], ["Reviewed 1 week ago", 5.0, "Prime Location", "Pier 39 is the place to be, it has everything you need for an enjoyable day from food and drink to shops and stalls there's also the sea lions which are worth visiting. Also great view of Golden Gate Bridge perfect photo location."], ["Reviewed 1 week ago", 5.0, "Nice place for a night out", "Pier 39 is one of the places that makes San Francisco a unique city. A nice environment for family, friends and colleagues to spend quality time in an open sky commercial center with FIRST a great view of the Bay and plenty of restaurants and stores.\nThis time I went for dinner at Fog Harbor Fish House and view, service and food (Jumbo Scallop & Crab Risotto) were all great.\nShow less"], ["Reviewed 1 week ago", 3.0, "Coming originally from a seaside town with 3 piers", "Maybe because I originate from Blackpool I did find Pier39 a bit tacky but can understand the attraction for people not from a seaside resort.\nThe “famous” sea lions are a big attraction but after a couple of minutes of listening to them barking it was enough for the two of us.\nHaving said all that the view at the end of the pier itself is great as you can see Alcatraz.the Golden Gate and Bay Bridges and much of the Bay Area.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great!", "I will say that we happened to go on a random day in February when it was sunny and 75 so my review is based on that. I don't know what it's like when it's cloudy and cold, but in the sunshine it was marvelous! So much fun walking around all the shops! We even stopped at the edge of the pier and looked at the view of Alcatraz and Golden Gate for a while. I would walk around again :) We walked there after our tour of Alcatraz so that was nice!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Lots of Shops and an Aquarium", "This pier has a lot of shops and restaurants to visit. There is also an aquarium here. If you go to the water you can also see the sea lions that are hanging around on some floats. This is a good place to just hang out. It is kind of touristy.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Touristy spot", "Of course when your a tourist you go to Pier 39 and check things out. The pier basically has restaurants, treats, coffee, some shops, arcade, carousel, 7D game, and the Sea Lions. For us ( we are in our 40s) teh 7D game and the Sea Lions were our favorite. The 7D game is basically going into a small movie with 3D glasses. You have a gun that you shoot at stuff- we shot at Zombies and robots. Who ever shoots the most zombies or robots -depending on which game you play- wins. We went and played a second game so we had fun. I loved watching the Sea Lions, they were funny. They would be just chilling out on the docks getting sun and if another one came around them they would get all mad and start barking at the other one.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So much to do", "Excellent for families, kids, adults. Plenty to do and see. Lovely atmosphere and staff all very helpful."], ["Reviewed 2 weeks ago", 5.0, "Lots to do here!", "This was such a great place. There were areas where you could just sit and listen to the sea lions and waves! Many restaurants and shops to visit!"], ["Reviewed 2 weeks ago", 5.0, "Great fun", "Fab place!\nGreat restaurants, everyone is friendly and always fun to watch the world go by whilst having a glass of something nice.\nQuite busy but plenty of shops & restaurants to keep you interested.\nGood for all ages and you can go see the sea lions chilling out. Highly recommend\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Interesting and Crowded Tourist Area", "We visited late afternoon and it as pleasant walking along the water front watching all the people and stuff happening. lots to see and and eat but of course as a tourist area very pricey and commercial."], ["Reviewed 2 weeks ago", 5.0, "Fun interesting place", "Pier 39 is the place to go to get something to eat, souvenirs, pictures etc. If you are are visiting SF for the first time i would recommend coming here to get something to eat and some things to take back home. You won't be disappointed goimg here make it a stop. Also the views breathtaking make sure to visit the Seals as well!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must see and do in San Francisco", "We spent about five hours at pier 39 on a Sunday Tuesday afternoon. We were very much impressed with the cleanliness, the selection of shopping and dining choices and the beautiful sites to be seen. We especially enjoyed our time gazing at the sea lions located in the back of the pier. Certainly a sight like no other. The view of Alcatraz and the Golden Gate Bridge and San Francisco Bay were awesome. Don’t miss Pier 39.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Vibrant", "An amazing collection of shops and restaurants and providing great views of the Golden Gate Bridge and Alcatraz, for Which yours go from the nearby Pier 33.\nThe resident seals are also a welcome attraction for the kids with their noise, numbers and sheer size.\nPlenty to go and eat with all sorts of different culinary establishments offering plentiful fresh fish foods both cold and hot.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun Place to be. Lots of shops, restaurants, view of Alcatraz, Golden Gate and of course, Sea Lions.", "Pier 39 is one of the most exciting Places to be in San Francisco. There is so much things happening there all the time. A large number of shops, restaurants, a very large crowd, artists showing their talents, beautiful view of the Bay, particularly Alcatraz Island and Golden Gate. Of course, it is fun to watch Se Lions, with loud noise, playful, jumping off and getting on the pier. A large number of people gather to see the Sea Lions and to accommodate the large number, platforms have been made. One can see the antics of Sea Lions for eternity.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "If you want a walkabout go to Pier 39", "after coming from Alcatraz we walked up along path towards 39 OMG sun shining people so relaxed taking in sights of bay of bridges , we came apon ship and submarine amazing to see then we got cablecar all way up to Union Square fantastic afternoon so much to see and eat and do .\nLoved It\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Shopping and Dining!", "Great views of the bay bridge, Alcatraz, and the sea lions. A plethora of dining and shopping options. Loved the Crab House and Pier Market for seafood dining options."], ["Reviewed 2 weeks ago", 5.0, "Interesting!", "Interesting little pier. There was a lot to do and see, and a lot of places to grab a bite to eat. We enjoyed the street performer, as well as watching the sea lions. There is also a great view out to Alcatraz."], ["Reviewed 2 weeks ago", 4.0, "Worth your time", "We visited this place and were very impressed. You can see the Golden Gate Bridge from an angle. You also have a great view of the prison. Plenty of places to eat and shop. It’s on the expensive side."], ["Reviewed 2 weeks ago", 4.0, "Sea lions", "Interesting pier with lots of restaurants. Sea lions are fascinating but noisy and smeely, still watched them for ages. Shops and shows too"], ["Reviewed 2 weeks ago", 3.0, "Anniversary", "Typical tourist shopping and dinning area if you are into that. The best thing about it is to be sure and go behind it to see all the seals that conga grate on the floats. Neat to hear."], ["Reviewed 2 weeks ago", 5.0, "busy and bustle", "Love Pier 39, so much going on here, lots of people milling aroung and a lovely atmosphere, especially when the weather is good. Great shops and trendy bars and cafes"], ["Reviewed 2 weeks ago", 5.0, "There's something for EVERYONE at Pier 39!", "You can't go wrong with visiting Pier 39! Truly, there's something for everyone!....restaurants, wine tasting, shopping, aquarium, Hard Rock, seals, views of Alcatraz....magic shows, a carousel. We prefer Pier 39 over Fisherman's Wharf!"], ["Reviewed 2 weeks ago", 4.0, "The bay in a day", "The pier a great place to see much of what makes San Francisco a unique place to visit. Our with the family or in a date, this is a must see if you are from out of town. Parking can be difficult to find but once you are here, there's plenty to do and see. Temperatures can drop on the evenings and there is alot of walking to do so bring a light jacket or sweater and wear comfortable shoes.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Place but swamped with tourists, touts and Sealions", "Great place to visit but very expensive for food and gifts. Great to visit the sea lions on the pier all basking in the sun (that’s free!) Great iced cream and a fried fish lovers dream!"], ["Reviewed 2 weeks ago", 4.0, "Great time", "Lots of shops to explore food to eat , people watching is always. Sea lions sunbathing was also enjoyable"], ["Reviewed 2 weeks ago", 5.0, "Entertaining place to spend an afternoon", "Yes, it's very touristy, but if you like a place with street entertainers and cute shops and all sorts of unhealthy food (think Fanueil Hall or South Street Seaport), you'll like this place."], ["Reviewed 2 weeks ago", 4.0, "Tourist Trap Area", "I just visited this area. It is full of tourists and souvenir shops not to mention locals trying to get a hand out or sell you something. Shops are full of little things you would never buy on vacation as well as many restaurants. We tried to look for that perfect outdoor spot for drinks and appetizers but did not find it. We tried Mangoes but it lacked in all areas. It was a fun area to walk around and people watch. The sea lions were pretty hilarious sounding. Great to walk around in an afternoon but not a place I would visit year after year. Chalk it up to a been there done that experience.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nice shops and fun to see sea lions", "It's a fun place to stroll. Fun shops, food and of course, sea lions. A tourist destination you can't miss."], ["Reviewed 2 weeks ago", 5.0, "Fun and Sea lions!", "Sea lions are back!! We saw them last weekend (Feb 2018), walked the pier, shopped a little. Lots of cute boutique type shops. Ice cream and mini donuts. Carousel rides too but they are expensive - $10 for 3 rides, $5 for one ride. Children under 40 inches must ride with an adult. There was also a performer doing a show too. Overall lots for fun and things to see and do on the Pier.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Iv ever had", "Stopped in after a day of shopping. Had a Cheat meal here and almost broke the bank, couldnt stop us from ordering more food. Best seafood Iv ever had"], ["Reviewed 2 weeks ago", 5.0, "Nice area to shop or be entertained", "Great area with lots of unique shops and restaurants. Plenty of candy shops and seafood restaurants but also a Sock Store, a Left Hand store, an arcade, and more to do at this pier. We visited 3 times. Shops seem to try closing around 8 during January even though there still seemed to be lots of people around. Plenty of places to buy souvenirs here as well. Don’t miss the sea lions lounging on the docks!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Day at the pier", "A pretty name you kind of feel like you’re shopping at Disneyland. They have a lot of different shops & restaurants a few little rides. you can go over to the side and watch all the seals were gathered around"], ["Reviewed 2 weeks ago", 4.0, "Hub of shops & tourists", "This place is an amalgamation of too many shops with many eateries. Its always bustling with the people having a good time."], ["Reviewed 2 weeks ago", 4.0, "Lots of restaurants, shops and sea lions!", "There are lots of shops, including an Alcatraz souvenir shop and various other shops selling San Francisco themed goodies. There are two areas to view the famous sea lions, the stair up to the top level give you a better view."], ["Reviewed 3 weeks ago", 3.0, "Tacky", "Very tacky ,lots of tourist shops and expensive restaurants. Worth a look but not much more, good to see the seals though."], ["Reviewed 3 weeks ago", 5.0, "Great place to visit - make sure you get seafood chowder in a breadbowl here!", "This is an essential place to visit in San Fran. Great views of the bay, brilliant food and vibe and also good place to see the seals IRL which is an added bonus. Would recommend going here for an afternoon stroll and then finish off with dinner at one of the many restaurants nearby.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "So much fun ... just a tourist trap ... but totally FUN!", "We loved Pier 39 ...\nWe had so much fun ... just hopping from shop to shop.\n\nFor sure it's made just for tourists, but it's beautifully decorated ... we were there over Christmas Break and everything was decorated for the holidays!\n\nThe Sea Loins are amazing to watch!\n\nThey have \"street\" entertainers ... FREE ... and worth it.\n\nWe ate a few places ... everyone on the Pier was super friendly and they seemed to like their jobs and working with people!! :-D\n\nWe would go back!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loads of fun at Pier 39", "Pier39 is great fun for the young and old, with waterfront dining, aquarium, arcade, shopping, riding the carasol, live street performers, and visiting the local seals. Locals and tourists always have a great time here!"], ["Reviewed 3 weeks ago", 5.0, "Great place for an afternoon walk", "We came here for lunch after visiting Alcatraz. It was a great place to stroll with lots going on. There were some really good street performer. After walking down the main part we went to where the sea lions were and they were very entertaining. Definitely worth a visit.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun but touristy", "A fun area on the waterfront with shops and restaurants including the Hard Rock Cafe. Also a carousel and jugglers etc. It is great to see the seals basking on the boardwalk."], ["Reviewed 3 weeks ago", 4.0, "Fun afternoon.", "Lots to see and do, plus food variety excellent. Shops are fun and varied. Give yourself plenty of time and the. Re,ember to visit the sea lions around the corner."], ["Reviewed 3 weeks ago", 4.0, "Street performers make it worth the visit", "Pier 39 is a picturesque shopping mall. Most probably prices are higher than comparative products in other places. However it is worth the visit because always have very professional, funny and original street performers at the open air theatre located, of course, at the end."], ["Reviewed 3 weeks ago", 5.0, "Never boring!", "Love it here just people watching! There is always something going on, whether it be music, dance, street performers, and of course the noise of the seals! Honking in the background! Restaurants & entertainment abound, trips to Alcatraz & Sausalito to name a few. Just spend an hour or so browsing, well worth it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Sea Lions", "The pier area where the sea lions sunbathe is a very nice spot. One can walk the pier across from the crowds and see the sea lions interact as well as swim in the protected area. While there the tourist has a great view of Alcatraz!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Sea lions!!!", "The sealions are so cute!!!! There is a free museum thing upstairs. Go and you can touch their pelts!"], ["Reviewed 3 weeks ago", 4.0, "Always nice", "It’s always nice to visit Pier 39. Lots of shops and restaurants. Also to see the sea lions. Not difficult to find them, follow the sound and smell."], ["Reviewed 3 weeks ago", 1.0, "Dirty and overrun. Just bad", "If you like tourist junk, too many people, and overpriced crap, this is your spot. If you like anything other than these items there are many more places to visit and have a superb experience."], ["Reviewed 3 weeks ago", 3.0, "Overpriced and overcrowded", "We were there in the Christmas Holidays so it was really crowded, long lines at every restaurant, people everywhere."], ["Reviewed 3 weeks ago", 4.0, "A must see if one is in Fisherman's Wharf area.", "A nice stroll from the hotel we stayed in(10 min )walk.Mainly a tourist area.Lots of restaurants and shops to choose from.Lots of restaurants serving fish and seafood,specially don't forget to eat the sourdough bread bowl with clam chowder soup(its a must for us)lol.Don't forget to see the adorable Sea Lions.\nShow less"], ["Reviewed 3 weeks ago", 1.0, "Complete waste of time tourist trap", "Full disclosure: I am an SF local and am writing this post to advise visitors to SF. Pier 39 is a tourist trap and no self-respecting local goes there. There are so many more things to do in SF that are authentic (I’d start with San Francisco City Guides - the best walking tours around!)\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Sea lions and tourists", "This is a very interesting spot with the typical tourist trap shops combined with viewing real live sea lions! Rumor has it that 20 years ago they started showing up and jumping in boats until the city put out the floating docks just for them! Drop in, get some treats, and check things out.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Go if you've never been", "It's a complete tourist destination with minimal significance unless you want to be with other tourists. There are sea lions and some other interesting sites around it, but it's basically restaurants and shops. There are many better places to spend your time."], ["Reviewed 3 weeks ago", 5.0, "Good all around fun", "Take a stroll around pier 39 and enjoy one of the many shows. Lots to do for people of all ages, it’s a great way to pend an afternoon."], ["Reviewed 3 weeks ago", 5.0, "Enjoyed our time walking around", "We took a Lyft to the Pier and walked around. Felt very safe and enjoyed our time there.\nLots of shops and restaurants to choose from. Boudin was our favorite place with the sourdough\nbread bowl of clam chowder. On Saturday night we watched many cars driving up and down the street\nthat were \"souped up\" and were there to showoff for the crowd. Very interesting for sure\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Sea lions", "The pier 39 is THE place for the seals. They just relax in the harbour. Furthermore you have a great view to the Golden Gate, Alcatraz and the sea."], ["Reviewed 3 weeks ago", 5.0, "Fun place", "You must visit Pier 39. Once in SF you must go there. You can find restaurants, souveniers stores, besides the sea lions among other attractions."], ["Reviewed 4 weeks ago", 5.0, "Take the time to visit the Sea Lions", "Even in January still so much going on. Loads of shopping and souvenir opportunities and every type of food and drink - the clam chowder served in a sourdough bread bowl is a must!\n\nWhilst you’re there you have to take a few minutes to visit the beautiful Sea Lions.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must visit", "Pier 39 overlooks the Pacific Ocean is a home to many shops, restaurants, and attractions. Numerous Sea Lions also gather here. In terms of seafood, there are a lot of choices. This is also a great location to buy any San Francisco souvenirs. Pier 39 is one of the iconic locations in San Francisco.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Fun and interesting, but not a \"must see\".", "According to one of the local tour guides, Pier 39 is the second most touristed spot in California (Disneyland #1). Based on the crowds, I can believe that claim. It has some nice, distinctive shops and restaurants, but this hardly differentiates it from thousands of other such spots around the globe. However, the sea lions are a unique draw. My wife and I enjoyed our visit, but I don't feel the need to return on our next trip to San Francisco.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Lunch at pier 39", "Such a beautiful , colorful place. Had the obvious clam chowder at one of the many fish restaurants. Lovely place for a stroll and a meal."], ["Reviewed 4 weeks ago", 5.0, "Our daily breakfast spot in SF", "we stayed in Sheraton and came to pier 39 to have breakfast, and hang out... A lovely place and worth a visit"], ["Reviewed 4 weeks ago", 5.0, "A must see in San Fran", "The number one thing to do here is to see the sea lions - I have been a few times over the years and there are always at least a few of them there. Just look for all the people lining up against the water on the end of the pier. Inside the pier itself, they have restaurants and candy stores, a bakery, coffee, etc. This is also where the Hard Rock Cafe is. There are also a ton of souvenir stores here as well. It’s basically an outdoor mall - with sea lions.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Views with a price!", "So this was my second trip to Pier 39 and lots has changed since. The wharf seems to have taken on a new owner... the homeless, pan handlers and “mixed tape” salesman. To me this isn’t a sight for sore eyes but if you don’t give them money... expect nasty words to follow!\n\nHowever, the views of Alcatraz and the Golden Gate Bridge are wonderful. And, the Sea Lions are in full force this time of year. Lots of noise and the smell of fish and salt air. You should try Trish’s Donut Shop... very tasty mini donuts!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Pier Pleasure", "When I surprised our adult daughter with a trip to San Francisco and asked her where she wanted to go while we were there, Pier 39 was at the top of her list. I warned her that it's touristy, but she said that's part of its charm, and I have to agree. We had fun popping in and out of the many shops, enjoyed some delicious crepes at the Crepe Cafe, said hello to the sea lions that had begun showing up for the season and got some fun pics. I recommend this stop for those who like to window shop, say hello to some sea lions, grab a quick meal and enjoy the entertainment opportunities on the pier. The day we were there, a magician was wowing youngsters and the young-at-heart as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The Sea Lions are great", "There are lots of events at the pier and the sea lions were active at least when I Was there in August. There are plenty of food options as well."], ["Reviewed 4 weeks ago", 4.0, "Lots of things to do", "Lots of shops and restaurants. Great views of the harbor and sea lions. There is something for everyone here. A good amount of walking to see everything and it is right near the pier for Alcatraz."], ["Reviewed 4 weeks ago", 4.0, "Sea lions, giftshops, amusements and restaurants!", "This is mainly the place to look at the adorable sea lions for as long as you like. There are also a lot of different stores, food places and amusements. The aquarium is right next door, and there a usually performances going on near the street. On the second floor there is free restrooms to use. This place is nice to visit both during the day and in the evening.\n\nThe only thing that's a bit unfortunate is that the prices on everything is pretty high - but enjoying the sea lions are free though :)\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very plesant place (a little bit expensive)", "Pier 39 is a pleasant and easy accessible place in San Francisco, with a view to the bay and Alcatraz.\nIt has bathrooms and a good structure of restaurants and souvenirs stores, which are a little bit expensive.\nThe Aquarium of the Bay is there and it seems a good place to go (we didn't go).\nIf you go to San Francisco, Pier 39 is a must see place.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Definitely worth a visit", "I liked that there were several places to eat and then a bunch specialty shops to get a snack or shop. The most hilarious thing was the sea lions. They sit out on the docks and make noise all day and night. The only reason I did not give it 5 stars is because the vendors and most stores and closed way too early. I ate around 6 and most of the snack stores closed at 7 or 8.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Pier 39", "I went on a boat cruise to see the golden gate bridge and around Alcatraz island where the famous Alcatraz prison once operated though it's now a museum and you can take a trip to see it"], ["Reviewed 4 weeks ago", 4.0, "Tourist trap but worth checking out", "Pier 39 is your usual tourist trap...That doesn't mean it's not fun. They have tons of restaurants, shops, and activities. It's mostly just an overpriced shopping center. The \"Only in San Francisco\" shop is great for decently priced souvenirs. The rest of the shops are neat to look around in if you like that sort of thing. We liked the Oh My Goddard Gallery. And my kids and I liked the Fairyland even though it was ridiculously overpriced. Wow I never knew you could mass produce glitter in a jar and call it \"Fairy Dust\" and charge a lot of money for it. It was a nice day and we enjoyed strolling the pier. It was clean. public restrooms were clean as well. The entertainment there provided a nice break as well. The F streetcar is a convenient way to get there using public transit, but it gets awfully full with all the tourists so be prepared to stand in line if you are using public transit.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great harbour side", "Really nice harbour side, you feel the sum of life. Many difference actors make it worth to visit. Enjoy an ice cream and just sit down and enjoy people passing by."], ["Reviewed 4 weeks ago", 5.0, "Good keeped place to stay with family", "It is more for families but you can find plenty of places to buy food and gifts for people that you cares"], ["Reviewed 4 weeks ago", 5.0, "Love it", "There’s plenty to see and do here . We visited jet lagged at 8am and for drinks in the evening . Lots of buzz going on and plenty of places to eat and drink"], ["Reviewed 4 weeks ago", 4.0, "Very touristy but worth seeing the sea lions", "Two levels of good boutique style shops set amongst the usual tourist souvenir shops and some good restaurants as well. Great two-storey carousel and of course the famous Pier 39 Sea Lions sunning themselves (not that there was much sun the day we visited)."], ["Reviewed 4 weeks ago", 4.0, "Pier pressure", "Very much enjoyed my trip to the pier 39 during my weeklong stay in SF. Area is full of tourists and touristic activities. I have read a news article that pier 39 is the most visited attraction in SF and I am not surprised. Plenty of cafes and restaurants, aquarium of the bay and the bay cruises, all keep you busy for hours. Not to forget about the sea lions, who have made pier 39 their home. You can hear their barking from quite a distance. I also took a return ferry ride from here to Sausalito, which also stops by at some of the nearby islands. Access to pier 39 is easy, I took streetcar F from downtown market street, which has a frequent service\nShow less"], ["Reviewed 4 weeks ago", 5.0, "You have to experience Pier 39", "There were several things we had to see while in SF and Pier 39 was just one of them. We walked the piers, visited several restaurants, businesses and saw the seals at Pier 39. There is such a variety of things to do in this area, you could spend hours here.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Lots of food choices", "Worth buying home canned clam chowder. Fun to walk around. There is an In & Out there to satisfy craves"], ["Reviewed 4 weeks ago", 4.0, "Tourist Trap, so what- its fun", "Obviously a tourist trap, but if you are a tourist it's fun. Lots to do and see with eateries galore. Great for lovers of fresh fish. Avoid the obvious pitfalls and have a great time"], ["Reviewed 4 weeks ago", 4.0, "Bustling!", "Very bustling place. I didn't buy or dine at the Pier as I knew it would be very touristy. The sea lions lounging in the sun is such a pleasant surprise - walk along the pier instead of following the signs inland."], ["Reviewed 4 weeks ago", 4.0, "Sea lions!", "I enjoyed the sea lions! They was so much fun to watch. Other then that Pier 39 was your typical touristy area. A great spot to buy souvenirs."], ["Reviewed 4 weeks ago", 5.0, "Seals Galore!", "I loved this place, so much to see and do, the seals are amazing, they just lie around barking! So interesting to watch them. Plenty of shops to look at and eateries , plus an old fashioned carousel. Well worth a visit for all ages."], ["Reviewed 4 weeks ago", 3.0, "Yeah, it's a tourist trap, but ,,,,", "Lots of people told us this was a tourist trap, but we WERE tourists, so we walked the length of Fisherman's Wharf to check it out. It's mostly souvenir shops, food stands and restaurants, but it's fun to walk to the end of the pier and watch the sea lions that hang out, play and bark.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "girls weekend", "very touristy spot...but worth the visit if you have never been. Seeing the Sea Lions is a MUST! Be ready to pay for food & souvenirs....they are pricey"], ["Reviewed January 24, 2018", 3.0, "Tourist area- but OK for first time visitors", "Very touristy area with lots of shops and restaurants. If you are a first time visitor and have time- OK to check our perhaps during a walk on the Embaradero"], ["Reviewed January 24, 2018", 5.0, "I just love this place", "Cute place to walk around, visit different unique shops. Plenty of restaurants to choose from. My favorite part is watching the seals. Can just watch hem for hours. If you are in SF you must visit pier 39."], ["Reviewed January 24, 2018", 5.0, "Great Place to Eat and Shop", "We had a great time at Pier 39. Super family friendly. I highly recommend visiting the Pier for dinner and shopping"], ["Reviewed January 24, 2018", 1.0, "TOURIST TRAP!", "Absolutely no idea why people go here?!?!?!?!?! There is nothing to see. Absolutely nothing.... Save yourself a headache and lots of money!"], ["Reviewed January 24, 2018", 5.0, "A vibrant fun area! Iconic!", "Pier 39 is full of interesting shops, eateries, street theatre, buskers & of course sea lions. We loved the area. A great place to try some SAN Fran foodie experiences such as crab cakes, chowder in sourdough bread bowls and my son was addicted to the mini donuts and fudge. We went to Boudin Bakery for lunch and it was fantastic. I highly recommend it. You can also take a cruise from Pier 39. We didn’t get time to do that but it will be on our list for our next trip to San Francisco!!\nShow less"], ["Reviewed January 24, 2018", 4.0, "Good spot for restaurants", "Really busy on weekends not so much during the week. Many shops and restaurants to choose from. Great view of the bay from here."], ["Reviewed January 24, 2018", 5.0, "Did I mention this is free!!!!", "Great place to spend the afternoon, so much to see and do, many shops and restaurants and entertainment, the seals were the highlight of it all, it's free entry and as crowded at it gets it feels really safe!"], ["Reviewed January 23, 2018", 5.0, "Tourists and crab claws", "This place was exactly what I expected. There are kitschy souvenirs shops mixed with all-ages entertainment. Do yourself a favor and check out the sea lions. I could’ve watched them for hours"], ["Reviewed January 23, 2018", 5.0, "Wow", "There is so much to do and see here. The food alone will keep you busy for hours. Go early in the morning to avoid line ups."], ["Reviewed January 23, 2018", 5.0, "Plenty of great food, a small but nice aquarium, shops, an other attractions close by.", "It would be easy to spend half a day on Pier 39, and it is close to many other attractions. Sea lions abound. Go to the end of the pier for a view out through the bay."], ["Reviewed January 23, 2018", 4.0, "Visit for free or spend loads", "The visit to see the sea lions is worth it alone, but there are also plenty of shops, eateries and attractions to use up a couple of hours. We visited the mirror maze, which was fun but only just about worth the cost as it only lasts about 5 minutes.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Soooo much to choose from", "Loved the atmosphere here so many different people and different restaurants to check out! Took a cruise from the pier and loved my experience"], ["Reviewed January 23, 2018", 5.0, "Lots to see and do!", "Pier 39 has so much to offer all ages! Stores, restaurants, sights of the waterfront...so much to do! You an visit more than once in a day and see something different each time!"], ["Reviewed January 23, 2018", 3.0, "Nice walk by the water", "This spot is definitely a tourist trap but still worth seeing. It’s a nice spot to take a stroll. You will be able to see some boats, and shop at a few (overpriced) shops. Lots of restaurants options available and make sure to check out the sea lions.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great Pier", "We visited this pier in the evening as it was getting dark. seeing the sealions playing and bathing was awesome, and there are plenty of different types of shops on the pier, There is an unreal fudge shop... enter at your own peril... we spent $40 on fudge... the best fudge ever! the guys were very friendly and once they found out we were from Ireland toppled them over the edge and gave us freebies, not that we really needed any.\nShow less"], ["Reviewed January 23, 2018", 3.0, "Good just to look", "Interesting shops to look around however its just a few nic nacs that i wouldn't buy. Found a good lunch spot just down the road Boudin bakery & cafe on Jefferson st. Line seemed long however food was fresh and didnt take long before it was ready.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Excellent experience", "Fantastic place to grab a coffee or something stronger and watch the world pass by, lovely shops to peruse in that youll find wonderful gifts to take home and make sure you go and look at the sea lions!"], ["Reviewed January 22, 2018", 5.0, "Fun and interesting, must see spot in SF", "Pier 39 is both, very interesting and fun place to spend a few hours when visiting SF. The most famous attraction are the large amount of sea lions but you could have so much more there. If you are with kids, there are always free, open shows of singers, magicians and others. The food verity is great and most popular is the crab meat but you’ll also find all seafood and very affordable. You could also take boat rides in the bay water from here. The only problem here is parking if you come by car so if you do have a car, consider coming here with public transportation instead\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great place to pick up a few treasures", "Great place to get a feed after your harbour tours and some great bargains in the shops on PIER 39 (the ice cream is good also"], ["Reviewed January 22, 2018", 5.0, "A wonderful part of the San Francisco experience", "Stroll along Fisherman's Walk to Pier 39. Very touristy but a fascinating and interesting walk. Souvenir shops and bars but some excellent restaurants and the seafood is to die for."], ["Reviewed January 22, 2018", 4.0, "Tourist Trap At It's Best", "This is a fun place and of course a must see and visit while in town. The many shops and places to eat can last a day or two. There of course are other things to take in and do at the pier while you are here.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Don't miss this, Something for everyone.", "It can be free, not much in California can be but this, heavy tourist area, can be relatively low cost. There are rides and games that do cost, but there is a free magic show, not the best I've ever seen, the sea lions are very interesting to learn about, free educational area. Parking can get as high as $45.00 a day, food is a bit pricey, but look where you are, the sea food is so fresh, but if on a budget picnic lunch would work, they have benches for sitting all around the pier. I love the shops, I always find them interesting, and a bit entertaining, and some beautiful artistry as well. This and fisherman's wharf are definitely a not to miss when in the CITY!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Pier 39 is a MUST go place when you are in San Francisco!", "No. 1 place to visit is Pier 39! You will finitely need to come if you are going to Alcatraz as you need to take the cruise from the Pier. Cruise to Golden Gate Bridge is from here too. Must also try their boil crab when you are here. Looking a the Sea Seal taking a picture of them is also fun but may not smell good there :) remember to wear a thick jacket as it is usually very windy!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Pier 39", "It's been a while since we have been here. Still fun to visit. Nice variety of things to see and do. Nice memories."], ["Reviewed January 21, 2018", 3.0, "A touist trap", "It's long pier with restaurants and shops. The sea lions are the only thing worth seeing. If you are at the wharf area, then stop by but nothing special."], ["Reviewed January 21, 2018", 3.0, "Really crowded", "Come for the sea lions which are behind the shops near the end of the pier. They are really fun to watch. Otherwise, this tourist trap is packed with people, buying trinkets or a hoodie because they are cold!"], ["Reviewed January 21, 2018", 5.0, "Is always fun!!!", "Always something to see, on the Pier and of course the obligate visit to the seals and the window shopping and why not even on Winter you can enjoy a ice creams, they are plenty to choose!!!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "To SEA! and be seen!", "A buzzing area with the sea at its backdrop. It is easy to understand why people flock here. A mix of shops, cafes, restaurants, tourist shops and of course seafood sellers. A must see when you are in town"], ["Reviewed January 20, 2018", 4.0, "Seafood and parking", "Many restaurants and free parking with validation until 6pm. The parking especially sealed the deal. We dinnered twice just because of great access."], ["Reviewed January 20, 2018", 4.0, "Fun place", "First time we had been here and it was a great place. Lots of people and great shops to visit rite near the water which was great to relax at Will be visiting again i hope in future"], ["Reviewed January 19, 2018", 4.0, "Packed with tourists but a beautiful place", "Lovely views of the San Francisco Bay, and a great tourist experience seeing the sea lion-riddled dock. Very busy so one must push through the crowds to get a good view of them. For a true tourist experience, bring a lock to put on the fence there (and a peg for your nose as smells quite fishy!). Also within walking distance of many waterfront restaurants, so a great place for a walk as the sun sets before dinner at Fisherman's Wharf.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Lots to see", "We visited the Pier on a Saturday night. There were lots of shops to visit and tons of restaurants. It was very fun to walk around. There were even some performers. The view of the city from the pier was beautiful, and you can hear tons of sea lions, which was really neat. Definitely worth visiting!\nShow less"], ["Reviewed January 18, 2018", 5.0, "Great shopping", "Awesome shopping here. Heaps to magnetron about half way down first because they have the best prices for hats, beanies, magnets and souvenirs."], ["Reviewed January 18, 2018", 4.0, "a must when your in San francisco", "Pier 39 was such a great place to do a bit of shopping and it has different sort of shops and places to eat and drink. A easy place to spend half a day with great atmosphere."], ["Reviewed January 18, 2018", 4.0, "Come early to avoid the crowd.", "We enjoyed watching sea lions sun-bathing and playing among themselves. You can also view the Alcatraz from this location. There are plenty of shops and restaurants, just be ready to spend especially when travelling with young children. It a great place for family outing."], ["Reviewed January 18, 2018", 5.0, "Great food and sea lions", "Great food, bars, food, sea lions, shopping and food. Took the family here day and night for crabs and sightseeing. Our kids were fascinated by the Sea Lions"], ["Reviewed January 17, 2018", 5.0, "Must see location!", "Start your tour of beautiful San Francisco here. Lots to see and do. Aquarium of the Bay is here. Lots of restaurants - above as well as on the ground level. Touristy shopping- lots of knick-knacks. Views of Alcatraz from several eateries. And don't forget the Sea Lions at the very end around the corner. Loads of fun.\nShow less"], ["Reviewed January 17, 2018", 4.0, "The tourist place on the bay", "This is where you get full on everything that is for the vistor. Fresh seafood and fish n chips cooked while you wait. Beer on tap. Shops shops and more shops. There are public amenities on the pier. Locayion is a short walk from the Alcatraz ferry terminal.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Nice", "Lots of shops and restaurants down the pier. Great views and lots of moored boats. You even get a great, clear view of Alcatraz Island. Would be nice on a sunny day."], ["Reviewed January 16, 2018", 4.0, "Good for First Time Visitors and Returning", "Get on your walking shoes and enjoy the sights.\nLots to see and do. Shopping, eateries, souvenirs, aquarium and street performers.\nThey seemed to have upgraded and remodeled since my last visit. It was clean and well maintained.\n\nParking near pier is available.\nMake sure to go the end of the pier so that you can see the sealife that is basking in the sun on the docks. (beware of the smells).\n\nBeautiful views on a clear day.\n\nWould recommend.\nShow less"], ["Reviewed January 16, 2018", 5.0, "A SF Can't Miss Location!", "If you go to SF - you have to go to Pier 39! There is something there for everyone. Take the 30 minute boat ride if you can, explore the Pier, the shops, restaurants, etc. The atmosphere there is so welcoming & inviting - and the views are breath taking!\nShow less"], ["Reviewed January 15, 2018", 5.0, "A must visit", "I had no expectations prior to visiting Pier 39: it was a huge surprise for me and I totally loved it! There are so many sea lions that it is hard to believe they came by themselves. The atmosphere is also great but expect the restaurants to be fairly expensive!\n\nWe had a great time!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Love it!", "There was a market when i went there, it is amazing. A variety of tea, dried fruits, fresh veggies, accessories. Just walking around and having a coffee around the pier was great. Must visit"], ["Reviewed January 14, 2018", 5.0, "Wow will be back tomorrow", "Great place to go. There is something for everyone!! They also house a lot of restaurants (Hard Rock Cafe, Bubba Gump, Fog Breath )and other eateries, clothing stores and even experience rides. We didn’t realise till we went exploring further in that this place is actually really quite extensive. Fun for us who like mooching around different shops. Will be back tomorrow cos we didn’t see everything as we came quite late after Alcatraz.\nShow less"], ["Reviewed January 14, 2018", 5.0, "LOVED this place!", "One of my favorite places in San Fran. This was so full of life and colors! Wonderful shops and great eateries. We loved Bubba Gumps, but there were lots of places. I enjoyed walking along the waterfront. The BEST part was seeing the seals! Loved watching and hearing them!!! Such a lively bunch!!\nShow less"], ["Reviewed January 14, 2018", 5.0, "One of my Favorites", "This place is a blast. Definitely a tourist stop, and has a little bit of everything. You can catch a boat tour, see the sea lions outside the docks, ride the carousel, or get a meal. There are plenty of high end restaurants, and well as chain restaurants (like Bubba Gump Shrimp, where we ate). There are also a few gift shops, where you can find anything you could imagine to remember your trip. This would be a place we go to every time we are in town.\nShow less"], ["Reviewed January 14, 2018", 4.0, "It is a mall", "They basically transformed the pier into a mall. There are several stores and restaurants. It is crowded, but you can see Alcatraz and the Golden Gate. The sea lions are nice to see too."], ["Reviewed January 14, 2018", 4.0, "Worth a look", "Luckily the weather was quite warm so quite busy. Can accommodate varying budgets as it’s the kind of place where you can spend as much or as little as you want. Spent an afternoon here watching free performances and wandering in and out of souvenir shops. Had a nice day. The information centre was really helpful. Take a walk to see the sea lions. Apparently it’s hit and miss as to how many you will see but on the day we visited, there were loads and they are highly entertaining. Quite a few places to eat varying in price and cuisine. Tried the aqua massage where you remain fully clothed. Looks similar to a capsule where you’re encased in what looks like plastic sheeting. Headphones are provided as head remains visible. Jets massage from neck to feet. Recommend.\nShow less"], ["Reviewed January 13, 2018", 1.0, "Didn’t rate it", "Nothing really of interest. Couple of okay souvenier shops. Didn’t rate the restaurants there. Overrated in my opinion."], ["Reviewed January 13, 2018", 5.0, "Fun place", "Such a neat place to hang out. Great views of alcatross and the Golden gate bridge. So many shops to visit."], ["Reviewed January 12, 2018", 3.0, "Not so good ok ok", "not so good, sea lion area is good and not much activities to do there. all are very costly, if you are not experience with aqarium you can visit aqarium"], ["Reviewed January 11, 2018", 3.0, "Life is a cabert", "A never ending stream of tourists, cheap souvenirs and street performers. The dirge of bathrooms means the entire area has a vague smell of urine. The same souvenirs can be purchased in china town for about 1/2 price."], ["Reviewed January 10, 2018", 4.0, "Very touristy but worth the visit", "Lots of options for dining - we picked a place that sold clam chowders. It's a vibrant place that has something for everyone. Our kids enjoyed the carousel and the sea lions. There are also several spots to take photos of Alcatraz Island."], ["Reviewed January 10, 2018", 1.0, "Very Busy and Chaotic", "Pier 39 is full of tourists. It's just a bunch of random shops selling souvenirs and crepes. There are so many people here. Avoid at all costs unless you like chaotic crowds, random shops or crepes."]]}}