{"Pismo Pier": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Pismo Pier", "url": "/Attraction_Review-g32894-d220150-Reviews-Pismo_Pier-Pismo_Beach_San_Luis_Obispo_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/e0/b9/7e/pismo-pier.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1327"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Pismo Beach", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 3.0, "Under construction....", "The pier is under construction but the boardwalk is still happen'. It's still an awesome place to take pictures, go for lunch or dinner, take a walk on the beach, or just enjoy the sun. Enjoy."], ["Reviewed 3 days ago", 3.0, "A work in progress!!!", "Will be super when done: you can see the progress they are making. Even closed, the surrounding area is lovely, very quaint and old fashioned seaside-y, with an extensive soft sand beach to walk along...... it’s just a beautiful place."], ["Reviewed 6 days ago", 4.0, "Nice Pier...But Closed", "We have been to the pier before and thoroughly enjoyed it. It is fabulous for avid photographers. This year we were disappointed as it is undergoing a lengthy construction. Look forward to visiting it on our next visit."], ["Reviewed 1 week ago", 5.0, "A great place to watch whales.", "A great place to take in a picnic. Sit back and enjoy the sun, breeze and sand. People watching is fun too."], ["Reviewed 1 week ago", 4.0, "Pismo pier", "Unfortunately this place is under renovation. Nice location. They are doing a good job so far. I've been there before and it's a nice place to watch surfers."], ["Reviewed 4 weeks ago", 5.0, "Under repair", "The pier is under repair however when finished it is a great place to walk out above the ocean and see the coast line"], ["Reviewed January 24, 2018", 1.0, "Someday", "It is under construction now 1/2018. Come back at a later time.It will probably be great. New hotels etc. also under construction 1/2018"], ["Reviewed January 21, 2018", 5.0, "Beautiful walk", "When we were there, they were renovating the pier. It's still an amazing location. As soon as it's open again, go walk the pier!"], ["Reviewed January 18, 2018", 4.0, "Always a pleasure to walk the pier area", "The pier that extends over the water is under repair at present, but the walkway that runs parallel to the water still affords a great overlook of the beach and great photos of the setting sun."], ["Reviewed January 14, 2018", 4.0, "Great Meeting spot for friends and family", "The Pismo Pier was partially under construction when we were there in Dec / Jan - it is centrally located and is a good meeting spot for friends and family while in Pismo Beach. We used location to meet and plan our day each morning with our group.\nShow less"], ["Reviewed January 6, 2018", 1.0, "Under Construction", "As of December 2017 it is under construction and doesn't look like it will be finished anytime soon. When done, it will be very nice for a stroll to watch the sunset."], ["Reviewed January 3, 2018", 3.0, "Pier is under construction BUT...!", "... The beach is such a nice place to hang out and the shops nearby are nice. Especially Splash Cafe. The rest of the beach is nice and open and flat to walk and play and search for sand dollars"], ["Reviewed December 31, 2017", 3.0, "Pier under construction", "The pier itself is undergoing repairs so it is currently closed, but you can walk on a short boardwalk by the beach, and there are restaurants and souvenir shops to visit. It looks like there is some additional construction going on in the area too but I'm not sure if it is connected to the pier renovation. I look forward to visiting again when the construction is complete but if you're going anytime soon your visit will be limited.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Mrs.", "The pier is under renovation but we enjoyed the surroundings. You still get to enjoy the ocean and beatiful views."], ["Reviewed December 28, 2017", 4.0, "Nice, but under repair", "This is a cool pier -- it is under reapir currently. It was really nice that they had a Christmas tree in lights at the end of the pier. We could see it, the pier and the shoreline from our hotel at the Seacrest. The major repairs look like new steel pilings. Quite expensive but the pier will be there forever!\nShow less"], ["Reviewed December 11, 2017", 4.0, "Nice place to kill an hoyr", "The Pismo pier is a very pleasant spot if you need to entertain yourself for an hour. There are affordable restaurants, typical souvenir shops and beautiful ocean views. We have visited on several occasions and found that it is far more pleasant off season than it is in the busy summer tourist season\nShow less"], ["Reviewed December 7, 2017", 4.0, "Nice pier but currently under repair", "Beautiful place, Pismo beach, surfers, waves, sun. There is a nice boardwalk along the beach and then walking on the beach is great with the sand, and surf."], ["Reviewed December 1, 2017", 4.0, "Local eval of Pismo Pier", "As a local, most people view the Pier as more of tourist thing,\nespecially with all the shops that are nearby. While the views\nhere are quite nice, finding parking here is always a hassle.\n\nCompared to Piers & Boardwalks that are found in Coney Island\nand other places the one here is rather pathetically short. As\nyou walk along the short stretch there is not really much to\nsee, except for a few hotels. All of the restaurants are at the\nbase of the Pier.\n\nThe Pier is located in the crowded area of Pismo Beach itself\n& is popular with tourists. Regardless of the tourists, the waters\nare too cold & rough for most [so head for Avila Beach for the\nkids].\n\nThe Pier area is filled with want one would expect from a small\ntown tourist scene & I would pass on most of the food. There\nare some pricey stand outs for seafood [eg. the Oyster Loft].\nBetter deals are on nearby Price street, or just a short drive\naway along Grande Ave in Arroyo Grande or Grover Beach\n[e.g. Thai Deva].\n\nIf you do want to visit here, there are some good sunset views\nto be had & then there are a few activities down the street, like\nbowling, pool, darts, arcade machines.\n\nOf course the public restrooms are rather gross, but if you dine\nat one of the more upscale restaurants, you will have a better\nchoice.\n\nThe only time we visit the Pier, is when we have visitors from out\nof town....so that should tell you something.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Walk on the boardwalk", "Walking along the boardwalk is great ! The pier is under construction, and will be a great addition to your walk when it's completed"], ["Reviewed November 22, 2017", 3.0, "Just okay", "I’m not sure why in my head Pismo would be like Santa Monica Pier. It’s not! It’s sort of run down with a lot of old restaurants and souvenir shops dotting the main drag. The crowd feels a little shady. We did eat at Woolys which served some classic American fast food.\nShow less"], ["Reviewed November 19, 2017", 3.0, "Nice", "Brings back so many memories from my past. Its a have to stop for me and my family..the pier is closed for up grading."], ["Reviewed November 18, 2017", 5.0, "Awesome, fun, great beach", "The pier is being renovated now but that doesn’t stop it from being so much fun. New hotels are being built including a brand new Marriott. It is going upscale. The ocean views from the pier are breathtaking. A walk along the pier will talk away all your worries and stress.\nShow less"], ["Reviewed November 17, 2017", 5.0, "So Disappointed", "This has been recommended by so many people we had to come for a visit. Only to find that it's closed. It's unsafe and they are doing construction to repair it but no set time to reopen. Beach is accessible but the amazing views from the pier were not. Maybe next time\nShow less"], ["Reviewed November 15, 2017", 4.0, "Lovely views", "Nice place to stop by for half an hour or so to watch the world go by. Decent parking close by and a few nice restaurants as well."], ["Reviewed November 10, 2017", 5.0, "Summer at the beach", "Always lots happening Big at the Pusmo pier! Beautiful crashing waves, crazy gulls trying to steal your lunch, and amazing food everywhere!"], ["Reviewed November 3, 2017", 4.0, "Nice little area under bit of construction.", "Came to this pier back in June and Construction was ongoing around the pier and beach area. There was plenty of access to the other areas of the beach and boardwalk. There are benches to sit on, access to bathrooms and parking. It's a great place for people watching.\nShow less"], ["Reviewed October 29, 2017", 2.0, "Poor for now", "It is under construction so you cannot access it and I did not see any signs indicating when it would be reopened. I think it would be a decent pier to walk out on if open but doesn't go out that far and appears to be like any other pier.\nShow less"], ["Reviewed October 26, 2017", 4.0, "fun night on the pier", "lots of good people watching, music and food. lots of shops, restaurants. just a fun atmosphere. I would return."], ["Reviewed October 18, 2017", 5.0, "Quick visit", "We were staying nearby so had a walk along the pier, it was lovely. It was early evening so it was a nice and quiet."], ["Reviewed October 16, 2017", 4.0, "Pismo Pier offers great views of ocean and coastline", "I always look forward to visiting the Pismo Pier at Pismo Beach. On a bright sunny day, the views of the beautiful coastline can be amazing. The repetitive sounds of the breakers crashing on the beach below in concert with the cacophony of seagulls above makes for an interesting natural orchestra.\n\nTake a stroll down to the beach and feel the grains of sand trickling between your toes! It really feels peaceful and relaxing. Afterwards, head back to Main Street for a cold drink to quench your thirst at one of the many bars and restaurants.\n\nThere is a paid parking area with a centralized payment machine which thankfully also accepts credit cards. Please note that parking can be a challenge on weekends and holidays. There is a public restroom at the entrance of the pier on the other side of the parking lot.\n\nPlease note that the pier was closed for renovations during our visit and may be closed until July 2019. Please contact the Pismo Beach information center for up to date information.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Pismo Pier is Under Construction", "We were so disappointed to learn the Pismo Pier renovation will take up to 3 years. However, the city has unbelievable future plans--two new downtown hotels going up now, and there is talk of a possible future ferris wheel. It has not slowed down the activity there. Love, love, love Pismo!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Pismo pier", "It was a very nice place specially the 🏖 the restaurant along the frontage road are excellent you have a lot of restaurants to choose from I like the fresh fish at almost all the restaurants"], ["Reviewed September 26, 2017", 5.0, "Still under re-construction but focal point of the Beach!", "Even though you cannot go out on the pier, there is still lots of things to see and do if you don't mind a little sand in your toes! Plenty of places to eat around here, along with surf and trinket shops. Great at night!"], ["Reviewed September 22, 2017", 1.0, "Yep, still closed", "They are renovating the pier and it is still closed. They are slowly making their way down it replacing all the boards so looks like it will take some more time yet (likely months not weeks)"], ["Reviewed September 22, 2017", 4.0, "Quiet Week Night", "Quiet walk during the week without partiers lurking around - very peaceful Shops close early, but restaurants are open"], ["Reviewed September 20, 2017", 4.0, "Pier was Closed due to Maintenance Work", "We visited this fabulous beach and discovered the pier was unfortunately closed due to maintenance work! Which no doubt has to be carried out...\n\nWe did walk along the beach before and after the pier for quite a distance, and we did see and photograph a happy looking sea lion basking and frolicking in the surf near the pier... it was a pleasure to witness!\nShow less"], ["Reviewed September 20, 2017", 4.0, "Beautiful views!", "Park your car & take your Honey for a walk in the surf. Take in the extraordinary vistas. Go grab a bite to eat. Build a memory of a lifetime. This is the place to do it! All of it!"], ["Reviewed September 19, 2017", 1.0, "Closed for renovation !!!!", "The views of whales and surfers would have been awesome - it is however under going a renovation and is shut. This is a real blow to anyone want in to visit Pismo and do those two things !"], ["Reviewed September 16, 2017", 4.0, "Nice view with easy access for wheelchairs", "This is a great place to view the late beach and ocean. The Pier has great access for wheelchairs. We saw many Pelicans and a few passing Whales"], ["Reviewed September 9, 2017", 1.0, "Its Closed", "The pier was closed on this labor day weekend. Looks like they are about a third of the way along with replacing supports. However, the artists depiction of what it will look like is really boring, not one structure planned, not even to get an ice cream!\nShow less"], ["Reviewed September 1, 2017", 1.0, "Under construction", "The pier is being renovated. Construction equipment and fencing. Beach is accessible which alone is worth the visit."], ["Reviewed August 28, 2017", 2.0, "Reconstruction", "Disappointed the pier was closed due to it being upgraded. My fault for not checking ahead of time. But Pismo is still a great town to walk through"], ["Reviewed August 23, 2017", 4.0, "Wonderful place to visit!", "I've been coming regularly to the Pismo Pier. Many times we go to watch the spectacular July 4th fireworks. Bring a sweatshirt as you never know if it will be foggy! There's a shop on the pier where you can buy pink popcorn and snacks, fishing stuff, and souvenirs. The shops and restaurants nearby sell things like coffee, ice cream, beach shorts & tops, sports souvenirs, candied apples, fudge,and homemade taffy, and the clam chowder is wonderful. You can rent beach bikes or wetsuits, buy sunglasses, or get the latest newspapers, books, 7 magazines. There's something for everyone. Love, love, love this place!\nShow less"], ["Reviewed August 17, 2017", 3.0, "Closed", "Obviously undergoing some renovation work the closure of the Pier actually doesn't detract from Pismo at all. The beach is still there, as are all the bars and restaurants so wouldn't worry too much."], ["Reviewed August 16, 2017", 4.0, "Lovely Pier", "The Pismo Pier often has great views of whales and there are many fishermen. It needs proper maintenance."], ["Reviewed August 14, 2017", 5.0, "whale and dolphin wstching from the pier", "The pier is such a great place to hang out. People watching, whale watching, surfer watching....always something going on.\nwalking alongside the pier seeing new construction...also watching people paddleboard, walk their dogs, taking pictures and occasional music entertainment. You can also walk down to beach or watch from pier. swingsets for the kids, benches if tired and restrooms close by. its all intetesting. lol\nShow less"], ["Reviewed August 13, 2017", 1.0, "Pismo Pier", "Unfortunately the pier was undergoing renovations so we weren't able to walk along it. This was a shame as I would have liked to see the pelicans that sit at the end!"], ["Reviewed August 9, 2017", 4.0, "On a beautiful day you can see for miles...", "Pismo is such a fun seaside town located on the Central California Coast that a visit would simply not be complete without a lovely stroll down the Pismo Pier, enjoy!"], ["Reviewed August 4, 2017", 5.0, "Pismo Pier being worked on!", "Pier is blocked off right now but there are still wonderful benches and vendors at the Pier entrance to enjoy!"], ["Reviewed August 4, 2017", 4.0, "Great place to wander around at sunset.", "The pier area of Pismo Beach is alive with people in the late afternoon & early evening. It is quite photogenic. Great to walk around before and after a meal. The area at that time of day seemed very safe."], ["Reviewed August 3, 2017", 5.0, "Lovely Place", "The pismo beach is wonderful. There are plenty of cute, small stores and the personal is verry friendly. I even saw a seadog in the morning during my lesson in the sandbar surf school. Chantal"], ["Reviewed August 1, 2017", 1.0, "Pier is closed", "The pier is closed for extensive repairs. Visibly, a lot of work needs to be done. The beach was fairly crowded and dirty"], ["Reviewed July 29, 2017", 5.0, "Pier is currently closed, but beach is awesome", "The Pier is currently closed, but the Pier area and beach are a must visit in the area. Come at low tide for some shell and Sand-dollar collecting. The shops are slightly overpriced, but the area is a great example of classic Beach town California."], ["Reviewed July 29, 2017", 5.0, "Pier closed for repairs", "Sorry to say the pier is still closed for repairs. Looks like it will be a while before you can stroll to the end and enjoy the coast views, along with the whales & sea lions. You still can visit the walkways & wander down for miles going south toward the dunes. Very pleasant even if a lot of people are on beach. Peaceful!\nHope they open the pier soon!\nShow less"], ["Reviewed July 26, 2017", 3.0, "Dirty", "Pismo beach pier shops are stinky and dirty. It wouldn't be my first choice of a place to visit. We have family nearby so we have visited often. Avila is much nicer."], ["Reviewed July 25, 2017", 2.0, "An acquired taste", "If you like pretty scenic beach areas with room to swing a cat this place is not for you.\n\nFor me this is very much a hustle & bustle type beach resort with lots of fast food joints, cheap shops, rough bars and an average looking beach that oozes tack.\n\nIm sure some people may find this place OK or even good but for us we left as quick as we came. We stopped here as part of our 28 day road trip from Seattle to a San Diego via the PCH (Pacific Coast Highway) and to be honest compared to some of the other places on the west coast this is poor.\n\nPersonally I'd give pismo beach a wide berth if yo don't have to go there.\nShow less"], ["Reviewed July 24, 2017", 1.0, "Not what i expected", "it was closed, but there doesnt appear to be anything on it. I'm used to shops, restairants, vendors etc."], ["Reviewed July 22, 2017", 1.0, "Too many people!", "Just drove through Pismo Beach. Not a place I would return to. Too many people. Too many cars. Just not how the photos show it to be. I think all the photos are taken in the winter so they do not show the 10000s of people and cars. So my advice is not to go to Pismo unless you are a crazy young person looking for crowds\nShow less"], ["Reviewed July 20, 2017", 5.0, "Stunning Views", "Some of the best views on the California coastline come from the end of the pier, great sunsets too on the right day"], ["Reviewed July 17, 2017", 5.0, "Beutiful", "Relaxing very beautiful. I just walked the beach and enjoyed looking at the ocean and pier. Many were enjoying the ocean."], ["Reviewed July 16, 2017", 4.0, "The pier area including the beach is open but not the pier, sigh!", "We liked the vibes of the city immediately as we parked and walked up to the pier. The surrounding eateries, pubs and souvenir shops were very cool. The people were laid back but we arrived near sunset and it was very chilly in June! Thus, I recommend bring layered clothes. We made our way up to the pier and saw that it was closed. Such a bummer! The beach was open and people were playing and some even swimming but it was already getting too chilly for a proper walk along the beach. We went back and enjoyed the city a little more before we ate and headed out. We will have to come back and this is a must stop place if you’re touring the coastal cities.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Closed", "We went July 1 and the pier was closed for repairs. The beach around the pier was beautiful but finding parking around the beach was a nightmare. My guess is it's not so bad at other times (not the 4th of July week)."], ["Reviewed July 9, 2017", 5.0, "Fixing the Pier", "You can't walk out to the end of the Pier yet. The are fixing it and will be really nice once done. There is a walkway along the side of a few motels. Can't wait for it to reopen."], ["Reviewed July 9, 2017", 5.0, "Laid back and beautiful", "My daughter and I went last September and stayed at a hotel overlooking the beach. We loved the surfer style atmosphere and a big plus was having a laundromat so that we could do a big wash halfway through our California fortnight."], ["Reviewed July 9, 2017", 5.0, "Nice view", "Extremely beaytiful view. We came out at about 6am and the tide was low but at about 10am the tide was pretty much coming in already. Still chilly at 10am and many of us had to wear our windbreakers.\n\nThere are boogie board rentals for $6 for 2hrs and a free shower / restrooms. Just a warning though that although the shower is sectioned off, there's no door or screen. There are also public open aired showers and feet washing stations.\nShow less"], ["Reviewed July 8, 2017", 3.0, "Crowded place", "So many people there. Dirty area. Ocean always wavy and cold. Nice views. Many shops and restaurants nearby."], ["Reviewed July 7, 2017", 4.0, "Classic California being refurbished for the next year or so", "The Pismo Pier is a sure tourist spot but unfortunately is it being refurbished for a year or more. You can always catch surfers near the pier which is fun and classic California. The boardwalk is up and running"], ["Reviewed July 4, 2017", 1.0, "Pier under rennovation", "The whole pier is closed off and is under renovation. In fact, there many constructions sites and renovations at Pismo Beach which probably detract from it's charm. However, the beaches and waves are still great!"], ["Reviewed July 3, 2017", 3.0, "Packed", "We were there during the week of July 4 and it was very crowded. We enjoyed riding around looking at shops and restaurants as we tried to find a parking spot. But alas, we left without finding parking and without walking on the pier."], ["Reviewed June 30, 2017", 5.0, "Love this place", "One of my favorite places. Beach is just wonderful. Love going to all The shops. People are friendly my only complaint would be the restrooms. They are smelly."], ["Reviewed June 29, 2017", 5.0, "What a View!!", "Fantastic view of the Pismo Beach area!! The restaurants around are fantastic and the sandy beaches are beautiful and clean. A bit cool until afternoon but the view is worth the walk."], ["Reviewed June 25, 2017", 4.0, "Nice Pier", "Awesome place by the ocean. The beach in nice not too crowded. Many fun little shops to see. I wish the boardwalk was completed. All and all I enjoyed it."], ["Reviewed June 11, 2017", 2.0, "Pier is under construction, parking is affected by this.", "We went the first week in June did not know the pier is under construction to do the work they eliminated some parking I would recommend going during the week to avoid the crowds on the weekend"], ["Reviewed June 8, 2017", 5.0, "Relaxing get away", "We love this place. It's always nice and a relaxing get away from the stress of everyday life. It's a great way to just go and recharge your batteries so you come back refreshed and ready to go. The only thing I don't like is leaving!\nShow less"], ["Reviewed June 7, 2017", 1.0, "Being Rebuilt", "Don't plan a trip this year to see this pier. It's being rebuilt after winter storms severely damaged it."], ["Reviewed June 6, 2017", 3.0, "Closed", "The Pier itself is closed when I was there and probably won't for a while. (They are working on it.) Nevertheless, there are lots of shops and restaurants in the area and still a fun place to go."], ["Reviewed June 5, 2017", 5.0, "Gorgeous beach", "Pismo Beach is one of the most beautiful places I have visited in California. The beaches are gorgeous. This was our second year in a row visiting Pismo Beach. The pier was under construction when we were there at the beginning of May 2017."], ["Reviewed June 4, 2017", 3.0, "Under Construction", "As of June 3rd the entry to the pier is under construction. It is not accessible. The shops and restaurants around the pier are still open, but the construction at the pier and the new inn that is being built next to the pier has made parking a nightmare.\nShow less"], ["Reviewed June 3, 2017", 4.0, "Boardwalk views were great but pier was down", "A little bummed that the pier was inaccessible during our visit. Still, you can see what makes this such a great place to visit. Lots of activity on the beach (sun, surf, volleyball) and even more on the boardwalk. Steps away from a ton of souvenir shops and local eats!\nShow less"], ["Reviewed May 31, 2017", 2.0, "Pismo Pier under construction", "Always difficult to park near the beach, but this year the pier is closed off and under construction. There is a walking pier that goes out over the beach, but the actual pier is off limits. Enjoyed watching the ocean and the surfers, but miss walking out on the pier\nShow less"], ["Reviewed May 25, 2017", 4.0, "Exercise", "I walked from our room along the beach until I reached downtown. Wonderful experience. Windy but it was still nice."], ["Reviewed May 24, 2017", 5.0, "nice.views.seating,", "shopping nearby, lots of it.eateries good. clean beach, beach is wide, paths wide. good prices.good spot for kids to play off shore."], ["Reviewed May 22, 2017", 5.0, "Pier closed - Beach Dog Friendly", "This was the only beach area we have ever been to in California (and we spend a fair amount of time there) where there was a VERY CLEAR INDICATION that dog's were welcome (even provided waste bags). We can't afford to get a ticket for taking our dog on the beach and very few people seem to follow \"the rules\" as far as when and where dogs are allowed. My pup was so happy to finally get his chance to play in the sand.\nAs others have said, the pier itself is closed (\"the goal of the first phase of construction is to have the first diamond of the pier back open by the July Fourth (2017) weekend. The construction is expected to last 30 months,\") The area around the pier looks fun - being early risers nothing was open when we were there. Good tip though - they don't start charging for parking until 10:00 a.m. (weekdays only maybe?) and it was only $1.00/hour anyway. Lots of surfers to watch.\nShow less"], ["Reviewed May 19, 2017", 2.0, "C L O S E D", "No Parking anyway.... the city has too many construction projects going on all at the same time and its not any fun..."], ["Reviewed May 16, 2017", 5.0, "A nice little beach for kids", "The pier and the swingset just off the pier are a great way to let the kids have some fun in Pismo beach."], ["Reviewed May 16, 2017", 3.0, "Pier is closed for repairs. May 2017", "I love piers but there really never has been anything special about the Pismo Pier. However, I always enjoy a good walk up and down the pier. It still offers lovely views of the city and beach. The pier is currently undergoing construction and it appears as if they may be widening the walk which would be wonderful! The pier took a hit earlier in the year and hopefully it becomes operational again soon.\nShow less"], ["Reviewed May 15, 2017", 3.0, "Basic pier", "Right on the beach. No restaurants or other attractions like other piers. But I am assuming is good for fishing."], ["Reviewed May 14, 2017", 3.0, "Under constuction", "We couldn't walk out on the Pier because it is being worked on. Downtown is fun and very busy with lots of little cafes and shops."], ["Reviewed May 12, 2017", 2.0, "Closed March 15, 2017 and due to reopen Fall 2019", "But now we have a refurbished pier to look forward to, right? The city is selling pieces of the pier if you want one. This is mostly a walking, scenic and fishing pier that extends out into the Pacific Ocean. It is the 16th longest pier in California at about 1,200 ft.\nShow less"], ["Reviewed May 11, 2017", 2.0, "Closed for major refurbishment", "We had been looking forward to walking out along the iconic pier, but must have dropped the ball with our research, because on arrival at Pismo Beach, we discovered the pier was closed for a $6 million refurbishment programme. Great that this investment is happening, but be warned, it is going in for two years, we were informed. The problem is that the central area of Pismo Beach is covered in building materials and equipment so it's not just the pier itself that is affected.\nShow less"], ["Reviewed May 3, 2017", 4.0, "Classic Pier and Beach Experience", "The Pier at Pismo is everything you expect it to be and more. The shops and restaurants leading up to the Pier offer beach related apparel and memorabilia, and food. Get the best clam chowder you will ever eat at Splash Cafe, or purchase a hoodie on a windy day designed by local artists. The parking lot and available parking is going to cost you, but the experience is worth it. The sidewalks and public areas are filled with people taking pictures, skaters, family's and a couple of people begging for change. The pier itself has been expanded in recent years and the info booth always has someone with a smile. Walking out on the rustic wooden Pier offers a chance to walk on water, talk to local fishermen, observe surfers catching waves and occasionally a bit of interaction with the wildlife. Walk to the end if your going to walk at all, the view and the panoramic view from the end is always worth the walk, and don't worry you won't fall through the spaces in between the wooden planks... thats a joke from my childhood. If you are able to visit during the holiday's the end of the Pier will have a giant Christmas Tree made of lights that can be seen from miles away. I'm forced to put a specific month that I was there to visit so I will select December because I doubt that is the common month to leave a review, but the truth is I have been to this location many many times, and at all times of the year. I currently live about 6 hours away, but I grew up about 20min from Pismo Beach and the Pier is very familiar to me. I have even jumped off the end of the Pier into the open waters several times over the course of my life, however I do not recommend anyone else do it or indorse jumping off Pier in any form, it's very dangerous so DO NOT JUMP OFF THE END OF THE PIER. OK that's all the Pier beautiful almost year round, so if your in the area or just driving by it's worth stopping and checking it out.\nShow less"], ["Reviewed April 30, 2017", 4.0, "Looked nice, but it was too cold to enjoy the day we were there.", "We enjoyed our quick stop here for the most part with some walking around the shops, out on the pier, and on the sand for a little bit. However, this was just supposed to be resting break on our way to the next town, so we didn't get a chance to stay too long. Everyone was a bit chilly and wanted to get back on the road. We would probably stop by and check it out again if we were in the area, but I don't think we would go out of our way to visit with so many other pretty beaches in the area.\nShow less"], ["Reviewed April 25, 2017", 4.0, "beach lovers", "beach lovers delight. great sunset. childrens swings on the sand. nice walk on the pier. lots of birds and great ocean and cliff views. recommended meutermedia"], ["Reviewed April 25, 2017", 2.0, "Just an ordinary pier", "Currently under repair and reconstruction. Good overview of the village. Fishing and meeting point. But nothing special."], ["Reviewed April 24, 2017", 5.0, "Nice views", "The views of the water and the cliffs are great and there are a ton of stores and restaurants in easy walking distance. It was incredibly windy but worth it."], ["Reviewed April 23, 2017", 5.0, "Great views, beautiful sunsets.", "Nice pier, beautiful on sunny days. Even a nice walk on the foggy, not so nice ones too. Currently closed for repairs."], ["Reviewed April 22, 2017", 2.0, "Pier was closed", "The pier area was quaint but the pier was closed when we there. Also lists of new construction going on in the area. Once everything is fixed up it should really nice."], ["Reviewed April 17, 2017", 2.0, "PISMOPIERNOTTASTIC", "In the past this has been one of my attraction places to go in Pismo, but becuase it is being renovated it will not be for a long time. The way i hear is that it is going to take a couple of years to do?? not good.\nShow less"], ["Reviewed April 16, 2017", 5.0, "great view", "nice view with tons of restaurants around you with great tasting food and smells inexpensive to shop and eat"], ["Reviewed April 16, 2017", 4.0, "Pier is closed for work but the beach walk was pleasant on holiday weekend", "Easter afternoon, breeze was cool but still plenty of people were swimming and surfing. We walked from the pier south for about a mile. Lots of driftwood, people and birds to make it a pleasant, laid back walk.\n\nWe had a dog so we chose not to eat at any of the many restaurants.\n\nThere are pleanty of photos already posted of the type shots I took.\nShow less"], ["Reviewed April 14, 2017", 4.0, "Beach Access and downtown", "Pismo pier is close by to drive from most of the ocean front resorts and you can get in out quickly."], ["Reviewed April 10, 2017", 4.0, "Fabulous view of the bay", "The pier and the walkway along both sides of it is a must for a view of the entire bay. There are nice restaurants and lots of souvenir shops in the area next to the pier. The best clam chowder can be had here!"], ["Reviewed April 9, 2017", 3.0, "Like San Clemente", "This pier and surrounding beach/shop area are just like nostalgic San Clemente. It's a step back in time and fun to walk around."], ["Reviewed April 8, 2017", 4.0, "Fun and food", "Lots of places for meals and sweet treats, great shopping for beachy clothes and souvenirs, good showers and bathrooms, and, of course, Splash Cafe!"], ["Reviewed April 4, 2017", 5.0, "Great Wildlife Viewing", "It is fun to watch the surfers, but the California Sea Otters are an experience you never will forget. Also, the periodic seal lion and dolphin."], ["Reviewed April 4, 2017", 5.0, "Great stop.", "We stopped in Pismo for breakfast on our way to SF and we made time to walk the pier and surrounding areas. Very nice, clean and peaceful place."], ["Reviewed April 2, 2017", 5.0, "The Pier is Closed", "The board walk is nice and we watched them cut some of the pier away. I don't know how much they are replacing, But if the planks in the parking lot is everything then there only doing a section or 2."], ["Reviewed March 30, 2017", 5.0, "Beachgirl", "Great place to take a stroll down the pier than come back to a variety of different foods to choose from"], ["Reviewed March 29, 2017", 2.0, "under construction", "will be nice when done...who knows when? in the meantime lots of construction equipment and supplies. not attractive."], ["Reviewed March 29, 2017", 3.0, "See it now for the original", "The pier is under re-construction and will be totally replaced in 2 years. Now just a reminder of how we used to build! It's already being torn down."], ["Reviewed March 28, 2017", 5.0, "the best views", "Pismo Pier is beautiful. It's almost always breezy, clear skies, views of the dunes all the way to Avila...beautiful white sand beaches...boardwalk! If you have a chance...be sure to stop by...there are stores, bowling alley, billiards, restaurants and...whew! what a better way to spend the day!\nShow less"], ["Reviewed March 26, 2017", 2.0, "Sketchy", "The pier was very sketchy. It was windy and we all felt like we were going to fall into the ocean or something. Glad they are fixing it!"], ["Reviewed March 26, 2017", 5.0, "Lovely pier", "I really enjoyed walking down the pier and the view of the ocean was great. It was also a quiet day when we were there so we were able to enjoy the beach without a big crowd. The weather was cool but sunny when we went so I would definitely recommend going in March if you like that kind of weather.\nShow less"], ["Reviewed March 22, 2017", 3.0, "It is close for refurb", "The pier closed the day we visited piano for a full refurbishment, until 2019 I believe, so be mindful if you plan to visit Pismo."], ["Reviewed March 22, 2017", 5.0, "Great pier", "Awesome pier in the heart of Pismo. Too bad it's closed for the next 2 years for construction!! Nice beach to watch surfers."], ["Reviewed March 20, 2017", 5.0, "Fun Zone", "The pier area has so much to offer for family entertainment. Lots of restaurant choices (for all budgets), bike rentals that allow you to ride down miles of long sandy beaches, fishing, jogging, swimming, shopping, picnics, football or volleyball, the list is only limited to what your willing to do. Let yourself run freely on this beautiful California beach. It has a local feel to it and the people are very friendly. Make sure you stay for the sunset.\n\nInsight: they just closed the pier for repair and remodel in March 2017. A local person told me that it is going to be closed for 2 years (except on 4th of July). Don't let this keep you away.\nShow less"], ["Reviewed March 13, 2017", 5.0, "awesome place", "the pier is fun to fish from and you get a very nice view from it. you can rent fishing poles on the pier too."], ["Reviewed March 13, 2017", 4.0, "I Love a Morning Walk at the Beach!", "I love walking my dog at the beach. The Pismo Pier is a great place to do just that. I go early to beat the crowds. You also eat the heat. You won't be alone - there are lots of people up and about. It's a great way to start your weekend.\nShow less"], ["Reviewed March 10, 2017", 2.0, "Thank Goodness This Is Due For An Upgrade", "The pier is one spooky experience if you can walk it to the end. The planks are wobbly, decayed, loose, and so shaky that you wonder if taking the next step is really a good idea.\n\nIt certainly is a high, long pier and, if you are silly enough to get to the end, the views are pretty great.\nShow less"], ["Reviewed March 9, 2017", 4.0, "About to close for remodel.", "A major site on Pismo Beach and a main access to the water. About to close for refurb. Lots of activities surround the pier"], ["Reviewed March 3, 2017", 5.0, "Pismo Pier is Closing in March 2017", "Love this Pier-but its time for maintenance. Just here on March 1 and there is a sign letting everyone know construction going on -March 9th (I cant remember exactly the date) I hope they make it bigger and better"], ["Reviewed March 1, 2017", 5.0, "great spot for views", "great spot for views of the sunset and surfers turn around and see the beautiful hillsides just a few steps for your favorite eats"], ["Reviewed February 26, 2017", 5.0, "Walk on the pier", "Such a fantastic pier. Been walking on this pier for over 50 years. Great sitting areas to enjoy beautiful sunsets"], ["Reviewed February 21, 2017", 5.0, "A Pier To Remember", "Such an nice pier to walk on. You get to the end and you feel like you are walking on water as it is right below. I love this pier and so do all the other locals and visitors... I heard its going to close for 3 years soon. You better go walk it before that happens, if that is true.\nShow less"], ["Reviewed February 20, 2017", 3.0, "Long wooden pier into the ocean", "This is a long wooden pier. Well constructed and maintained. Pay parking $1/hour. Rest rooms next to parking area. It was a cold, windy, overcast day with high winds. Bundle up. But it's always a pleasure to watch and hear the waves crash, and watch the brave surfers. Nice couple hours. Glad we went.\nShow less"], ["Reviewed February 18, 2017", 2.0, "A Pismo Disappointment", "We found that downtown Pismo is now quite rundown looking. The pier looked fine, however we chose not to walk on the beach as we had previously planned."], ["Reviewed February 16, 2017", 5.0, "Best sunsets in the world and love RICH LOVE resident singer", "We first traveled here in the Summer and that is where we met Rich Love. He sits near the bathrooms in his wheel chair and has a microphone and sings the older songs. If you take the time to talk to him he will tell you about his wife who passed away and show you pictures of her. He sits near the bathrooms so he can stop the homeless people from eating out of the trash cans. He buys out of his limited funds food for the homeless. We first met him when we had way too much food from a local restaurant and didn't touch half of it. We didn't know if he was homeless so we offered it to him. Then we heard his story about how he helps the homeless and he had us give the food to a homeless man that day. When go to Pismo Beach often and take him food and/or money to help him. If you see Rich give him your left overs or buy him a couple of sandwiches or give him a little money to help him help others. The sunsets at this pier are amazing. It is a nice workout walking all the way to the end and back. Views are amazing!\nShow less"], ["Reviewed February 16, 2017", 5.0, "Beautiful pier, beautiful city", "We love Pismo Beach, it is the perfect small town with lots to offer, perfect place to stay the night on your way south down the Pacific Coast Highway. We stayed at the SeaCrest Oceanfront Hotel, just a short walk from the pier with beach access and large rooms with private balconies. Our favorite hotel and town on our way south down the PCH!\nShow less"], ["Reviewed February 8, 2017", 5.0, "Surfers' paradise", "So nice to watch the surfers enjoying the tide. Although it's still winter time, the weather was so warm and pleasant. Walking on the pier was such a delight and relaxation. Lots of restaurants around with very diverse choices. Will come back again."], ["Reviewed February 8, 2017", 5.0, "Wedding", "Very nice pier. watched the surfers for hours! There could be a few more coffee/beverage kiosks closer to the pier, though."], ["Reviewed February 5, 2017", 5.0, "Beautiful Central California Coastline", "Pismo is a really quiet, sleepy little beach town. Good place to get away and relax with friends. There's a lot of small shops and restaurants and a lot of beach."], ["Reviewed February 5, 2017", 3.0, "Pismo Beach Pier", "The pier is all wood, seems old and nice for a walk to the end and turn to enjoy the coastline and surfers. Little activity on our trip."], ["Reviewed February 3, 2017", 5.0, "Must Do InPismo", "I can remember walking on this pier as a kid. My kids and now my grandkids walk on the same pier and it brings back memories of the past. Pismo is our home away from home and I highly recommend a walk on the pier."], ["Reviewed January 30, 2017", 3.0, "Simple old Pier", "Pier is great and worth a stroll down it to see the best of Pismo beach in both directions. Mondays has a local market by the pier selling food and various gifts\n\nPier is a simple wooden affair and apart from the vies of the surfers and the sea, not much to do apart from enough the clean air\nShow less"], ["Reviewed January 30, 2017", 4.0, "Relax and unwind.", "I followed the beach to the Pismo Pier and enjoyed an easy stroll on a sunny day! Watching the surfers catch waves is always fun! They have a small souvenir shop with basic food and drink items. You may fish off the pier too. Shortly after, I found an authentic Mexican restaurant that was great! The pier offers a chance to get over the water for some nice breezes and enjoyable views of the beach.\nShow less"], ["Reviewed January 30, 2017", 5.0, "Beautiful sunset, must visit", "The sunset here is simply stunning, must visit. While there are so many people, the beach is also big, so you don't feel crowded. Parking is really hard to find though."], ["Reviewed January 27, 2017", 5.0, "Beautiful pier and town view", "I like American piers. They offer close contact with the ocean and beautiful town views from them. The Pismo one is just like that with a big parking lot in front of it. We were there for an hour break while driving the iconic CA 1 route.\nIt was great fun walking the pier, watching surfers all around on a clear sunny December day.\nShow less"], ["Reviewed January 25, 2017", 3.0, "Beautiful view", "The pier itself isn't much but you get a better look at the surfers. Farmers market setting up as we left with prepared foods & crafts. There is a good size beach for families & volleyball nets all set up. Lots of little shops up and down the area. Fun\nShow less"], ["Reviewed January 24, 2017", 5.0, "Beach walk!", "Every year, Pismo Beach adds more and more beach walk areas! Fantastic! Built strong and sturdy, you go walk between Arroyo Grande and Pismo Beach either right off the shore line or just slightly inland, taking in the coast, the eucalyptus groves, playgrounds, or the Monarch Butterfly Groves! Lovely at any time of day or in any kind of weather, although you should check the conditions and dress appropriately! Beach walking is a great way to meet new people and commune with nature!\nShow less"], ["Reviewed January 23, 2017", 4.0, "Fun area", "Just off downtown Pismo, the pier and beach area are a great place to go for a walk, especially at low tide..!"], ["Reviewed January 23, 2017", 3.0, "Fun to walk on and gorgeous view", "Nice for pictures and walking. Nothing much to do on the pier but watch surfers and the beautiful water!"], ["Reviewed January 19, 2017", 5.0, "Great peoplewatching", "Take a leisurely stroll down the street; grab some fudge, shop the souvenir stores, and stop and have a drink and watch the sunset. No need to hurry. Relax and enjoy."], ["Reviewed January 18, 2017", 4.0, "A Walk on the Pier", "This is a typical small beach town fishing pier, but is extremely well-kept and very clean. It's a beautiful addition to a lovely walk along the beach, particularly at night when the lights from town glow in the distance.\n\nI would give five stars, but I have one complaint. The boards of the pier have knots that rise and catch the toes of your shoes causing a slight trip. As an older person, that can be disconcerting, particularly at night.\n\nIts a great place to watch the surfers, beachcombers and birds!\nShow less"], ["Reviewed January 18, 2017", 4.0, "Clean, nice photos", "Very clean, sturdy. Was too rainy to get into sea/ beach, but clean sand, beautiful photos possible. Wonderful to just sit and stare at water."], ["Reviewed January 17, 2017", 4.0, "Nice place for sunset and view of surfers and waves. Also nice from the beach.", "Good parking nearby so it was convenient. Nice place to view a sunset and watch surfers and fishermen/women. There is a nice view of the pier from the beach in the morning and includes reflections of the pier."], ["Reviewed January 17, 2017", 4.0, "A Great Walk Enhanced", "Pismo Pier is the iconic image of Pismo Beach, CA, a longtime sandy getaway halfway between Los Angeles and San Francisco. Walk out on the pier and watch surfers; look for sharks; cast a line; take photos; look back at the city (a town, really) nestled up against the hills (where a new hiking trail with fabulous views will open in late 2017). For fun background information see the Amazon/Kindle short-read entitled \"\"Pismo Beach: Hollywood Punchline.'' PS: Am told there's a good new restaurant at the foot of the pier replacing a hamburger joint . . . The Oyster Loft.\nShow less"], ["Reviewed January 16, 2017", 5.0, "I love this wonderful old wooden pier!", "I've walked out to the end of this pier many times. Great for people-watching, amazing sunsets, and watching the surfer dudes catch the waves below you. The pier, along with Pomeroy Street, which is the heart of beach-town life in Pismo. Can you hear the Beach Boys singing \"California Dreamin'\"?\nShow less"], ["Reviewed January 12, 2017", 3.0, "Beautiful California Coastline", "Travelled here by the free shuttle from Shell Beach that runs every 30 mins. Pismo is clean & a delight. If you're driving down the PCH then this place is worth a visit, even if you only stop for an hour or so."], ["Reviewed January 4, 2017", 5.0, "Iconic old pier on the west coast", "This is primarily a fishing pier which has been here for many years! It's at the end of the Main Street in Pismo and is a great place for a stroll any time of day! Lots of pelicans and seagulls, used to humans, make subjects for up-close photos. And there are many shops to explore on the street leading to the pier. We LOVE Pismo!\nShow less"], ["Reviewed January 4, 2017", 5.0, "It's a short walk to the end worth doing", "If you are in Pismo, you have to walk the pier. It's a only a several minute stroll to the end. Great location from which to watch surfers, fisherman, waves and sometimes whales and dolphins. Worth it to note that dogs are not technically allowed (although sometimes seen) on the pier. Flat shoes are recommended. Toward the foot of the pier, there are coin operated telescopes. Toward the middle there is a tack shop that also sells a few snacks and souvenirs.\nShow less"], ["Reviewed January 2, 2017", 5.0, "Great views and a wonderful walk", "So nice to walk the pier out over the surf, watch the fishermen and surfers in the strong waves of this fabulous California coastal beach. We've driven past it a lot, definitely worth the stop."], ["Reviewed December 31, 2016", 5.0, "Great pier & boardwalk", "The pier is very pretty, great place to catch the sunset. There's shops & restaurants at the foot of the pier, but nothing on the pier itself."], ["Reviewed December 30, 2016", 4.0, "Fun Walk", "Always fun to explore an ocean pier. The tide was low, so we even went under it for a few photo opps."], ["Reviewed December 30, 2016", 5.0, "Relaxing", "Went to Pismo Beach with the family to visit friends. We went to the pier and walked it about half way and sat on a bench to enjoy the scenery. I love the ocean and found it very relaxing to sit and just enjoy the...More"], ["Reviewed December 29, 2016", 5.0, "Absolutely beautiful", "If you surf, then this is your paradise. If you enjoy watching surfers then you have a full day of activities."], ["Reviewed December 28, 2016", 4.0, "Surfer watching, leisurely walk", "The pier is beautiful and well maintained. There is a reasonably priced parking attached to the pier. Very close from the downtown. We walked and spent some time on the pier on a sunny December day. Beautifully bluish green water - a lot of surfers...More"], ["Reviewed December 28, 2016", 3.0, "A Pier to watch the surfers.", "Interesting views from the pier. There were a lot of surfers to the north, a few fishermen (there is a rental shop on the pier), and nice vistas of the coastline. No homeless (unlike Santa Monica Pier) Overall. A pleasant walk and nice views."], ["Reviewed December 28, 2016", 4.0, "Nice Pier", "Parking can be a problem but it is a decent pier. Not a lot of activities on the pier but a good place to take a walk and watch the surfers."], ["Reviewed December 27, 2016", 4.0, "Fun quaint town. Lots surfers", "Fun time on pier watching surfers. Kids liked it. Good weather. People in the town are very nice. Felt safe and was clean."], ["Reviewed December 25, 2016", 4.0, "The view worth the visit", "We walk all the way from our hotel to Pismo Pier, we enjoyed the sun while walking and the view worth visiting it to see the whole beach with the mountain."], ["Reviewed December 24, 2016", 5.0, "A Piece of History", "We stayed at the Sandcastle Inn in Pismo Beach recently and were able to experience a bit of history. The pier is very close to the hotel and beckons guests to take a walk a enjoy the views. The original pier was built in the 1880's and the town has seen fit to rebuild it. It is wide and stretches quite a distance into the Pacific Ocean. Since it was week before Christmas is had a large display of lights that was shaped as a Christmas tree. There are no sops or attractions on this pier, but I believe it is worth a visit!\nShow less"], ["Reviewed December 19, 2016", 5.0, "Awesome spot", "What I can say. It's my fifth visit to Pismo which for me is such a wonderful place. And the pier, it's one of its landmarks. Awesome views. Love it."], ["Reviewed December 19, 2016", 3.0, "There's the ocean!", "The pier is a regular pier. I love the Christmas Tree of lights at the end of the pier every holiday season.\n\nCAUTION: Be sure to watch where your walking on the pier. Some of the knots of the wood planks stick up and could cause you to trip.\nShow less"], ["Reviewed December 16, 2016", 2.0, "Average pier", "It is an average pair with no attractions on it. There are nice views of the ocean while walking alone yet. The end was roped off for their Christmas tree."], ["Reviewed December 9, 2016", 3.0, "Fun walk out over the water", "We were just strolling around and enjoyed a trip out onto the pier and back. Lots of seals and birds."], ["Reviewed December 9, 2016", 5.0, "Gotta do it!", "I don't feel like I have been to Pismo unless I go to Splash Cafe, Hoagies, Avila Barn and walk on the Pismo Pier."], ["Reviewed December 2, 2016", 4.0, "Great for all ages", "Brought visiting family here few times. Beach was great, parking is difficult and some places is pay parking. There are some free parking. Was nice to walk and sit on a bench on the pier. Definitely wear tennis shoes or like as high heels etc not recommended as it's bumpy and a bit uneven .\nShow less"], ["Reviewed November 30, 2016", 5.0, "Stretches right into the sea", "Awesome view. The seagulls will visit you here and you can see the surfers riding the waves from the pier. Good spot for photography."], ["Reviewed November 30, 2016", 3.0, "Beautiful sunsets", "A little touristy, typical pier stores. Can't beat the sunsets! Enough places to grab a bite, walk down the pier and enjoy the ocean view."], ["Reviewed November 27, 2016", 5.0, "Great Pier - Day or Night", "I love hanging out on or around this great pier. During the day it is great for watching the surfers, the whales and the fishermen. Great on a beautiful sunny day or a foggy one. I also enjoy watching the beautiful sunsets most evenings. Bring your camera for great sunset shots and shots of the surfer. Pismo Beach is one of my favorite places on the California Coast.\nShow less"], ["Reviewed November 27, 2016", 3.0, "Relaxing", "On our recent trip to the central coast of California we took a walk down Pismo Pier. A nice trip down a pier with fisherpeople along the railing, and lovers, old and young, holding hands or walking arm and arm. Surfers tackling the moderate surf on both sides of the pier was quite a scene.\nShow less"], ["Reviewed November 27, 2016", 4.0, "Very long Pier", "Very long pier in Pismo Beach. Everyone was very friendly. Lots of people fishing. We even got to see some whales far out in the ocean."], ["Reviewed November 20, 2016", 4.0, "Lovely", "Great old fashioned pier with ppl fishing off the end. No restaurants like Santa Barbara & other places - just a nice old fashioned pier with great views each way and surfers to watch."], ["Reviewed November 19, 2016", 5.0, "Great way to start the day", "Beautiful views, nice people, lots of great shops to explore, and eateries, sample the many crafted beers and wines with lunch. Walk lunch off on the beach, Take dogger with you as there are plenty of places with outside seating. This is a leash only beach so be considerate or hire one of many ways to explore the beach. You can drive on the beach, you can walk on the beach, you can look for shells or make castles or just lie back and read a book. It was in the 70's in Nov and we are from AZ and it was not too cold except one day we got fogged in most of the day which was the first time in years and rather mysteriously good fun.\nShow less"], ["Reviewed November 18, 2016", 5.0, "Fun in the sun", "Great place to send a day walking around while enjoying the stores and the food. The view is amazing God is good and His handy work is evident. And the people are nice."], ["Reviewed November 18, 2016", 4.0, "Surfers and a Pelican", "We enjoyed this off-season walk on the pier in Pismo Beach. We tried once before, during the summer, and could not find a place to park anywhere near the pier. In November, when all the local kids are in school, is a perfect time to walk the pier. It was quite windy on the pier. We enjoyed a few surfers trying to find the right waves and laughed at a big pelican being photographed by tourists.\nShow less"], ["Reviewed November 18, 2016", 4.0, "nice uncommericalised pier", "We had a lovely morning walk on the pier in glorious sunshine. It really felt like we were in the California beach you see in movies. Loved to see that the local authorities were making a great effort to keep the area clean and family friendly\nShow less"], ["Reviewed November 15, 2016", 4.0, "It was a beautiful weekend in Pismo", "We come to Pismo Beach a few times a year and this past weekend was beautiful. 11-10-16 through 11-13-16. We walk up and down the street. We go through all the store's and shops. But our trip isn't complete until we take a walk out onto the Pier. We mingled with the fishermen out there and other people doing the same thing I'm doing. Just relaxing and enjoying the da5.\nShow less"], ["Reviewed November 13, 2016", 5.0, "Sunset", "Watched the sunset here. It was awesome. The photos speak for themselves so I will say no more......."], ["Reviewed November 11, 2016", 5.0, "Fun!", "Get out of your car and walk this pier. It's lovely and the views are terrific. Then grab a coffee, find a sweet place to perch and just watch the people and the views go by. A pleasurable experience."], ["Reviewed November 11, 2016", 3.0, "Not an Awesome Pier to Walk On", "This pier has seen better days. A lot of the boards need to be replaced, and they could be a lot more even... like the nearby boardwalk. Even in shoes, it hurt my legs.\n\nThe view is great, but I would not come out here just for that.\nShow less"], ["Reviewed November 9, 2016", 4.0, "Really nice place to walk", "This pier is aged but still a great place to visit. The rolling boards actually massage your feet for a pleasant stroll. You can see the waves really well from here...worth a visit."], ["Reviewed November 3, 2016", 5.0, "Awesome Pier to walk on", "Love going to Pismo Beach, the Pier is different then when I was in high school and lived in the area, but still a fantastic place to be. It is a great view of the water, surfers and more."], ["Reviewed November 3, 2016", 5.0, "Love this pier.....it offers a nice long stroll.", "This pier is long enough to offer a good walk. It also has a little shack for fishermen and litttle keepsakes. Benches have been added as well a nice added walk way in front of th new restaurant."], ["Reviewed November 3, 2016", 5.0, "Chillin' on the coast!", "A great spot to take in the local atmosphere & surf culture on a sunny day. Enjoy a peaceful stroll along a well-maintained pier stoppi g to watch the board-riders & fishermen along the way. Charming!"], ["Reviewed November 3, 2016", 4.0, "Nice to walk along", "Good views off the edge of the pier. Nice to walk along the beach and to go in to the town. Not loads to do but a nice view."], ["Reviewed November 2, 2016", 4.0, "Pismo Pier", "Nice to be able to drive almost to the beach with very access onto the sands. Some decent restaurants on the front. Not stylish but more than adequate."], ["Reviewed November 1, 2016", 4.0, "Lovely quaint pier", "Old fashion southern California pier. Great for watching surfers and people. Nice convenient walk and parking."], ["Reviewed November 1, 2016", 4.0, "Pismo in October", "Great place to watch the sunset! the nearby terrace was a great place for a drink, we also waked along the beach which was really clean."], ["Reviewed October 29, 2016", 5.0, "Wonderful stroll along the pier with stunning views and good views of the surfers", "Lovely pier walk. gorgeous views, great for watching the surfers. Free parking on front until about 10am. Lovely beach area and the town had a lovely atmosphere."], ["Reviewed October 28, 2016", 2.0, "It's a pier!", "It's a pier! Nothing more, nothing less. You can buy overpriced tat and rent a fishing rod. End of review!"], ["Reviewed October 28, 2016", 5.0, "Chill and Beautiful", "Pier and boardwalk are never too crowed. Great stroll down the pier to look at the ocean and people watch. Pier is close to everything around Pismo. Great eats close by. It is a must to do while in Pismo!"], ["Reviewed October 26, 2016", 4.0, "Fun and easy stop for the beach", "We had a quick stop here for dinner on our drive between SLO and Santa Barbara. We walked to the pier and down to the beach to enjoy the view. There are lots of shops and restaurants nearby. The beach was clean and easy to access. There were also showers to rinse off afterward which was nice.\nShow less"], ["Reviewed October 26, 2016", 3.0, "Beautiful Views of the Ocean and Surfers", "I love walking the Pier and looking at the Ocean, the Surfers, the people and kids on the beach and in the water. Dogs also were on leashes and off on the beach. Not too sure I liked that idea! Fun to watch though. You can actually walk to the end of the Pier and be walking with the ocean underneath you. I LIKE TO FIND A BENCH AND AND WATCH THE SURF . The waves breaking are mezmerising. It is very meditative. It made me want to just look and pray. Gorgeous place to veg out! It is the longest Pier in Ca.\nShow less"], ["Reviewed October 22, 2016", 4.0, "Nice walk", "Wandered down the pier before setting off to LA. A lovely day, lots of surfers in the water waiting for a wave. Very picturesque."], ["Reviewed October 22, 2016", 3.0, "Just a pier", "Nothing exceptional. Just a pier overlooking the ocean. Always fun to watch the surfers, but nothing special. wDon't go out of your way for this one."], ["Reviewed October 21, 2016", 5.0, "Best whale watching!!!", "We did a whale watching cruise in Monterey, it's was nothing compared to the beauty and frequency of the whales, seals, otters and dolphins see here."], ["Reviewed October 20, 2016", 5.0, "Pismo Pier", "Always delightful to walk on the pier...we lucked out and the farmers market set up...wonderful fruit..."], ["Reviewed October 18, 2016", 4.0, "California sunshine and beach", "Nice stroll down the peer and then under the peer. A walk along the town to some local shops was a nice relaxing day."], ["Reviewed October 18, 2016", 3.0, "Nice for a walk", "Nice for walking or fishing. There is only one small bait shop on the pier, everything else in on shore."]]}}