{"Point Lobos": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Point Lobos", "url": "/Attraction_Review-g32172-d102545-Reviews-Point_Lobos-Carmel_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/12/ed/a6/view-of-the-bluffs-from.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "3981"}, "address": {"@type": "PostalAddress", "streetAddress": "Carmel-By-The-Sea", "addressLocality": "Carmel", "addressRegion": "California", "postalCode": "93923", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Beautiful nature preserve south of Carmel", "Lots to see here, with very knowledgeable docents.\n\nFrom the Point Lobos Foundation web site:\nPoint Lobos is a natural reserve, not a park, and afforded the highest level of statewide protection. The purpose of a reserve is to forever protect an area of unique natural beauty and ecological significance.\n\nThis is a magic place just south of Carmel. There are several self guided and guided walks available. I recommend one that starts at Whalers Cabin. It’s not offered every day. There’s a link to a schedule at the Point Lobos Foundation website.\n\nHints:\nParking is at a premium on weekends and during summer breaks. You can park alongside Hwy 1 but to park inside the preserve plan to arrive before 9:00 am or you’ll probably have up to a mile walk. Off season midweeks shouldn’t be a problem.\nDress warmly in layers. Depending where you are it can be warm or downright chilly!\nShow less"], ["Reviewed 2 days ago", 5.0, "Fantastic hiking area and views; best in all of CA", "We spent most of a day here on the various hikes; arriving right after they opened at 8am; be sure to come early, as the parking lots are very small and fill up quickly; by 10am they had closed the lots and people had to hike in from the road which is a long distance! The views were amazig; saw whales off shore and sea lions on the rocks below; tide pools were filled with sea life also; but walking along the shoreline was spectacular! We hiked at several parks and this one was by far the best!\nShow less"], ["Reviewed 2 days ago", 5.0, "Trail Repairs and a Great Otter Sighting", "Point Lobos is always spectacular and one of our all time favorite places to hike. This trip we were impressed to see the long stretches of new trail surfaced with decomposed granite and appearing to be wheel-friendly (walkers, strollers, etc.). We also saw a large sea otter no more than 50 feet from shore. Through our binoculars, we could see the individual strands of kelp it was chewing and watch it fluffing up its fur!\nShow less"], ["Reviewed 3 days ago", 5.0, "Beautiful Hikes!!!", "We 'found' this place as we made our way down the California coast and this stop was well worth it. The volunteers there made us feel so welcomed, provided binoculars and directions and we did two short hikes, both absolutely beautiful! We saw sea lions, otters, whales out in the distance, crashing waves, and a beautiful forest. The pathways are easy to walk and easy to find. Washrooms were available, too. Well worth the cost of admission and well worth the time!\nShow less"], ["Reviewed 4 days ago", 5.0, "One of the most scenic coastline in all of California", "In my opinion, Point Lobos has got to be one of the most scenic coastline in all of California.\n\nThere are all different terrains of coastal wonders.\n\nThere is jagged promontory at Pinnacle Cove. It is such a popular photograph spot that College photography school come to this place as a class project.\n\nYou keep walking on the cypress grove trail past the Pinnacle Cove, you would reach the mystique Cypress Cove, it resembles a movie set from Peter Pan.\n\nIf you go to the other side onto Sea Lion Trail, you can often see sea lions waddling in the water. The steps down to the beach is steep , care should be taken with younger children.\n\nThere are cormorants nested on the cliff edges. Their throats can be spotted to turn bright blue during mating season to attract opposite sex.\n\nChina Cove looks more like a Carribean soft sand beach . The cove provides shelter to form jade green calm water .\nShow less"], ["Reviewed 4 days ago", 5.0, "very scenic park", "You need to come early or you will not be able to get in due to limited parking. I paid ten dollars to get in. I would suggest skipping the first and only right turn to drive over to the main section to get a parking space. This place has both beautiful landscape and wildlife. You can see seal lions, brids and harbor seals. Be sure to wear sturdy walking shoes as you will deal with uneven, rocky surfaces. Wear layers as you can get cold in the shade and hot in the sun.\nShow less"], ["Reviewed 5 days ago", 5.0, "A Carmel Gem!", "We started our day here at 9 am and I recommend spending the full day here. We paid the pittance price to park inside to support the reserve. There are several small lots, but only 150 cars are allowed in at a time. Park at the first lot at the tip of the point. You can get free use of binoculars if you give the docent your car keys (which of course you get back when you return them) but we donated $10 for the service. Highly recommended you have binoculars. Also buy a map for $2. Lots of good info and all the trails are indicated. We hiked the full trail around the reserve for about 7 miles and took several side trails as well. But that was an all day affair with several stops to just sit and watch. We are in our upper 60s so it is all very walkable. We saw a mama otter with her baby, a few whale spouts, harbor seals in several places, and tons of birds. But the waves and the rock formations were just as mesmerizing. Also a wonderful museum at the whaler's cabin. Dress in layers as the wind can be strong on the north trails and almost hot on the south. Wear sturdy walking shoes. Bring a picnic lunch as ther are no concessions. (But nice flush toilets!) PLEASE be respectful of the signs and stay on the trails! We are so glad we spent the day here. It is a gem.\nShow less"], ["Reviewed 1 week ago", 5.0, "Gorgeous and Sacred Wildlife Sanctuary", "This place is amazing. I've been going here for over 25 years and it never fails to astound me, you get birds, an incredible view, the ocean swirling below you, trails that are perfectly maintained and the view feels like you're in heaven. Don't miss it!\nShow less"], ["Reviewed 1 week ago", 5.0, "Gorgeous!", "Such a lovely place to walk around; get there early so you can park up in the park! Great chance for photographs."], ["Reviewed 1 week ago", 5.0, "Breathtaking", "You need to go here!!!! We saw many harbor seals and sea otters basking in the sun. It was one beautiful turn after another."], ["Reviewed 2 weeks ago", 5.0, "Beautiful park", "Well maintained park and well staffed. Trails are well marked and well taken care of. Wonderful view and great pictures. Liked the ability to get down by the water in some of the areas."], ["Reviewed 2 weeks ago", 5.0, "Magnificent views of Monterey Bay, the various rock formations, trees and scenery!", "Two friends took us here recently and we were so glad they did. We walked over 7 miles and took so many photos of the scenery! Some of the areas were steep and one must be careful, but it is worth that. It was a perfectly clear day and we could see up to Pebble Beach, including the field of yellow flowers!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning coastal walk", "We walked on the coastal trails from one end to the other. Stunning views, in addition to observing sea lions, harbor seals, whale spouts in the distance and even 2 sea otters floating in the kelp! A Park docent was walking around with a nice telescope for passersby to see the animals up close and was very interesting to talk with. Try to go early on a weekday as parking is limited. Highly recommended!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Narnia by the sea", "Amazing place to walk around, scuba dive and drive around the park. I suggest people to go for a walk but make sure to have time. If visiting point Lobos as a relatively quick stop by on the way south/north, it is better to drive within the park. Car access is just few bucks\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stunning scenery - must visit if you're in the area.", "I was visiting Monterey for the day and I only had an hour to spend around the Reserve which was a shame.\nThe views were stunning. A must visit if you are in the area.\nThere were many staff / volunteers around the trail and they were very kind and proactive in sharing what animals are around the area.\nHighly recommended!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The most beautiful ocean-front park I have ever experienced!", "Get there early to avoid the crowds and find a place to park. A simple hike in leads you straight to the beach, with trails to walk. Miles of coastal views and lots of wildlife in the water. AMAZING!"], ["Reviewed 3 weeks ago", 5.0, "Latest visit", "Do not miss this in your trip to Carmel. Great trails along protected coastal area. Great views and even saw some whales spouting!"], ["Reviewed 3 weeks ago", 4.0, "Nice hike", "This was a hike I really enjoyed. It was easy with rarely any elevation and great views of the water. We saw a lot of seals which was a pleasant surprise!"], ["Reviewed 3 weeks ago", 5.0, "Great stroll through nature", "This is a gorgeous natural setting to experience if you're ever in the area or even driving past. Well worth the stop to walk through experiencing the coast, the forest and the amazing animals that walk right beside you. We got to experience a group of dear, rabbits, and gorgeous birds throughout our walk.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "GORGEOUS, ASTOUNDING PLACE!", "Point Lobos State Natural Reserve is truly a special place on our fragile earth. You can walk with stunning ocean and forest views, see whales, sea lions, harbor seals, otters, many land animals, as well a 80,000,000 years of geology! Tread lightly."], ["Reviewed 4 weeks ago", 5.0, "Very nice. Plenty of different trails. Great Scenery", "The lot was full (as we expected) but we found a great spot on the highway just outside the gate. As soon as we walked in, there was a group of volunteers giving good advice, answering questions, and recommending routes. We ended up doing about 5 miles. Some of the review said it was flat, but we found some stairs.\n\nWe saw whales and sea lions along with assorted birds.\n\nTake the trails near the shore for the best views.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Stay for the docent tour", "We visited Point Lobos on a whim and were glad we did! Stunning scenery and loads of wildlife to see. We caught several bird species, dolphins and seals. We caught a docent tour, which is run by volunteers and free! That gave us the history of the area and insider information about the flora and fauna. Our guide was very knowledgeable and enthusiastic about this special place in the world. Be sure to have cash on hand to donate to the organization that runs the reserve.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Absolutely Amazing, Can't Wait to Go Back", "My friend and I hiked the 7.1 Point Lobos loop and it vastly exceeded our expectations. During our hike we saw humpback whales, otters, and seals. The staff in the park was very friendly and helpful. The views were amazing. It would be nice if it were not so crowded / there was more parking, but those were minor compared to how great a hike it was.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great seashore views and hikes", "I absolutely love this place. Great sea and ocean views; nice trails and hiking paths. Pack a lunch and stay awhile. Awesome almost any time of the year. In the winter the waves can be huge so be careful not to go close by on the rocks. Great for photography and a nice outing. Get here early to part in the park.\nShow less"], ["Reviewed January 24, 2018", 5.0, "This is a great Park", "Fee to get in but it is worth it. Hikes are relatively flat and views are spectacular!! WE saw many whales from the point as they were migrating. Coast is just breathtaking here. Good parking nice trails, interesting volunteer info."], ["Reviewed January 23, 2018", 5.0, "Our favorite state park!", "If you like the coast you'll love Point Lobos. Ranks right up there with Yosemite Valley in stunning views. Breathtaking!"], ["Reviewed January 23, 2018", 5.0, "My favorite hiking and photography spots in the bay area.", "I live in the bay area for the last 25 years and I have been here numerous times, this is a little Gem awesome hikes and photo opportunities. On weekend gets really busy so come early cause parking gets really full."], ["Reviewed January 22, 2018", 4.0, "Beautiful walks and views", "Well worth a visit and walk and see the sea lions and dolphins but park outside and walk in so you don’t have to pay the $10"], ["Reviewed January 22, 2018", 1.0, "No dogs allowed - save the trips if your puppy is with you☹️", "This is a wild life preserve so no dogs allowed. We didn't know that and made the trip twice- first time parking lot full second time found out you couldn't bring dogs."], ["Reviewed January 21, 2018", 5.0, "Must Do when in Carmel", "Absolutely gorgeous scenery. Lots of small easy hikes. Well worth the $10 to pay to get in and $2 for a map. Bring layers and a full camera battery!!!"], ["Reviewed January 21, 2018", 3.0, "No Dogs Allowed at Point Lobos", "Could not visit Point Lobos it appears Dogs on leash are no longer allowed in the reserve or even to stay in your car while you go for a walk. Very disapointing news to discover on a beautiful winter day"], ["Reviewed January 21, 2018", 5.0, "Do not miss", "Astoundingly beautiful. The waves were high when we visited yesterday, breaking against the rocks spectacularly."], ["Reviewed January 20, 2018", 5.0, "Beautiful!", "Get there early to find a parking spot and avoid crowds. A nice walk/hike along the shoreline. We saw a mama seal giving birth. Great experience."], ["Reviewed January 19, 2018", 4.0, "cool location and view of the ocean", "i highly recommend visiting here when the elephant seal pups are out. we did see some seals during our visit but nowhere as many as we would have had we arranged to do the tour to see the nursery. be sure to make reservations"], ["Reviewed January 16, 2018", 5.0, "Beautiful hikes and photos", "We were fortunate to visit on a sunny, warm day. We spent 4 fabulous hours hiking and photographing the beautiful area. It was a wonderful day. We got great fresh air and exercise and some fabulous photos too. This was far more enjoyable and scenic than many other nearby area we visited. It gets crowded quickly so we were glad we went early.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Drive along Route 1", "What a wonderful park to visit. Lots of walking trails with fabulous views. Do go early, parking fills up later in the day, however you can park on the road and walk in. There are many different walks along the cliffs. You can drive through the park to go to different destinations, which have a variety of birds and sea animals.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Spectacular Views!", "Point Lobos State Reserve is the perfect place to get some exercise while enjoying beautiful views. As a 15 year old, I thoroughly enjoyed my time on the trails. Though parking is hard to come by inside the park it is free to park on the road. I recommend road parking as it only adds a couple hundred feet to your total distance and you won’t have to pay $10 to park inside the Reserve. The trails are easy to follow and accessible for all ages. There are many different trails to choose from for all different ages, experiences, and desires. The views are incredible and the water varies in unique shades of blue. All the park rangers are nice, helpful and obviously care about their work. Overall great environment to go hiking and if you have time and want to get some exercise, I would highly recommend hitting these trails.\nShow less"], ["Reviewed January 14, 2018", 5.0, "beautiful, simple hikes", "such an amazing place. Go early and beat the crowds. Docents are wonderful. If I lived close, a morning hike every day would be in order."], ["Reviewed January 14, 2018", 5.0, "Must See!", "We walked the entire outer trail. I highly recommend this for anyone in the area. It is absolutely beautiful and we even saw some whales in the distance. I would say only parts of it are small children or stroller friendly."], ["Reviewed January 13, 2018", 4.0, "Autumn walking along the coast", "We arrived early, before the park filled up, paid our entry and parked at the southern car park. We enjoyed the full park walking route, through the wooded areas first across to the whaling station, and back along the coastal path. We enjoyed watching the birds, otters and seals.\nWalking shoes or boots would be recommended. The park does ‘fill up’ during busy weekends and holiday periods, when this happens cars park alongside the highway.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Worth a visit", "This park includes icon California views of the ocean and cliffs not to be missed. We parked in the lower section, close to the ocean, allowing us to hike the loop around the point easily. The whole circuit is maybe 5 miles back and forth. If you want to take it all in budget 3-4 hours. Comfortable shoes with grip are a must, flip flops or berkys will not get you far.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Gorgeous!", "What a beautiful place to hike!!The trails are great and well kept. The views are breathtaking! My son is 8 and athletic so he did not tire. Child has to be a good listener since some spots are high up and close to edge."], ["Reviewed January 11, 2018", 2.0, "Overcrowded and regulated", "On a coast of beauty you come to Point Lobos State Reserve. A biologist friend said it was a must stop (he lived near here 20 years ago.) So we did and frankly... it was a disappointment. The facility was full so we parked out along the highway (which was mayaham) and walked into the park. At the park entrance we met two State officials - one was nice and one was downright rude to my children. She obviously felt that children have no place on a reserve. Anyhow we walked on a boardwalk (almost in a procession of folk) through a decadent forest (which looks like a death trap should a wildfire ever ignite.) when you get to the water the trails are so roped off (to stop erosion due to the number of people) your chance to watch / participate with nature is virtually zero.\nThen comes the fact that you can only eat in designated picnic spots (gleefully espoused by the bureaucratic person when we arrived.) The picnic spots (of which there are two are on the opposite end of the park. So we walked back out (past hordes of screaming kids and selfie snapping self-absorbed yuppies) and drove down the coast and pulled off and had a great picnic.\nStopping at this park in the high season is a waste of time.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Beautiful place to hike", "Love going for walks here. The scenery is just breathtaking. This place is very popular with locals and tourists, so get there early for parking."], ["Reviewed January 8, 2018", 5.0, "Great Hiking and Magnificent Views", "Ten bucks a carload to drive into this oceanfront State Park. You may to drive around to find parking but the views and unique alcoves hugging the Pacific promises amazing photo opportunities. A must see for outdoor lovers. Stunning."], ["Reviewed January 6, 2018", 5.0, "OMG, YOU HAVE TO GO HERE!", "Absolutely stunning coastline vistas. You will take a million pictures and they'll all be fantastic! Go early in the day while there's still parking!"], ["Reviewed January 6, 2018", 5.0, "Breathtaking", "One of the most breathtaking hikes I've ever been on. The nature walk along this magical coastal beauty was beyond spectacular. Friends of ours mentioned how beautiful it was, and were surprised that as hike and nature enthusiasts we had never been here before.\n\nThe efforts by park rangers and volunteers to preserve this precious land is admirable. The rules are relatively strict - no snacking on the trail, no picking up sticks and so on, but it makes sense. This precious land and ecosystem ought to be untouched for many generations to enjoy.\n\nThe wildlife is so precious here. We saw sea otters, hundreds of them, and sea lions, and whales, not to mention the various species of birds. There's even a little museum where you can read about the history, see actual whale bones, and learn more about the habitat.\n\nA relatively easy hike, so perfect for children and families, although some points are incredibly romantic with a bench over a lookout, and an almost complete 360 view. I could get lost here for days, but even a few hours suffice to build magical memories.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Breathtaking.", "The entire Point Lobos State Reserve is stunning. The views are amazing, the water ever so green and blue, the sky blue and bright. It is just beautiful. If you are in the area you really should visit, even if just for an hour, but I would spend the day.\n\nThe trails are pretty easy and there are areas that are accessible with a walker. There are restrooms and a visitor center. Pack a lunch and enjoy. There are miles and miles to walk and it is just magical.\n\nYou can take your bikes if you are so inclined and spend the day biking the area. You will need a car to park and if you bike on Route 1 be careful of drivers.\n\nThe area is also known for scuba diving and snorkeling. Scuba and free diving reservations can be made for Point Lobos State Reserve. Be mindful that the water is cold. You will need your wet suit. Reservations can be made in advance, as far out as the current month plus two months.\n\nNote that the State Parks does not rent any kayaks, stand up paddleboards, or dive equipment to park visitors. There are a variety of shops that rent gear to the public in Monterey.\n\nSnorkeling reservations are made in the same way as dive reservations. All snorkelers need a buddy in order to enter the water, but you must know this. If you come across dolphins etc. please leave them be. They do not want to be touched.\n\nThere have been some terrible weather, fires, landslides and such in this area as of late so call ahead and make sure the area is open. I know it is as I type.\n\nCalifornia State Parks advises visitors that it may close Point Lobos State Natural Reserve during and after storms. Closing the reserve will protect visitors and allow State Parks time to assess damage within the Reserve.\n\nThere is so much to do here and you will be so happy you came.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Best place. Hands down.", "We return to this place with deep nostalgia every time we are visiting the area. You must not miss this park. The views are absolutely fenomenal. Extensive walking tour takes around 90min but you can shorten it if needed. No need for any special footware, but make sure it is fairly comfortable. Do bring a camera and selfie stick. Photos are breathtaking. Highly recommend!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Do not miss!", "Breathtaking scenery and views. This is a great place for everyone to spend at least 2 hours but one could easily spend a day! I'd consider the trails to be more walking than \"hiking\" and even saw visitors with walkers enjoying the views.\nIt would be a great idea to pack a lunch and spend a day exploring. There are restrooms and a little visitor center. Tours and guided walks are available as well.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Randy G", "Great trails and views. Close by and not very crowded. Plenty of spots to just just stop and be amazed! Very limited parking in the park"], ["Reviewed January 2, 2018", 5.0, "Superb vistas, limited access", "We've toured the park twice, once via car and a second time by bicycle. Either way you'll end up parking your vehicle somewhere and hiking to see the most impressive views. Getting to the park by bike is a bit sketchy, Highway 1 is the only access and it is a high speed road with very little shoulder. Once you've made it to the park, being on bike is much nicer. Both times we were there was very limited car parking, and for some of the lots, people waiting in cars for a space to open up. But that's the worst of the inconvenience, and this is a special place...\nShow less"], ["Reviewed January 1, 2018", 5.0, "Seals and birds", "If you are in the Carmel area be sure to stop at Point Lobos State Reserve and take a hike. The ocean's waves are beautiful to see pounding on the rocks and don't miss all the birds flying about and diving in the ocean. The trail at the north end of the park through the trees is not to be missed--beautiful!\nShow less"], ["Reviewed January 1, 2018", 5.0, "Scenic place!!!", "It is absolutely must to see place in Monterey. The whale's museum, scenic views, marine wild life that what you find in Point Lobos."], ["Reviewed January 1, 2018", 5.0, "Beautiful forest and coastline", "Took a hike here on the eve of 2018. Was blessed by great weather and good light for photos. Saw lots of marine mammals - particularly harbour seals. Lots of birds and beautiful coastline."], ["Reviewed December 31, 2017", 4.0, "Point Lobos", "Beautiful; day and drive., Exceptional. Nearby areas also lovely and exceptional. Visit to Carmel,nearby, essential"], ["Reviewed December 30, 2017", 3.0, "Love this place but don't try to visit over Christmas break", "I absolutely love Point Lobos but sadly during our 3 day stay over Christmas we couldn't get near the place. The traffic was very heavy all the way from Carmel and when we got near we noticed cars parked all along the road leading up to the gate. The car park was full both days we tried. Such a shame.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Best place to hike and view wildlife in the area", "If you are looking for a great outdoor experience along the Northern California coast, this is the place to go. You can see birds, whales, otters, seal lions, seals, tide pools and more. Beautiful views of the ocean and the rugged coastline. Also great walks through the woods. Take the family and your camera for a great time.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great Hike", "Easy hikes but amazing views! Arrive early and get parking near the entrance. If not you may have a long walk from parking spots on Highway 1. Well worth the trip!"], ["Reviewed December 28, 2017", 5.0, "Family visit", "We loved Point Lobos. We did the whole loop. It took about 5 hours with lots of stops and looking. We had great weather."], ["Reviewed December 28, 2017", 5.0, "Do not miss this, You can often see otters!", "Wonderful park, incredible views and trails, lots of history and information if you go on a guided hike. Worth the stop for sure! Come here almost every time I am in the area."], ["Reviewed December 27, 2017", 5.0, "try to visit on a weekday, as it can get very crowded", "Very crowded on xmas day, not unexpected, and parking lots were full, Try to hike to China Cove a beautiful beach."], ["Reviewed December 26, 2017", 5.0, "A great pit stop outside of Carmel", "Had been to Carmel/Big Sur several times, but had not stopped Point Lobos. It's a wonderful small hike with several trails and spectacular view. We spent about an hour here walking around, taking pictures and enjoying the outdoors."], ["Reviewed December 25, 2017", 5.0, "Best state park hands down", "The most gorgeous state park I have ever seen. The coastal trails are fantastic — the northern one is almost dreamy. Don’t omit the in-land trails. They are unique and refreshing."], ["Reviewed December 24, 2017", 5.0, "Amazing", "I admit I am biased. I am a volunteer docent here. This is one of the most beautiful spots in the world and for $10 you can bring in a carload, or park ouside and walk in for free. Hike the trails or just look at the scenery. It is truly a gem.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Nature's treasure box....a glorious place to discover.", "Point Lobos is simply heaven - just a magnificent wonder with a fabulous set up to make it super accessible and enjoyable for visitors. The docents and guides are all SO helpful and lovely - they offer tips and stories...and the Whaler's Cabin Museum is such a gem - don't miss it! I can't wait to go back and visit again.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Beautiful piece of California coast", "Point Lobos has a series of lovely walks along the coast. None of the walks are very testing - its all relatively flat. One nice thing was there were a series of volunteers who were giving information about the wildlife. They set up a telescope and pointed out wild otters bathing in water below the cliff - a real treat. It was rainy on the day we visited but still beautiful. If it is sunny I can imagine spending a long time there.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Beautiful state park", "Point Lobos is stunning. It is less of a hike and more of a stroll along the gorgeous California coastline. You can park at the top of the park and walk the various paths, or you can drive from vista to vista within the park. I would recommend paying $2 for a brochure at the entry gate. It has interesting tidbits about the park and it’s wildlife, along with a useful map. Enjoy!!!\nShow less"], ["Reviewed December 16, 2017", 5.0, "Walking the 7 mile loop!-Pros and Cons", "We set aside a whole day to explore Point Lobos and to walk the 7 mile loop. Much of it can be driven to but taking the trail all throughout the park was...immersive...in a way that I just can't imagine being experienced the same way from the car. We packed a light picnic, a good amount of water and had a terrific time.We started the loop trail at the Whalers Cabin and picnicked at the half way point.\nPros- A really easy walk. You could call it a hike but it was all very easy, mostly flat and level terrain. You really get to see so much \"wow...would you look a that!\" kind of scenery. There are so many vistas and points where you just need to stop and let it all sink in.\nCons- I can only think of a few, but there are trails like this that make it very hard to come up with any cons...this is one of them. It is clean, well maintained (the bathrooms were the cleanest we had seen in some time!) Some may say the admission charge is one but we felt that $10 for such a day was a bargain!\nBottom Line- If you are on a trip to the area you really must try and carve out some time to visit BUT if you can take the time and make the walk (7 miles in all) that is definitely the way to go.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Well Worth A Visit", "Point Lobos State Reserve is a great location to see wild life. With over 200 species of birds, mammals and ocean life this small park is a hidden gem.\nOcean life includes but is not limited to sea otters, seals, sea lions and whales including humpbacks, grays whales, blue whales and killer whales.\nThere is also a lot of history to be learnt including native American inhabitants, Portuguese whalers, Chinese fishermen and coal mining. Several movies have also been filmed at this location. Hours are 8am to 5 pm $10 per car $9 for seniors.\nShow less"], ["Reviewed December 11, 2017", 5.0, "One of California's Coastal Treasures, And the Walking is Easy", "My wife and I have been visiting Point Lobos more or less every year for 3 decades. It boasts spectacular coastline views, waves crashing over giant rocks right in front of you, tide pools containing crabs, sea stars, sea urchins, and other aquatic life, windblown trees, sea lions and otters. The place is magic and beautiful whether its sunny or cloudy (though we prefer it sunny). The walking is mostly flat and easy to the south with more hills to climb to the north. But the hills are not that steep. For those who can't walk much, you can simply park and walk a few hundred feet and just take in the view. There are friendly and knowledgeable docents there to answer your questions. There are also a modest number of picnic spots. There's scuba diving there, too, if that's what your into, but I don't know what kind of permits or reservations are needed. And it's only a 10-15 minute drive from Carmel on Highway 1 before it gets windy. If you like the outdoors at all, go here. If you go on a weekend, parking can be a bit of a challenge. Get there early or be prepared to park along Highway 1 and walk in (we've done both many times). Parking is usually easier for weekday visits.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Fantastic Hiking", "Well maintained trails, fantastic views. We hiked one morning and loved it so much that we returned in the evening to watch the sunset."], ["Reviewed December 10, 2017", 5.0, "Amazing scwnery", "Point Lobos is a must-see for anyone visiting Carmel/Monterey. There’s a great walking trail that’s easy for all ages and features fantastic scenery."], ["Reviewed December 8, 2017", 5.0, "Beautiful", "This park was amazing. Stunning views, great walking trails and tons of wildlife. We even saw whales from shore! Absolute must see in the area"], ["Reviewed December 8, 2017", 5.0, "Stunning scenery and blissful setting. Highly recommended.", "A jewel of the California state park system. Try to be there for sunset as the setting is just stunning. You will experience marine mammals and various deer. Highly recommended on any visit to the Monterey Peninsula."], ["Reviewed December 8, 2017", 5.0, "Must stop between Carmel and Big Sur", "This smaller park affords gently sloped paths through cypress trees and views of sea lions, otters and seals."], ["Reviewed December 5, 2017", 5.0, "wonderful state park", "Walking through the park and taking in the sights is a delight to the senses. Easy access. Lots of places to park and walk. You might even see dolphins. A state gem."], ["Reviewed December 4, 2017", 5.0, "Great hiking and views", "The Point Lobos State Reserve is a busy place. We decided to go late in the afternoon on a Friday and were able to drive in and find parking at a couple trail heads. The Cypress Grove trail was beautiful and afforded great views of the point and the ocean. We were there just over an hour as the park closes at 5pm. Well worth the time and energy. There is a fee to be paid at the gate for entry.\nShow less"], ["Reviewed November 29, 2017", 5.0, "What Views", "An excellent unit of the California State Park system. Easy access, great views of the Pacific and of the Big Sur coast. We were lucky - the whales were in and we saw many spouts and dives."], ["Reviewed November 28, 2017", 5.0, "Big Sur Feel", "Great park and seashore with so much to do and experience. Walked the lagoon area and toured the old whaling / fishing museum - neat. Drove the rim and walked the seashore by tide pools and the seal rocks. Then spent about 2 hours walking the piney woods trail. Superb! Enjoy.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Very Popular Spot", "A must to visit if you are in the area. Great walking, great views. Not a great deal of parking but enough"], ["Reviewed November 27, 2017", 5.0, "Stunning Coastline", "What can I say? This is one of several State parks on the Pacific Coast Highway and this one is on the coast side of the highway and extends to the sea. The pictures tell the story... 2064"], ["Reviewed November 25, 2017", 5.0, "A Beautiful natural treasure you can't miss visiting Carmel.", "Meandering through woods, you would suddenly be presented with stunning ocean view in front of you, with sea birds and sea lions calling from afar. Some trails are a bit challenging. Need a good pair of shoes to comfortably roaming from one scenic spots to another. Make sure to get down to the Whale's Cove and check out the whale museum. Get there early. Very early, as this is a very popular spot.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Breathtaking!", "Absolutely love the trees against the water, the foliage in the area is like no other in the world. Take the time to compare it and enjoy it. A must see."], ["Reviewed November 23, 2017", 5.0, "Good place for easy hikes.", "We came here with my 2 young kids and we really liked the place. The park is relatively flat with good walking trails. Saw some people with joggers. You should go early as the place fills up and the line to get into the park can take a long time. We got there around 10am and it took us a good 15 minutes to get into the park. It is 10 dollars a vehicle and good for any other state park you visit that day. Its recommended to bring exact change. You do not need to park in the park. You can park on the side of the road and walk in, but the walk to the coast is pretty long, but seems flat. I'd probably do that if not for our young kids. People seem to park at the 2 end points. I'd probably park in the middle around \"the slot\" and them just walk both ways. I thought a lot of places would be roped off, but you can get really close to a lot of places for good pictures. My kids liked exploring the various beaches. Park has clean restrooms. Because the hikes are relatively easy, i bet this place gets filled up during the weekends. At the time we went, it was still challenging to get a picture without anyone else in the background.\n\nNext time, i'll come earlier and again on a weekday. We came day before thanksgiving.\n\nOnly bummer was that the trail down to China Beach was closed. Hopefully they fix that soon, but seems like a lot of work to repair.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Deer, Sea Lions, Sea Otters!", "Such a cool place to while away many hours of pleasurable walking and I hate walking! Stunning views, wowzy location"], ["Reviewed November 19, 2017", 5.0, "Beautiful coastline state reserve", "Another must see attraction on Big Sur/Carmel area. You can do some amazing hiking in Point Lobos. Highly recommend a stop here on your tour of Big Sur."], ["Reviewed November 17, 2017", 5.0, "Can't win for losing", "The concierge at our hotel suggesting waiting for the weekend to pass before going to Point Lobos. So we showed up early on Monday -- only to realize that it was Columbus Day and the park was soon filled. We wanted to photograph The Old Veteran, a 200 year old cypress tree. We could not find parking though we went around and around. When we finally managed to stop, the ranger told us that a portion of the tree was damaged in a recent landslide and half of the tree was now in the canyon below. Disappointing! But the Pacific was gorgeous and the waves crashing into the rocks were glorious to behold. Definitely worth the stop. GO EARLY!\nShow less"], ["Reviewed November 17, 2017", 5.0, "Beyond Stunning", "Stunning doesn’t do Point Lobos justice. We have been going there for about 30 years and it never disappoints. We have been there in spring and fall and either time it is lovely. In the spring we were lucky to see the harbor seals having their babies. BUT, I highly recommend being in line when it opens. Parking is very limited. Take your binoculars. Due to bad storms, you no longer can walk out to devil’s cauldron. There are no plans to rebuild trail and steps.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Gorgeous views", "Point Lobos is a special place. It has a ton of easily accessible trails and scenic views that will blow you away. Chances are that you'll see sea otters, sea lions, and maybe some whales too. None of the hikes here are difficult.\n\nI'm not too hot on the access fee of $10 since it's public land, but I can understand the need. Most public parks and nature areas are going this way, but it is a travesty to put up barriers to people enjoying it. Parking can be difficult on weekends, so get there early.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Beautiful but restricted access areas", "We have been visiting Point Lobos for over 3 decades. We have seen the impact of increasing tourism over the years. Many areas are restricted for regrowth, erosion of the trails, and just plain wear of so many tourist feet. They are also protecting the seal population. it is still worth hiking in the park, though I am preferring the north area among the trees.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Serenity in The Best CA State Park", "I had the amazing privilege of being in Carmel by the sea California for a few weeks. The sweetest spot and moment I had on this trip was on a bright sunny blue day before a meeting. The Park opened at 8am when I arrived. This hidden treasure has around 15 different areas to hike and walk. There is easy parking and the trails are nice and easy to walk on. (Good for elderly parents or young kids) they charge only $10 per car to park. This is the best place to go even if you only have 1 hour to spend. China Cove is my favorite spot on the park. You can see sea lions basking in the sun and swimming in the water with their young ones. Great fun!!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Beautiful!!!!!", "Fantastic views, $10, quick in and out if you want. Sea lion activity is pretty far away, but views are unreal. Enjoyed the whale watching cove on top perch."], ["Reviewed November 14, 2017", 5.0, "Beautiful!!!!", "Beautiful scenery! Hiked every trail in this park today- saw sea lions, otters, seals, pelicans, and SO many breathtaking views. Most of the trails are short. Bring binoculars to view the sea lions and seals!!!! Very clean and well maintained trails. Lots of parking and restrooms.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Great place!", "We took about two hours to tour this area! Great views and easy hiking! It’s a small state park. Parking is 10$ and plenty of spots when we went. Fun area to explore and see great scenery."], ["Reviewed November 13, 2017", 5.0, "weekend get away", "A must see, beautiful walk with stunning views. The coast line is just stunning, don't skip the Cypress hike/walk."], ["Reviewed November 12, 2017", 5.0, "Live. Hike. Love.", "Point Lobos has something for everyone - picnic areas, ocean view, scenic heights and friendly crowd. Bring your camera, your iPhone and take lots of pictures, this place is so special you will want to share the pictures with your friends and family - on Facebook or IG.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Breathtaking views and easy to navigate", "Point Lobos State Reserve is a national treasure. It is right in Carmel, and therefore easy to find and not somewhere you need to plan a special day trip to see.\nAs you enter the park, you pay $10 for parking and $2. for a map. If you follow the main road in, you can park at one of several parking areas, leave your car and follow the well marked trails. The day I was there, several student groups were being given tours by park rangers. How lucky are they to live nearby and have this in their backyards?\nEach parking area has its own highlighted topic for viewing. I parked near the whale watching area. It was not the right time of year for whale viewing in November when I was there, but that area was still beautiful. The most popular was the Cypress Grove area, which I also walked, and I can definitely see why. The trees are beautiful and when viewed with the water and the rocks in the background, the views are breathtaking.\nThe park was busy on the Monday late morning that I was there, but not so much as to be crowded or that you had to wait to see a view. The pictures that I took that day with my iphone look like they were taken by a professional photographer, or almost like they have been photoshopped because the colors are so very clear and true.\nI highly recommend at least an hour or two at Point Lobos State Reserve.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Treasure Island", "Robert Luis Stevenson used Point Lobos State Reserve as his inspiration for his book Treasure Island when he was living in Carmel. Point Lobos is considered the \"gem of the California Parks system\" and is steeped in history dating back to the Chinese fishermen is Whalers Cabin in China Cove built in the 1850's using whale bones as its foundation. The State reserve is surrounded by a national marine sanctuary but swimming, snorkeling and kayaking are permitted weather cooperating. Explore the North Shore and Bird Island trails for exciting views.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Breathtaking Coastal Hikes and Vistas", "We hiked for 2+ hours on a clear but cool Saturday in October. It was a bit crowded in the parking lots but the trails were still lovely. The trails we followed were moderate and the views were sensational. A \"must\" on any visit to Carmel.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Incredible vistas!", "I walked along the craggy point Lobos State reserve in search of what I thought I saw.....seals! Even though I never did spot a seal I spotted instead a couple of painters capturing the magnificent Pacific ocean and that's a scene my mind has never painted before.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Amazing!!!", "Breathtaking cliff views, usually seals sitting near the rocks or swimming, great views of tons of cyprus trees, and nice hiking trails to walk on. Costs $10 per vehicle to enter."], ["Reviewed November 7, 2017", 5.0, "A must see", "If you have the time.. even 2 hours will be worth it.. DON'T skip this gorgeous peace of land. I would really recommend on the Cypress Grove Trail !"], ["Reviewed November 7, 2017", 5.0, "Beautiful", "We were driving down Route one and made Point Lobos our first stop. It cost $10 to get in but if you visit any of the other state parks along route one the pass is good for all day. Once you park your car there are some park volunteers that will give you guidance on what to do. You can also pick up a pair of binoculars in exchange for your car keys. We walked out to the observation area and got To see some seals on the rocks. Very pleasant morning. There are some restrooms at the entrance of the park but you cannot park directly at the restrooms. There is some parking right before you enter the park or as you exit where you can park for 15 minutes and then walk to the restrooms. There is no signage that Kelsey this.\nShow less"], ["Reviewed November 7, 2017", 5.0, "What a beautiful place to be", "Certainly a 'do not miss this place' experience. Magnificent views from all of the trails. From the scenery to the Pelicans on the cliffs, you will remember this tiny gem. Highly recomended !!"], ["Reviewed November 6, 2017", 5.0, "A must for any nature lovers. California at it's best", "This is an amazing place to hike, lunch, relax and enjoy being outside. I make time to visit each time I come to Carmel."], ["Reviewed November 4, 2017", 5.0, "Unsurpassed", "I had not been to Point Lobos in nearly 40 years so a lot has changed, mostly for the better. The Whalers Cove area is now more developed and accessible with a parking area right in the Cove and the whalers shack now houses a museum of the whaling and contributions from so many different people's (Portuguese, Chinese, Japanese, and native Americans) along with historic artifacts. The docents who staff the area are able to give you so much neat information of the area and wildlife. Bird Island is also better developed with ADA accessibility which is a terrific improvement. More cars and visitors, of course but the natural beauty and scenic views along the coastline are unsurpassed. We went on a weekday where it was very still, so while this made it easier to hike and walk, the surf was quite mild.\nShow less"], ["Reviewed November 3, 2017", 5.0, "We came in search of otters...", "We stopped by on our coastal road trip and were completely mesmerized by the beauty of this park. Wildflower strewn cliffs dropping directly into the sea, beautiful deserted beaches, and seals galore were only a portion of the majesty we found here. Definitely worth the trip!\nShow less"], ["Reviewed November 3, 2017", 5.0, "Wonderful Outdoor Experience", "If you like hiking, particularly along the Pacific coastline south of Carmel, this is the spot. Several different trails are available. Do not miss the small museum at Whalers Cove to learn so much about the Monterey peninsula and early settlers. Point Lobos can get crowded, especially on weekends. Parking is at a premium in the reserve, so many people park along Highway No. 1 and walk through the gate, rather than drive through. It is best to arrive early, probably before 9:00 am. We bring a picnic lunch to enjoy after hiking.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Beautiful park", "Point Lobos is a wonderful place to visit. There are great coves with sea otters, sea lions, and harbor seals and a plentitude of sea birds. There are numerous trails along the rugged shoreline as well as in the woods, many of which are ♿. There is a cove that is accessible for divers as well as places for kids to enjoy nature and some of the history of Monterey Bay.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Beautiful Park for easy hike", "Point Lobos is a beautiful park with a fairly easy hiking path along the coastline on the Monterrey Pininsula. It does get very crowded and parking can be a problem."], ["Reviewed October 30, 2017", 5.0, "Amazing views", "We drove past Point Lobos State Reserve every year saying we should stop by sometime. We never realized what an amazing place we were passing by. It is a great place to hike and enjoy the outdoors. The views from the hike at the very end going out on the cliff were amazing. We stood there for a while watching some sea otters playing below.\nJust a warning, don't go out too far on the rocks to get a great picture of the waves crashing on the rocks across from you. With no warning the waves will sneak up on the rocks you are standing on and you will be holding your camera way above your head and soaked all of the way up to your shoulders while your husband snaps action shots on his cell phone from the dry land. I heard that from a friend :-)\nShow less"], ["Reviewed October 30, 2017", 5.0, "Just beautiful", "The rocky coves, windswept cyprus trees, sea otters, seals and sea-lions, add up to one of the most enjoyable nature reserves we have visited. $10 per car entrance fee is reasonable, especially as this then gets you into other nearby state parks (e.g. Pfeiffer Big Sur) for free on the same day.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Great walks", "We did two relatively short trails - both were lovely and easily accessible. The staff were very friendly and helpful. They have binoculars which you can borrow to get a closer look at some of the wildlife. We even managed to see two sea otters, as well as plenty of sea lions.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Great views, hiking, and telescope docents", "This place is not to be missed, even when the highway line of parked cars seems off putting. The views are fantastic, and the weekend docent volunteers with telescopes were very friendly. We saw seals and otters."], ["Reviewed October 28, 2017", 5.0, "Beautiful!", "The weather was perfect for hiking along the coast line. It would be a great place to spend an entire day or for camping."], ["Reviewed October 25, 2017", 5.0, "A must see and enjoy", "If you are in the Carmel and Monterey area you need to visit Point Lobos park. Easy waking trails near the ocean with great view of seals and stunning coastline. The park has binoculars to use for free on your hike. Trails for all ages"], ["Reviewed October 25, 2017", 5.0, "Such beautiful landscapes", "A must on your to do list. There are such great trails right along the ocean. . .very well maintained and so serene and blissful!"], ["Reviewed October 25, 2017", 5.0, "Breathtaking.", "This park is a gem! Views are amazing and there are so many different trails to chose from that there is something for everyone. We did the Sea Lion Point Trail, part of the South Shore trail, then the North Shore, Whalers Knoll and finished with the Cypress Grove/Allan Memorial Grove loop. It took us about 1.5 hours and we saw a variety of wildlife and nature along this coastline and in the forest areas. Parts of this hike were a little challenging, nothing too strenuous, and what a great place to get some exercise! We left wondering if you are from this area if you EVER get used to how beautiful it is?!\nShow less"], ["Reviewed October 23, 2017", 5.0, "Simply Breathtaking", "While this was on my Carmel list of possibilities, it was not set in stone until my wife and I simply wanted a hike and fresh air. What breathtaking scenery! We’ve been to many beautiful scenes around the world and for sheer beauty of nature, this ranks right up there. Highly recommend.\nShow less"], ["Reviewed October 23, 2017", 5.0, "So much wonder!", "Point Lobos is a place to get a flavor of the beautiful central California coastline with about 7 miles of trails. Many are along the shore, but there are also interior trails that take you through the Monterey pine and cypress forests. Named for the sea lions (lobos de marinos, in Spanish) that inhabit the rocks, they are best seen by borrowing some binoculars from the Information Station. You might also spot sea otters and harbor seals, and even whales! On land, there are deer, little brush rabbits, all kinds of birds, and even the western fence lizard.\nThere is some interesting geology to be explored, too. Throughout spring and summer, many varieties of wildflowers abound. Just beware of the plentiful poison oak.\nIt is such a wonderful, uplifting place to visit, either to walk the trails or to just sit and meditate.\nShow less"], ["Reviewed October 22, 2017", 5.0, "We Had a Wonderful Afternoon at Point Lobos State Reserve", "We have been to Point Lobos several times over the years. We have always had a very enjoyable time when we have visited. There are always new sights to see and new adventures that occur while you are exploring. Many of the trails are relatively easy to walk and the coastal views are fantastic. Some of the trails are more challenging and take a little more time to hike. My only suggestion would be to leave enough time to truly enjoy the area. There are many places to see and you need to have enough time to truly enjoy the experience. We were there for the afternoon and could have used more time to explore. There is an admission fee to get into the park. However, the parking is free. It is well worth the visit and you will be happy you went to Point Lobos.\nShow less"], ["Reviewed October 22, 2017", 5.0, "A lovely place to hike but go early to avoid the crowds", "The state park is a must have you if you enjoy the outdoors and hiking. The vistas are magnificent and the trails well-marked and relatively easy. Good bathrooms well-placed along the trails and these are very well kept. Staff was set up along the trails with binoculars to show some of the wildlife which is much appreciated and most interesting. Go early to avoid the crowds and if you can get out by lunch you'll be in very good shape indeed.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Great day out", "Lots to explore. Plenty of wildlife to see. We were lucky enough to see a whale not too far out. Rangers were very helpful. Good toilet facilities."], ["Reviewed October 22, 2017", 5.0, "Outstanding!!!", "This place is magical! My three little girls loved it and my oldest one fell in love for photography.\nWe saw otters, dolphins and seals. The park staff is comprised of wonderful senior citizens and they were extremely friendly and helpful.\nI recommend going early to beat the crowed, park inside and just spend the day walking around.\nDefinitely the best park I’ve been in for a while.\nStrongly recommend.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Easy walks & great coastal views", "Bring your binoculars if you want to see whales & seals! A wonderful park to visit. All of the trails are easy walking, with stunning views of the coast. We lucked out and were able to catch the sunset here as well. Highly recommend!"], ["Reviewed October 18, 2017", 5.0, "The views were amazing & we saw many whales breaching in the bay there!!!", "This was one of the high points of our 12 day car trip through california. The views are amazing!! There are many trails right along the rocky overlooks along the shore. We were there in late August & saw many whales offshore."], ["Reviewed October 18, 2017", 5.0, "Beautiful walk above the shore...", "Beautiful photo opportunities abound one after another. The trails were well marked, not too rugged but more than just a walk in the park. The Pacific coast so much more breathtaking than the Atlantic in South Florida where I live. So glad our friend insisted we make this stop.\nShow less"], ["Reviewed October 17, 2017", 4.0, "State park with good scencery", "Plenty to see saw sea seals Walking trails where kids can also walk easily Parking places if you want to drive and walk less Otherwise it can be a great about 7miles hike"], ["Reviewed October 16, 2017", 5.0, "Clean air and spectacular scenery", "Light hiking around the most beautiful ocean views anywhere in the world. If you take the first walk around the cypress grove you’ll notice the red rust looking lichen on the cypress trees. That lichen only grows in the purest air. It’s an experience just to enjoy not only gorgeous views but just breathe in that light, pure, air! Be careful to stay on the path. Poison oak is the local ground cover.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Beautiful state park", "Visited on hot October day . Beautiful coastal park . Pay the entrance fee ( ten dollars a car ) and\ntake a hike around the park .\nPlenty to see and if you are lucky you will see seals , sea lions and maybe a sea otter .\nWonderful place , easy walking trails , take water , there are quite a few toilets on route . Look out for the whalers shack , lots of information there ..\nShow less"], ["Reviewed October 15, 2017", 5.0, "Great hiking", "There are a lot of trails here to explore and most are very flat and easy to navigate. This would be great for anyone. Wonderful ocean views and the cypress forest was beautiful too."], ["Reviewed October 15, 2017", 5.0, "Very nice park with well marked trails", "Get there early if you want to park inside in one of their lots ($10). Great trails and incredible views."], ["Reviewed October 13, 2017", 5.0, "Great place to explore and get out in amazing nature!", "Wonderful and busy place to explore and enjoy nature. We took a long half day with an early start to hike around the whole reserve, very gorgeous scenery and lots of wildlife."], ["Reviewed October 12, 2017", 5.0, "GORGEOUS PLACE", "We stopped by this state park on the recommendation of a parks worker. It cost $10 to park and you could lvisit any other state parks during the same day with the pass. The few hours we spent there ended up being the highlight of our time in Carmel. There are beautiful vistas EVERYWHERE! We hiked along the ocean to Birds Island path and once there walked down the wooden steps to Gibson Beach. It was only us and just beautiful. On the way there we saw sea lions and amazing swarms of beautiful birds. My husband and I do not usually hike but we were able to handle the paths pretty easily so if you are in decent shape do not hesitate to go. The entire reserve feels like a postcard and the raw beauty of the pacific ocean is just spectacular. Don't miss it!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Beauty Galore", "This was already the highest rated place to go in Carmel, CA but we still weren't sure about it. Well after spending half a day there yesterday, we are now certain, this IS THE PLACE TO GO! Beauty abounds, sounds are wonderful, nature fills every piece of this adventure. YOU MUST GO! Don't leave Carmel without giving this place at least half a day!\nShow less"], ["Reviewed October 11, 2017", 5.0, "One of a kind spot", "No one should pass up this visit and stay as long as you possibly can. Hike and walk everywhere as there are beauty spots around every bend in the trail. Take guide tour if available as you will learn more than you imagine. Only a few places on earth with Trentepohlia on Cypress trees.\nSpend the $10 bucks to enter as free parking on road will require 30 minute walk.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Amazing Views", "Easy to Moderate walk/hike to fantastic views of the ocean. Parking lot was full when we arrived, so we parked out on the highway and walked in. No entrance fee was required for walk-ins."], ["Reviewed October 9, 2017", 5.0, "Fantastic views", "We very much enjoyed the short hike and views at Point Lobos. Sea otters, sea lions and birds were all easily viewed and the photography possibilities are great."], ["Reviewed October 9, 2017", 5.0, "Gorgeous!", "Get there early if you need a parking spot. Absolutely beautiful. You can buy an additional map at the entrance for 2$ describing the different trails. My spouse does not like to hike, but he really enjoyed our time here.\nSome of the trails are paved, so it's great for young children as well (and indeed we saw quite a few).\nShow less"], ["Reviewed October 8, 2017", 5.0, "Beautiful spot!", "Took a good chunk of the day to see this park and it still wasn't enough. Lovely overlooks on every trail. Many hikes to take if you have the time. We were however surprised that with our park entry fee, you don't even get a map so you know where you are going. A map cost you another $2. While that's not much- its the principle of it. I mean, really?!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Over the top!", "We hiked the north trail after talking to Ranger attendant it was incredible! Moderate to easy hike with numerous views of seal, otter, untold bird species. We arrived early morning which is a must for parking and low to no crowds and were offered binoculars to borrow from the ranger! We would have missed a lot if not for the binoculars so would recommend bringing if you can! Beautiful! Beautiful! Beautiful!\nShow less"], ["Reviewed October 5, 2017", 5.0, "Lovely walks and beautiful sights", "It's all already been said - just lovely walks and beautiful sights. Photographers will have field day. It's also good for exercising those legs!"], ["Reviewed October 3, 2017", 5.0, "Amazingly beautiful", "We love coming here. Amazing hiking trails and unbelievable ocean vistas. You could easily spend an entire day here hiking all the trails and taking in the amazing views. $10 entrance fee or $9 for seniors (62+). They sell a trail map for $2 at the entrance gate if you want to hike all the trails, but if that is not your plan you won't need the map. Most parking area have a map showing the nearby trails. Plenty of benches and small beaches to enjoy the scenery and ocean. Absolutely love this place. If you want to enjoy the park without paying for it's care you can park out on highway 1 and walk in. Shame on you if you do. Enjoy.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Get there early for easy parking but this is the Greatest!", "This is a \"not to be missed\" park and a walk with one of the several breathtaking vistas of the best cliffs and surf of the California Pacific Ocean coast."], ["Reviewed October 3, 2017", 5.0, "Never fails to be breathtaking....", "We live 10 minutes from this amazing reserve and hike/walk here several times a month. There is a new handicap trail that takes you to the ocean in about 15 minutes. Or from the kiosk you can veer to the right and be at the sea in less than 10 minutes. There are picnic areas and clean restrooms .. no eating on the trails or at any for the benches along the beautiful walk ways. The dedicated docents are usually available to answer questions, provide a telescope for viewing or take you on a guided walk. A few of the trails are steep and challenging, up stairs, over roots and rocks and some trails are sooth and accessible by stroller, wheelchair etc. Allow a few hours to see this amazing bit of mother nature. You can park on the hwy and walk in if you do not want to pay the $10 fee. On weekends, unless you get there early, you may have to walk in anyway as parking is limited. It takes us about 1.5 hours to do a loop along the shore but that is not allowing times to stop, take pictures, and watch for whales, otters, seals and sea lions. From here drive 25 miles to Big Sur for the most scenic stretch of California coastline.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Beautiful!", "The hiking trails through Point Lobos are well maintained. The network allows users to design a walk that suits their particular timing and ability. Scenery is stunning. We saw seals and a whale during our hikes."], ["Reviewed October 2, 2017", 5.0, "Amazing and Timeless", "A must see on the Monterey Peninsula! This park is a treasure. A Walk into the past and if you have the time walk the entire perimeter. It is worth the time. Even if its foggy and cold, bundle up and see the coast as it was.\nShow less"], ["Reviewed October 2, 2017", 5.0, "What a gem!!", "Stunning state park. The wildlife, the vistas, and some hearty hikes, this place was a very pleasant surprise!"], ["Reviewed October 2, 2017", 5.0, "Hike of a Lifetime!", "Point Lobos was at the top of my to-do list while spending three days in the Monterey area. We paid $9.00 to get in the park(Senior Discount). The experience was priceless. Went on a trail that started next to the restrooms(Whalers Cove, I think). It is amazing how much vegetation there is and how thick the forest is so close to the water. Being from Florida we live near the beach but our beaches are nothing like this. We walked a little way and could hear sea lions barking. A ranger let us use a scope he had to spot them. Most were basking out on the rocks. Such a breathtaking view! You are looking out over tall cliffs to the waves crashing against rocks and it is surreal. I felt like I wasn't even in the United States any more. There were some spots where you could climb up on rocks overlooking the surf, all were roped off at a safe distance. Though it did make me a bit nervous for my 14 year old to be climbing around. If you are ever anywhere near this area you really must see this place. One of the most beautiful places on earth I have ever visited.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Quite simply unmissable", "This was the highlight of our Californian trip. Wear decent walking shoes and cool clothing and take water and sunscreen Be prepared to walk for 2 hrs and you will be rewarded by spectacular vistas And only 10 bucks..... the best value experience we had"], ["Reviewed October 2, 2017", 5.0, "Breathtaking Views, Casual Hiking", "Point Lobos is a BEAUTIFUL area and it houses some of the most stunning vistas I've ever seen. There is hiking casual enough to merit the description of \"a walk\" rather than \"a hike.\" Either way, the whole of this area is breathtaking and definitely worth a visit on your trip to Carmel or even a stop as you drive past on a road trip.\nShow less"], ["Reviewed October 2, 2017", 5.0, "A must visit for Carmel/Monterey vistors", "Great hiking trails and never ending ocean views. Does not matter what kind of weather is always a great place to visit. Please be careful when parking. There is very limited parking at the reserve and fills up early during the busy season. If you decide to park on highway one be careful. It is an active road with fast traffic both ways.\nShow less"], ["Reviewed September 30, 2017", 5.0, "An absolute must", "If you love walking, wildlife and stunning scenery you must visit Point Lobos State Reserve.\nJust five minutes drive south from Carmel, this park is an absolute must to visit and the various trails and woodland walks are suitable for all ages and offer some truly spectacular vistas.\nIt was our second visit to the reserve and we spotted whales and dolphins and also came across a group of up to 25 sea otters lounging around in the kelp.\nWe also came across numerous birds, a snake and squirrels.\nAll in all a great morning, spent in lovely sunshine and peace and tranquility with nature.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Idea life viewing", "The ranger had a scope on 3 sea otters that he was sharing with people as they walked by. There were also sea lions basking on the rocks farther out. We saw an otter closer in who was feeding and easily visible along with a little harbor seal swimming about. There were egrets, pelicans and cormorants as well. Great views around every bend!\nShow less"], ["Reviewed September 28, 2017", 5.0, "Highly Recommended", "I would recommend this park to anyone going to California. Such beautiful views from all directions. We could see sea lions, otters and whales in the ocean. My favourite trail was the cypress grove."], ["Reviewed September 28, 2017", 5.0, "Otters Spotted", "My wife and I were shown otters hiding in the kelp by the ranger who kindly lent her her binoculars.Lovely views of comorants and sea lions. Be careful of poison oak."], ["Reviewed September 27, 2017", 5.0, "Great!", "One of the most beautiful spots in the West Coast....or anywhere....on the planet! Once you say that what else is left? It's reminiscent of Yosemite for those who've been there:Each and Every time you see it it's as if it's the 1st time you've seen it!\nShow less"], ["Reviewed September 27, 2017", 5.0, "Stunning coastal walks", "Get there when the park opens (8 a.m.) and you'll get a car park space without any problems, and fewer people on the trails. It fills up quickly after that, especially at weekends."], ["Reviewed September 26, 2017", 5.0, "Beautiful California Coast", "Got here early and in the middle of the week so we didn't have a problem with parking.\nThe trails along the coast are beautiful and offer differing and amazing views and wildlife.\nIf the weather is nice, plan to spend some time on one of the many beaches along the way!\nShow less"], ["Reviewed September 25, 2017", 4.0, "Beautiful piece of the pacific coastline!", "What a park! Numerous trails crossing different types of terrain. We saw lots of wildlife: bobcat, sea otters w/ pups, seals/sea lions, black tail mule deer AND humpback whales! All this only a very short drive south of Carmel. Amazing! Will definitely return when in the area. My favorites: North Coast Trail and Granite Point (but all areas were good).\nShow less"], ["Reviewed September 25, 2017", 5.0, "LOVED it!", "Great spot for hikes, ocean views and nature. Loved the Cypress groves. We saw a TON of whales, and Sea otters. We spent about 5 hours here, and could have spent more. Wear comfortable shoes, and it would be fun to have binoculars to check out the wild life. Camera, too.\nShow less"], ["Reviewed September 25, 2017", 5.0, "5 hours of breathtaking views", "We did not have time to visit the Big Sur and went to this park under a recommendation of locals. You can park on the street and avoid the 10 dollars parking fee inside the park, but I suggest you buy the 2 dollars map that explains the trails. There are many of them and they are all short ( up to a mile or so), but if you do them all as we did , you can tour the whole park doing five miles, all easily walkable, going from coastal to forest panoramas one more beautiful than the other. Also not to miss is the little charming museum on the north trail, with the 1800 original fishermen cabin and many interesting artifacts and stories.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Beautiful Views", "We were lucky to get a parking spot even though we got here early. The walking paths are very well maintained, and the ocean views are just beautiful. They charge $10 per car and if you want to buy a map, it costs $2."], ["Reviewed September 22, 2017", 5.0, "Incredible!", "This national park is a hidden gem. It is not too crowded and we saw whales really close from the shore, tails flipping and splashing, it was one of the best experiences we had on our trip. We arrived about 9am and when we were driving out noticed that the parking lot was full and there were a lot of people parking on the road so think we were lucky to get there early! It is a must see on the coast, and a lovely park with lots of easy trails.\nShow less"], ["Reviewed September 22, 2017", 5.0, "a Must-See view/nature walk", "Point Lobos has beautiful ocean and forest vistas. It also has some trails that are wheelchair friendly and docents who are happy to answer questions and lead walks. Take along a picnic and dine while enjoying it all. In the spring the seals come out on the beach to have their pups. There are fall colors and quiet winters. Summer sometimes means the park fills. Parking is a problem and people park cars along highway one and walk in.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Amazing! Simply Amazing", "One of the most special places we have seen so far. Magnificent view of the ocean with rocks, waves, small beaches and birds. All surrounded with easy walking trails, picnic areas and great view points. Don't skip this place!"], ["Reviewed September 20, 2017", 5.0, "Beautiful views of the coastline, exercise and abundant wildlife", "Ten dollars per car (nine for seniors) and two additional dollars for a map that provides an overview of all trails leading to an unbelievable experience in nature. We saw deer, seals, sea otters and many varieties of birds. The views of the ocean crashing against the ragged coastline were spectacular, as well as the magical cyprus trees. Some of the trails included steep steps and uneven walking areas. This should be taken into consideration for those who are not used to exercise. However; people can drive from one area to another instead of hiking.\nWhale sightings are possible, but not when we visited. What a wonderful 2-3 hour experience.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Amazing Views!", "The docents were very helpful in selecting the perfect hiking trails for our needs. Trails were well maintained and facilities were clean. Displays were informative. A MUST see when visiting the Central Coast."], ["Reviewed September 19, 2017", 5.0, "Truly stunning", "One of the most beautiful cliffside walks you will encounter anywhere in the world. Stunning locaation."], ["Reviewed September 19, 2017", 5.0, "Must see for nature lovers!", "My teenagers and I went on a hike there and really enjoyed our 5 hours.\nWe followed the easy trails and could enjoy beautiful scenery, with plenty of wild life. We got pictures of eagles, sea lions and could see whales from far in the sea.\nThe landscape are incredible, with a mix of rocks, vegetation, and sea that is pretty unique. A must see if you are around!\nShow less"], ["Reviewed September 19, 2017", 5.0, "This place is amazing", "Incredible to have so much amazing packed into such a small area -- incredible hikes on the water and in-land, cool rock formations to play on and mountain views to see, the incredible cypress trees. Highly recommended."], ["Reviewed September 19, 2017", 5.0, "Just a perfect, beautiful, and unique place", "This is a must see for anyone coming to Carmel-by-the-sea. Wear you walking shoes and do the Point Lobos Loop. See it all. You won't regret it"], ["Reviewed September 19, 2017", 4.0, "Lovely coastal walks. Saw wales and seals!", "We spent 2-3 hours here. A nice variety of easy trails. This place is not for anyone looking for a tremendous hike, but more of a leisurely walk to see the coast and spot wales!"], ["Reviewed September 18, 2017", 5.0, "Nature & Shore Lovers Rejoice!", "The modest charge to get in here is well worth it, the views and walking trails along the coast are majestic to say the least, From undulating beds of kelp to a variety of shorebirds you will be amazed at the beauty here and opportunities to enjoy it. We saw several sea otters floating around to add to the fun. You can walk as much or little as you like, take a picnic and get out into some of the best nature along the coast.\nShow less"], ["Reviewed September 18, 2017", 5.0, "The highlight of our drive from San Francisco to LA", "It’s hard to put into words how spectacular the ocean views at Point Lobos State Reserve are. The best we have ever seen. The trip to the reserve was the highlight of our trip from San Francisco to LA. You also get to watch a host of wildlife: sea lions, otters, sea birds and we were lucky enough to see, well out to sea, grey whales passing by. Well signposted tracks guide you round the reserve and there are lots of volunteers on hand to assist and talk to. When you get fed up of the views of the rocks and sea you can visit the Whalers Cabin Museum housed in a building built by Chinese fishermen in the 1850s and next door The Whalers Station Museum which displays a collection of artifacts to do with whaling. Then head inland to walk along a number of designated trails, seeing lichen, Cypress Trees, large shrubs, mushrooms and meadows. Point Lobos State Reserve is a must see place to visit.\nShow less"], ["Reviewed September 17, 2017", 5.0, "One step of the clouds", "This is an amazing place to visit. You can feel the warm of the people is attending you at all the reserve. You will enjoy the different amazing view and how the sea waves burst on the huge rocks . Sea-lions, otters, birds and also whales are the most common marine creatures you will find. Peaceful and colorful walking paths you will find in the reserve. Go inside in the groves and enjoy the wildlife. Nice picnic areas to enjoy homemade food that you can prepare with your family.\n\nYou want to be a step away from the clouds, look for a bench that faces a cliff to the sea, where you can sit and admire the immensity of nature, meditate and even rest, eyes closed, listening to the murmur of the waves of the sea.\n\nDecide to have a natural adventure.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Vacation", "Very nice views. Easy hiking trails. Very busy so parking can be a problem. There are trails that go to the water."], ["Reviewed September 16, 2017", 5.0, "Don't Miss Point Lobos", "Point Lobos is one of my favorite places along the coast--generally not crowded and with spectacular views."], ["Reviewed September 16, 2017", 5.0, "A Must See", "Really beautiful spot. Great little walks around shoreline. Saw deer, seal lions, birds. Great for an hour or even to wander around all day long. Road winds through to take you to spots where short trails with great views begin"], ["Reviewed September 15, 2017", 5.0, "Excellent state park - no dogs (for me a plus)", "Great scenic park. Sweeping views of the ocean. Great hiking trails that go along the seashore. There are places to get down to the beaches. Another rule forbids \"collecting\" from the beaches.\nI recommend paying $2.00 for the great map they have. It offers many details that help you get to know the place.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great Hiking and Sightseeing", "Best place in the area for coastal hiking and sightseeing!! State reserve and great docents and volunteers make it informative and pleasant."], ["Reviewed September 13, 2017", 5.0, "Great Ocean Cliff Walk", "Great place to walk the cliffs above the ocean keeping an eye out for sea life. We walked a good share of the park trails on a beautiful windy sunny Carmel day. Suggest packing a lunch and eating in the designated picnic areas. A beautiful place any time of the year.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A true must see.", "Where the forest meets the sea. Rugged paths, natural stairs, breathtaking ocean views. Walk it, hike it or enjoy a leisurely short drive. Meadow paths and forest paths for a literal change of pace! Terrain is medium to moderate physical activity, wear proper shoes. Bring the kids, but mind them carefully on the step bluffs overlooking the ocean. If you are a terrain runner, so challenging and beautiful.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Birthday Hike", "Turned 63 today and decided to hike Pt Lobos. I'm really not a hiker but started out at entrance and did the whole North and South trails. It was awesome. I did pack a sandwich and chips and water and ate at a designated picnic area which helped as I was in park 4 hours. If you can park in the park you can do shorter jaunts to what you want to see. Bring binoculars to see sea life. Don't wear flip flops if you're hiking as trails can have rocks and gnarly limbs to walk over-watch your step. Wear a hat. My favorite view was bird rock on South Trail but the North had some fab views and the sea lions.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Stunning Scenery - easy walking trails", "Beautiful, easy walking trails along the ocean bluffs, through cypress trees, wildflowers, with sea otters & sea lions in the ocean, many birds,..... It is a highlight of the California Coast. They will even lend out binoculars, to give you better visibility of some of the wildlife you might see. If you enjoy seeing nature, this is a must.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Easy trails for nice views", "Nice place to spend a little time hiking. Nice views and not overly crowded. Small entrance fee per car."], ["Reviewed September 11, 2017", 5.0, "Such beauty to take it!", "We only took a small walk from the entrance to some tidepools, but there is so much to see and do here. Plus the views of the coast are just amazing. Our family enjoyed it so much, we couldn't stop talking about it.\n\nI wish he could've spent the whole day here and had a picnic, it was that amazing to be out there. Definitely worth your time.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Hiking", "What an absolute treat! Hiking (very light) great views. Rangers are great and more than happy to answer questions and add great tidbits of information. You can easily spend a good 6 hours walking and peaking at different view points"], ["Reviewed September 9, 2017", 5.0, "A Preview of the Big Sur Coast", "I have an annual pass to Point Lobos and get over there as often as I can. In a few hours of moderate walking, you can see an enormous variety of ocean and woodland scenes that echo the landscapes you would see if you could drive the 80 mile Big Sur Coastline.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Great Walks", "we live in Chicago and come to Carmel about 4 weeks per year. We always find time to talk walks in Point Lobos - a truly special experience for folks of any age."], ["Reviewed September 8, 2017", 5.0, "Beautiful views og the Pacific Ocean", "I never get tired of Point Lobos. We make it a point to see it as often as possible.\nThe have a few picnic places and pull offs to see the views At the end of the road there is a parking lot and you have a picnic and hike.\nIt is a State Park so you can not take anything out of the park, but there are tide pools to enjoy.\nWe see whales now and then. There are Rangers and volunteers to help you learn more about the area.\nAn excellent family outing to learn more about nature and the beauty of the Pacific Ocean.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Not As It Was...", "We have been coming to Carmel and hiking Point Lobos for at least 20 years, and this last time was a real disappointment. They have closed off some of the trails that follow along the bluffs overlooking the ocean, and have put in a new path going back to the entrance. We REALLY missed the ocean overlooks where we often spied sea lions and their pups. And altho the new path was advertised as \"beautiful\" it most definitely was .not - some of the poorest woodland hiking we have done - and it was at least 50% further than walking on the road. It is still a lovely place if you drive in and go to the headlands straight ahead or take the trails to your left. But really did miss the original North trail.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Carmel weekend", "Beautiful park to easily hike n enjoy sea lions n unusual trees n plants. Friendly docents n park staff"], ["Reviewed September 7, 2017", 5.0, "My favorite hiking/reflecting spot in Carmel", "Spectacular scenery along the coast with trails for every ability level. Crashing waves, sea lions, sea otters, may types of birds, and, while popular, never feels overused. Be sure to visit the trails that begin by the entry station (you have to park on Highway 1 and cross over the road) which tend to be less traveled than the ones close to the parking lots inside the park.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Taking a little hike", "This is a very special place to take someone for a walk around and enjoy the beauty of all the sites."], ["Reviewed September 6, 2017", 5.0, "spectacular views and easy hiking", "My husband and I were visiting the area to see our son and wanted to see the natural beauty of the area. We came early on a weekday to avoid the crowds. The hiking was not too difficult for a fit, but not athletic, woman in her fifties. The scenery was spectacular. We went on four different trails. The docents had set up binoculars on the seal point trail and we were able to see sea otters, sea lions, seals, and a variety of birds. We even saw whale spouts. After about three hours we were tired and ready to go. My recommendations are to go early and dress in layers. Some parts of the trails are windy and a little cold, but you can also warm up pretty fast.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great easy day hike", "We love just walking this trail and taking in all the beautiful scenery. It's an easy hike on a well maintained trail."], ["Reviewed September 5, 2017", 5.0, "Fun place", "I took my wife and kids there and we had a great day. It helps to get there at 8am because the parking is limited. We saw sea lions and seals, sea otters, dolphins and most importantly we saw whales. Breaching Humpback whales. Good place to hike and get some exercise.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Nice place but plan on a early arrival.", "We have been here many years ago and had a couple hours for another visit. Especially on the weekends it gets busy so they only let so many cars in. Right on the coast and many stops with short hikes. I packed a lunch and there were some tables with an ocean view which made a great time. My favorite place was Hidden Beach and not to be missed. It is easy to find, but be careful especially with the kids as the ocean tide could be dangerous. $10 fee to get in for the whole car.\nShow less"]]}}