{"Point Loma": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Point Loma", "url": "/Attraction_Review-g60750-d116564-Reviews-Point_Loma-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/fa/7d/44/point-loma.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1679"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 4.0, "Fantastic views", "The views here are spectacular. We went before sunset and it was great. We came back and spent some time in the cemetery and found that quite interesting. It's an incredible place."], ["Reviewed 1 week ago", 5.0, "Shades of the past on Point Loma.", "Point Loma is the western demarcation of ingress/egress to San Diego Harbor. There are plenty of historical Portuguese-style homes-with special features for carrier pigeons used for families to communicate with the fishing fleet. Be sure and visit the Cabrillo National Monument for great views (covered in a separate review). Also, you can view the remnants of military bunkers with huge iron doors. Most visitors will likely want to move to Point Loma, but it's expensive in that regard.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great part of the Pacific", "Love this part of San Diego, and section of the Pacific Ocean. Clean, and beautiful. Take in the local charm of the area."], ["Reviewed 1 week ago", 3.0, "beautiful", "Great area. My only tip is to take an uber because the parking is a nightmare. I really wish they had more places to park without the fear of being towed"], ["Reviewed 2 weeks ago", 5.0, "Great hidden gem", "My nephews went to college at Point Loma and this this area of San Diego is one of the perfect examples of why San Diego is one of the prettiest places in the world to live."], ["Reviewed 2 weeks ago", 5.0, "Pt. Loma Magic", "If you visit San Diego, you must make it a point to drive out to Point Loma. Highlights of your daytrip should include the beautiful Cabrillo National Monument, The Tidepools, and a visit to show your respect at the Fort Rosecrans National Cemetary. Views from all over Point Loma are spectacular, looking to the east you will see the beautiful San Diego skyline, and to the west the Pacific Ocean including islands off the coast of Mexico. Point Loma is a magical place, steeped in history, but easy on the eyes.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful vistas", "If you have an appreciation for water this is a good place to just BE! San Diego has many faces and this is just one of the many!"], ["Reviewed 4 weeks ago", 4.0, "Beautiful", "I can't imagine there is a better way to see San Diego than traveling to Point Loma. With Cabrillo and the tide pools and the trails and light house and bunkers, there is so much to see."], ["Reviewed 5 weeks ago", 5.0, "Fantastic view of San Diego and the Pacific Ocean", "Absolutely lovely, USD$10 to enter the reserve and it is a priceless view of San Diego and the Pacific Ocean. Just gorgeous and was well worth it."], ["Reviewed January 21, 2018", 5.0, "Great views", "It has been many years since my last visit, but it is still as beautiful as it was back then! I always enjoy popping into the little restaurants. And don't forget your camera."], ["Reviewed January 16, 2018", 5.0, "beautiful area", "Really beautiful area, always enjoy coming here. Has some good restaurants and wonderful views of the city, bay and ocean."], ["Reviewed January 15, 2018", 5.0, "View of San Diego Bay", "Amazing views of San Diego Bay with its pristine blue waters. A strong wind brought in a thick fog and our amazing view disappeared. It was quite the experience!"], ["Reviewed January 9, 2018", 4.0, "Great views of the city", "This area had some great views of the city. I don't remember SD being very hilly, but this area has a ton!"], ["Reviewed January 9, 2018", 5.0, "Lovely Place to Stay", "My husband and I were blessed to spend a week with his aunt and uncle in Point Loma in March. Their house is on a hill within walking distance to shopping, restaurants and even a great church!"], ["Reviewed January 8, 2018", 5.0, "Beautiful scenery", "Nice place to walk along and have a picnic. Beautiful scenery of the ocean and shoreline (shore is rocky)."], ["Reviewed January 7, 2018", 4.0, "On a Clear Day....", "On a clear day you can catch some of the most astounding views of the Pacific Ocean, the San Diego Skyline and the harbor. Great Photo Op!!!"], ["Reviewed December 30, 2017", 5.0, "One of the historic termination points for U.S. Highway 80.", "We visited Point Loma, which has some excellent views, and a lot of history to it. Our main reason for visiting was because this was one of the former Western terminus points for U.S. Highway 80. I grew up on the Eastern terminus, which is still there for Highway 80 and thought this would be a cool visit, and it was.\nShow less"], ["Reviewed December 27, 2017", 4.0, "One of the best sunsets Point", "I visited this place with my family and it was really amazing view and had lots of fun. This place is an ideal place to view sunset. The place has trails for hiking too."], ["Reviewed December 26, 2017", 5.0, "Beautiful Walk Along the Water", "This is a beautiful place to walk and reflect and learn a bit of history and ecology. Parking is convenient and there's a sweet, low-key visitor center with some interesting souvenirs. Worth visiting."], ["Reviewed December 25, 2017", 5.0, "Well worth the trip! OUTSTANDING SCENERY!!!", "On the way to do whale watching in San Diego, stopped here to gaze at the breathtaking scenery - it's FANTASTIC - well worth a detour!!! Wish we had had more time to hike the trails - it's just a great day out in nature - but please, respect all the wildlife, leave them in peace, and don't litter.....\nShow less"], ["Reviewed December 25, 2017", 5.0, "Beautiful Walk, Awesome Views", "This last trip, we finally made some time to visit this attraction. There's quite a bit to see here - tide pools, a bit of history, birdwatching, views that stretch seemingly forever ... This is a great place for nature lovers and history buffs.\n\nIt can be a bit cool here during the winter months and breeze as well so bring a jacket (I realize \"cool\" is subjective, depending upon where you're from!). There is an entrance fee but parking is plentiful.\n\nThere are quite a few hiking trails so bring your camera. You'll get some great shots of the ocean, coast, and city.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Beautiful Sunset Views", "We added Point Loma to our San Diego itinerary and, boy, are we glad we did. We took pictures of a spectacular Sunset over the Pacific Ocean. Then we turned around and took pictures of San Diego and the Harbor. You just need to do this one, especially around Sunset.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Beautiful part of San Diego!", "This is a beautiful part of San Diego where you will find great places to eat (Point Loma Seafood never disappoints and you can sit outside) and enjoy being right on the water with super views, and a relaxed atmosphere."], ["Reviewed December 15, 2017", 4.0, "Thousands eyes needed", "Very good and plain view from the top. Feeling like thousands eyes needed to watch this great look. Keen to visit in future too."], ["Reviewed December 13, 2017", 5.0, "Great view", "Great place to view the harbor. Able to watch the navy ships coming and going. Also great for viewing the planes take off and land. Great view of San Diego also. Very windy and cool late in the day."], ["Reviewed December 11, 2017", 5.0, "The View", "This was an awesome place to view the San Diego area. Beautiful light house, hiking trails, visitors center. The views are in every directon. You can even see into Mexico. Beautiful Place, a must see."], ["Reviewed December 8, 2017", 5.0, "Best view of San Diego from Top", "This place was not in my list initially but when i got feedback about this place from my hotel I added to my list.\n\nAfter visiting this place i come to know , its must go place in San Diego.\n\nThis point on top of the hill which give spectacular view of San Diego city , coronado island and bay area. Nice light houses on top.i feel afternoon till evening is best time to visit this .\n\nLoved the view.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Spectacular view", "Overlooking San Diego you drive thru military cemetaries very somber and should be treated with respect. Going with this are great views, walking trails and ocean pools to admire. Worth the trip out to the lighthouse too."], ["Reviewed December 5, 2017", 5.0, "Beautiful views", "Well worth the visit for absolutely fantastic views of San Diego bay, North Island and Coronado. Lots of history here with the military installations, Fort Rosecrans cemetery and the Light House. Bring your camera to capture the memories."], ["Reviewed November 19, 2017", 4.0, "Exstatic View", "It is quite a long drive but worth it for a wonderful panorama of the city and bay. There is also an excellent film describing the 'discovery' by the Spanish of San Diego and the story of Cabrillo. It was made even better that by chance we visited on Veterans Day when entry is free. A nice surprise.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Tidal pools, lighthouse and visitor centre", "We arrived at low tide to see the sea life. Unfortunately a virus has wiped out a lot of the sea stars. I slipped on the rocks and fell in a tidal pool. Fortunately, I gave my camera to my son-in-law just before I fell.\nThe lighthouse is open 4 times a year and we lucked out to arrive on a day that it was open. We didn't have the patience to wait in the line for 30 minutes to go on the tour of the lighthouse.\nWe met one of the last family members who grew up at the lighthouse in the building beside the lighthouse. If you go between December to March you may be able to see grey whales on their way from the Arctic to their breeding grounds in Mexico.\nThe graveyard on the road to Point Loma is a sad reminder of the many soldier's lives that have been lost.\nThe point is at a high elevation so you can see amazing views of San Diego. There are signs by the visitor's center that tell you the mountains you are looking at, ships and planes. It was a memorable visit.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Wow the view!", "After a bunch of trips to San Diego somehow we had never ventured out to the Point. We never knew what we were missing! After venturing out to National Park we parked the car and enjoyed a walk along the paved pathways on this spectacular point overlooking San Diego Harbor and the Pacific.\nThe lighthouse, the WW II fortifications, the pastoral view of the Victorian era Coast Guard buildings at the bottom of the hill and facing the ocean are all spectacular elements of the park. But the real gem, the view, provides a number of moments that take your breath away. Enjoy with a date or your spouse and it is sure to be a memory shared.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Great views of San Diego", "Some really nice views of San Diego and the harbor can be obtained from here. It's also a very good way to see the expanse of the National Cemetery."], ["Reviewed November 2, 2017", 4.0, "Interesting Place with Great Views!", "I visited here whilst on business, so couldn't devote as much time as I would have wanted. The drive to the National Park takes you past the Navy Cemetery, which is interesting in itself. The Park contains some walking paths, the Park HQ, and the old Point Loma lighthouse, which has been refurbished into a museum. Very interesting place to walk around, and the views are amazing - over San Diego, Coronado Island and the Navy Air Base to the South; and open Pacific views almost everywhere else!\n\nWorth a visit, but it is quite a detour off the beaten path to get to the south end of Point Loma!\nShow less"], ["Reviewed October 30, 2017", 5.0, "Walking, Working, Eating, Birding & Playing", "Pt. Loma is rich in history, especially along the bay that currently houses 5 yacht clubs and various boat repair shops. You can also hear the harbor seals squealing and the fog horns blowing steadily. You can catch a sunset from the small café on the public pier where fisherfolk and brown pelicans hang out, a glorious sunrise over the bay, and lots of near shore birds almost everywhere. Or enjoy some freshly caught fish at one of the Shelter Island restaurants or two new ones in the village -- Seafood Pho and Shanghai Bun and Tapas. It's easy to park (free) on Shelter Island and then walk along the bay over to the first spot for Chinese Fishing Fleet (near the San Diego Yacht club), past the Portuguese area with a chapella, market, and hall as well as the beach where Dana cured hides and then wrote about his experiences in \"Two Years Before the Mast\". If you love the outdoors and history, then explore Pt. Loma.\nShow less"], ["Reviewed October 25, 2017", 4.0, "One of the best overviews", "Point Loma is an nice and interesting place.\nUp the hill, you have an amazing overview over San Diego downtown and its harbour. It's nice to walk around and to get an idea of how big the city is where you're currently staying.\nIf you drive down you will see sea lions between the surfers, some small cliffs and the nice wind from the ocean.\n+ the ticket (10$) is valid for a week.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Beautiful Views", "It is definitely worth the drive. Beautiful views and history. Wear walking shoes because you will want to see it all."], ["Reviewed October 22, 2017", 5.0, "Amazing views!", "We wanted to visit a place to capture some great photos of the ocean while visiting San Diego and this definitely accomplished just that! Bring your camera, and your tennis shoes, entrance fee is $10 and is totally worth it!"], ["Reviewed October 18, 2017", 5.0, "Fabulous days on the Bay; great restaurants; so many sites to explore!", "I love taking friends and family to Point Loma when they are visiting from out of town. We live in La Jolla which is also beautiful, but Point Loma has a whole different collection of historical and fun sites, beach access points, and wonderful restaurants.\n\nFor small kids or for teens, Point Loma has something to explore for families or friend groups.\n\nCabrillo National Monument is a great site at the end of Point Loma with excellent views of the Bay, the ocean, and of Mexico on a clear day. The tide-pools on the western side of the end of Point Loma are a favorite of our family... kids, teens, and adults all love walking the tide-pools and trails along these beach edges and taking photos at any time of day.\n\nGoing back into the heart of Point Loma, if you can find someone who is a member of the San Diego Yacht Club, go enjoy a wonderful lunch on the deck, overlooking the boats of Shelter Island. The history of the SD Yacht Club goes back to some incredible years of winning and holding the records for the America’s Cup for many years.... it’s a great Club\n\nAlso on Shelter Island are classic restaurants of Old Venice (wonderfully nice and loving owners who treat their guests like family) and Miguels (with a delicious white dip in addition to guacamole and salsa).\n\nBe sure to check out the summer schedule of outdoor concerts at Humphrey’s... this is a classic experience to see and hear some of the most classic bands and singers from across the decades perform in this wonderfully quaint, small, outside breezy setting. Think Frankie Valli, Willy Nelson, Beach Boys, Chicago, Trisha Yearwood, and more.... it’s a classic San Diego experience!\n\nLiberty Station is a wonderful complex of buildings that includes shopping, restaurants, performance stages, and galleries. It’s a fun area to explore with kids (check out The Corvette Diner for great burgers and fifties’ decor) and a whole array of restaurants for young and old.\n\nPoint Loma is a great area to explore.\n\nTraffic on Rosecrans, the main artery of road access, can be very heavy. Use WAZE or Google maps to check traffic on routes in and out.\n\nThe ROCK church holds services on Sunday mornings through about noon so that adds many people onto Rosecrans. They have a very active congregation so just be aware of checking traffic.\n\nSometimes it’s good to consider Nimitz as an alternate route into Point Loma if you’re coming from the north, or Harbor Blvd if you’re coming from downtown.\n\n\n\nShow less"], ["Reviewed October 15, 2017", 5.0, "My friend said this is a must see", "My friend told me that no visit to San Diego is complete without seeing Point Loma, the Cabrillo National Monument and Fort Rosecrans National Cemetery. He was right. The views are spectacular. A plaque lists the Portuguese name \"Joao Rodrigues Cabrilho\"\nthat for some reason was anglicized to Juan Rodriguez Cabrillo.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Wonderful view, nature and Park", "Came here on a weekday when they opened at 9am, best time, plenty of parking.\n\nVisited the Cabrillo Visitor Center, the female park ranger was nice, friendly and after hearing we planned to visit tide pools down below around 11am (lowest tide for this day) which coincide with their 11am show (On the Edge of Land and Sea) which covers beautifully about Point Loma tide pools she made a special showing for all of us at 9am. It's about 20 minutes movie, must see for those who are interested in tide pools.\n\nWe also stayed for the 10am \"In Search of Cabrillo\" who was the first white man that discovered California and the park is named after him. Very good also.\n\nThe \"point\" where Juan Rodriguez Cabrillo statue is just around the corner and nice vantage point to see San Diego, Coronado Island (and the Naval Base) and beyond.\n\nThen lighthouse is few minutes walk up the hill is worthwhile to explore a little.\n\nAfterward drove short distance to tidepools down lower park. However, according to ranger even though we went at right time for lowest tide, the best low tide is +0.7 or less, on this day it was +2.6, so we still didnt see much.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Enjoyes hiking and the views. Will try whale watching in the winter!", "Used my National Park pass and thoroughly enjoyed about 4 hours at this lovely place! We went hiking down to the rocky coast on the ocean side, enjoyed a picnic, and then later enjoyed the vistas of San Diego and the gift shop!"], ["Reviewed October 8, 2017", 5.0, "Well worth the time!", "We had time to kill on our last day in San Diego. The view of the surrounding area from the old lighthouse is sweeping. The history of the lighthouse and the area is fascinating. We learned so much from one of the docents, Fred, who added so much to the experience.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Family Picture @ Point Loma", "We were on a tour to San Diego from LA. Visited Cabrillo National Monument. On the stop over for a photo shot @ Point Loma; was a welcome decision from the monotonous ride. Good to carry some packed food like cookies or biscuits with water off course to munch on.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Interesting historical site", "Long drive down the peninsula (30 mins) - but traffic light. Site shared with US Navy. Sights include old lighthouse and accomodation, visitor center and great views of ships in and out of San Diego/"], ["Reviewed October 2, 2017", 5.0, "Spectacular views of San Diego", "I have been a resident of this area for many years and this is my favorite !!! The views are incredible, the harbor, the skyline and beautiful paved walks and parks to take it all in. Drive to the end of the Point Loma peninsula, an easy drive, to the Cabrillo National Monument with its jaw dropping views. Along the drive you will view Ft. Rosecrans National Cemetery with its many headstones of our fallen military overlooking the ocean,beautiful.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Beautiful National Park", "Point Loma in my opinion is probably one of the best visitor attractions in the San Diego area. It scenic beyond belief and the views both over the city and the sea are amazing. Well worth a visit."], ["Reviewed October 1, 2017", 5.0, "Worth the visit just for the stunning views of San Diego and beyond", "What a lovely way to spend a few hours checking out a bit of history and the stunning views of San Diego. I recommend you do the whole thing on foot once parked."], ["Reviewed September 29, 2017", 5.0, "A Must Excursion in San Diego", "Locals know this already, but the beautiful surroundings of Point Loma and its trails are not be missed It is part of the National Park System (admission is $10 per car). Visit the museum, the lighthouse, and walk a few the scenic trails. The one near the lighthouse explains the migration of the whales. Another takes you to the fascinating tidepools. Associated with the museum are free films and there are free guided tours.\nGreat adventure for the entire family.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Amazing view of San Diego from here", "The light house itself was awesome. The views from this point was spectacular and picturesque. It is great for taking pictures. You get a breathtaking view of San Diego coastlines."], ["Reviewed September 16, 2017", 5.0, "Our favorite place in the San Diego area", "This was our second time to visit Point Loma and the Cabrillo National Monument and it continues to be our FAVORITE area of San Diego to visit. There are so many beautiful facets of Point Loma with the Lighthouse, the Cabrillo National Monument, some military history, the amazing military cemetary, and the most beautiful cliff side to get up close to and make exceptional photographs at. It's just all there!!! Point Loma is a MUST SEE if you are going to San Diego for a vacation.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Beautiful!", "Point Loma has beautiful ocean views and white sand beaches. The nearby restaurants are wide in variety and high in quality."], ["Reviewed September 11, 2017", 5.0, "Great place", "We brought our 9 year old grandson and his mother for their first trip to California. This was one of the first stops to see the great Pacific Ocean. Wow, what a fantastic treasure for the world to witness. Simply beautiful and I hope we have another opportunity to visit again.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Lovely Rock Pools", "Parked up by the shore and took a lovely walk along the beach / rocks. Wonderful views and great for kids to hunt for crabs in the rock pools."], ["Reviewed September 6, 2017", 5.0, "Tidal pools on Point Loma, who knew this was so cool?!?!", "I've been going to San Diego and just recently found the point loma tidal pools and it was incredible! Kids and adults alike playing with crabs, sea anenmones, fish..you can hike and explore the area, staying dry or getting wet, there is no beach, but the ocean views are amazing.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Most favorite thing I did in San Diego!", "The views from this place beat any I have ever seen! This is a must do!!! You won't find any better views of San Diego!"], ["Reviewed September 4, 2017", 3.0, "Provides good views of the Area", "Access is through Military entrance, be prepared to observe all regulations. Travel is also through residential neighborhoods. Be patient with traffic."], ["Reviewed September 3, 2017", 5.0, "So beautiful", "So glad we decided to take the drive thru here. I felt like I was on the edge of the world. I felt so small with that great big ocean on one side of me. Truly beautiful"], ["Reviewed September 1, 2017", 3.0, "When they say it closes at 5, they mean it.", "We made a mistake going here, not arriving until 4 when it shuts at 5 (and it really does shut, the rangers herd everyone out), and on a cloudy day. The views are ranging for sure but not as spectacular as I was expecting. You have to drive between the monument and the rock pools despite it only being a short distance as there is no sidewalk. The lighthouse is quite interesting and the display of lenses good, but that's about the only positive for me. It's quite a long drive out and it's not cheap to get in (the ticketing system seems to penalise people who arrive on foot or by bike, which as someone from a country which actively discourages car use I find very strange). If you get an Uber there be aware the 3G signal is very weak/non-existent to arrange the return journey. If you're really into local history then worth a visit; otherwise there are a lot of other better things to do in SD.\nShow less"], ["Reviewed August 29, 2017", 5.0, "WOW - Look Out At the Ocean - WOW", "If you love the ocean and ocean views, Point Loma is one of the best scenic ocean views available in the Western US. Quiet, peaceful and beautiful. NOT, a place to be alone at night. NOT a place to look like a tourist."], ["Reviewed August 26, 2017", 5.0, "Something for Everyone", "A very enjoyable place to visit and something for everyone - history buffs, walkers and people who just enjoyed a very attractive view. It's well-maintained and interesting spots are highlighted in plenty of detail. There was a $10 entrance fee for a car. I think that was the most expensive charge; walkers, bikers etc would pay less. It was well worth it though and I would revisit this place.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Easy hikes with Amazing Views", "Took our kids here at the recommendation of a friend. The views are stunning and the hike to the bottom is easy for kids 2.6 miles round trip. The hike back up is a bit steep but its doable. The tidepools on the other side are really cool to explore and we saw a seal swim right up to the side. $10 gets you into the national park and the ticket is good for 5 days. Totally worth the money. We spent about 2.5 hours here hiking and exploring. You can go up into the light house to see how it used to be occupied. Bring quarters if you want to use the telescopes around the point. The visitor center has a great exhibit and the park rangers was a wealth of knowledge. Get here early because the gate backs up. We arrived around 9:30 and the line was about 4 cars deep. When we left at 12:30 it was probably 30 cars deep. Early bird gets the view!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Terrific rock formations and tide pools", "Enjoy spectacular views of the bay and great tide pools. Wear good footwear so that you don't slip on the rocks at the pools."], ["Reviewed August 23, 2017", 4.0, "Beautiful", "Beautiful place, with you are in San Diego, you should Go. You 'll spend maybe 1 hour to see a Nice landscape."], ["Reviewed August 21, 2017", 5.0, "Moteling", "Point loma is do pretty. My friends and i stayed in point loma for 2weeks just to get away from east county. I dont remeber the last time i had so much fun."], ["Reviewed August 19, 2017", 5.0, "Scenic Area", "We drove to Point Loma to visit several sights in the area. There are lovely views of the coast and the city. We visited the Cabrillo National Monument, Fort Rosencrans National Cemetery, the Point Loma Lighthouse and the beach. It was very pleasant and peaceful."], ["Reviewed August 16, 2017", 4.0, "SEE MANY SIDES OF SAN DIEGO IN ONE PLACE", "Drive out to the end of Point Loma and see many features of San Diego along the way -- the former fishermen's community of Roseville, significant architectural areas like Fleetridge, the nuclear submarine base, Rosecrans National Cemetery, the old lighthouse, and finally the Cabrillo Monument. All within a few minutes drive from downtown or nearest freeways. If you're a visitor, be sure to include this in your itinerary.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Amazing views of San Diego.", "Great place to spend an afternoon and learn about the history of San Diego while enjoying breathtaking views. There's a lot to do; two lighthouses, the monument, Cabrillo museum, tide pools and cliffs. I would love to return during sunrise or sunset."], ["Reviewed August 15, 2017", 5.0, "Gorgeous Views", "This is one of the most relaxing beautiful cities in the country. Very clean, safe, serene, and gorgeous homes dotting the coastal areas. Perfect place to take a drive or walk along the beach."], ["Reviewed August 13, 2017", 5.0, "Day Trip", "Grab lunch in Ocean Beach and head down for the afternoon or bring a picnic lunch. Visitors can easily spend a few hours or more visiting the cemetery, walking around the Old Point Loma Lighthouse and Cabrillo Monument and driving around the beaches and tide pools at the national park. If the line to pay the entrance fee is long, you can park along the road and walk in. The walk to the lighthouse, the visitor center and the monument is relatively easy but having a car for the beaches and tide pools below is necessary less able walkers and those looking to only spend a few hours on the peninsula rather than the whole day. This is a MUST SEE if you're in San Diego!\nShow less"], ["Reviewed August 8, 2017", 4.0, "Bring your national park pass", "The cabrillo monument is a beautiful spot to learn a bit about history. You can climb the lighthouse, and see how the light works. You can see a bit of history regarding the large guns they built around the point. Also, you can buy some souvenirs in the shop, and see all the way to downtown from the viewpoint. This is a National Park and accepts the National Park pass. If you don't have one, you can just get a one day pass, currently $10 a car. Stop by the tidepools if the tide is low (info in the visitor center on tide times and levels).\nShow less"], ["Reviewed August 1, 2017", 5.0, "Great views", "A great place to stop and see the Naval ships from above the harbor and the North Island Naval Air Station. The National Cemetery and all the ocean views."], ["Reviewed July 31, 2017", 5.0, "Best View of San Diego", "I had family visiting from Australia and tried to give them an idea of what was around San Diego. The view from Point Loma is the best way to show off the city. From here you can point out most of the major points from San Diego to Tijuana.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Amazing", "This place is really nice and cool to visit. You can bring your animals there and the weather is nice as well. It's good for heath because you have to walk through the hill."], ["Reviewed July 29, 2017", 5.0, "Best View!", "Point Loma was easy to get to and the greatest views of the city! Also met someone who lives in San Diego and she gave us a lot of great information - very friendly and helpful. The tide pools are something to see while you are here - very beautiful.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Always love Point Loma", "Point Loma Sea Foods is always a stop when we are in the area. Lots of parking with in walking distance, whole area was clean, and food was outstanding."], ["Reviewed July 26, 2017", 5.0, "Awesome view of San Diego and Coronado", "Its about 30 minutes from downtown and provides wonderful views. Well worth the drive. We spent just under an hour at the visitors center. We did not visit the lighthouse. I'd recommend 1-2 hours if you want to see it all and take your time. There is a small museum exhibit that is informative and well done. There was a \"conquistador\" in the museum hall with replicas of chain mail, swords, and crossbows of the era. His discussion was informative for all ages and he did an excellent job answering the kids questions. We arrived around 1:30 but had to wait about 30 minutes before we could enter. There were lots of cars but only one lane to pay the park entrance fee.\nShow less"], ["Reviewed July 25, 2017", 4.0, "It was a wonderful tiny trip!", "On 7/8, we drove to Pt Loma in the late morning and had a little \"picnic\" there with a beautiful, great bay view! The weather was so nice with the wind. Easy to find a parking space in the morning and hike a little bit to see the old light house and some small exhibition hall. Many simple hiking trails allow people to walk. Bad side is that if you like to go to the Tide Pools which closed at 16:00, you better go earlier as the parking lots down that side was really hard to get. You need to line up in your car on the road. Suggest to spend more time at the Tide Pools than upstairs. Overall, it's a nice place for you to go as a mini trip, pay just $10 per vehicle and it's valid for 7 days( national park permit can be used there)!\nShow less"], ["Reviewed July 21, 2017", 4.0, "Great views, no shade", "When you drive up to Point Loma you'll pass a arlington-esque military cemetery and then pay 10 dollars per car to enter the park.\n\nThere is ample parking and many scenic views overlooking the vast Pacific or the City.\n\nThere are cliffs down the road that you can climb on and do a little hiking over. You can see some fish and crabs in the small tidal pools that cover the rocks.\n\nIt's a pretty nice place to go check out when visiting San Diego.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Great neighborhood with many interesting places to visit", "This is a peninsula sticking out into San Diego Bay and the Pacific. There are a lot of interesting places to visit in this area: Cabrillo National Monument, Rosecrans National Cemetery, Sunset Cliffs Natural Park, Liberty Station, a perfect secret spot to photograph San Diego skyline in the dusk, etc. Try to spend the whole day here. You won't be disappointed.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Point Loma", "We liked the area especially Shelter Island and the views. We liked Old Town, LaJolla, Balboa Park and the Zoo. We could have missed Liberty Station. The views from rental were great but I think I would opt for a resort next time."], ["Reviewed July 17, 2017", 5.0, "Beautful View", "The view of San Diego from here is breathtaking. We arrived just before closing but they were kind enough to let us in for a few minutes. I was able to snap a few photos to remember this amazing view."], ["Reviewed July 14, 2017", 5.0, "Point Loma", "Of all the attractions or places to visit while in San Diego, this should one on your top 5......Absolutely beautiful day and one could see for miles out into the Pacific."], ["Reviewed July 13, 2017", 5.0, "Beautiful Point Loma", "This is a great side trip from the hubbub of downtown San Diego. At the end of the road, you pass by military cemetery on the way to the Light House where you get a fantastic views of the entire marina, beach, naval station and Coronado Island.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Great views and perfect for photos of the boats and harbor", "This is a great location for photos. We were able to view a submarine leaving the harbor and got great shots."], ["Reviewed July 10, 2017", 5.0, "Must see if you're in San Diego", "Great facility, great history, great views. Wait until the fog/haze burns off and then head up there. Allow at least a couple of hours, visit the lighthouse and the tidal pools."], ["Reviewed July 10, 2017", 4.0, "Worth Discovering", "The community of Point Loma is nestled under the west side (harbor side) of the point and covers a few blocks near Shelter Island. It sports some nice restaurants and is a favorite spot for San Diegoins to enjoy a Saturday lunch."], ["Reviewed July 10, 2017", 5.0, "The Real San Diego Ocean Community", "If you want an authentic experience in San Diego where real people hang out, people fish off the dock for real and the people are real and colourful, then spend some time in Point Loma. Access to Ocean Beach and the docks alike, all kinds of interesting hole in the walls to eat and hang out in awaits you. If you like watching beautiful sunsets, there is Sunset Cliffs. If you want to take your dog to play on the beach, there's Dog Park. If you want to see all of the amazing people who inhabit this area, take a walk in Ocean Beach.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Point Loma is a MUST see in San Diego!", "Gorgeous views of the Pacific Ocean! You can see the Naval Base and shore line of Coronado! It costs $10 to enter the park per vehicle, but is good for a week. Try to get there early to beat the crowd."], ["Reviewed July 9, 2017", 5.0, "Part of Cabrillo", "Good place to tour after landing, if you get a rental car. Park to Cabrillo and point Loma closes early check times. We were there early afternoon"], ["Reviewed July 1, 2017", 5.0, "Must see! Beautiful park.", "Beautiful views and lots of history. See the lighthouse museum. The cliffs have great views and walkways by the ocean."], ["Reviewed June 29, 2017", 4.0, "Great view", "Up to the hill and you can see the entire San Diego and Tijuana. Passing by rosecresan cemetery and looks very stunning. We also continue drive up to the end and you can find a light house there"], ["Reviewed June 28, 2017", 5.0, "smell the air, oh that ocean breeze!", "Pt Loma is one of the hearts of San Diego, it was once a bustling Navy area that housed the sub base as well as the West Coast recruit center (boot comp). It's been transformed into what it's always been, one of our roots. From Shelter Island to Ocean Beach to Point Loma Nazarene University to Cabrillo Monument there is always something going on in the Point\nShow less"], ["Reviewed June 27, 2017", 4.0, "Breathtaking views", "Spectacular views of San Diego and the harbor. Sadly, the tide pools are not visible in the summer. Wear comfortable walking shoes and bring water if you plan to walk the trail along the cliffs."], ["Reviewed June 27, 2017", 5.0, "Great way to see San Diego harbor", "If you take the harbor boat trip, visiting Point Loma Park is a must. You really get a great view of the whole area that was visited by the cruise. And the restored lighthouse is done well and very interesting and informative. Great way to spend an afternoon in San Diego.\nShow less"], ["Reviewed June 23, 2017", 5.0, "A Must See!!!!!!", "The most spectacular views in all of San Diego. This is a must see for whale watching at certain times of the year and offers terrific views of the Navy ships entering the harbor as well as spectacular views of Sand Diego City."], ["Reviewed June 17, 2017", 4.0, "Visit the tidepools", "A very nice hike along coastal cliffs takes you to tidal pools you can climb down to and explore. The views are spectacular and exploring the pools was so much fun with little kids. If you want to go down to the pools check the tides and go at low tide. Also, be aware there's climbing involved, but the experience is well worth it. My 6 and 5 year olds were able to make the climb with help.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Point Loma", "A fun busy place to visit when you are in San Diego. From Point Loma Light House to fun wonderful places to eat like Point Loma Sea Food. Fresh Sea food, always great, always busy."], ["Reviewed June 15, 2017", 5.0, "Beautiful vistas", "What a wonderful time we had traveling around Point Loma. There is plenty to see, lots of opportunities to get out and hike a bit. We were there this past December and to say the weather was perfect would be an understatment. If you go out to the point lighthouse you might want to bring a sweater, or you can buy one in the gift shop. The views are breathtaking, lots of history. There is a film you can watch and the people are happy to answer any questions. Very friendly! We would love to go back!\nShow less"], ["Reviewed June 13, 2017", 5.0, "Gorgeous view", "My boyfriend wanted me make sure that I did not miss this attraction. One of his favourite points in San Diego. Words can't describe the view of everything it had to offer. Truly breathtaking! A must to visit."], ["Reviewed June 12, 2017", 5.0, "A wonderful hike down to the tide pools", "Point Loma is located in Carrillo National Monument, there is a $10 per car entrance fee that is good for 7 days. We visited the monument and the exhibits up above then drove to a hiking trail that took us to the tide pools that are only accessible during low tide. The view was incredible.\nShow less"], ["Reviewed June 9, 2017", 4.0, "Great views and some interesting history", "Fee for entry to the park unless you have a pass. Wide ranging views and you can even see down to Tijuana. Small museum explaining the history of discovery of the area which was enlightening. Strong coastal breezes so a light jacket required if you feel the cold.\nShow less"], ["Reviewed June 3, 2017", 4.0, "Point Loma is full of incredible views and incredible eats at all prices.", "Breathtaking views from the Point Loma Light House, tide pools at Sunset Cliffs, views of aircraft carriers and small fishing vessels, walk up taco huts and peninsula views from Bali Hai, Point Loma is very much a \"locals only\" haven."], ["Reviewed May 30, 2017", 5.0, "Another great view of the ocean", "This is a very nice viewing spot of the ocean and the bay. Beautiful drive up to see the ocean and vistas and remember to stop and see Fort Rosecrans Cemetery"], ["Reviewed May 28, 2017", 5.0, "Magnificent", "Worth visiting. When you go there you will feel on top of the world and you see the whole city from above."], ["Reviewed May 28, 2017", 5.0, "Beautiful and surprisingly lots to do", "We went here as a last minute choice, and it ended up being one of our favorite parts of our trip. The views are spectacular. We spent a long time at the tide pools enjoying the peaceful atmosphere and looking for hidden animals. The light house had a small but interesting little museum. Several places take some walking and few paths are steep so anyone with mobility issues might have a tough time. Also, we accidentally drove onto an active military base when Google maps took us to the Point Loma base instead of the park - but the soldiers on duty were very kind and directed us where to go. So check that Google maps is taking you to the right Point Loma :)\nShow less"], ["Reviewed May 25, 2017", 5.0, "See Point Loma from the water or by land; beautiful, special, so many things to see and do", "By land: Visit Cabrillo National Monument for good history and views or the Fort Rosecrans Cemetery for a reverent reflection of service to our country, The tidepools and coastal walk are fabulous on the west side below Cabrillo National Monument. My daughter's favorite place to visit for an out-of-the-way place, not so heavily touristed.\n\nGo down to Shelter Island or Harbor Island for a feel of the marine/boating neighborhoods. Great parks for kids to run, while the bay breezes always make it comfortable. There's a great bikepath here also.\n\nBrunch at Bali Hai is fabulous.... great views of the bay and delicious food for the family. Make a reservation and enjoy our local treasure.\n\nSo many great little cafes and boutiques in and out of the streets.... Be sure to visit Miguel's for great Mexican food (the white dip is soooooo good with their chips!). Old Venice is a delicious Italian restaurant and very family oriented. Wonderful owners and great service.\n\nLiberty Station offers a variety of options for shopping as well as groceries to stock up for picnics and bbqs.\n\nDon't forget the Corvette Diner. The kids (big and small) will love the old-style 50's diner with all kinds of crazy things to order. The DJ takes requests and it's a lot of fun. Birthday parties are a blast here!\nShow less"], ["Reviewed May 23, 2017", 5.0, "Views to die for", "some of the greatest views of San Diego you will find. the harbor and naval airport on the opposite point"], ["Reviewed May 22, 2017", 5.0, "The most amazing city and water views", "This place is truly unique and impressive, a scenic overlook of the city and water at the end of a drive through a Navy Base, also overlooking Naval infrastructure for those interested. I think this is a must do for tourists in San Diego. Peaceful and lovely, opportunities for short walks, connected to the tide pools attraction. Closes at 5 pm so not good for sunset unfortunately.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Amazing views, easy to get to, parking!", "This is a beautiful vantage point to have an outstanding view of much of San Diego, including one of the naval bases. There is a nice museum, good bathrooms and a gift shop. You can also head to tide pool but be sure it is low tide or you will only see waves. The parking can be difficult on the weekend at the tide pool area since it is so limited. There is a small educational display about what you might see in the tide pools, and there are nicer portapotties there. It cost us $10 for a 2 day pass. Which we actual went there 2x since the view is so nice.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Beautiful at sunset", "This was one of my favorite locations to visit while on the first day of my visit to San Diego for the New Year. Absolutely BEAUTIFUL. There is simply not much better than to watch a setting sun bouncing off the ocean at Point Loma."], ["Reviewed May 16, 2017", 3.0, "Pretty spot", "Point Loma is a nice place to get a different perspective on the San Diego bay area and enjoy some special outdoor areas."], ["Reviewed May 9, 2017", 5.0, "Outstanding Views!", "This was one of the best things we did in San Diego. Outstanding views of the bay and great waves crashing against the shore."], ["Reviewed May 8, 2017", 5.0, "Beautiful views, fun easy little hike.", "Check the tide tables, so you can get there at low tide and see the tidepools. We didn't but it was still a lot of fun, and some of the most beautiful ocean scenery I've seen."], ["Reviewed May 4, 2017", 5.0, "Another Great Place to spend some qualtiy time", "The views are awesome and this is such a great place to spend some time with your loved one or alone to relax and reflect. Try your best not to miss this location on your travels."], ["Reviewed May 3, 2017", 5.0, "Great view", "The area has been greatly enhanced spice our last visit 18 years ago. The visitor center is informative, and the lighthouse is in good condition being well maintained. Walking down to the tide pools and the cove was interesting, especially from a geologic standpoint. The waves were leaving their splash, but not dangerous. Glad we had good weather as we could see the entire bay, Coronado, and even the Hotel Del. The incoming boats, and small regatta were fun to watch\nShow less"], ["Reviewed May 2, 2017", 5.0, "Amazing views!", "Spent the morning at Point Loma. Great place to take pictures of San Diego and the ocean. We parked the car without a hassle and walked around throughout the morning. Would highly recommend!"], ["Reviewed April 29, 2017", 5.0, "Great way to spend the day!", "Unbelievable views on a clear day. There was ample parking despite gorgeous weather at mid-day. Visited the lighthouse, cemetery and tide pools. No better views near San Diego."], ["Reviewed April 29, 2017", 4.0, "Great Views", "The Pacific side of Point Loma offers great views of the Pacific Ocean and sunsets. Be careful of the cliffs and heed the warning signs."], ["Reviewed April 26, 2017", 5.0, "Beautiful view touching the beginnings of San Diego's history", "I enjoyed the visit to the end of the peninsula on the west side of San Diego Bay. Because I am mobility-challenged, we were able to park in front of the old lighthouse and enjoy the breezes and beauty."], ["Reviewed April 24, 2017", 5.0, "Stunning", "This is another must see! You would be crazy not to visit this breath taking location while in San Diego. The views are breath taking. I loved watching the F-18 jets taking off from North Island along with Navy helicopters and performing exercises. The lighthouse is very small but has a lot of character. I would recommend this for families or couples. Absolutely amazing!\nShow less"], ["Reviewed April 22, 2017", 5.0, "See all of San Diego!", "You can literally see for miles and miles from this vantage point. Mt. Soledad is so impressive. I enjoy reading the tributes to the veterans who fought to keep us free. One can not leave here feeling uninspired."], ["Reviewed April 22, 2017", 5.0, "Beautiful", "Beautiful drive up and a place to park and walk around. View is spectacular. One of the first places we visited"], ["Reviewed April 21, 2017", 4.0, "Really nice beach, BUT", "Parking was a nightmare, since we were there on Sunday afternoon. We waited 20 minutes. The beach is a very nice one, with long, flat areas for wading and running from the surf."], ["Reviewed April 21, 2017", 5.0, "Amazing afternoon", "Hanging out near the tide pools at Point Loma was a highlight of our trip. The tide was high, so we were not able to play in those, but just sitting down near the water on the rocks/cliffs was a great way to just relax and soak it all in. Easy little hike to the ocean. Great place to watch the sail boats and yachts heading in and out.\n\nLighthouse was a good stop as well....but I have to say, on our way out, we stopped by the US Military cemetery. This will rock you a bit. I have never seen a cemetery as well kept as Arlington National...but this place is right there with the same high level of up keep. Great place to take a quiet walk and reflect on these peoples service to help us have what we have today to enjoy!\nShow less"], ["Reviewed April 17, 2017", 5.0, "History and Nature at one point", "So much of history at this site, gorgeous view of the city as well as the pacific ocean plus a natural tidepool. A San Diego trip is not complete if you dont visit this particular spot."], ["Reviewed April 16, 2017", 5.0, "What a Surprise!", "We started our drive thinking we would just be out for a short time. Our intention was to see the cityscape from the peninsula. Imagine our surprise when we encountered a National Park at the end of the road with a wonderful seaside trail complete with tidal pools. The hills were full or wonderful yellow flowers, the sun was out and the hikers were all friendly. Wonderful experience. If you are a senior, be sure to pay the National Park Pass -- fabulous value!\nShow less"], ["Reviewed April 12, 2017", 5.0, "Great views of San Diego!", "Great place to visit, just for the views. You have a great vantage point to get some great photos. Definitely a place to check out when visiting San Diego."], ["Reviewed April 10, 2017", 5.0, "Sunday afternoon drives just like the good old days.", "Beautiful views of the Pacific and conversely looking back over the San Diego Bay into downtown and out to the surrounding mountains make for postcard photos."], ["Reviewed April 10, 2017", 5.0, "Views, views and more views", "Another San Diego must see is Point Loma's Cabrillo Monument. A beautiful natural setting with superb views a few great short walks and a chance to wander the tidepools while watching some cracking surf and sailboats glide past...maybe even a whale sighting."], ["Reviewed April 9, 2017", 5.0, "Fun hike and beautiful area", "This is a beautiful area and worth a visit. The trails are very safe and we found several rangers along the way. Be sure to pack your water shoes."], ["Reviewed April 6, 2017", 5.0, "Great Views...But it Costs $10 to Enter!", "Nice place to go for great views. We spent about an hour total there. I enjoyed it and it was very nice, but just be aware that there is a $10 fee to the Point, which we were not aware of. Our guide books said it would cost $3 to park, so we were a bit surprised.\n\nYou can visit the lighthouse, visitor center, Carrillo monument, walk a couple of easy trails , visit two small museums, and enjoy spectacular views. Definitely a nice place to visit!\nShow less"], ["Reviewed April 4, 2017", 5.0, "Another spot for beautiful views of land and sea", "A beautiful spot with a history lesson about Spanish explorers. There are tide pools, but schedule your visit at low tide"], ["Reviewed April 3, 2017", 5.0, "A Great History Lesson", "While at Cabrillo National Monument Point Loma is right there. It is a great history lesson of the contribution made by J.R. Cabrillo. View of the Pacific Ocean and the San Diego Bay are great. Ample parking and well maintained walking paths"], ["Reviewed March 28, 2017", 5.0, "A must see!", "The coastline along here is so beautiful. You will be taking tons of pictures of the view! Get out and walk along the road?"], ["Reviewed March 27, 2017", 5.0, "Loved it", "If I could return to one place in San Diego, this would be it. There are panoramic views of the ocean, views of downtown San Diego, the Cabrillo National Monument, a lighthouse, the famous tide pools, a military cemetery, hiking trails, a visitors center, and clean bathrooms. If you love photography, bring your camera and plan to spend some time here. There's lots of wildlife around, including snakes (we saw the warning signs) and many cool birds. It does cost $10 to enter, but it's definitely worth it!\nShow less"], ["Reviewed March 25, 2017", 5.0, "Great views and vistas", "Went with family and grandchildren...We were able to see whales spouting water from bow holes...Went to wadding pools amazing day..."], ["Reviewed March 24, 2017", 5.0, "Delight in the sight", "Another great place to spend the evening looking out in to the seas and also the city. San Diego is one of my favorite places to be and this place has to be right up there (no pun intended)."], ["Reviewed March 23, 2017", 5.0, "gorgeous view", "I loved the peacefulness here. Walked in the lighthouse (very small one but still nice). We walked around and just breathed in the fresh air and the beautiful scenes."], ["Reviewed March 18, 2017", 3.0, "Close to the Ocean", "Nice beaches, houses and small shops make a unique atmosphere. San Diego skyline view is part of the scenery."], ["Reviewed March 16, 2017", 5.0, "Views Through the Fog", "This is a nice place to enjoy the views of Coronado, the ocean, the bay and San Diego. The fog eventually moved off so the views improved. The Bayside Trail is a nice walk - keep in mind, what goes down, has to go back up.\nShow less"], ["Reviewed March 16, 2017", 5.0, "more than expected", "This was an easy to find and approach attraction. Besides the Cabrillo statue, there is a nice visitors center with a lot of history displayed therein. The lighthouse is also a museum of sorts rich in history. There are a few military history sites also. The view is\nunbelievable!! You can see Mexico and entire base on Coronado and the city and being on a peninsula, it seem you can see half way across the ocean. There is a $10 fee to get up to the attractions and parking lot but well worth it and covers 2 days. Wish we had had the time to stay longer and go back the next day to take in everything and walk some of the trails. Definitely a half day or more worth of activity to explore and enjoy.\nShow less"], ["Reviewed March 14, 2017", 5.0, "Great Views", "A lot of friends had suggestions of places to see in San Diego, but apparently none of them had been to Point Loma. So glad we decided to drive up there. When you're up at the point by the Visitor Centr & Lighthouse, you get spectacular views of the city and the Bay with Mexico off in the distance to the south. If you like hiking around there is plenty of room to do that. We met a number of \"birders\" who spent time up there & loved it. Can't beat the sunshine, breeze and fresh sea air.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Walking the Rocks with Limpets", "We loved the Tidal Pools! So did our five and three-year-olds. We saw crabs, sea slugs, limpets, and barnacles. We got to climb rocks, balance above the ocean, look for fossils in the strata, and splash in puddles. There are volunteers to point things out (or go it on your own. A field guide helps), and you can stay as long and walk as far as you like. It is rugged enough to make everyone feel brave (parents, keep a close watch and a hand on the little ones) and interesting enough to keep everyone wanting more. Be sure to wear rubber-soled shoes; the rocks are slippery. Viewing is best when the tides are low, so check the tide tables.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Must go!", "First let me start by saying you have to pass by a memorial cemetery to get here. During foggy times it was definitely erie and cool. The park rangers at Point Loma were super nice and friendly and answered my several questions about rattle snakes. We came here to find a hidden sea cave which we did but could not get too. A mammal migration was taking place and had the area roped off.They did tell us when it is not foggy that you can see whales off the coastline.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Views, views and more views", "Outstanding views ..,enjoyed whale watching from the viewing point, exploring rock pools, chatting to a ranger and soaking in the Rays- apply lots of sunscreen as it pretty exposed."], ["Reviewed March 13, 2017", 5.0, "Views", "Purdy here and be sure to eat at Pt. Loma Seafood. NOTHING fancy; good pricing, limited seating, line goes quickly. Great Tuna sandwiches (I drizzle the bread in balsalmic vinegar)and Manhattan Clam Chowder-be sure to have it Mexican style by adding lemon and and tobasco"], ["Reviewed March 12, 2017", 5.0, "Beautiful views", "Oh I am so glad I went here. When we arrived it was so nice to see the sail boats and stunning views of the water crashing onto the rocks below and then in a blink it was blanketed in fog. We went down to the tide pools for a closer look. It was relaxing to watch the waves breaking up and down the shore. Within 30 minutes the tide receded and we got to explore the tide pools. We saw a sand piper and some beautiful rocks etched by the ocean. I would do this again in a flash. Keep your ticked if you go, It is good for more than just one visit. We went back a second time, which was just as wonderful as the first.\nShow less"], ["Reviewed March 12, 2017", 4.0, "Busy place on a Sunday", "Lots of people visiting but lots of space to share. Many things to see, including hiking opportunities. Large parking area next to visitors center."], ["Reviewed March 11, 2017", 5.0, "My favorite place in all of San Diego", "Love the views, love the tide pools, loved the visitor center. No food available besides vending machines, so bring snacks and water. Check the tide schedule for low tide, best views."], ["Reviewed March 11, 2017", 5.0, "Wow! Amazing!!!!!", "You must go to Point Loma for the view and you can walk all around the rock,areas with a few trails."], ["Reviewed March 10, 2017", 5.0, "Breath taking views!", "Was a bit chilly and a lot windy, but worth the trip. Toured the Cabrillo Monument, saw the cemetery and got lots of great pics!"], ["Reviewed March 8, 2017", 5.0, "Great Panaramic Views!", "We saw a number of large shipping and military vessels going in and out of the bay. You could also see the military transports leaving the base."], ["Reviewed March 8, 2017", 5.0, "Majestic view", "This is a bit out of the way, but worth the drive. The views were very impressive. A great view of the harbor. Does not disappoint."], ["Reviewed March 7, 2017", 5.0, "A bit of a drive to get to... worth it.", "My husband and I decided to go to Point Loma for the views. They did not disappoint one bit! You do have to pay to get in this area, i think it was around $10-15. They close at dusk so make sure to go earlier on in the day. You do have to drive a little ways past the Naval Base and around some windey roads. Once you are there the view into the water is worth it! You can also see the other parts of San Diego from that point and it is beautiful.\nShow less"], ["Reviewed March 5, 2017", 4.0, "Overlook the Pacific and an ideal natural harbor", "Come in as Cabrillo came some hundred years ago. Within minutes you'll understand the significance of this natural harbor, home to the Navy. Ships come and go: from carrier to frigate, from tanker to fun-boat, from cruise-ship to sail-ship. And everything is bathed in a wonderfull blue; unless the sea-fog comes in.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Ocean Vista like no other", "This is the highest point on the bay area and provides a sweeping view of the ocean. The town also has many interesting shops and spots for lunch."], ["Reviewed February 28, 2017", 5.0, "Absolutely beautiful", "We were there on a foggy morning but it was still amazing. We were lucky enough to be able to watch an aircraft carrier float by on it's way out to sea."], ["Reviewed February 27, 2017", 5.0, "point loma the best", "I always came to visit San Diego. I go to point loam to see my family is the best place i heart close to the beach, l can smell the harbor air"], ["Reviewed February 24, 2017", 5.0, "Panoramic views", "Point Loma has outstanding views of the ocean, San Diego, mountains and is the location of a lighthouse and Cabrillo National Monument. There are tide pools that you can hike to. We saw a seal frolicking in the surf, spotted fishing boats, pleasure boats and military boats. There is a huge variety of vegetation on Point Loma.\nShow less"], ["Reviewed February 22, 2017", 5.0, "GREAT VIEWS", "We go here every time when we are in SAN DIEGO. The views are spectacular and well worth the drive. Cost is $10 to get in but ticket is good for 7 days so one can always go back another day."], ["Reviewed February 19, 2017", 5.0, "Great hike! Killer views!", "The national monument here is a must see! Fantastic hiking and great views of San Diego and the naval facilities."], ["Reviewed February 18, 2017", 4.0, "Great Views", "This is the place to get a fantastic view of San Diego and Coronado Island. The afternoon is the best time to visit when the sun is shining from behind. It is well worth the ten dollar per car entry fee plus you get the history of Cabrillo the Spanish explorer added in. There are short and medium hikes that can be taken.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Beautiful!", "This place was great! Parking has a fee but you can return for multiple days. Parked by the tidal pools and walked around the area. Also took a look inside the lighthouse and took the Coronado side path around the edge as well. Probably allow for 2-4 hours depending on how much hiking/walking you want to do.\nShow less"], ["Reviewed February 16, 2017", 5.0, "one of the best views of the bay of San Diego and Coronado Island", "I highly recommend to go to the end of Point Loma. The old light house is a must see for historical purposes. The Cabrillo monument is also great history to absorb with artifacts hiking trails and a great fun full of facts gift shop."], ["Reviewed February 14, 2017", 4.0, "Some of the best Views in San Diego.", "Fabulous views and easy walking. Watched the sunset. You can grab a snack and a drink while visiting so don't need to take anything with you. The military cemetary is impressive as is the lighthouse."], ["Reviewed February 13, 2017", 3.0, "The views are lovely, but... $10? And they kick you out before sunset?", "If you pay to get into the \"Memorial\" area - which means parking, you have to leave BY 5:00. So, for $10, you can't even see the sunset! It is a great view of San Diego, but I think it is expensive for what you get. There aren't a lot of walking/hiking options. The small visitors center is, well, small. Lots of parking, but not a whole lot of content.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Enjoyable gem!", "We enjoyed a few hours at Point Loma! Had a NPS card so got in free!... GREAT Views + interesting Lighthouse."], ["Reviewed February 13, 2017", 5.0, "Gorgeous views and beautiful topography", "Love venturing out on Point Loma when visiting San Diego. There is so much to see and the military cemetery is so gorgeous and serene."], ["Reviewed February 13, 2017", 5.0, "Views, views, views", "There are great views of the San Diego harbor and the Pacific Ocean from along the road. If you go to the end of the road, you'll have to pay a fee to enter the Cabrillo National Monument, but it's well worth the cost. The trails there, both on top of the bluff and below to the tidepools are both great.\nShow less"], ["Reviewed February 11, 2017", 4.0, "Beautiful Views", "Military cemetery is amazing - awe inspiring; Lighthouse at Cabrillo National Park was very interesting!"], ["Reviewed February 6, 2017", 5.0, "Breathtaking views", "Son is in navy , took us up to a very high location probably best view of San Diego ever. Beautiful homes and neighborhoods , was able to travel down to see navy nuclear subs, etc overall a great trip"], ["Reviewed February 4, 2017", 5.0, "Point Loma never disappoints!", "Visited noonish on a Saturday. Gorgeous views. Slightly inclined walking is necessary to see the sights on all side of the peninsula. Nice historical displays in the center and lighthouse. Tide pool area parking was a challenge; there are not enough parking spaces."], ["Reviewed February 2, 2017", 5.0, "Awesome!", "Can't say much more than what has already been said! The views of the bay and ocean are magnificent! Great history lesson."], ["Reviewed February 2, 2017", 5.0, "Point Loma Sites", "We went to the Rosecrans Military Cemetery. It is very awe inspiring and beautiful. The view of the City and ocean are incredible. We visited my son's final resting place. Then, we went to Shelter Island and strolled along the Bay. We talked to the fishermen on the Pier and inspected their catch. Then we had lunch at the Kona Kai Restaurant.\nShow less"], ["Reviewed February 1, 2017", 5.0, "Must experience at sunset", "I loved San Diego and Point Loma at sunset was one of the most amazing things about it. It is an \"experience\" of nature and beauty highlighted by the fact that it surrounded by thousands of veterans in the surrounding cemetery. The view is amazing anytime of day but make the effort to literally plan your days schedule around it to arrive by 5pm and prepare for the sunset experience of your life. NOTE: go up to the lighthouse first and enjoy the view and then travel back down the hill a bit to the overview before the gate area. We were irritated that the upper level state park actually CLOSED just before sunset and staff was shuffling us out before we could enjoy it completely. Silly - just move your close time back 30 minutes people! We visited twice so did this schedule and it worked well. Anyway - go and take your camera for sure. It's a gift from God...\nShow less"], ["Reviewed January 30, 2017", 4.0, "Great area", "This entire area is really nice and definitely worth a trip out to if staying in San Diego. Make sure you see the cemetery"], ["Reviewed January 30, 2017", 5.0, "Every Time I Visit San Diego", "Every time I visit San Diego I take a run to Point Loma..., one of the best views available in the United States - right on up there with the Grand Canyon. Enjoy!"], ["Reviewed January 27, 2017", 4.0, "Amazing view!", "We visit Point Loma every time we visti San Diego. The views are unparallelled! I never get tired of the views. On the drive up, you will pass a military cemetary that is also beautiful to view."], ["Reviewed January 26, 2017", 4.0, "bella vista", "nice walk all around, interesting visit the museum in an old Victorian lighthouse. At clear days views all along S. D- bay across to Mexico."], ["Reviewed January 24, 2017", 5.0, "Scenic Views, Absolutely Beautiful Tide Pools!!", "I had never been to Point Loma previously. After visiting, I definitely feel like I was missing out. It is a beautiful location. The tide pools were the highlight of the trip and offer some gorgeous photo opportunities. There are also several other things to see when visiting the area. There is a lighthouse, ocean-side cliffs with some stunning views, the Cabrillo National Monument, and a couple of great lookout points to see the planes and helicopters coming and going from the nearby Naval base. There is also a visitor's center near the monument that has a small museum and shows films on the history of Point Loma. I plan to come back again next time I find myself in the San Diego area.\nShow less"], ["Reviewed January 15, 2017", 5.0, "Lovely Section of San Diego!", "Stayed with a friend who is lucky enough to call Point Loma home. I am jealous, to say the least! Gorgeous views of the city if you know where to look, quaint neighborhoods, and many scenic attractions. Check out the Cabrillo Tide Pools and Sunset Cliffs for sure!\nShow less"], ["Reviewed January 12, 2017", 5.0, "...and they called it San Diego, which in German means whale's...", "Absolutely killer views of the city along with a very sobering reminder of our service men and women's sacrifices. Wonderful place to come see the sunset out over the Pacific."], ["Reviewed January 12, 2017", 5.0, "Exceptional", "Go on a clear day. The visitor's center is wonder. Be sure to see the video on the history. Very nice stop and lovely drive."], ["Reviewed January 11, 2017", 5.0, "Great fun", "What a great 1/2 day excursion, fun for all ages. the light house is very interesting, all the battlements from WWII, and don't miss the whale watching platform at the very end. What an incredible view of the cost line, Coronado Island and up to La Jolla. Best Views from the entire trip. And on the way up stop off at the Naval cemetery, very sobering to see the perfectly lined up grave stones from all our heroes that died in WWII.\nShow less"], ["Reviewed January 11, 2017", 5.0, "Breathtaking!", "The view of the harbor from Point Loma is beautiful! We enjoyed the drive out to the lighthouse and the view. Plus it's near the military burial ground which is very humbling!"], ["Reviewed January 6, 2017", 5.0, "If you like nature, history, or just fresh ocean air, don't miss it", "This location combines nature, the history of lighthouses, and a beautiful view into one package. There's even a tiny bit of WWII history here, in terms of the military watch. You can also hike or visit the tide pools. Also, on your way out, there are plenty of food and strolling options.\nShow less"], ["Reviewed January 4, 2017", 4.0, "best view", "This place offers a fantasic view and his a great place to relax You can enjoy this area with your whole familty"], ["Reviewed December 30, 2016", 5.0, "Great Views and interesting HIstory", "Go see the tidal pools and wander the coast before then going on to see the light house and read about the history of the area."], ["Reviewed December 29, 2016", 5.0, "Gorgeous area of San Diego", "There are many places to shop and eat in Point Loma; as well as all the yaht clubs and marina shops. Check it out you will enjoy the area."], ["Reviewed December 26, 2016", 4.0, "Nice sight", "Really nice sight, go and drink something over there; it is better if you go at the time for suncets. There isn't too much to do."], ["Reviewed December 25, 2016", 5.0, "Stunning", "We loved this with family. Views were amazing and winds picked up but we had the best time. Great pictures too"], ["Reviewed December 16, 2016", 5.0, "You can spend all day on Point Loma", "From the National cemetery to the Cabrillo National Monument, there is a lot to see on Point Loma for the outdoors type."], ["Reviewed December 10, 2016", 4.0, "Pretty views", "Our visit was on a December day, when it was sunny, but we were later on in the afternoon, so the park was almost closed when we arrived. Neat views and nice informative signage."], ["Reviewed December 7, 2016", 5.0, "Beautiful!!!", "Nature at its best! The views were breathtaking . . .views of San Diego (and the skyline), Mexico, the Pacific Ocean (and San Diego bay), Coronado Island (and the military bases on the north end of the island) and the military ships throughout the bay area! We toured the light house and visitor center; we learned quite a bit!!! The Cabrillo National Monument is beautiful and overlooks the bay. We were amazed at the Fort Rosecrans National Cemetery (the west coasts' Arlington.) It overlooked the bay/ocean and seemed to go on for miles. An extremely beautiful area. We heard that, if the whales are migrating, you might see them from the park!!!!\nShow less"], ["Reviewed December 3, 2016", 5.0, "Beautiful, nature at it's best", "I had a chance to come here for a short visit, and wished I could have stayed longer. There is a fee for entering this National Park. Once in, we drove along the cliffs, parked and walked down towards the tidal pools. The waves, water and views were spectacular. This area isn't handicapped accessible. The park had been a navel base, and some of the bunkers and lookouts are available to go in and see. We climbed down into an old lookout bunker, which was fascinating. We even climbed down to what I thought would be a bunk room, but it not only held sleeping quarters, but also the area where sailors took turns watching for incoming enemies. Once outside again, I was struck by the great views. There are lots of places to walk, a nice visitors center and other historical facts. Also there is the Point Loma Lighthouse, which you can also enter. I loved it.\nShow less"], ["Reviewed December 2, 2016", 5.0, "The tidal pools give you outstanding views", "When you come down from the visitor center there is a small section of the west coast with the tidal pools. There is a hiking trail connecting both ends of the trail and there are parking lots at the ends and along the trail. Walking the trail will take about one hour roundtrip. The trail gives you really magnificent views of the Pacific ocean and the cliffs.\nShow less"], ["Reviewed December 2, 2016", 5.0, "Lovely views", "We loved visiting Point Loma. The views are great and it gave us a great afternoon. We walked and sat and learned a bit of history. We had lunch at a little Italian restaurant and just enjoyed exploring this community. This would be a great place to stay for a visit to San Diego\nShow less"], ["Reviewed November 27, 2016", 5.0, "Surprisingly nice for hiking and exploring tidal pools", "Great for a few hours or day of hiking and exploring the tidal pools or just relaxing along the ocean."], ["Reviewed November 23, 2016", 5.0, "Nice view", "Point Loma gives 360 degree view of San Diego city and also glimpses of Tijuana. Must visit place in SD"]]}}