{"Presidio of San Francisco": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Presidio of San Francisco", "url": "/Attraction_Review-g60713-d128930-Reviews-Presidio_of_San_Francisco-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/cb/ed/71/presidio-national-park.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1496"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94129", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "A wonderful stroll", "Had a half day to sightsee while in San Francisco on business and decided to walk through the Presidio park to Crissy Field. Started at Lover’s Lane and walked the 2+ miles of trails through the park with some beautiful mountain and wooded scenery getting a closer look at the Golden Gate Bridge at every turn. You also get to see some of the old military base structures and cemetery which makes the walk even more interesting. I recommend a stroll through the Presidio if you have time.\nShow less"], ["Reviewed 6 days ago", 5.0, "Amazing Views!", "I stayed at this park for about 2 hours, its great to walk around with so much to see. Theres a nice little shop down by Crissy Fields where you can warm up, buy coffee or souvenirs for family. Check it out. You are right next to the bridge.\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful Area", "I recommend you tour the Presido of SF because this is an old military base, turned into museums and other office and living space that is worth the look."], ["Reviewed 1 week ago", 5.0, "The Presidio of San Francisco's Officer's Club.", "I went to see an exhibit on the Japanese-American \"relocation\" from the West Coast.\nIt was housed in the Presidio Officer's Club referred to as the \"O\" Club along with a military history of the Presidio from Spanish times up to when the Army pulled out and the U.S. National Park Service took over. They, along with the Presidio Trust and the Golden Gate National Parks Conservatory have rehabilitated & restored the buildings, grounds and forest areas which make up the Presidio.\nDuring WWII, the Americans of Japanese ancestry were \"relocated (moved)\" from their homes in No. Calif. to \"Relocation Camps\" out of the West Coast into camps as far as Arkansas. There were 10 or15 such camps around the country and most were in the barren and desert area of those states.This was under the order of Lt. Gen. J.L. DeWitt, head of the Army's Western Defense Command. He issued the \"Civilian Exclusion Order\" incarcerating over 110,000 Americans of Japanese decent to these camps. It's a \"shameful period\" in our history for which the history books devote a page or a half a page to this event. The order was challenged in the Supreme Court with the famous case of Korematsu vs. the United States. He along with two(2) other Japanese-Americans, who joined him in the \"lawsuit\" and won their case.\nThe exhibit of the Japanese-American \"Exclusion Art\" is very \"moving, poignant and heartbreaking\" story on to how they were treated based on their ancestry and yet, being born American. It also tells in part the story of the all \"Nisei\" 442nd. Infantry, the most decorated unit in WWII, and their heroic efforts during that war. Just to show/prove that they were\" Americans\" and would fight for their country! You will come away with your own impressions and thought \"of then and now\"! The exhibit is presented by the Fred T. Korematsu Foundation and the National Japanese American Historical Society, both of them housed there in the Presidio.\nThey have a restaurant in the club and which is reasonable. There is \"free entrance\" to the exhibit and there's also, \"free parking\" in front, on the parade grounds.\nEnjoy the history and the exhibits at the \"O\" Club in the Presidio. I recommend it as a \"must see\", if you come to San Francisco! DonSF\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Stunnning views and great history if a bit remote", "As a former (current?) military installation, the Presidio is a spacious campus of period buildings from the early to mid 1900s that overlook and the Golden Gate Bridge and adjacent the bayfront areas. There is a good restaurant in the complex and it is close to the Palace of Fine Arts, which is superb. Worth the visit but it is a bit of a taxi or uber ride.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A gem in San Francisco", "We left this attraction until our last day and I was sorry we did so. The only self-funding National Park in the country! There are many walks, great views of the Golden Gate Bridge, museums, restaurants, accommodation, a very informative visitors’ center staffed by helpful interesting volunteers and paid Park officials. And when we finished we discovered that there is a free shuttle (GoPresidio) to the Presidio from downtown and vice-versa available to all on off-peak hours. Also free whittles within the park.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place to explore/photograph", "This is a cool place to explore and has amazing views. There’s the military base, pilot’s row, a nude beach below and great views of the bridge. It’s the best place to photograph the bridge in my opinion. Parking is very accessible. There are no restrooms though.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great historical and scenic attraction", "The Presidio is a forest in the city, along with being an old military base. Great beaches, old WWII coastal defense artillery (fired monthly), stunning Pacific views. Wildlife, Golden Gate Bridge views, and the Coast Guard Memorial. You can drive through the old military parade ground, housing, etc. This is a great place for a \"down\" day to just amble around and be lazy. Going in summer? Take layers.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Very Cool location and Restaurant", "I really enjoyed dining at the Presidio Club. Cool location, cool restaurant, great service very very good food and cocktails"], ["Reviewed January 21, 2018", 4.0, "Need lots of time to see it all", "We had a fairly short drive through and around the Presidio, would loved to have spent at least half a day exploring the beautiful buildings and surrounds - superb location and architecture. Definitely a must see when visiting SF"], ["Reviewed January 21, 2018", 5.0, "Events wonderland", "There are a large variety of things to do at the Presidio, from beach walking to outdoor music events, restaurants, hiking, and museums. A great place in any season."], ["Reviewed January 21, 2018", 5.0, "Best thing you can do in SF for free", "This was a great way to get around for free in the Presidio area which is a very large area mostly residential. They have a café and a Disney Studio Museum. There are 3 different lines that take you around for free to different view points but is really for people that live there to get around. Think one of them goes to Downtown too. The visitor's center is a must do as soon as you get there so they can explain everything. Totally recommend if you are on a budget or don't have a car to get around. Lyft there and spend a few hours to a day!\nShow less"], ["Reviewed January 19, 2018", 5.0, "Love the Presidio", "Visiting the Presidio when you're in San Francisco should be near the top of your things to do list. It's beautiful and have some great views. It's nice for walking, running, cycling, or having a picnic."], ["Reviewed January 14, 2018", 5.0, "Take a picnic and enjoy the gorgeous views", "Travelled here in the go car. This place is beautiful. It’s so clean, picturesque and tranquil. Take a book or some good company and enjoy. Wished we’d taken a picnic."], ["Reviewed January 7, 2018", 5.0, "Family holiday", "I had never heard of the presidio before but found out about it whilst doing the fire engine tour so decided to visit on the hop on hop off bus tour. We spent a few hours walking around but the highlights for us were star wars and disney. We visited the yoda fountain and the walt disney family museum both of which were amazing. Its not very well signposted so we did spend alot of time walking around trying to find the things we wanted to see but all that said it was worthwhile. Lovely area for a picnic outside the museum. Beautiful gardens and fountains.\nShow less"], ["Reviewed January 6, 2018", 5.0, "The Presidio is great... Above ground and below!", "The Presidio is one of the nicest regions of San Francisco and also one of the largest. There are heaps of hiking and bike trails as well as an incredible view of the Golden Gate Bridge. During this trip I made my way underground heading over to Land's End and Ocean Beach. That was already pretty interesting as I didn't know about the tunnel to get over there. Must be the Disney Museum blocking the way. Check it out, there's lots to see and do here during your visit. Enjoy!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Beautiful, serene area for cycling", "My boyfriend and I came to SF for a week of bicycling-related vacation over New Year's 2017-18, and stayed at an Airbnb at 5th Avenue and Clement. We quickly realized that there were many possibilities for enjoying the Presidio, which is only about 1/4 mile from where we were staying. The first trip to the Presidio, we followed advice from a cycling-route website and took Mountain Lake Trail west for a mile or so, then went up a steep hill through a golf course to get to Washington Blvd, which winds through eucalyptus trees over toward the Golden Gate Bridge. The trail is charming, full of dog walkers and runners and people taking their constitutionals. People readily helped us figure out the best route to the bridge, and it was a pleasant run down hill (til we got to the steep bit). Washington Blvd is popular with bikers, who led the way to the bridge's pedestrian and cycling lanes. We ended up going back and forth through the Presidio several times (sometimes using Arguello Avenue, sometimes Mountain Lake Trail): we rode to Marin county 5 times, and we also took a route down Veteran's Boulevard to Baker's Beach and the outer Richmond District, and another route right through the center of this former Army post to get to Crissy Field and the Marina. It's a delight to ride in the Presidio, with gentle well-graded roads for the most part and fabulous views of the Golden Gate Bridge, the Marin headlands, the Richmond, the Marina, Alcatraz, and Baker's Beach, This area seemed very bicycle-friendly to us, with clearly marked bike lanes and good signage. We'll come back here again.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Historical past of the Bay Area", "A stroll through the Presidio is a great way to learn about the history of this city. This is where it all started way back in time."], ["Reviewed January 3, 2018", 4.0, "Beautiful views", "We took a free bus ride from the San Francisco tourist office near the Golden Gate Bridge which took us through Crissy Field and on to Presidio. Checked out Yoda's statue and the lovely gardens there."], ["Reviewed January 3, 2018", 5.0, "Pretty simple- park and view!", "This is an old military area and the view from here is spectacular! Walk around and enjoy the views."], ["Reviewed December 23, 2017", 4.0, "A party with a view", "The iconic golden gate clubbed with food trucks, live music and amazing weather almost makes this place look like straight out of a MTV concert venue"], ["Reviewed December 18, 2017", 4.0, "Beautiful and interesting area", "This is a beautiful and interesting historic area that is well worth a visit. The easiest way is probably through the free Presidio shuttle tours. You can pick up the Downtown shuttle from near the Embarcadero. At the terminus on the Presidio transfer onto one of the two circular (hop on hop off) tours of the Presidio. Both are free. Great views of the Presidion, the Bay and the Golden Gate Bridge.\nShow less"], ["Reviewed December 14, 2017", 4.0, "Fantastic view of Golden Gate", "This place you will enter by taking last exit on Highway 1 south before the Golden Gate Bridge. You can drive up to the top and see the bridge from different stops, we stayed at three of them. The closest is the best view and a sunny day you will get amazing pictures. Difficult to get parking\nShow less"], ["Reviewed December 13, 2017", 5.0, "Great views!", "We enjoyed this Park very much. We visited the Disney Family Museum and the many lookouts! ther is a free park shuttle."], ["Reviewed December 4, 2017", 5.0, "Beautiful tranquil scenery with great views", "We visited The Presidio during our city tour with Dylan’s Tours.\n\nThis is a 1,500-acre park on what was in the past a military post. The Presido offers recreational activities , has lovely forested and green areas, a golf course and scenic views of the Golden Gate Bridge views, and houses the historical Walt Disney Museum.\n\nThere are several restaurants in the area as well.\n\nWell worth visiting.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Exquisite views!", "Definitely a must for nature lovers. The views are breathtaking and the trails lovely and alive. Do bring good hiking shoes as this used to be part of a military post. There are still remnants of where the canons used to be. I would be sure to take plenty of photographs here because everywhere you look, there’s an exquisite view. Great place to get away from the crowds at the traditional viewing spots of the Golden Gate Bridge.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Great views with fresh air and lovely walks in San Francisco", "On days when you cannot walk as much as others, the Presidio offers a great alternative with its many shuttles, including the shuttle from the Embarcadero in downtown San Francisco. You can get to the Golden Gate Plaza, the Disney Museum and a number of good restaurants like Arguello and the Commissary.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Worth visiting with family", "Presido is a huge campus and has fabulous lush green lawns, convention clubs, the national cemetry, Korean war memorial. The Golden gate club is a very good place to host corporate or family events. With the Golden gate bridge around the corner, the setting is perfect. Lush green lawns surround this place. The main hall in GGC can accommodate 150 to 200 persons. Separate rooms for dinning.\nShow less"], ["Reviewed November 26, 2017", 5.0, "What an exquisite place to hike and have brunch!", "My sister and I visited The Presidio in mid-September before a trip to Yosemite. The park is a beautiful oasis of calm and nature in the city. There are multiple hiking trails and we tried most of them before enjoying brunch at a restaurant on the property. There is a hotel there that I would love to try sometime. It looks very inviting with a park atmosphere that is not to be found in most of San Francisco.\n\nIf you are a hiker, The Presidio is the place for you!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Beautiful", "You can spend a day or more exploring here. The grounds and history are wonderful. Husband played the Presidio Golf Course and loved it...their bar is great as well:) End up at Fort Point and park to walk the Golden Gate Bridge. Many hiking trails and historical buildings and breathtaking views.\nShow less"], ["Reviewed November 24, 2017", 4.0, "Beautiful place to hike and explore!", "Another gem of the Golden Gate National Recreation Area! We spent an entire day hiking and exploring Presidio, and that was no where near enough time. The park is huge.\n\nThere are buses that run routes in the park. We managed to get on one up to the Golen Gate Bridge visitor center, but had a hard time picking it up in other places.\n\nThere are a couple visitors centers. The rangers had maps and we're very informative. There are also museums you can visit within the park.\n\nThere are places to eat scattered throughout the park as well. We made sure to bring some bottles of water and snacks to enjoy as we hiked around. That way we could avoid buying too much food.\n\nHighly recommend spending some time in Presidio. Thee veiws and history are incredible!\nShow less"], ["Reviewed November 23, 2017", 3.0, "Sketchy, but worth a visit", "My wife and I stopped here for the views. There is a lot of graffiti, and I definitely wouldn’t want to be around at night, but the views were worth the stop, and it seemed very safe during the day. There is a lot more to this site (buildings, cemetery) than we had time to see. The history was very interesting.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Inspiration Point in the Presidio", "One of my favorite spots in The Presidio is Inspiration Point. Enter the Presidio at the Arguello Street Gate, immediately turn right, follow the road about a quarter mile, and you will come to a small parking area on your right. Park there and enjoy the beautiful sight. You will find yourself high above the city, with views of the Presidio, the city, the white dome of the Palace of Fine Arts, the Golden Gate, Alcatraz Island, and Marin County across the Bay.\nJust before you get to Inspiration Point you will pass the entrance to the Presidio Golf Course with a pleasant cafe and bar, a good place for lunch.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Get lost in the trails!", "I lived right next to the Presidio for ~6 years. I loved it then! I was constantly training for an athletic event, and I would love that w/in minutes, I could escape to nature. I thought that it couldn't get any better! My how it has!! The state has really invested dollars into making the Presidio even more fabulous. My old trails got names, and then they added a bunch of new trails! There are so many great loops, with amazing views. I would suggest that you make multiple trips!\nShow less"], ["Reviewed November 20, 2017", 4.0, "Such a nice drive even on a cool, rainy day", "Taking a bus tour that included the Presidio was very special, particularly learning of its history and significance. The trees and landscape were beautiful."], ["Reviewed November 18, 2017", 4.0, "Interesting history", "And the view of the Golden Gate Bridge with the city behind it is breathtaking. Imagine being stationed here during the war to protect the city/port from invasion."], ["Reviewed November 18, 2017", 4.0, "A trip out to see it", "Vry well maintained and options of doing 2 bus rides around but unless you get off and wait for nxt bus not much opportunty for taking photos. Good museum and shop."], ["Reviewed November 10, 2017", 5.0, "Go for the Views", "The views are astounding as is the uphill climb on a bike. Head on out to GGBridge as you ride along the water. Be sure to stop by the Palace of Fine Arts a beautiful outdoor historical structure. Just beautiful!"], ["Reviewed November 9, 2017", 5.0, "Chrissy Field", "Very gray day by the bay, but still beautiful. Very few people walking the path from the Warming Hut to the yacht club. Great for oldies like us. Flat with super views of the bay, the GG Bridge and Alcatraz."], ["Reviewed November 8, 2017", 5.0, "Presidio of San Francisco", "Beautiful place to visit and enjoy its view. There is a lot to see and to know all the surroundings of this beautiful place."], ["Reviewed November 7, 2017", 5.0, "Great place to visit and walk", "Really enjoyed the walk and the views across the bay are. Such a peasant cool sunny day and no fog. Well worth the visit"], ["Reviewed November 6, 2017", 5.0, "I had no idea a fort was hiding at the base of the Golden Gate!", "Touring the fort was very interesting! It is well preserved and full of history. We did a self-guided tour, but I believe you could also have a docent give you a tour. Either way, it is a must-see!"], ["Reviewed November 1, 2017", 5.0, "Beautiful", "Large park area perfect for hiking or cycling. Nice beaches and excellent view of the Golden Bridge."], ["Reviewed October 29, 2017", 3.0, "Watch for thieves!!!", "The Presidio is lovely with plenty of great views. BUT BE AWARE of THIEVES!!! They break into cars while you are taking photos. If your car is open, they will steal bags- if your car is locked they will smash windows and grab things. There were six such robberies by 3 in the afternoon the day we were there. There is also confusion as to who has jurisdiction over the park too - local or park police. I would drive through here without stopping next time.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Lovely area", "Nice area to stroll near the bridge and bay area. Quite quiet and pleasant. Very green and serene. Quite a few people around just wandering and enjoying the space."], ["Reviewed October 23, 2017", 5.0, "Great place for a small wedding.", "Our daughter got married at the little chapel at the Presidio. What a lovely place for a small wedding. We were able to take some great pictures here too.my favorite was of her looking out the leaded window of the chapel."], ["Reviewed October 19, 2017", 5.0, "Beautiful views", "It is a beautiful park at the entrance of San Francisco Bay, The locals go there running, walking , families with kids... very nice peaceful park, we were lucky with the weather and enjoyed walking till the Golden Gate"], ["Reviewed October 18, 2017", 5.0, "Go!", "Such a contrast to the rest of our visit to SF. We spent time there over two days as we enjoyed it so much and there was plenty to do. The free shuttle bus is great but unclear where you can pick it up when not at the visitor centre.\nPretty and scenic and great views of the Golden Gate Bridge.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Big place, free shuttle", "Two free shuttles to take you around the various parts of the Presidio plus another that goes between the Presidio and the BART (Embarcadero Station).\nLooks up presidio for the timetables.\n\nQuite a free information signs telling you bits of the history of the place. This covers a very large area. The shuttle also takes in the Golden Gate Bridge Welcome Centre.\nThe shuttle will also get you across to the beach on the coast (South Bay beach I believe).\nShow less"], ["Reviewed October 16, 2017", 5.0, "beautiful", "beautiful park with tons of trails and views of the golden gate bridge. has some free parking and paid parking"], ["Reviewed October 16, 2017", 5.0, "1400+ acre urban parkland with historical, architectural and natural features", "This strategic location at the entrance to San Francisco Bay had been a military outpost since 1776 under the Spanish, from 1848 under the United States Army until 1994, when the Army transferred ownership to the National Park Service. For those many years when the Presidio was an Army base, access to the area was limited. Now this urban parkland of 1400+ acres offers historical, architectural and natural features that invite exploration. The Presidio Visitors Center has information on tours led by park rangers and maps that show the wide variety of attractions. Access to Golden Gate Bridge, Crissy Field, and miles of hiking trails make the Presidio a must visit.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Fantastic views and great walking", "Started close to Golden Gate and walked to Fishermens Wharf. Great day to people watch and catch the Blue Angels show for Fleet Week. Very pleasant, nicely maintained."], ["Reviewed October 11, 2017", 4.0, "peaceful place to relax", "running, biking, walking, just a beautiful place to relax and recharge. parking nearby and take your time."], ["Reviewed October 8, 2017", 5.0, "Beautiful and peaceful", "There are many hidden gems! The history that you can learn reading from the posters everywhere, the green area, the museums and restaurantes. And an astonishing view from the Bridge. There is also a free bus to downtown. Future without violance is a great project and a wonderful place for conferences.\nShow less"], ["Reviewed October 8, 2017", 5.0, "A beautiful gem", "If I return to San Francisco, I will focus my time in this beautiful area. This is a must just to unwind from the chaos of downtown. There is something here for everyone."], ["Reviewed October 6, 2017", 5.0, "Amazing place, peaceful and pretty", "Lovely place not very far from the city hussle where you will find a place to relax in the park and The Walt Disney Family Museum to wonder through. The story behind Walt Disney as told by his daughter. Just a nice day out."], ["Reviewed October 5, 2017", 5.0, "Beautiful place, especially together with the Golden Gate Bridge", "The place is lovely, with it’s neat gardening and wonderful vistas all around. The fog rising from the ocean is an enchanting phenomenon."], ["Reviewed October 5, 2017", 4.0, "Very pretty!", "We went here for the Disney Family Museum, but the grounds are very well manicured and the views o Golden Gate Bridge and the bay are gorgeous. Definitely plan a little extra time to explore!"], ["Reviewed October 4, 2017", 5.0, "A beautiful way to approach the Golden Gate bridge", "An easy area to bike ride in, which gives you picture perfect views of the Golden Gate bridge as you ride towards it. Stunning."], ["Reviewed October 4, 2017", 5.0, "Gorgeous area near the ocean", "The Presidio is a well kept area, previously known for it's army base (check the movie Presidio with Sean Connery), nowadays just museum etc Lovely area, calm, serene and beautiful surrounded by some stunning trees."], ["Reviewed October 3, 2017", 5.0, "Presidio Was a Nice Surprise", "The Presidio has a lot of history and was very interesting. We went in the Officers Club and were able to view a current archaeological dig in progress. The grounds are beautiful. It's nice to find a park atmosphere in San Francisco"], ["Reviewed October 2, 2017", 5.0, "Home of the Buffalo Soldiers!", "This is a beautiful place. It is best to see it on a tour so that you know exactly where the Buffalo Soldiers lived and cared for their horses. They were the first Park Rangers for our National Parks, notice the buffalo on the logo? Many tours go through the Presidio on the way to the Golden Gate Bridge. The Presidio has a rich history spanning back to the time of the native Ohlone people. The Spanish arrived in 1776 to establish the northernmost outpost of their empire in western North America. The Presidio fell under Mexican rule for 24 years before the U.S. Army took control in 1846. Over 148 years, the U.S. Army transformed the Presidio grounds from mostly windswept dunes and scrub to a verdant, preeminent military post. In 1962, the Presidio was designated a National Historic Landmark and the site has been part of the Golden Gate National Recreation Area since 1994.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great Walk", "We took a bus to Lovers Lane and then walked throughout the Presidio to Lucas Studios and then the Palace of Fine Arts. This is a spectacular area of the city."], ["Reviewed September 29, 2017", 5.0, "Very interesting place", "This whole area is so interesting. There is lots of history here, and remnants of its former glory. But there are places to stop and see things too. I accidentally found a great place to take photos of the Golden Gate Bridge. Worth taking the time to meander through here.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Beautiful", "Walked from Fisherman's Wharf enjoying beautiful beaches, etc. The Presidio grounds were awesome and we loved seeing the old historic buildings. We also stumbled across the Lucas Digital Studio offices where we took pictures at the Yoda fountain and inside the lobby by the various Star Wars characters. Great history overall!\nShow less"], ["Reviewed September 23, 2017", 5.0, "Views Here Are a Must", "If you are on your way across the bridge by foot, car, or bike then it is worth a stop for the views of the bridge with some refreshing breeze. I stopped off here to stretch, grab a picture of the bridge on my way to Napa and it was well worth it!\nShow less"], ["Reviewed September 23, 2017", 5.0, "Beautiful area", "We toured this beautiful area and saw the well-kept former Defence Force homes, now rented out. Beautiful views."], ["Reviewed September 22, 2017", 5.0, "nice place to visit", "very very nice spot to just hang out and walk ,to relax,lots of people ,but not a problem ,,,,p.s. any thing to do in san fransisco is a treat"], ["Reviewed September 22, 2017", 3.0, "Views of the bridge", "Old military complex. Many opportunities to take pics of the bridge. Wear your sunglasses-it's windy there."], ["Reviewed September 21, 2017", 5.0, "Interesting Museum", "The Presidio is a former Army base that is now a National Park. The museum is in the former Officer's Club and is very interesting. When we visited the museum, we were the only people in the museum and were given a private guided tour by the very knowledgeable docents.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Gorgeous Location (s)", "The Presidio is one of those places you could just park and stroll a few hours or all day. There are a number of attractions within the grounds that are a treasure to discover. Currently run by National Park Service.\n\nIf you are an \"old\" Army person or brat, you will appreciate the military feel of the buildings and layout.\n\nGreat photographs of the Golden Gate Bridge from some parts of the grounds.\nShow less"], ["Reviewed September 18, 2017", 2.0, "Not what we were expecting", "Having read about the Presidio, and read of the many birds seen in this area, and seeing so much green on the map we assumed this was more rural than it turned out to be. It was probably a mistake visiting without a car which made getting to the various areas difficult and a very long walk. The new road which we did not know about made it impossible to visit all the areas we had planned.\n\nWe found that this area is now full of housing with only some areas left 'wild'. A car is really a necessity for a visit here.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Mostly a drive by.", "But we did it nonetheless in a private car from the Adagio Hotel. We covered lots of territory in one afternoon."], ["Reviewed September 15, 2017", 5.0, "subscribe to their social media channels to get updates", "you gotta love the sun, the good weather of San Francisco and the outdoor to be here. tons and tons of activities to do. I have recently participated in the Bird + Art Walk last week and it was amazing and very interesting. I would suggest you to follow their social media accounts/ subscribe to their newsletter, they have packed of events happening throughout the year! i think Presidio is one of the most active park in the city..and it's always great to have fun & meet new people.\n\nthe park is always always clean too!\n\nEnjoy!\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great views", "Took the 28 bus to the bridge drop off point. Shop and cafes available before you then walk around the park to get great views of the bridge. Nice walk down to the shore and then along Crissy Field. You can then continue to walk to the Walt Disney Family museum which is another worth while attraction. Free shuttle buses also tour the area if you don't want to watch\nK\nShow less"], ["Reviewed September 13, 2017", 5.0, "Lucky San Francisco", "An amazing park with a rich history. How Lucky for San Francisco. If I lived in this city, I would go all throughout the year. There is a lucrative trust that keeps it all clean and constantly current. A must do. Skip Disney. Too commercial and an obvious monetary move by the trust. A poor board decision in my humble opinion....far from low key and high brow.\nShow less"], ["Reviewed September 13, 2017", 5.0, "We are so lucky to have Presidio", "So much to do and see in the Presidio - walking, biking, hiking, windsurfing, attending exhibits, playing golf, get a snack or simple or high-class meal, learn about the history of this part of the City. A gem!"], ["Reviewed September 10, 2017", 4.0, "Sights worth seeing", "There is a reason why SF is known as a place where people left their hearts. The Presidio is one of the main reasons why. Take a look for yourself and see."], ["Reviewed September 7, 2017", 5.0, "Love this city", "We took a tour of the city on the Shuttle Tours. The Golden Gate Bridge was an incredible sight. It is not to be missed on a visit to San Francisco."], ["Reviewed September 4, 2017", 5.0, "One perfect day hike tour in San Francisco", "Just try a day hike tour to connect three pieces, golden gate park, lands-end and presidio.\nMy tour schedule looks like this.\n1. 2 hours walk in Golden Gate Park, enjoy the nature and artificial in same time, also a lots of family event in the park\n2. 0.5 hour via ocean beach to connect to the lands-end, the great view as the old swimming pool, and some great old restaurant.\n3. 1 hour lands end to enjoy the far away watching to the bridge, as left side.\n4. 1.5 hour tour in presidio, have a stop in korea war memorial, right side to the bridge.\n5. final take the Presidio shuttle bus to ferry builling.\na perfect day hike route, total around 10 KM\nShow less"], ["Reviewed September 2, 2017", 5.0, "Beautiful park for a walk or run", "We visited on a day when most of the facilities within the park were unfortunately closed due to a planned white nationalist event nearby (which we did not encounter). Despite those circumstances, we enjoyed the visit to the Presidio. It is a great place for a walk or a run. Stop by to ogle the view and get some exercise.\nShow less"], ["Reviewed August 31, 2017", 4.0, "The vista stretches calmly", "Like the Heads in Sydney, Australia, so the Presidio is a natural draw for anyone who cherishes natural beauty. Residents probably visit it more in thought than in practice, though devotees there must surely be. For a traveler visiting SF, having passed through the Mission, strolled the Embarcadero, visited Nob Hill, walked, driven or just gazed upon the Gate, it would be a shame to omit the Presidio. Bring a blanket, a sandwich, and something liquid, then enjoy the surroundings.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Beautiful happy space", "I went with my family from Taiwan, and it was a very welcoming atmosphere. There were food trucks, fresh fruits kiosks around the lawn and good music. Nice view of the Golden Gate Bridge. Free bus ride to and from the picnic."], ["Reviewed August 29, 2017", 5.0, "Lucky military people who used to live and work there!", "Some civilians live there now. Beautiful place, great location, more and more things to do there - restaurants, museums, buildings, events, hikes, art..."], ["Reviewed August 28, 2017", 5.0, "Huge Park, Great Views", "Lots to see in this huge park along the Ocean and Bay. Some people live here. Lots of sports, some very wild areas. Some magnificent views and the approach to Golden Gate Bridge."], ["Reviewed August 27, 2017", 3.0, "Great park and wonderful view", "This is a wonderful park, and the views here are great as well. It's a great place to spend time and people watch as well."], ["Reviewed August 27, 2017", 5.0, "The perfect photo", "If you are looking for the perfect photo or selfie with the Golden Gate Bridge as a scenery, this place is perfect for it. In addition, a nice and relaxing walk with dramatic views."], ["Reviewed August 26, 2017", 5.0, "A hidden treasure", "The Presidio has so much to offer for all kinds of people. There is OFF the Grid on Thurs nights and Sundays with food trucks and seating. The bonfires are only on Thursdays. Do not miss touring the Officer's Club located at the back behind the canyons. Inside is a restaurant and wonderful museum. They even have a craft center for kids. There is a bowling alley, golf course, artist installations, hiking trails, DISNEY MUSEUM (A must ) additional restaurants, a free Presidio Go Shuttle throughout all the acres. So much history and beauty.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Beautiful Park!", "Rented bikes at Sports Basement and rode across Golden Gate Bridge to Sausalito. Had lunch there and came back and biked to Fisherman's Wharf and Pier 39 - highly recommended!!!"], ["Reviewed August 23, 2017", 5.0, "Presidio of San Francisco", "Lovely area. Go on a Sunday for the food trucks on the Presidio lawn. You can walk down to the Golden Gate area viewing. Definitely visit the Walt Disney Family Museum."], ["Reviewed August 21, 2017", 5.0, "Great view.", "I'm in favor of knowing all the places that you can because every place is worth knowing a little of its history. There is a beautiful view."], ["Reviewed August 21, 2017", 5.0, "Gorgeous", "Just a world class public park with spectacular plantings and some spectacular view, especially of the Golden Gate Bridge. The Palace of Fine Arts is located here too."], ["Reviewed August 20, 2017", 5.0, "On Sunday families and friends can gather for a leisurely time on these beautiful grounds", "When visiting my daughter, we planned a morning gathering with friends on the well manicured grounds of the Presidio. If you get there early enough you can commander a plastic lounger or two. We did, and sat and talked, catching up with friends.\n\nMany food trucks were there if you didn't bring anything to eat, an impromptu yoga session was going on, many families brought various types of tents, dogs were allowed on leash.\n\nA beautiful day in the city.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Lovely view visiting this historic site!", "Spent an afternoon visiting the Presidio. Visited the Walt Disney museum which is located in the base, had brunch in the Social club restaurnt and had drinks at the Presidio Inn. Spent time in the visitors center learning about the history of this military base. Took lots of pictures of the Golden Gate bridge. So much to see and do that you could spend days in this gem of an historic park. Just driving into and around the Park is beautiful. Can't wait to go back and visit again.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Nice Drive after visiting Golden Gate Bridge", "Driving through the Presidio of San Francisco was very relaxing and a great way to avoid traffic on the return trip to the city. Really enjoyed looking at the architecture and trees through this vista."], ["Reviewed August 13, 2017", 5.0, "A gem in the city that has great open spaces.", "If you get tired of the crowded piers then the Presidio is a great place to unplug and enjoy this historic site. Lots of history, the Walt Disney Museum, Golden gate bridge and the view of the Bay."], ["Reviewed August 11, 2017", 5.0, "make a point to go", "amazing history. Part of every american's history. california has done a great job in restoring this piece of history. You can go to just enjoy the park. Cannons from 1600s"], ["Reviewed August 10, 2017", 5.0, "Best Spot for Views of The Bridge", "This is a great spot to get some fantastic views of the bridge. The Yacht Club is a fabulous spot. When there we also watched a couple of world class \"kitesurfing\" races son the bay. If in the Presidio check out the Disney Family Museum (not really an activity for kids).\nShow less"], ["Reviewed August 9, 2017", 5.0, "Great views of the Golden Gate Bridge **", "** when there is no fog. Love the Presidio. It offers amazing views of the bridge. Have been several times when the bridge is engulfed in fog too, which leads to a very different, almost eery experience, but just as special."], ["Reviewed August 8, 2017", 4.0, "Beautiful area", "They have done a nice job of redeveloping this former army base while keeping much of its old charm. They have converted the old officers housing to private homes and some of the administration buildings to private businesses"], ["Reviewed August 7, 2017", 5.0, "Lovely park", "Came here via Lyon steps in Lyon st. Go left stay on right hand side walk 200 metres turn right then left. Here is Lucas films offices. Lots of Star Wars items,ask reception to look and take photos( free).also before you get to reception outside is the Yodo fountain. After head to the small lake at the bottom of Presido,before you have to walk past Starbucks ( toilets), hope you enjoy it as well.\nShow less"], ["Reviewed August 5, 2017", 3.0, "A bunch of houses on al old military base", "A bunch of houses on an old military base. The Disney family museum is also here. This is good if you are interested in History especially of this area. it was interesting tour."], ["Reviewed August 3, 2017", 4.0, "Something different to See", "We were in a tour bus so we just rode around the\narea. It was very interesting to see and hear about.\nIt is a park and former U.S. Army military fort on the\nnorthern tip of SF Peninsula. It is also part of the\nGolden Gate National Recreation Area. It goes to\nunderneath part of the Golden Gate Bridge. It is\ngood to be on a tour to hear all about it.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Wonderful Day", "I visited this special place of San Francisco and was blown away.\n\nThere is over 6 Km of wonderful wooded and landscaped spaces to explore. There is an educational centre which descibes the history as a military base and has programmes for kids and more.\n\nThe Presidio is also home to the Walt Disney Family Museum...a must see for families and Walt fans. So much to see and you'll need a couple of hours and still want to come back later.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Worth a visit/stroll through", "Great for a morning walk/hike, breathtaking trees and surroundings. The yoda fountain was a great surprise."], ["Reviewed July 30, 2017", 5.0, "Check out the officers club!", "After touring the Walt Disney museum we walked over to the officers club. There's one room that has a wall that dates back several hundred years to the original Adobe that was used back then! They happen to have a special exhibit dealing with the internment of Japanese Americans during WWII that was absolutely amazing!\nShow less"], ["Reviewed July 29, 2017", 4.0, "Red, white and blue", "Red Golden Gate Bridge, blue sky, white clouds... The view is amazing. It is a great place to visit when there is no fog."], ["Reviewed July 29, 2017", 5.0, "So much, so little time", "I wish I had made this my first stop. The shuttle buses take you on the loops (for free). It is worth it to ride one loop before deciding where to stop. There is so much to do and see. Tons of opportunities to walk and take various photos.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Beauty and History Combined", "Opposite (i.e., to the West) of the carnival that is the Fisherman's Wharf stands beautiful park areas and interesting historical forts and other worth sites. Here you can take your picture at the Yoda fountain and enjoy more of the city's vibe that you'll get further east towards the piers. While the piers are a must-see, I'd rank the Presidio right up there for sight-seeing as well...\nShow less"], ["Reviewed July 28, 2017", 5.0, "Breathtaking views of the Golden Gate Bridge and beautiful grounds", "Presidio is a hidden gem. Not that many tourists but absolutely stunning grounds, so green and lush. Fantastic view of the Golden Gate Bridge. The Lucas Film Company is located here and Star Wars fans would be happy to get a pic at the Yoda Fountain, with Darth Vader and other figurines.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Meeting of Land and Sea!", "We visited the Presidio to see the Walt Disney Museum and lucked into being able to purchase the $10 lifetime annual pass for Seniors for the National Park Service a month before they go up to $80 at the last week of August. They have a lovely new Visitor's Center with excellent displays and a killer giftshop, where we bought the Parks Service pass. The other way to obtain the pass was by mail or online and both took weeks to process.\n\nWe also walked the grounds and took some breathtaking shots of the Golden Gate Bridge and enjoyed the views of Alcatraz, the City by the Bay and also the museum.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Gorgeous Views", "We were on a tour- and our guide was very informative and interesting--- gave us information about the history from the military base to what it is now-- stunning views of golden gate- wish we could have had more time here"], ["Reviewed July 26, 2017", 4.0, "Loved the history.", "Our time was limited as it was our last day. Beautiful area with some stunning views. We spent quite a bit of time in the cemetery. The free bus back into the city with a stop near our hotel was great. We used Uber to get there.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Interesting Stop by the Golden Gate", "While traversing down West Lombard street we ended up in the Presidio area of San Francisco. I was not aware of the history of the area until we arrived. This used to be a Military base until relatively recent. It is easy to see since the all the buildings look very base like. Since the military moved out, it has become an artist colony and mini city within San Fran. There was a visitor center that told some of the history. There is always something going on, and the day we arrived it was pretty crowded. We tried to eat at the old officers club, but it was too packed so I recommend reservations. It was an interesting stop, with some nice views of the Golden Gate and SF Bay. It might be worth finding out what events they have and going to what interests you most. Certainly worth a drive through and stop if you have time.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Breathtaking", "I seriously could have spent hours here. It was so beautiful and the history behind everything was so much to take in. I would love to go back and be able to spend more time there."], ["Reviewed July 19, 2017", 5.0, "Bring your camera", "This stunning piece of San Francisco history is worth a visit. Peaceful, with sweeping vistas when the fog cooperates, it's a perfect place to get those photos for Instagram."], ["Reviewed July 19, 2017", 5.0, "Natural beauty in a park", "A great area with lots of different things to see and do. There is a free bus service which runs around the presidio, but will require some time spent going around, as it covers a large area. Great if you have some spare time and want to be as close to nature as possible in a big city such as San Fran\nShow less"], ["Reviewed July 18, 2017", 5.0, "Beautiful", "This was our 3rd time in San Francisco and we always wanted to go on this drive and we finally did. I am glad we did. It was a beautiful scenery. We went in June and it was cold up there."], ["Reviewed July 18, 2017", 5.0, "Top experience of San Francisco", "After visiting the Presidio, it's the first thing that comes to mind when I think \"San Francisco.\" The park is well-manicured and -kept, featuring some of the most gorgeous trees and plants. We also enjoyed the museum--small and quaint, but informative and interesting. The view at Inspiration Point gives you a great overlook of both the bay and parts of downtown. For anyone who wants to experience more of the California greenery and scenery, or just escape the busyness of the city, I would highly recommend the Presidio.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Surprise Trip Favorite", "Okay, so I didn't think we would love this,but we all did! We went to see the WD Museum, and enjoyed the entire Presidio so much. Just a beautiful place to take in SF!"], ["Reviewed July 15, 2017", 5.0, "So much to this park", "One could easily spend an entire day or longer visiting this park in San Francisco. For the Star Wars fans out there, be sure to visit the Lucasfilm lobby and the Yoda fountain off of Letterman Drive. There is a parking lot out front, just let the attendant know you are there to see the fountain and you shouldn't have a problem. The Palace of Fine Arts is a must see as well. So much to see and do in the park!\nShow less"], ["Reviewed July 13, 2017", 4.0, "Beautiful Expansive Nature Preserve", "The Presidio is a park and former U.S. Army military fort on the northern tip of the San Francisco Peninsula in San Francisco, California, and is part of the Golden Gate National Recreation Area. It is an expansive park with beaches, picnic grounds, educational activities, historic landmarks. It is comprised of Crissy Field and Fort Point.\nShow less"], ["Reviewed July 12, 2017", 5.0, "A great place to learn history", "Visited on a clear San Francisco day. Views were marvelous. Parts were built during the Civil War. Aviation history was made here in the 1920s. Gun Placements from WW2. A must see."], ["Reviewed July 11, 2017", 5.0, "Great place to take pictures", "The title says it all. This is a great place to drive to, get out and take pictures with the Golden Gate in the background!"], ["Reviewed July 11, 2017", 5.0, "First Visit", "Amazing place to visit. The grounds are massive. Many hiking and biking trails. I could spend days exploring the site. The Officers Club has a great museum with the history of the Presidio. Entrance is free. There is also a Military Intelligence Service (MIS) Museum by Crissy Field that was the main focus of my visit. There is a $10 entrance fee for this museum. There are two free shuttle bus routes that will take you to all areas of the park. Be aware of where you are on the route because the drivers are not too helpful. A walk to Fort Point is also a must. You get a real different view of the Golden Gate Bridge. Looking forward to my next visit. One other suggestion, there is a free shuttle service with multiple stops called PresidiGo Downtown if you don't want to drive to the park. Take a look at the National Parks Service-Presido web site. Lots of good info on what to see and how to get there.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Beautiful views", "Great place to take pictures and to get good views of the city. You can see just about everything from up high!"], ["Reviewed July 9, 2017", 4.0, "A nice drive", "Nice to drive around and look at the buildings. Was better on the tour bus to get some explanations."], ["Reviewed July 7, 2017", 5.0, "Great Park", "The park counts with lots of sights to be seen and good trails. You can walk for hours and not get bored."], ["Reviewed July 6, 2017", 5.0, "Great Views Of The Golden Gate Bridge And The Marin Headlands", "The Presidio is an interesting section of San Francisco, and well worth a visit, especially if you have a rental car while you're in town. The property is an old military fort that is now part of the National Park Service. If you visit their website, you'll be amazed at the offerings for the various sections of the park. We just drove around and stopped whenever the views were interesting and also when we were hungry for lunch (there are cafes and restaurants here, too). What a nice surprise to find such a quiet section of busy San Francisco!\nShow less"], ["Reviewed July 5, 2017", 5.0, "Walk around a lot and visit the museums", "The lawn is really nice and holds festivals throughout the year, the Disney family museum is also here as is Lucasfilm, though you cant tour more than the lobby of Lucasfilm. Search for the Yoda statue if you're a Star Wars fan - its searchable on google maps\nShow less"], ["Reviewed July 4, 2017", 5.0, "Check beforehand to see if there are any (free) special events .", "There are a series of free events at the officers' Club, a lovely building in the Presidio, which is more egalitarian than it sounds! Pretty good , convenient parking too1"], ["Reviewed July 3, 2017", 5.0, "Great!", "First time visiting Presidio - wish I would have known about this on prior visits to San Franciso. Lovely park area, great views of Golden Gate Bridge - highly recommend - skip Pier 39 and go to Presidio."], ["Reviewed July 3, 2017", 5.0, "Scenic views near Golden Gate Bridge", "Walked from Lands End lookout point near Sutro baths, following the Coastal trail. Presidio also has Baker beach that gives a great view of the bridge. A lot of wildlife as well. Beautiful area!"], ["Reviewed July 2, 2017", 4.0, "Pretty sea front location", "This is worth a trip out to see the fantastic views of the golden gate, the beach is pretty and when it's warm you can have a paddle."], ["Reviewed July 1, 2017", 5.0, "Set aside some extra time", "Our regret is not setting aside enough time for the Presidio and the museums. I really wanted to visit the summer of love museum. It's a really nice area."], ["Reviewed June 29, 2017", 5.0, "Great Memories", "Growing up on the base was a great experience. Not having been there for years I wasn't sure what to expect but I was pleasantly surprised. Since becoming a National Park it has hardly changed. It's still a lovely area to walk, bike or take a leisurely drive (though not Lincoln Blvd which is a fast moving busy street). If you ever lived there it will likely be a memory jogging visit. If you've never been there it will be a slower paced visit with several things to do including, the Presidio Officer's Club which is now a museum, the Disney Family Museum, Baker Beach with it's beautiful views including the Golden Gate, and a museum in the old Fort Point. Truly a nice place to spend some time.\nShow less"], ["Reviewed June 28, 2017", 5.0, "beautiful", "Just had a wonderful time walking the grounds of the Presidio... these are beautiful grounds with great views and very relaxing just so sit and enjoy the sites."], ["Reviewed June 28, 2017", 4.0, "Yoda Fountain is here!", "Unfortunately my time in San Francisco was limited so I just had a short time to go the the Presidio and it was after dark. I had heard about the Yoda Fountain and being a Star Wars fan I wanted to see it. It was basically a fountain with a statue of Yoda on a pedestal in the middle. It was not very well lit in the dark so if you want to get a picture, I would recommend visiting during the day. On my next trip, I hope to see more of this area and go to the Walt Disney Family museum.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Gorgeous", "Beautiful park, views, beach, the bunkers are neat. The path uphill is difficult if you have mobility issues (even if you don't - it's made of sand and there are wobbly logs for you to get a foothold."], ["Reviewed June 26, 2017", 4.0, "Immaculate grounds", "The Presidio is a very nice place to visit. There are a lot of places and trails to walk and visit. The bay views are spectacular also. We were impressed with how immaculately well the grounds were kept and the amount of nice areas to relax.\nShow less"], ["Reviewed June 26, 2017", 5.0, "CHEAPEST thrill in San Francisco ~ great mini- hike", "Even though this is a tourist location it is not very crowed with them. Lots of locals hiking and walking around. Meandering paths take you from the top of the Golden Gate Bridge to this almost secret garden like area that few venture to. You are rewarded with breath taking views of the GGB and the Bay. Don't forget your camera for some beautiful pictures that would make anyone jealous!\nShow less"], ["Reviewed June 26, 2017", 3.0, "The place to access and view the Golden Gate Bridge", "After realizing that Golden Gate Park was not the park closest to the bridge we pulled up our map app and knew immediately the we needed to proceed...to Presidio. We enter the area from the west with a destination of the Bridge Welcome center as our target. As we approached we were treated to majestic views of the Bridge and the gap. As well we could see old battery emplacements that could be gone thorough.\n\nWhen we reached the welcome center we found that parking there is a complete nightmare. If one gets a spot it is by sheer luck as there is maybe a couple dozen spots. We circled around three times but to no avail so we turned south a found instead a Parkin lot with trail access back to the center and other areas.\n\nThe reason we wanted to get to the center is so we could walk the Bridge. Unfortunately we could not during this visit as the day had quickly expired and we had to be moving on to our next destination. Maybe next time. We did get some very nice views of the Bridge from the small observation area at the north end of the parking lot. We felt it was the best place to do so.\n\nSee you on the trail and please remember to try to treat with dignity and respect, everyone whom with you come in contact.\n\nJohn Eric\nShow less"], ["Reviewed June 25, 2017", 4.0, "Very beatiful with lots of things to do.", "Lots to do.The Walt Disney Family museum is a real gem. Beautifully and lovingly executed. Also close by is Lucus Films( in the Letterman complex). A working office that you can't see at work but there is a small Star Wars exhibition in reception. Also there is a Yoda fountain outside the main entrance. Other things to see are the free circular buses around the park from the information centre and a lot of information boards giving the military history of the site. Toilets and cafe in the information centre.\nShow less"], ["Reviewed June 24, 2017", 1.0, "a lot of money for not much", "motel is being remodeled. \"breakfast\" consists of 2 stools in the very small office and who knows what to eat. We didn't even try. breakfast was open 8-10am. too late for us.\nparking is \"free\" is you get a spot--wasn't a problem, however, there were only 7 cars there.\nbathroom is minuscule as is the closet. beds were comfortable. no air conditioning--just open the windows; however, the windows were so large anyone could just climb in the room, we we did with just the fan. stayed away as long as possible and left very early in the morning. don't bother to come here.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Awesome!!", "The Presidio was so amazing and beautiful! The best part was the Yoda fountain and Star Wars lobby. A must see for all Star Wars fans."], ["Reviewed June 21, 2017", 5.0, "THE HISTORY HERE IS REAL", "I am amazed with the Presidio , wow I love to set in the parks there and remissness of how it must have been like during the days at war , and to imagine how ugly war was across the ocean and how so beautiful the Presidio of San Francisco is , please allow yourself to feel this experience .\nShow less"], ["Reviewed June 20, 2017", 5.0, "Self-guided walk", "My son & I got off the \"Hop On/Hop Off\" bus at the Presidio Stop. We walked through the grounds on the way to the Disney Family Museum, which is located INSIDE the Presidio grounds. The Presidio grounds are GORGEOUS!"], ["Reviewed June 20, 2017", 5.0, "Best place for picturres", "Have got to go here. the views are beautiful. Sunset is the best time. we saw dolphins and whales swimming by."], ["Reviewed June 17, 2017", 4.0, "Great Park!", "Great park with a view of the Golden Gate bridge. You can also go to Baker Beach and the Palace of the Arts all located in or around the Presidio."], ["Reviewed June 14, 2017", 4.0, "Scenic spots", "A lot of great views to be had at the Presidio. Stoped by here as part of a tour. Wish the stop was longer."], ["Reviewed June 10, 2017", 5.0, "Great scenery", "This is definitely a place to take pictures! We were on a tour and stopped to see the view. What a great place"], ["Reviewed June 10, 2017", 3.0, "Interesting", "There were several places to walk and take in the sights. There were a lot of one way streets which confused the navigation. Kids liked seeing the Yoda fountain and Lucas films office which had some Star Wars movie props on display."], ["Reviewed June 9, 2017", 5.0, "Beautiful views from along their property (marked viewpoints)", "A friend told us to visit the Presidio in SF before we left for California. Our friend didn't mention the breath-taking views we would see from there. All along the drive through the Presidio, there were vistas and viewpoints for people to pull over and take in the sights. I have attached some photos. Some views were even of the Golden Gate Bridge. Worth the stop and cost nothing :-).\nShow less"], ["Reviewed June 8, 2017", 5.0, "Unexpected", "A very unexpected gem to visit. We went on what we thought was a foggy morning but had great views of the bridge and bay. This would be a great spot to picnic with family or friends. Had lunch at at the warming shake and had awesome service and amazing vegetarian chili!\nShow less"], ["Reviewed June 6, 2017", 5.0, "Pretty at the Presidio", "Beautiful grounds and well worth taking some time to explore. You can get a good view of the bridge (if there is no fog)"], ["Reviewed June 5, 2017", 3.0, "Good photo-taking place of Golden Gates", "The spot near the fort should be the best place to take photos of Golden Gate, especially in the sunset timing."], ["Reviewed June 4, 2017", 5.0, "Beautiful", "The Presidio is such a beautiful neighborhood. See of the best homes in San Fran. This is a gorgeous area to see with lots of old growth trees and other greenery. Beautiful and not to miss."], ["Reviewed June 4, 2017", 4.0, "Great gardens and Views of the Bridge", "Amazing gardens, architectural buildings, ponds and views of the Golden Gate Bridge. A peaceful spot to walk around"], ["Reviewed June 1, 2017", 5.0, "Favorite Neighborhood and Park", "Walk around the neighborhood to view and capture some of the best homes in San Francisco. A lovely, high-end neighborhood for sure!"], ["Reviewed May 31, 2017", 5.0, "Beautiful!", "We walked through Presidio from the Fine Arts Museum to the Walt Disney Museum and from the museum to the Golden Bridge. Very scenic! highly recommand!"], ["Reviewed May 30, 2017", 5.0, "One of the most beautiful spots in San Francisco!", "The Presidio is such a beautiful respite in the middle of this busy city! The landscaping is immaculate and the views of the Golden Gate Bridge are the best! The Officer's Club is a great place for lunch outside and the Presidio also houses Lucas Films and Disney Films. The best though, is the Walt Disney Family Museum that is on the property, a beautiful homage to a great man. My whole family loved the Presidio!\nShow less"], ["Reviewed May 30, 2017", 5.0, "A great place to explore if you want some great views and some exercise.", "The Presidio of San Francisco is a great place to explore if you want some great views and some exercise. This area was a military post and is located at the crest of the Golden Gate Bride. From the Indian Wars, Spanish American War, US Civil War, World War II and Vietnam. This area has historical buildings that host a wide history of American military history. This area is full of amazing hiking and walking trails and is part of the National Park Service.\nShow less"], ["Reviewed May 29, 2017", 4.0, "really interesting and beautiful", "one of unique places to see in San Fransisco. Scenic and historically interesting. probably need a car to get there"], ["Reviewed May 29, 2017", 5.0, "Hike or ride great place to visit", "Whether you want to hike, walk, bike or ride the bus the Presidio has a way for you to enjoy a national park and still visit Unuion Square for dinner. A former military base the park includes historical info on the base, multiple hiking trails. The new Disney Family Museum is there also. Two \"go\"buses take you to various outlooks and stops including the base of the Golden Gate Bridge.\nShow less"], ["Reviewed May 29, 2017", 5.0, "First time in this area, very nice", "I had never been thru the Presidio before even though I came to SF many times as a teenager. This is a gorgeous area to see with lots of old growth trees and other greenery. Beautiful and not to miss."], ["Reviewed May 29, 2017", 5.0, "Great hiking", "If you are looking for exercise and you've already explored Golden Gate Park, just a mile away is an even more spectacular park, The Presidio. I am prejudiced since I live very close to the Presidio and visit a couple of times a week. But for tourists this is one of the more unknown treasures of our city.\n\nThe terrain is much more rugged than Golden Gate Park so wear comfortable hiking shoes and be prepared for hills. Because of those hills I hesitate to recommend biking thru here unless you are in good shape.\n\nThere are fewer eating options than in and around Golden Gate Park. And fewer water fountains so bring a water bottle. There are a few restaurants in the Presidio so if you look at a map you can plan your day to start or finish at a nice eatery.\n\nThere are sweeping vistas of the Bay, tree lined trails and interesting locales spread throughout this treasure box of a park. The National Cemetery and Walt Disney Museum to name two contrasting locations. If you want to see a lot of different places in one trip, then you can drive. But this is really a walker's kind of trip.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Historic Park with military history", "Very nice place for a walk around in the sunshine the park has attractions also museums lot of history here"], ["Reviewed May 23, 2017", 5.0, "Worth a wander", "Stunning view of the Golden Gate Bridge. Beautiful spot to walk through. Wish that I had more time to explore it further."], ["Reviewed May 22, 2017", 4.0, "We only drove through", "This is a beautiful area. We only drove through but definately somewhere I would go back to. The Walt Disney Family Museum is located here. Was a former military base now a national park. Great for picnics or just a stroll."], ["Reviewed May 22, 2017", 4.0, "Great Place", "Believe it or not this is an old military base - check it out on Google. The grounds are vast. Visited on a local \"fair\" of some kind. It is well worth the visit. Dining facilities, shops, bars etc. Different and unusual - give it a try.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Amazing area in the city!", "I was loving the fact we were right in the city with these amazing views, hikes and nature settings all around us!"], ["Reviewed May 19, 2017", 5.0, "Beautiful", "Played a round of golf at the course. Course was in great shape and significantly challenging. Great way to spend the day in Frisco."], ["Reviewed May 18, 2017", 5.0, "Picnic at the Presidio", "Have you ever wanted to have a picnic with all of your favorite foods, alcoholic beverages, and hundreds of people you don't know? Well, now you can! Picnic at the Presidio is a super fun event that I highly recommend to any Bay Area native, or tourist. Every food truck you've ever wanted to try is there, along with a cocktail bar, live DJ, and a bunch of San Franciscans taking it all in. I've often seen local hipsters hula-hooping, or juggling while there (which can be fun entertainment). Bring a Frisbee, a blanket, and an appetite!\nShow less"], ["Reviewed May 16, 2017", 5.0, "Hikers Delight", "There are several hiking trails throughout the park. Start at the newly opened National Parks visitor center and get a map of the park. The staff was extremely helpful and there is parking at several locations for a nominal fee. Great views of the Golden Gate and the bay.\nShow less"], ["Reviewed May 10, 2017", 4.0, "Great place to visit for the day", "Great views - good trails, some good beer, and history. Not a bad place to walk around for the afternoon. Didn't go to the Disney Museum, but enjoyed the rest."], ["Reviewed May 10, 2017", 5.0, "Breathe in the Eucalyptus !!!!", "There are so many historical and amzing nature spots on the Presidio. Tou can even access and walk over the Golden Gate Bridge here. The Eucalyptus trees are particularly fragrant and lots of beautiful flowering trees here too."], ["Reviewed May 10, 2017", 4.0, "Beautiful views", "Beautiful views on the bay, bridge and downtown. You can walk, bike or drive along Lincoln Boulevard."], ["Reviewed May 8, 2017", 4.0, "Former military barracks", "This former military barracks is an interesting addition to any visit to the Bay Area, containing a mixture of different attractions including the Walt Disney Family museum, a national cemetery and the former parade ground, there is a very useful free bus service to downtown SF. From the transport hub at the bay end of the parade ground\nShow less"], ["Reviewed May 6, 2017", 4.0, "Lots of Good History!", "Well worth the visit! Spend time in the Guest Center prior to your visit. You can take a bus trip to see the entire property as an overview. Watch out for the opening times of the museums and restaurants on the property. The views are spectacular.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Great views of Golden Gate Bridge", "We stopped by here and had a wonderful time taking all the sights of the Golden Gate. There were lots of other sightseers and we all took photos for one another."], ["Reviewed May 3, 2017", 4.0, "Beautiful Area", "We ended up walking through the park on our way to the Golden Gate Bridge. It is a beautiful area and well maintained. The hospital is in amazing shape for how old it is."], ["Reviewed May 3, 2017", 5.0, "San Francisco's Hidden Gem", "Like the Lickey Hills ( Birmingham's Alps!) this historic expanse of woodland is where the Amerindians lived when white sttlers arrived. Then it became a fort. Now is it is a mixeduse area, leisure, business, housing, ona grand scale. The space and views are stunning -particularly along the cliff paths and walkways.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Wonderful Visit", "My wife and I spent a wonderful Sunday afternoon at the Presidio. We took BART into the city and then took the free shuttle bus from the BART station to the Presidio. Once on the grounds we went to the museum at the officer's club, took a shuttle bus on a sightseeing tour through the hills, and then took a hike to the fort under the Golden Gate Bridge. We enjoyed all of the activities. As is usually the case, the national park rangers were extremely friendly and helpful.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Amazing Views!", "Our Uber driver took us on a tour past the Presidio. The Presidio of San Francisco is a park and former U.S. Army military fort on the northern tip of the San Francisco Peninsula and part of the Golden Gate National Recreation Area. The park is characterized by many wooded areas, hills, and scenic vistas overlooking the Golden Gate Bridge, San Francisco Bay, and the Pacific Ocean. It was recognized as a California Historical Landmark in 1933 and as a National Historic Landmark in 1962.\nShow less"], ["Reviewed April 25, 2017", 4.0, "Twilight at the presidio", "Look up Twilight at the presidio to find out when it is being held. Great food trucks and live music. Sit out on the grass with spectacular views and have some drinks around fire pit. A unique San Fran experience away from tourist traps."], ["Reviewed April 25, 2017", 5.0, "Walk and View on a Windy Day!", "Visiting the Presidio is must-do experience while visiting San Francisco. It's an opportunity to venture out of the city and see the sights. We visited Fort Point, had lunch nearby, walked up the trail to the Golden Gate Bridge, walked to the bridge midpoint, took the free shuttle to the Presidio Visitor's Center and museum, and finally visited the Officer's Club. It is a full day. It was so windy. Suggest wearing a coat with a hood. Losing your hat is a real risk - I almost did!\nShow less"], ["Reviewed April 23, 2017", 5.0, "A Nature Fix", "San Francisco is full of people, but some parts are also full of open spaces like the Presidio. With hiking trails, ocean vistas, wildlife and picnic areas, people of all sizes can find something to enjoy. Today my friend and I did a short walk around the Main Post and ended up at the Presidio Picnic event. The music and food trucks were delightful for all ages. The Society of California Pioneers were offering free admission that day so we visited the James Lick exhibition. The area offered fantastic views of the Golden Gate Bridge and the Pacific Ocean. We were even lucky to have a glorious sunny clear day. I highly recommend visiting the Presidio for a nature fix or urban excursion.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Spectacular place", "You can tell this used to be an old military base by the cleanliness and set out. It must have been spectacular in its day. Superb views everywhere and what a lovely drive through it on our way to the 17 mile drive. So many places to stop and take wonderful photos and memories of SF. And it's free!\nShow less"], ["Reviewed April 19, 2017", 5.0, "Great Photo Stop", "The Bridge is one of my husbands favorite subjects for photos and this spot is great to view the bridge."], ["Reviewed April 18, 2017", 3.0, "Too Busy", "The Presidio is beautiful but much too busy. On a Sunday it took us over 30 minutes to find a parking spot by the main VC and then had to Uber to Fort Point NHS."], ["Reviewed April 18, 2017", 5.0, "Must See", "The Presidio is a great drive through, walk or hike and is good for birdwatching and photography. The Disney Museum is also in the Presidio and is not to be missed. Wild parrots can be sited here as well as other wildlife and birds. The grounds are lovely.\nShow less"], ["Reviewed April 14, 2017", 4.0, "Fantastic", "A fantastic park for warm days to chill out. By bike or by feet The golden gate park is offering something for everyone. For sport or relaxing, enjoy and stay a few hours ."], ["Reviewed April 13, 2017", 5.0, "Must see place on your visit", "I can't say enough good things about the Presidio. I live in San Fran and walk around the Presidio often and every time I visit something has changed because they are constantly improving the site. Make sure you go to the new visitors center that opened February 2017. Lovely place and super helpful staff where you can get your map and some guidance. There is a lot of space to cover, so if you want to see it all it might be worth doing so on a bike. Either way, wander around and enjoy this jewel of a park.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Beautiful area", "Such a gorgeous area. Eat at the Presidio Social Club, find The Spire art installation, visit the Yoda Fountain and the lobby of Lucasfilms to view Star Wars memorabilia. Take the free shuttle to the Disney Museum or across town to the Embarcadero. The Presidio is a beautiful spot to spend the day.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Historic Site Converted to Other Uses But Still Interesting", "This was once an Army base and like many around the country, has been converted to mixed use. Many small business start ups have offices here, there's a gorgeous beach for picnics, and lovely views from the top of the Presidio. Many of the officer quarters (homes) are still standing and lovely to see.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Perfect Picture Spot", "If your looking for the perfect picture of the iconic bridge this is it. A lot less choatic then the visitor center area right off of the bridge. Park and walk down the hill to see the bridge/visitor center or continue the other way off to follow the hiking path along the cliffs.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Too brief a visit", "We visited the Presidio as part of a bus tour and regretfully did not have enough time there to do it justice, just enough to tantalise us to wish to return and spend time exploring what we are certain would be a very interesting, historical location.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great Early Morning Walk Place", "We had a number of things to do so we stopped at the Presidio early in the morning on a Friday. Things open abut 10 and so being in the park about 8 seemed to give us most of the place to ourselves. This is a very typical Army installation - only a lot bigger. It reminded me of Fort Warden in Washington only much, much bigger - same style of buildings that had the same function.\n\nSince it was April, the flowers were in bloom and bird were everywhere.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Wonderful scenery, many good places to wander, eat and enjoy some of the best scenery in the country", "One of the most beautiful parks in the world with many wonderful places to see, eat and explore. The combination of the Presidio and Crissy Field make for a great way to spend an afternoon in the Bay area"], ["Reviewed April 9, 2017", 5.0, "Wonderful Architecture", "Amazing military base that must have been the primo place to be stationed! Great buildings and flowers and National Cemetery. Worth a drive through."]]}}