{"Redondo Beach Pier": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Redondo Beach Pier", "url": "/Attraction_Review-g32954-d127306-Reviews-Redondo_Beach_Pier-Redondo_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/39/3f/83/redondo-beach-pier.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1086"}, "address": {"@type": "PostalAddress", "streetAddress": "121 W Torrance Blvd", "addressLocality": "Redondo Beach", "addressRegion": "California", "postalCode": "90277-3615", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Great Sunsets", "Amazing Sunsets! Spent a couple evenings on the pier. Felt safe after dark as it is well lit and there was security. Great little shops and restuarants. Had Our 1st Churros"], ["Reviewed 6 days ago", 5.0, "Wonderful view of the harbor and ocean", "A must visit in Redondo Beach, great views of the entire area. Spend some time and get some sea food to eat on the pier."], ["Reviewed 1 week ago", 5.0, "love the piers of California", "great memories of this location. not a trip to LA if you dont do the pier and live like a local. authentic local eateries too."], ["Reviewed 1 week ago", 5.0, "Nice stroll along the beach", "Not over crowded, clean pier, lots of choices for fresh seafood and desserts! We visited Kona Koffee while on the pier and considered a gondola ride around the pier. Many boat excursions available, dock fishing and family friendly activities. If you are looking for a spot with a lot of action, this is not it, however if you are looking to get away from large crowds, I would recommend this pier. There is an arcade called fun fisherman's (not exactly sure if that's the exact name), that would be best for kids, massive arcade with games and food, etc.! Enjoy!!!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nice shops", "All kinds of food shops and stores to buy things including Pizza Sushi all sorts of fish dishes and all kinds of clothing and other things"], ["Reviewed 2 weeks ago", 5.0, "My Favorite Pier", "Great pier with several restaurants and some really nice small shops. Awesome sunset views. Very relaxing environment. Beautiful beach and ocean view."], ["Reviewed 3 weeks ago", 5.0, "Fun and relaxing", "Pier has a good mixture of shops and eateries. My children enjoy the gelato ice cream and playing on the beach. Great place to walk or jog on the strand. Early morning is not too crowded. You can park in parking structure or side streets have meters. I think 25 cents gets you 10 minutes only. Also people Fish off the pier, but I would be cautious of eating any of those catches! We like Kincaids but it is pricey.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Iconic trip", "Redondo Pier is not for everybody.. It is very old school and very diverse in cultures. It is a true fishermans pier with great food stops, not very expensive, but good variety. Quality Seafood downstairs has every kind of fresh fish imaginable, cooked or steamed, right in front if you. Great people watching place to see so many different cultures visiting in one place.. Resturant like Tonys, iconic, abd very good food at a reasonable price.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Walking the Pier", "Nice place to spend a few hours. Lot's of eating establishments and some shops also with the usual tourist stuff"], ["Reviewed January 22, 2018", 5.0, "wonderful place to see the waves", "One of the mosst beautiful places along th pacific coast. Very accomodating to travelers with lots of parking."], ["Reviewed January 22, 2018", 5.0, "this is a great place to go to", "I spent hours sitting on the pier and just watching the ocean and people. I drank a couple of beers at the boat dock and met some real interesting people. I ate at Capitan Kidds and it was always great!!!"], ["Reviewed January 21, 2018", 4.0, "Great for a relaxing walk and a meal", "Lots of parking and many place to grab a bite to eat - them enjoy a relaxing walk along the pier and down the beach or go for a swim"], ["Reviewed January 13, 2018", 4.0, "Beautiful area and wild life", "The area offers boat tours and has local stores and restaurants. I suggest just taking a walk by the beach and enjoy the sunrise or sunset"], ["Reviewed January 8, 2018", 5.0, "Beautiful", "Walked the pier after having dinner at one of the restaurants at the pier. It's so beautiful and clean"], ["Reviewed December 26, 2017", 3.0, "Nice pier, good shops", "Not on par with Manhattan pier, this pier is good for a stroll and shops. Decent parking but only accepts coins. Not crowded."], ["Reviewed December 26, 2017", 4.0, "Getaway", "Great place for a stroll and enjoying the ocean view and air. You also have different foods available and there is sure to be something for everyone."], ["Reviewed December 25, 2017", 5.0, "Should See", "Its not very known like Manhattan beach or santa monica but redondo beach area is so good for beach ,neigbourhood and silence."], ["Reviewed December 24, 2017", 3.0, "Large beach with several hotels and restaurants nearby", "Visited this beach on Christmas Eve. Good atmosphere with people playing volleyball, surfing, fishing and paddling, playing with sand and cycling.\n\nMany eateries along the promenade and open area for walking, cycling and other activities.\n\nDoes not have same atmosphere as Venice Beach or Santa Monica beach and further from town.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Great walking and sightseeing", "This has everything from boats in the marina, restaurants and bars, fish market, and views of people fishing. Not many people on their cellphones unless it’s for taking pictures. Ultra relaxing and soothing!"], ["Reviewed December 6, 2017", 3.0, "The oldest pier in the south bay", "its time for the pier to get renovated. There are quite a few plans in the city and it will be spectacular when completed. however, in the mean time, drive over as we did over the weekend. They still have the amusement park and the crab shops. And you can still walk all around the pier. its a part of RB history. You can say, you knew it when...\nShow less"], ["Reviewed December 2, 2017", 3.0, "Crowded but fun", "We ride our bikes here often. Plenty of places to eat with a wide variety. Generally very crowded on the weekends but nice that there is music there from time to time."], ["Reviewed November 30, 2017", 5.0, "Very nice", "Interesting pier. Shops restaurants people fishing off the pier. Sea gulls watching you. There is plenty of parking close to the pier."], ["Reviewed November 28, 2017", 5.0, "Long pier with many restaurants.", "First time visiting this pier and it is quite a long walk as it goes around in an arc out over the ocean. Great views of Palos Verdes and the Channel Islands. There is a marina nearby so many boats to see."], ["Reviewed November 19, 2017", 5.0, "Fun!", "What a big Pier! Lots of shops and eateries. Had a great time walking around in the sunshine and browsing through the shops and listening to those lovely ocean waves!"], ["Reviewed November 18, 2017", 4.0, "Fishing for inedible fish!", "Was a great place for a walk and a view of the surfers below, lots of fishers with provided cleaning tables but had signs everywhere warning against eating fish!"], ["Reviewed November 14, 2017", 4.0, "Great Pier! Kids loved it!", "Redondo Beach Pier is a great place to take the family. The pier is adjacent to a great California beach. Lots of beach activities and of course surfing. The pier itself is very nice with a lot of small independent restaurants and shops. Very good place to have lunch or dinner. Metered parking on the beach front which can get pricey if you stay long however there is structured parking at the pier which is very reasonable. Def-Rec on this place.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Great people watching", "The pier was busy but nothing like Santa Monica or Venice Beach. Here it was quaint with nice restaurants and bars. You could watch people fishing, cyclists, and runners, a very active pier. Not as pricey as the beach areas north of the airport."], ["Reviewed November 12, 2017", 5.0, "my hometown beach pier!!!", "Love the fresh seafood, view and play market. great family friends visiting place. There is underground parkings with phone text msg notification when your parking time is up. Its pretty helpful."], ["Reviewed November 11, 2017", 4.0, "After so many business appointments, it was nice to get a cup of coffee and gaze out!", "Very nice. I was doing many business appointments and had a short break between and drove down to the ocean. It was a beautiful day so I had a cup of coffee and enjoyed a few minutes gazing at the Pacific! A very nice break from hotel room, driving on the freeway and meeting clients.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Sunshine, fresh air and and a beautiful view!", "I have lived in the South Bay for over 65 years and I never miss a chance to visit the Redondo Beach Pier. While it has suffered in recent decades after a devastating fire in 1988, which resulted in the loss of many popular dining establishments, it is still a destination for me and my family. Whether to celebrate a birthday, holiday or just for an old fashioned walk at the beach the pier has become our place to go.\nShow less"], ["Reviewed November 8, 2017", 3.0, "Quaint", "Lovely walk around pier older and full of charm. Quaint shops and places to eat. Plenty of sea life and HUGE seagulls!"], ["Reviewed November 8, 2017", 5.0, "Another of many gorgeous California beaches", "This is a happening place not far at all from DTLA. visiting our Tifanee & James and they love\ngoing to Redondo so took us for a GORGEOUS sunset, full moon and dinner - walked and walked\nso many restaurants to choose from........loved the views of Pacific and Mountains and oh that MOON\nShow less"], ["Reviewed November 5, 2017", 3.0, "Ageing - But Still Nice", "I walked down here for a look around and its a bit of a tired old pier but in a great location and on a nice day there are plenty of people around"], ["Reviewed November 3, 2017", 3.0, "Looked better from afar - needs a makeover", "We rode our bikes to the pier then got out and walked around. I have to say i felt like it was very old and carnival like - they had a few cute shops but there was no healthy food to be found. It felt like it was really nice years ago but since it is a landmark there were alot of people there and when it lights up at night it does look pretty cool.\nShow less"], ["Reviewed October 26, 2017", 3.0, "Redondo Beach Pier", "The Pier at Redondo Beach seems like a good idea and photographs well, but in practice is not really very exciting. Not worth going out of your way unless you are here anyway or want to use it as a fishing platform. Can park underneath at $1.50 an hour and go for a walk round the loop. Seagulls watch you, sea lions honk from their resting places and there are lots of little silver fish glittering down in the sea. Fishermen are there, but so are lots of notices saying the fish are polluted so inedible along with local mussels. Supposed to be dolphins but they were absent during our visit. Lots of cheap food outlets, we had a nice crumbed fish, shrimp and chips for $12 or an expensive restaurant at far end of the car park that is nothing like as good as it thinks it is (we tried it once) Otherwise just good for a walk in the fresh air just to say you have been here.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Great place to just hang out", "This pier has something for everyone - restaurants, kites, shopping, beach and ICE CREAM! Love to take my grandkids there."], ["Reviewed October 22, 2017", 4.0, "Wonder how much change is going to happen soon?", "I have walked the R.B. pier numerous times often after enjoying lunch OR dinner at The Chart House or Tony's On The Pier. They have plans of doing a major overhaul of the pier. It was destroyed some years ago from a vicious storm. It's presently a great pier....\nShow less"], ["Reviewed October 18, 2017", 4.0, "Great beach area", "This is one of the last real California beach communities - beach area is really nice as are the restaurant around the area. Safe and easy to walk to from Redondo."], ["Reviewed October 17, 2017", 4.0, "Neat place to spent the day", "Another great place to spend the day walking around people watching and enjoying great food. There are lots of little shops and restaurants to pop in and out of. Get here early as parking fills up fast. We will be back. Need to explore more of the food options available.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Beautiful area", "Redondo Beach is one of the last holdouts of a great California beach community. Far less pretentious than ManhattanBeach And more friendly than Hermosa. A great throwback and fun place to be."], ["Reviewed October 14, 2017", 4.0, "Really nice - even out of season", "We parked fairly early in the morning at Redondo Beach Pier and strolled along it just as everything was opening up. In early September it did have an \"out of season\" feel at that time. However come lunchtime when we returned from the beach, the restaurants were quite busy as were the shops selling tourist items. All very laid back and safe.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Nice Beach", "We went to the beach to all around and enjoy the sites and liked shopping and eating on the pier we all enjoyed it!"], ["Reviewed October 5, 2017", 3.0, "Nice spot for walking and looking", "The Redondo Beach Pier is a good spot to enjoy the sights and sounds of the ocean and beachfront and also partake of a wide variety of shops and restaurants. It is a nice spot to spend an afternoon enjoying the beautiful weather, too."], ["Reviewed October 2, 2017", 5.0, "Awesome and huge pier", "We absolutely loved this pier. With three major sections it is huge. There is plenty of dining and plenty of things to do for entertainment. Parking is great and it is very easy to pay."], ["Reviewed September 27, 2017", 5.0, "Just lovely", "Park. Stroll. Watch a sunrise. Watch a sunset. Stroll over to the beach. Shop. Collect shells and sea glass. Clean and safe. Photogenic."], ["Reviewed September 15, 2017", 4.0, "Leisure walk", "This is a beautiful pier with lots of restaurants, bars and souvenir shops. It offers great views of the beach and ocean. It was clear and calm, does not feel too commercial. The weather was very nice in August. I found some cruise tours by the beach.\n\nShow less"], ["Reviewed September 13, 2017", 3.0, "Just stopped by for a quick drink with old friend", "Went by the pier for a quick drink with friend who has not been here for years. Very crowded on the weekend and it has gone down hill a bit. Of course the beach and ocean is nice. But honestly the south side of pier sometimes looks like a homeless camp with a lot of litter and just a general disrespect for the area.\nSafe from our perspective but wouldn't go if a women alone especially after dark , their is a police sub station on pier but police presence is minimum.\nShow less"], ["Reviewed September 12, 2017", 4.0, "Fun", "Nice little pier to walk around on little shops to buy souvenirs and snacks . Its close to alot of other activities."], ["Reviewed September 10, 2017", 4.0, "A charming pier", "This is a charming pier with lots of restaurants, bars and souvenir shops. It offers great views of the beach and ocean. I enjoyed watching the pelicans fly and swim around.\n\nI also hung out on the beach. It was clean and not too crowded. Crashing around in the waves was fun.\nShow less"], ["Reviewed September 6, 2017", 3.0, "Always nice for a walk around", "We live close by and often go for a walk on the Pier. Like the fisherman, pelicans. It is a small piece of nature in a busy urban area. Pretty good restaurants. Stores selling kitsch. Fun factory for the kids to play in. It is a fun outing for a day.\nShow less"], ["Reviewed September 6, 2017", 5.0, "What a view!", "This Pier is full of fun and views! Take the whole family for a fun day. Lots of restaurants, farmers market on Thursdays and a great walk on the strand."], ["Reviewed September 6, 2017", 5.0, "Fun weekend activity", "If you love the ocean, just sitting and eating at one of the restaurants on the pier overlooking the beach and the ocean is fantastic on its own. For more action, you can rent a stand up paddle board (and get a free lesson at the start), or a kayak, or paddleboat. They even have group outings with stand up paddle boarding at night with LED lights under the boards so you can see the fish underneath you. The very large arcade is lots of fun with both new and old games -- Skeeball, full wall PacMan, etc. Something for everyone.\nShow less"], ["Reviewed September 6, 2017", 1.0, "If you love LOUD crowds, this is for you!", "Our group of 5 went for a walk to see the sunset from the pier, and it was everything else except romantic! Low class, loud and obnoxious people and children EVERYWHERE, the smell of seafood cooking, either boiled of fried, was overpowering, no place to sit at a bar and enjoy a drink. I felt like having SOMETHING, so I ordered a funnel cake. After a long wait and $6 later, a small, hard and overly oily thing appeared, the worst one I ever tried, and all of us who tried it, regretted it later due to the grease coming back and heartburn. We were happy to return to the parking lot and get out of there!\nShow less"], ["Reviewed September 2, 2017", 5.0, "Lovey place to visit", "Would recommend a visit if visiting Redondo Beach some average shops for people\nlooking for presents to take home. Some fast food restaurants and a few seated restaurants a little of something for everybody. A lovely place for a stroll surrounded by\nby a harbour and a lovely beach.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Still the best pier ever", "It had been many years since we had been in Redondo, but I grew up here. We very much enjoyed our time on the pier! Lots of shops and eateries as well as beautiful views, a nice walk, and fishing as well."], ["Reviewed August 24, 2017", 3.0, "Carnival on the pier", "It wasn't Venice Beach by any means, no street musicians, etc. Lots of bars, lots of restaurants and an arcade area. Not really my thing."], ["Reviewed August 23, 2017", 4.0, "Be choosy when you choose to go", "The Redondo Beach area is one of the nicer destinations for a beach in the Los Angeles area. Having said that, its size and charm can work against itself when it is overrun with people. Go on a weeknight or a weekday better. When half of humanity comes down the parking spaces are overrun and the pier gourged with too many people, Rowdy or otherwise. There is an excellent place for fresh fish of all types and kinds, some of which is still alive when you pick it. The picnic style concrete tables they have for you works well when the place is not jammed. I cannot speak for how it would be when the place is filled to the brim.\nAs to the pier itself I understand there's still good fishing to be had. So there is an authenticity to all the people dropping their lines at the edge of the pier. The pier is slightly worn, with nails slightly exposed, which adds to its charm.\nThere is a pleasant scale to the area when it is not abused with people that exceed it's natural capacity.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Lovely Sunset on the Pier", "Another interesting pier in Southern California. Absolutely charming sunset at the end of the pier.. Hundreds of fisherman catching fish, typical tourist shops, great food, reasonable parking. Win win for everyone"], ["Reviewed August 16, 2017", 1.0, "This Pier Could Really Use a Face Lift!", "We discouraged our family visiting from out of town from visiting the Pier area because it is dire need of repair and smells like rotting fish and urine. Really wish the residents had agreed to the redevelopment. What a missed opportunity. :("], ["Reviewed August 16, 2017", 3.0, "highs and lows", "Redondo beach pier has changed over the years in some respect, they have some trendier restaurants-R10 social house and they also have cool dive bars with craft beers, the problem is the crowd-people who get totally wasted and become violent. I don't feel safe as I've seen couple of fights break-out and now rarely go to the pier. It's unfortunate because the concert on the pier is a fun activity in the summer.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Big pier with lots to do", "Lots of restaurants, shops, bars, huge arcade, charters, paddle board rentals, people fishing everywhere, lots to see and do."], ["Reviewed August 8, 2017", 4.0, "Birthday celebration!", "My cousin and Aunt brought me to the Pier for an evening of dinning. We ate at The Torito and later stroll around looking at the businesses in the Pier."], ["Reviewed August 4, 2017", 5.0, "Great Pier with lots of restaurants and wonderful views", "Great for strolling watching birds and wild life and finding a great restaurant for dinner or lunch. Highly recommend a visit."], ["Reviewed August 2, 2017", 5.0, "Small but fun", "Great little pier. Not nearly as big as others, but still some great restaurants, shops, etc. Awesome views and a great walking path"], ["Reviewed August 2, 2017", 4.0, "Interesting for sure.", "Lots to see and if your into fried food this is definitely a spot for you! Almost all the food joints are sea food and there's a couple bars here and there. We were there at 9pm on a Saturday and the place was very lively with lots of people fishing on the pier and walking around.\nShow less"], ["Reviewed August 1, 2017", 3.0, "Not impressed.", "The pier and shops and restaurant were your typical tourist traps!! I was not impressed except for the beautiful sunsets we watched from the end of the pier."], ["Reviewed July 30, 2017", 2.0, "Trashy", "This is just too smelly, old and trashy to be of any interest to tourists. Go to Hermosa or Manhattan Beach's piers instead."], ["Reviewed July 30, 2017", 5.0, "Great place", "Spent a few hours here and that was looking for parking. But seriously great place to spend the day fishing eating or drinking or all 3 like we did. Plenty of places to eat or drink. Great place."], ["Reviewed July 29, 2017", 5.0, "fun", "Great place to eat and do alittle shopping. Right on the beach making it a relaxing place to eat. Fun!"], ["Reviewed July 27, 2017", 5.0, "Fun at Redondo Beach Pier", "Lot's great eating places. There's also covered parking. Great beach for swimming, boogie boarding and surfing."], ["Reviewed July 26, 2017", 4.0, "Great place to walk around on a beautiful sunny day.", "I love walking around the pier during the day light hours, looking at all the Pier has to offer. They have lots of quick eatery places or fine dining restaurants. You can have burgers, great steaks or fresh cooked delicious fish. It's all at your...More"], ["Reviewed July 26, 2017", 2.0, "Needs improvement", "There are numerous reviews here that praise this pier's beautiful view of the ocean, upscale restaurants and pleasant atmosphere. These reviews definitely support the adage that perception is everything. The reviews extol the impressiveness of the Redondo Beach Pier and nothing could be farther from...More"], ["Reviewed July 25, 2017", 3.0, "changed", "grew up here, so seeing the pier changed so much and commercialized was a downer, as usual pay parking everywhere, kinda dirty looking, not as clean as it was, more like a tourist trap, sad..."], ["Reviewed July 25, 2017", 4.0, "Take the Walk", "The pier is like any other pier, a nice walk. If you like the ocean and views then be sure to walk the pier. There is a coffee shop and mini aquarium for a small donation at the end of the pier. The bathroom is...More"], ["Reviewed July 23, 2017", 4.0, "Fun place for shopping and restaurants, but VERY crowded", "Fun destination for fresh seafood and shopping. We were there on a weekend and it was very crowded. Lots of shops, restaurants and fresh seafood."], ["Reviewed July 19, 2017", 4.0, "Something different.", "Santa Monica pier may get all of the glory in Los Angeles, but Redondo beach pier has a few diamonds in the rough. Quality seafood is the best place in ALL of LA for fresh seafood and they have the broadest selection. The Pier itself...More"], ["Reviewed July 18, 2017", 5.0, "Relaxing Beach", "Down from pier, you can swim, pop sea kelp, and enjoy the clean beach! The pier itself offers beautiful views, shopping and eateries."], ["Reviewed July 16, 2017", 4.0, "Large pier with shopping, restaurants and fishing", "We were here early on a Friday so didn't really have the full experience but there is lots of shopping and nice looking dive type places to eat. The pier is large with bathrooms. Would go again."], ["Reviewed July 16, 2017", 2.0, "Too crowded; not much to do", "We went on a Saturday afternoon and the beach was so packed we only stepped into the water and then left. The pier is pretty worn down looking, but has great views. Bit of a disappointment versus the other beaches."], ["Reviewed July 15, 2017", 5.0, "Family Night", "My family needed something to do before the next day' flight and decided to take a stroll on the Redondo Beach Pier. There are several restaurants and shop along the pier. Good for people watching too!"], ["Reviewed July 12, 2017", 4.0, "GREAT views!", "This pier juts out into the beautiful Pacific Ocean - the views are incredible---I recommend being there at sunset WITH your camera!!"], ["Reviewed July 10, 2017", 4.0, "I visit the pier...", "...almost daily in the summer, and weekly in the winter. I live close by, so the pier is usually where I begin and end my beach walks. There's an interesting selection of restaurants and bars along the pier as well as picturesque views. It's a...More"], ["Reviewed July 10, 2017", 3.0, "Redondo Beach Pier", "It was nice. A little out dated but overall felt safe to walk on the pier. The pier and beach area seemed to have a lot of families enjoying the area. There are a lot of restaurants to choose from."], ["Reviewed July 10, 2017", 4.0, "Relaxing & Fun", "RB Pier has something for everyone. It's a great place to walk around, enjoy the water views, spot some seals or dolphins or watch the fishing. Has great found choices from treats for the kids to elegant dining."], ["Reviewed July 10, 2017", 5.0, "Lovely sunset!", "Hung out for a while after a business lunch and was awarded with a spectacular sunset! Its a very nice place with shops and restaurants, and considerably less crowded than the touristy Santa Monica pier!"], ["Reviewed July 7, 2017", 5.0, "Lovely place to stop and see the ocean and fisher-people!", "Great pier with robust tourism activities. Especially impressed with all the seafood opportunities. Must be 5 different locations where you can get steamed seafood fresh while you wait. One location offered the biggest lobsters I have ever seen @ $25 #. Lots of fishing occurring-...More"], ["Reviewed July 4, 2017", 5.0, "4th of July Weekend", "Went to Redondo Beach Pier while visiting LA over 4th weekend. So many restaurants to choose from. More choices than Santa Monica and way less crowed. We ate at Tony's and did not have to wait more than 5 minutes to get in. Pier has...More"], ["Reviewed July 2, 2017", 5.0, "Nice walk", "The pier was a nice walk with lots to see. The kids enjoyed seeing the water and the people fishing over the edge."], ["Reviewed July 2, 2017", 5.0, "Lovely", "Every time I visit CA to see family going to the peir is my favourite. I love seeing all the different activities and love looking at the sunset on it. It's absolutely gorgeous."], ["Reviewed June 29, 2017", 5.0, "Vacation", "Very cold in the pier butts a beautiful view of FISHMAN a ocean sea breeze to enjoy whether you sit to eat, talk or walk and the ocean view in the restaurants with great food and beer at Tony's."], ["Reviewed June 27, 2017", 2.0, "Disappointed", "Visited on a weekday. It is rundown, dirty and not much to do..no desire to return.. Too many people fishing from the pier..so be careful when walking around. The public bathrooms are filthy."], ["Reviewed June 26, 2017", 5.0, "Great place fo a stroll", "Wife and I took a stroll out on the pier after a great dinner. The view from the pier is phenomenal and there were several fishermen willing to share stories of the big one that got away! The pier is clean and safe for children."], ["Reviewed June 26, 2017", 5.0, "Great horseshoe pier - nice walk and a lot of cool bars and shops.", "Take a good long walk around the whole pier and harbour area: it's worth it. The amusements downstairs are great, nice and noisy, and the bars on the upper pier and excellent."], ["Reviewed June 25, 2017", 2.0, "Tacky tourist hole", "If you you like kiss me quick tack and slot machines this will be up your street!\nThere were a few restaurants selling lots of sea food such as crab & prawns that looked popular but also looked very low key joints with their plastic cutlery and paper plates.\nWas a shame as the pier itself was really nicely made and the only redeeming feature of Redondo for us were the sighting of 9 dolphins in the harbour.\nOther than them it would be one of the last places on earth I'd want to visit again!\nShow less"], ["Reviewed June 25, 2017", 4.0, "Cool place", "Great little pier, much nicer than Santa Monica pier and all the people. Really reminds me of an English seaside place only with better weather. Some good food places around and just a really nice vibe."], ["Reviewed June 25, 2017", 3.0, "Great location, somewhat entertaining", "As far as piers go, the walk around this one will give you some great views and it's quite large. There were plenty of dining options, most of which seemed pretty well priced but the cleanliness was a bit of a concern. I imagine some of the actual restaurants are just fine but the little eateries along the pier were certainly suspect to me, they may have been just fine. We had multiple trips to the pier as we were riding our bikes up and down the bike paths in the area. Early morning, it's dead, just before lunch and well into the evening, it's lively and has plenty of shops and activities. It's worth going to, nothing over the top.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Fun Place", "If you like a county fair, you 'll like the offerings here. All kinds of food and things to do while walking out over the bay"], ["Reviewed June 18, 2017", 4.0, "Lots of people", "We went to Redondo Beach Pier on a Saturday and the place was packed. Even though there were a ton of people, we still found parking within a few minutes as there were always people leaving. Definitely worth a visit."], ["Reviewed June 13, 2017", 4.0, "Nice but could use updating", "Lots of things to do but most places don't open until 11. Most of the shops seem really rundown on the outside. Quaint but overpriced."], ["Reviewed June 12, 2017", 1.0, "Low rent area and smelly", "Was mis directed here but stayed for a look around. Plenty of things to see and places to eat, but the overwhelming smell of seafood was a bit off putting. A lot of lower end fast food places and bars. Not my style but if you like seafood and shellfish worth a visit.\nShow less"], ["Reviewed June 9, 2017", 3.0, "Nice view. Expensive food.", "Plenty of parking for a few dollars. Nice views here. Food here is SUPER EXPENSIVE. A lot of gross looking men drinking everywhere here. I would not recommend this pier for more than 2 hours if you have kids. The beach here is nice though. Super windy though. Manhattan beach is Far better, and just up the road a few miles.\nShow less"], ["Reviewed June 9, 2017", 4.0, "awesome place for fresh seafood!!!", "this is an awesome place to go for some cheap seafood!!! just pick out your choices and have the vendors cook it for you! reserve a spot on one of the tables nearby\n( I recommend the 2nd floor) and wait for the food to get done! after eating one can then go around the pier and walk...watching the numerous folks fishing off the pier...it gets crowded yes but it's definitely worth the trip !!\nShow less"], ["Reviewed June 4, 2017", 4.0, "Out of the way Pier eats", "First timer ordered bowl of lobster bisque, very generous serving to share with my husband. It is a order and pick up yourself restaurant. They have tanks of crabs and fish. In addition i ordered 1 lbs of grilled large shrimp, the Cole slaw is delish, dill is added gives it a great taste. My husband had fish and chips. Very fresh and good eats. You just wait your own table not a problem for us.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Long & interesting", "It's like a pier shaped as a V. Lots of fishermen, lots of pelicans. It's a fun place to go to escape the heat and breathe in the beautiful ocean air. There are restaurants, counters, and people selling touristy gadgets. It's a lovely place to sit and relax.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Nice place to people watch", "I wanted somewhere interesting to spend the evening on a business trip. Great for people watching and had a wonderful king crab leg for dinner. Shopping was disappointing for me."], ["Reviewed May 28, 2017", 4.0, "Beautiful", "I went with my family because we got a beach house nearby and it was really beautiful. The actually beach was really pretty and there was no visible trash. The pier seemed a bit old so that scared me a bit. They have a lot of fun tourist gifts and attractions. I bought the softest blanket ever there and I do not at all regret that purchase.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Lovely pier", "The pier is a mix of shops and restaurants with a nice mix of old wooden pier and new concrete pier (rebuilt after a storm destroyed much of it). The pier goes out quit a ways and is great for view and listening to the waves. Also, saw a number of people fishing off the pier.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Seafood by the Pier!", "What I like about redondo beach, that the pier is quit big regarding HB and Santa Monica piers, there are many places where you eat seafood and crabs which are good and quite cheap. The beach itself is a lower class than HB and Santa Monica .They have a public parking which is $2/hour.\nShow less"], ["Reviewed May 20, 2017", 3.0, "Crowds, noise and activities", "Redondo Beach Pier is a lively, boisterous party atmosphere. Many people fish off the piers, there's a roller coaster, game rooms, many packed restaurants and tourist shops.\n\nI thought it was well done- beautiful- but I don't like loud noise and crowds so it just wasn't for me.\n\nShow less"], ["Reviewed May 17, 2017", 5.0, "The most relaxing beach in the area.", "I have been to all the beaches in LA county and I have to say Redondo remains local, relaxing, and beautiful. Its so nice to be at a beach that isnt overcrowded with tourists. Even on the weekends, you'll find it much more calm then Santa Monica, Manhattan beach or Hermosa. There is a wide variety of food, and great places to grab drinks with friends without having to move your car. I have always been able to find parking here as well. The more south you go the more serene it gets. If you come here on a weekday, its all yours!\nShow less"], ["Reviewed May 17, 2017", 5.0, "Fun and historic oceanside and pier", "We enjoyed walking from our hotel to the historic pier and ocean area. Cute cafes and seafood restaurants. We had the best clam chowder and salmon chowder."], ["Reviewed May 16, 2017", 4.0, "Nice Pier", "There are several places to grab a bite to eat. We had bikes and walked them through the area. There are lots of people walking through the area, a bit crowded but no issues. Some of the places had live music and big crowds. We enjoyed the sites, sounds and views.\nShow less"], ["Reviewed May 12, 2017", 5.0, "Relaxing and enjoying", "We had a great time walking the pier, clean and we went at prime time, Friday mid morning, there were minimal people. I wish it was more pet friendly"], ["Reviewed May 10, 2017", 5.0, "It has everything!", "They really do have everything. Fresh sea food,restaurants, paddle boats, entertainment and a huge pier!"], ["Reviewed May 3, 2017", 4.0, "Nice shopping on the Pier with great views", "We had a lovely lunch time here. Lots of restaurants and shopping but it is just as easy to stroll or fish. Classic Southern California!"], ["Reviewed May 1, 2017", 2.0, "Needs an update.", "The Redondo Beach Pier could use an update. It has an odd, 'relic' feel to it.\n\nThere were several restaurants, mostly casual, with maybe one or two finer dining options. Many of the restaurants offered outdoor seating options.\n\nThere was also an older arcade, with many broken game machines. The arcade crowd was mostly loiterers, and it wasnt exactly kid friendly.\n\nI wouldnt go out of my way to visit the pier.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Nice pier", "This is a very nice pier. Different types of food available nearby. Nice walk, specially at sunsets."], ["Reviewed April 26, 2017", 4.0, "Great Beach Pier", "Redondo Beach Pier is a little more chill than most of the other really popular ones in SoCal like Santa Monica or Venice. This pier has all of the other necessary things though as the others such as the great food and deserts! I love the funnel cakes here and there is always something exciting going on here on the actual pier itself. Live entertainment sometimes depending on the timeframe that you are visiting. Keep in mind that the weekends are going to be one of the most busy times so having plenty patience with the crowds and finding parking is necessary! I enjoy every trip here!\nShow less"], ["Reviewed April 23, 2017", 4.0, "Nice and cool beaches! Jun 2013", "Certainly a surprise to me to see the beautiful rolling hills estates and the wonderful beach pier in this area! Yes, the seafood market is also a great place to do some good shopping; fresh crabs and lobsters were there every day! So get up at 4.30 and be there at 6!\nShow less"], ["Reviewed April 20, 2017", 5.0, "Love this place!", "We visit Redondo Beach each year and never tire of this area! From the great Coney Island feel of some of the shops to the fresh seafood and unique restaurants, you'll have a challenging time picking which place to eat at! Great area to walk around on too!\nShow less"], ["Reviewed April 20, 2017", 5.0, "Gorgeous!", "A must see in the South Bay area. Serine and beautiful. On the right day, you might just see a whale swimming by you! Lots of great food in the area too."], ["Reviewed April 17, 2017", 4.0, "Different... In a Cool Way!", "This pier and boardwalk area is different from the other beaches we visited in California. There's a small marina and a really cool fisherman's market with all sorts of sea creatures to eat. You can purchase seafood by the pound to take home or they'll steam, grill or fry it for you to eat there. The eating area is outdoor and cafeteria style but it does face the marina and there are strolling musicians. There's an arcade for kids with a tilt a whirl. There are also a few other restaurants, bars and small gift shops. The beach area is separated a bit from the pier restaurants and shops. There is also a boardwalk for walks. In general, this beach is not as upscale as the other ones we visited, but the fisherman's market makes it interesting and unique.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Spring Break", "Fun family time. Great place to grab a snack and walk around. There is an arcade for children, live music, seafood restaurants."], ["Reviewed April 14, 2017", 4.0, "Lots of options for our family", "The Redondo Pier has tons of food shopping and entertainment options plus great views of the ocean and local scenery including the Torrance/Rancho Palos Verdes hillside. I recommend the happy hour food specials at Kincaids, the surf and skate shop at the north entrance and air hockey in the fun zone arcade.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Nice pier, great people watching", "A very nice pier, with some good restaurants, and great people watching. There is always something to see there."], ["Reviewed April 11, 2017", 4.0, "Has Not Changed", "This was once one of my regular spots 20 years ago and very little has changed except for everything is much more expensive...."], ["Reviewed April 8, 2017", 5.0, "Capitan Kidd", "Excellent food!\nIf you like seafood , but ready to eat it in very simple setting- this is the best place for you!\nVery reasonable prices for fresh seafood. I love Chioppino soup. 1 plate filled with all sorts of sea creatures- very filling.\nThey have their own parking, which is not usual for the restaurants on PCH.\nShow less"], ["Reviewed April 8, 2017", 5.0, "Great Pier", "It's a great place for different foods, and they have not so many places to shop. The pier wrap around is a nice walk and the view is just beautiful."], ["Reviewed April 6, 2017", 4.0, "Picture with a Pelican", "There are several choices for food from causal to fine dining. Also several souvenir shops to choose from. If you want a picture with a pelican, you have a good chance if you wonder over near the fishermen. Usually no problem finding parking in the metered structure unless there is a special event (e.g. July 4th).\nShow less"], ["Reviewed April 5, 2017", 4.0, "Good times!", "Great place to go with friends, lots of bars and restaurants to choose from cute little shops to buy things in. And the best part is the sunsets!! Beautiful views of Malibu and the ocean."], ["Reviewed April 5, 2017", 5.0, "Nice day trip", "I love coming to Redondo Beach pier!!! I have been coming here for over 50 years to get fresh seafood. Great place to have lunch, people watch and play in the arcade. You can also fish off of the pier and enjoy the day😘"], ["Reviewed April 5, 2017", 4.0, "Arcade, shops, restaurants, view and parking near!", "The Pier is always a good place to visit if you want to see the sunset, have dinner, have drinks or just spend some time at the Ocean on nice days!"], ["Reviewed April 3, 2017", 4.0, "Take A Stroll On The Pier", "Neat layout for a pier, it's in a big semi circle with lots of little shops and restaurants on multiple levels, my girls are very much addicted to the (pearls in the oyster) places, there are 2 of them close to each other and not terribly expensive, they crack the oysters open after you pick out the one you want (had the most luck picking out the most ugly shell they could find) both my girls got black ones, the wife got a very pretty bluish green that the people had never seen the likes of, so they said. you might see seals, people catching mackrel and such, one day there were these big birds sitting on the roofs that had bright red eyes, they looked evil LOL, it makes for a nice relaxing fun day.\nShow less"], ["Reviewed April 1, 2017", 4.0, "Fun place adjacent to redondo beach", "You can see some people fishing when the sun shines. Nice restaurants serving local food. Ice cream shops. This would also be a starting point for whale watching tours. Nicely decorated and colorful place. Some shops also display live crabs. Poor crabbies 😣"], ["Reviewed March 31, 2017", 5.0, "Amazing beach and bars", "We were on a business trip and had an afternoon to kill. This is the pier seen on many TV shows as it's absolutely beautiful scenery. Bars down the Main Street offer everything you could ever want! Huge beach and amazing sand to relax."], ["Reviewed March 30, 2017", 5.0, "Must see in South Bay", "we love this place... so much to do, so relaxing, you actually don't have to spend a dime, just stroll, take in the sea lions, the pelicans, the fishermen, and people watch"], ["Reviewed March 23, 2017", 4.0, "Nice & touristy", "There are a few shops & bars, loads of people fishing & a fish cleaning station and restaurants where you can choose your own lobster, crab or fish from those squashed tightly into the tanks underneath the windowsills if you don't want to catch your own. If that's still not for you, you can just wander along & people watch.\nShow less"], ["Reviewed March 20, 2017", 5.0, "Spring is like Summer", "A spring day is like summer at the RB pier. Grab a hot dog on a stick and lemonade and then head on over for fresh made churros at the pier bakery. Fewer crowds and distractions make for a pleasant stroll and terrific views of Palos Verdes. Parking is free on Catalina or the Esplanade streets and of course there is also inexpensive paid parking in the structure attached to the pier.\nShow less"], ["Reviewed March 20, 2017", 3.0, "A little old...", "Redondo beach is a nice place, far away from the crowds of other LA beaches, however this Pier is a little bit old, even their stores and restauarants. Good for a walk, but if you are not nearby it do not worth the travel."], ["Reviewed March 13, 2017", 5.0, "Gorgeous sunset, light ocean breeze, magical", "What a wonderful evening we had walking on the pier, fun for the whole family, We loved watching the seagulls and pelicans begging for free offerings from fisherman fishing on the pier.Lots of cute shops and plenty of fresh seafood to choose from."], ["Reviewed March 12, 2017", 5.0, "Nice quick trip for family", "Nice quick trip for family. Very close to the Best Western PLUS Redondo Beach hotel we stayed at. Good fun and good food"], ["Reviewed March 9, 2017", 2.0, "Mediocre Korean Food", "Considering that this was supposed to be the high-classed beach of southern California, I felt as though I was chumming fron the back-streets of Shanghai."], ["Reviewed March 8, 2017", 5.0, "Plenty to see and do.", "Many shops and eateries, biking, kayaking, fishing, whale watching and sun. The best of golden California."], ["Reviewed March 6, 2017", 4.0, "Nice pier to walk on", "Being from Canada, you just don't see piers like this very often. You can walk out to the end. Many people are fishing and walking around. It goes out quite far. We were able to watch people surf. This was a nice experience!"], ["Reviewed March 1, 2017", 5.0, "Saturday night on the pier is a MUST", "watching the birds steal the fish from the fishermen, the local kids just hanging, the bars and the atmosphere make this a must do attraction."], ["Reviewed February 28, 2017", 5.0, "Great place to spend the day", "The Redondo pier is a great place to visit for adults and kids...There are numerous places to eat..Wide range of foods...Adults can go to Tonys restaurant and have a good drink overlooking the ocean..They also have great seafood..."], ["Reviewed February 28, 2017", 5.0, "Beautiful odd shaped pier", "The Redondo Beach pier offers wide variety of restaurants suitable for any budget. It's fun to walk the odd shaped Pier. There are a variety of merchants and restaurants. There is an awesome fresh churro maker. There's plenty of parking for low or no-cost. You can always see people fishing and just strolling the pier.\nShow less"], ["Reviewed February 19, 2017", 5.0, "Home away from Home", "I come to Redondo Beach pier any chance I get. It is filled with so much to do and 2 of my favorite restaurants, El Torino and Tonys on the pier. I heard they will be remodeling the pier in the future. Rumor has it that it will be so much larger and may even have a small amusement park like Santa Monica. I learned to surf from Dewey Weber who has passed away years ago. The beach is my serenity. The pier has easy access underground parking. Great place for anyone. The gift shops are filled with treasures from the sea. My favorite is the Mermaid gift shop as I love mermaids. Go and enjoy. They have rentals so you can surf, body boarding etc.\nShow less"], ["Reviewed February 17, 2017", 5.0, "GREAT TIME", "wonderful place to go and get away from the busy city and relax great food and beautiful sunsets and arcade for the kids"], ["Reviewed February 15, 2017", 4.0, "Great pier with restaurants and perfect for sunset views", "The pier is a great spot for sunset views and a leisurely walk to take in the sea breeze. Redondo Pier is multi-levelled. It has many restaurants (of course, mainly seafood), cafes, pubs and bars. Plus gift and trinket stores. A great view out to sea.\n\nThe Pier arcs out over the beach, so look backwards to watch the waves break on shore and at disk see the lights of the restaurants. Look seaward for a perfect view of the setting sun.\n\nTip: T's a great local seafood hangout underneath the main pier. Paper table cloths, on big concrete tables and chairs, great micro-brewed craft beers, fresh cooked lobster, an array of other seafood and our favourite - clam chowder in a sour-dough bread bowl. All at reasonable prices.\n\nCombine it with a walk to Hermosa Beach pier, restaurants and pubs (although you will need to walk passed a big power plant, but it doesn't billow smoke, its just unsightly). The beach esplanade is worth the effort.\n\nA nice, pleasant afternoon or morning or mid-day out.\n\nGo try it.\nShow less"], ["Reviewed February 13, 2017", 4.0, "I had more fun than I though I would!!!", "I have been Hermosa Pier. I have been to Manhattan Beach Pier. I have been to Santa Monica Pier. Thinking the Redondo Beach Pier would be very much the same, but I was wrong. Took my parents to visit the Pier thinking we would be there for an hour, and ended up staying the afternoon. We parked in the metered parking deck. The first half was typical Pier- lovely views of the beach, restaurants, tourist shops. Delicious fresh churros. We kept walking and ended up at the marina -- with MORE shops, fresh fish shops and arcade, Water sport rentals and a glass bottom boat tour of the harbor. Overall it's a little run down, it could use a sprucing and some fresh paint but the beautiful day did make it a more pleasant visit. A great place to bring out of town visitors on the cheap!\nShow less"], ["Reviewed February 12, 2017", 3.0, "Nice walk", "A few souvenir shops with over priced item but it is expected. A few good restaurants are onsite. Lots of opportunities for fish and seafood lovers"], ["Reviewed February 10, 2017", 4.0, "Sit in the sun", "Sit on the benches. Watch locals fish. Eat or have drinks casually or a bit upscale. Watch the boats coming and going from the harbor marina. Quiet during the week. Busy busy on weekends."], ["Reviewed February 8, 2017", 5.0, "Expansive pier with tons of food and shopping", "Have been to many piers in my life, but nothing like this. You can walk forever. Many great shops and restaurants. Parking is sufficient in the garage or on street. People were very upbeat and friendly in the establishments.\n\nAbsolutely worth taking the time to view the ocean.\n\nShow less"], ["Reviewed February 8, 2017", 4.0, "Huge portions and great service", "The food was tasty and the service fantastic. The appetiser portions are huge - they are a meal in themselves!"], ["Reviewed February 7, 2017", 5.0, "Great place to visit", "It has a great pier and you can see the fishermen from it. In addition, there are great shops and seafood restaurants nearby. We think you will enjoy it."], ["Reviewed February 4, 2017", 4.0, "Great for a walk", "Good walk around the C shaped pier. Their is shopping as well as dining. There are many locals fishing off the pier."], ["Reviewed January 29, 2017", 5.0, "Always fun", "Even though it was a cold day a walk around the pier is always fun.\nLots of bars and restaurants for every taste and pocketbook.\n\nYou'll see fisherman and families, couples out for a stroll and kids chasing seagulls and having fun.\n\nThere are stores too that can give you a break from the cold and you might find a great memento to take home.\nShow less"], ["Reviewed January 28, 2017", 4.0, "Ocean is gorgeous, delicious food choices, good walkways, small shops, little amusment park", "Redondo Beach Pier great date area, and family area. The only problem is parking. you have to pay when you arrive, now and they charge you more to add parking fees to the app. Variety of eating places, from stand eat outside to sit down romantic dining. Beach for swimming, small amusement arcade, little shops of trinkets. fun!\nShow less"], ["Reviewed January 28, 2017", 5.0, "Relaxing", "We went to the Pier to watch the sunset. There are plenty of places to eat and shop also. Parking is reasonably priced and located in an underground garage. You park. Pay with your credit card at a kiosk and choose the amount of time you want to pay for. If you give them your phone number, you'll get a text telling you time is almost up and it will allow you to add additional time from your phone for the hourly rate plus a 25 cent service fee.\nSince we were there to watch the sunset, we just strolled along the pier stopping to look from different locations. People were fishing off of the pier and seagulls and pelicans were all over waiting for a treat. They were quite docile and up close. We had an enjoyable experience and would love to do it again.\nShow less"], ["Reviewed January 22, 2017", 5.0, "Nice walking", "We were walking with my daughter. It has a beautiful view, you can ride a bike. There are many places if you want to eat or buy some souvenir. You have to visit it!."], ["Reviewed January 18, 2017", 4.0, "Very Beautiful Location. Places to eat.", "There are a number of places to eat there that are nice. Pier is a little run down, but its a pier on water. I have found a number of places to eat and drink and hang with the boats, that are fun. Funky, but not not over built and easy to park and walk around. The location is wonderful and when I take photos and put them on facebook everyone just loves it. They have Friday Cars Shows in the Summer next to the pier and just a nice place to be. Very easy going. This is very different then San Pedro or Long Beach. Less commercial and less crowed and built on a beach with fantastic views.\nShow less"], ["Reviewed January 17, 2017", 5.0, "The Best Laid Back Beach Community in Los Angeles", "Come and visit the Redondo Beach Pier. If you are looking for a great laid back beach day or weekend, come and walk around and explore all it has to offer from restaurants, fishing, boating, beach, sea lions and some of the coolest little bars you will ever find. Leave your worries at home and explore this great seaside community.\nShow less"], ["Reviewed January 16, 2017", 4.0, "Nice", "Beautiful beach, long pier. Not much different from other smaller piers. No shops or entertainment on the pier"], ["Reviewed January 15, 2017", 3.0, "People Watch", "We go to the pier a lot to get out of the house, people watch and see what the folks fishing off the pier are bringing up. Every so often we will visit the stores or restaurants along the waters edge. Did just find out that the pier is undergoing plans for renovation. It will be sad to see the old one go but the new plans will have much more thing to do for the tourists.\n\nIf you are down at the pier I suggest renting bikes and going down the strand. Lots of shops and nice beaches between piers, not to mention the social aspect of it. Can spend a day easily doing this.\n\nHave fun.\nShow less"], ["Reviewed January 13, 2017", 4.0, "Enjoy a beautiful day at the pier", "Spend a day at this pier. Lots to do for all ages. Walk, ride a bike, sit and relax to watch swimmers and fishermen. There are shops to browse in, an arcade to play in, and serveral places to grab a bite to eat. Walk up counters to fine dining. The freshest and tastiest seafood you can find!\nShow less"], ["Reviewed January 9, 2017", 5.0, "The Strand is great for running, biking and shopping.", "Good seafood options available. Lots of shops and entertainment. No bikes allowed on the pier BTW. Great during and after sunset."], ["Reviewed January 7, 2017", 5.0, "Coolest pier", "Im not sure you can call this a pier as it is so cool i think it deserves more credit! We went on a misty wet evening, which barely even mattered since the urge to see more of this cool walk outweighed the cold. You can entertain everyone here. Cool retail stores if you want a souvenir or need a sweater. An arcade that has so many old school games we gor caught up for over an hour. There is also so many restaurants you can choose your cuisine. Obviously the fresh fish was the main focus and you can buy and have cooked before your eyes delicious seafood and sit where you can see the boat docks. It was somewhat dead when we cane but i expect this place is hopping in good weather/ another season. We will definitely be back when things are more lively and the weather is better.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Love the Pier", "The Redondo Pier is a great place to visit. We go there every time we visit Southern California. There are some excellent restaurants there and it is the best place to watch the sun set. Love it."], ["Reviewed January 4, 2017", 4.0, "Pier", "We walked here from the hotel. We enjoyed walking. Watching the fishermen and runners. We saw all kinds of birds and fish. There are restaurants and some stores"], ["Reviewed January 4, 2017", 5.0, "Fun", "We had a fun time walking the Pier nice atmosphere and fun for kids Restaurants are not that great expect Kincaids"], ["Reviewed January 2, 2017", 4.0, "Typical CA pier", "As with most of the piers in this area, mostly dining and shopping attractions, but well worth taking a stroll around. RB has developed this quite well and plenty to keep one busy for a couple hours"], ["Reviewed December 21, 2016", 5.0, "beaufitul", "We love Redondo Beach. Is clean, nice and beautiful. The Pier is fantastic, a lot of restaurants. You will feel a real california spirit there."], ["Reviewed December 19, 2016", 5.0, "Very cosy wooden pier with nice shops and restaurants", "We went there a couple of times during our stay at Redondo Beach. There is a variety of shops and restaurants including a very cosy diner at the end of the pier. There are always some people fishing and some pelicans are watching and waiting to get a fish. Sometimes there's live music too.\nShow less"], ["Reviewed December 18, 2016", 4.0, "GREAT OCEANSIDE PLACE TO WALK AROUND AND GET A MEAL", "Found this place just \"cruising around\" off Pacific Highway. Several restaurants and souvenir shops. Great parking (which was FREE for December (not always FREE).\n\nLooks like they had some decent seafood restaurants there but I went between Breakfast and Lunch so I wasn't hungry and most were not open. Interesting place to take a family and get out to see the Ocean. T-shirts, souvenirs, and \"California knick-knacks\" were on sale.\n\nDefinitely a good family place to stop at.\nShow less"], ["Reviewed December 17, 2016", 4.0, "Nice morning walk", "I suggest a walk on the pier if you stop in Redondo Beach. When I was there the atmosphere was quiet with no many other people arond."], ["Reviewed December 14, 2016", 5.0, "Fun shops and places to eat", "We went down late in the evening to grab a souvenir for one of our girls. We ended up walking around the pier and the other shops. It was cool to see all the little cafes you can get fresh seafood. We didn't partake because we just ate and it was late. Next time we're down in Cali we are going to eat all the seafood we can. All the boats were docked right there and we could hear seals in the distance. It was so beautiful there that night. They also had a large arcade but we didn't play as we were on a mission for souvenirs before closing time.\nShow less"], ["Reviewed December 14, 2016", 4.0, "Love the water", "The pier is beautiful, especially at sunset. I've made sure to bring out of town guests here for a stroll"], ["Reviewed December 12, 2016", 4.0, "enjoying relaxing walk, fish food or ice-cream at Redondo Pier", "Great place to spend a few hours between eating fresh fish, ice-cream or American food and more. There are several places were enjoying social moments, buying souvenirs or, if weather allows, get everything you need to enjoy the ocean side and swim! Space for kids available, with video games and more. Good spot for sunset and fishing just after the sun said good bye. Parking available, not expensive. Occasionally you can find music and events along the Pier.\nShow less"], ["Reviewed December 7, 2016", 4.0, "Lots of fresh fish", "Nice semi circular pier with shops, dining, drinking, and fish markets. Easy close in parking for a small fee."], ["Reviewed December 5, 2016", 4.0, "Unwind", "Easy parking, great seafood restaurant and plenty of souvenir shops to choose from. Pier is well maintained."], ["Reviewed December 3, 2016", 4.0, "Lots to see and do", "Plenty of parking. Easy access. Plenty of shops and restaurants. Great views and excellent spot to watch the sunset on the beach or on the pier.."], ["Reviewed December 2, 2016", 5.0, "One of my favorite spots", "I love this pier. Tony's on the Pier is great for a sunset margarita, fresh seafood for sale, pick your own pearl, boat excursions, arcade, live music, you name it- you can probably find it here. It is a wonder place to walk around and admire the ocean. Sunset is my favorite time to be down here, but anytime is a good time. The weekends are obviously busier but parking is usually no problem.\nShow less"], ["Reviewed December 1, 2016", 4.0, "Great vistas!", "Well-maintained, clean with plenty to seating. Loads of shaded venues and little shops and seafood restaurants."], ["Reviewed November 25, 2016", 3.0, "Redondo Pier", "Beautiful place to visit, fantastic views of PV, great beach, walking, biking and good restaurants, souvenir shops.. hopefully new renovation will make it look the way it should be.."], ["Reviewed November 16, 2016", 4.0, "Relaxing Spot", "A 20 minute walk from our Hotel took us to the Redondo Beach Pier. Very quiet, not at all busy between 1100 and 1400. Bonus was the warm weather, ocean breeze and the sound of the waves crashing on the rocks. Some of the restaurants opened after 1200, most had sea food offerings. Overall a good location to relax and enjoy the view.\nShow less"], ["Reviewed November 15, 2016", 4.0, "Great views", "Nice to walk through , with fantastic ocean views , pleasant walking and lots to see , great for the kids to wander through the shops and view the ocean"], ["Reviewed November 15, 2016", 4.0, "Worth a visit", "Nice pier without all the hustle and bustle of the some of the other ones close by. Large choice of eateries and all in all a peaceful please for a stroll. Went one evening and it was very pleasant."], ["Reviewed November 14, 2016", 5.0, "Beauty as its best", "One of the reasons i would recommend this place is cause its never packed on any given day, like santa monica pier is, they have a variety of restaurants and if you wait the evening you get to see a beautiful sunset, its suck a lovely place with alot to do.\nShow less"], ["Reviewed November 12, 2016", 5.0, "Nice family style pier", "A very family style pier. Good for a afternoon or evening walk . A good sunset view and friendly family people"], ["Reviewed November 12, 2016", 4.0, "Walk around was nice", "Cool scene and nice weather, makes for great outing. There are a lot of local restaurants to appease any appetite. Be ready to explore though. Makes for good time"], ["Reviewed November 4, 2016", 4.0, "Fun, small, not crowded", "Overlooked perhaps because everyone heads to Santa Monica pier, but Redondo is is relaxed and worth a look - we enjoyed it."], ["Reviewed November 2, 2016", 5.0, "Good Place to Watch the Sunset", "Just like most pier in California, this one is fun to visit, eat, people-watch, and watch the sunset...which I did all of the above when I went.\n\nI enjoy solo traveling and really enjoyed people watching and didn't feel 'alone' or awkward. There are plenty of shops to go to and the fresh seafood restaurant choices are plentiful.\n\nI ate at Quality Seafood, Inc. and was a little bit disappointed. First of all, the person behind the counter was rude and gave me conflicting information in terms of how they prepare and clean the fish compared to what the cashier told me. The man acted as if I was bothering him for asking him to clean-up and cook the seafood I had ordered from this joint. Then they overcooked/overfried my fish and my calamari and there was no seasoning at all. I should have walked a little bit further and gone to Captain Kidds Fish Market instead, which was the place that was recommended to me by one of my girlfriends who went there recently. I'll make sure not to buy my seafood and eat at this Quality Seafood, Inc. again. I've been in Customer Service industry for over 18 years and I've always treated my customers happily with a smile. Not once in my work history have I treated a customer as if they were a nuissance.\n\nAt the end of my meal, I walked-off all that seafood that I ate and watched the sunset. As always, the sunset was gorgeous and loved the silhouette of the pier lights and the people fishing. I was so bummed that my phone battery died and was unable to take photos *sigh*.\nShow less"], ["Reviewed October 31, 2016", 4.0, "Great place to walk, shop, nosh and enjoy the ocean views", "We spent a weekday afternoon walking on the Redondo Beach Pier. While it wasn't packed with tourists, it still had a large selection of arcades and shops as well as all kinds of snacks for sale. The best part was that you could enjoy the incredible views of the Pacific Ocean and if you were inspired you could rent a kayak or a paddle boat and get in the water!\nShow less"], ["Reviewed October 29, 2016", 5.0, "Great Place!", "The Pier is so wonderful for a walk! There are a lot of places to choose for lunch or dinner. Th sunset hère are out of this world! It's a fabulous place. It's a bit crowded on the weekend."], ["Reviewed October 29, 2016", 3.0, "Fishing Pier!", "The Redondo Beach pier was always a fishing pier. Although it has been improved with shops and restaurants, it's still a fishing pier. The shops are touristy, lots of places to get a beer, no place I would eat. It is what it is."], ["Reviewed October 26, 2016", 3.0, "Walk", "Visited the pier and had a nice walk . It hasn't changed since my last visit a few years ago. The weather was beautiful. I hope Redondo Beach does some renovation and maybe more people will visit."], ["Reviewed October 22, 2016", 4.0, "Mostly Reataurants", "I came to the Redondo Beach Pier hoping for more to do than just restaurants. There were a few other shops there, but none that I was interested in. The pier offered great views of the ocean though, and it was worth the visit."], ["Reviewed October 21, 2016", 5.0, "We love our Pier!", "We love our Pier. Great food and strolling w friends, fam, spouse. But on 3 day weekends its super busy so a little patience is needed when trying to find a parking spot. :)"], ["Reviewed October 18, 2016", 5.0, "Fun pier", "Fun pier... lots to see & do! Wide range of restaurants... Tonys on the Pier... great upstairs bar! Enjoy!"]]}}