{"Robert Mondavi Winery": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Robert Mondavi Winery", "url": "/Attraction_Review-g32812-d116935-Reviews-Robert_Mondavi_Winery-Oakville_Napa_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/5a/81/barrels-of-wine-in-the.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1249"}, "address": {"@type": "PostalAddress", "streetAddress": "7801 St Helena Hwy", "addressLocality": "Oakville", "addressRegion": "Napa Valley", "postalCode": "94562", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 2.0, "Too Corporate", "I went on the signature tour on a sunday afternoon. However that morning i also went to a much smaller intimate winery down the road (Del Dotto) and the differences in service were miles apart.\n\nIn the small winery i was greeted by a smiling sommelier who immediately placed a glass of wine in my hand and greeted me by my name. In Mondavi i was received in an office with a check in desk where i waited for 5 mins before being acknowledged.\n\nIn the small winery the sommelier established a rapport with us to find out which wines we were probably going to like and which we werent. In Mondavi our guide could barely be bothered to say hello let alone know our names.\n\nAlso in the small winery i had 5 dishes of fine food prepared by a top quality chef to go with about 9 different amazing wines. This also included top ups should i have wanted them. I probably drank the equivalent of a bottle.\n\nIn Mondavi I tasted 4 wines but in total had the equivalent of a small glass (125mls), and a single mouthful of chalupa.\n\nAt both wineries i had a tour of the grounds. The only difference is at Mondavi i got to visit the cellars whereas i didnt at the first winery.\n\nHowever price wise, at Mondavi I paid $40 in total whilst the smaller winery i paid $95 in total for everything (including the food).\n\nMy advice, pay extra and go small!\nShow less"], ["Reviewed 1 week ago", 5.0, "Still Good After All These Years", "I used to live close to wine country and have done the wine train, the limo thing, and the couples thing. This time I was with some friends who had never been to a winery so we went to Mondavi.\nParking can be rough, especially afternoons or weekends. Hit it in the morning if possible. The front grounds are beautiful with many visitors doing photos in front of the fountain. As you enter the Adobe type building, tours and tasting are on your left, and a large beautiful lawn, facing part if the vineyard, is right in front if you. Take a minute to look around.\nThe tasting room is nice but if weather permits, sit on the patio. More room, great view, fresh air, sunshine. Tasting flights vary from $25 up, depending on which one you order. In my opinion, a better deal is to take a tour, which will include some wine and sometimes some paired up snacks. You will learn and see quite a bit about how a winery operates, and be more into the wine.\nIf you are really into wine, sign up for the club. I was a member at one point, and besides discounts on cases, the best perk is a private tasting area at the winery.\nThis is a great winery to start your Napa wine country tour.\nShow less"], ["Reviewed 1 week ago", 4.0, "On the wine train stops", "The walk to the winery is long for some and the mulch can be unstable for some. The talk on the wine is all about how the wine here is the best. The wine is not the best for all who visit. The history lesson is good and the tour covers a lot about wine. We drank less tasting glasses here than any other winery we toured while in NAPA. The tour guide was knowledgeable and well informed. The tour is short off the train and there is no time to visit the gift shop and check out any wine for shipping. Unlike some other wineries the olives on the trees are just for looks. Some others in the area make their own brand of olive oil for cooking. The tour was good over all.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very Enjoyable", "Even though the vines weren’t in bloom found this tour informative. Our tour guide was knowledgeable and explained everything well. Saw the whole process and a little bit of Napa history as well as Mondavi. I highly recommend this tour."], ["Reviewed 3 weeks ago", 5.0, "Informative Guided Tour with tasting", "We did a very interesting guided tour at this winery and learnt a lot about the processes of making wine. We also got to enjoy the spectacular setting and enjoy tasting some of their products. I would definitely recommend, was my favourite of the wineries we visited.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Excellent Tour and Guide was very knowledgable", "We signed up for the twilight tour and it did not disappoint. Our guide was personable and very knowledgable about wine tasting. He said he had been a chemist many years ago. The tips he gave us about tasting wine were very helpful. We toured the distillery area and also where the barrels are stored. The cheese at the tasting afterwards was so so good. The best we had tried during this trip. The tasting room was so cozy with a fire in the fireplace. I would go back here and do this one again. And I would certainly recommend it to friends.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Good place to visit", "Among the wineries we visit in Napa Valley, Robert Mondavi was the most affordable for a visit/tasting. It has a lot of history as most of the wineries in the valley, but this one was particularly nice to walk around."], ["Reviewed January 6, 2018", 4.0, "History of Napa wine making", "Even though we visited after the fires and post harvest, our tour of this storied winery with insight into the history of the Mondavi family was priceless. It was a beautiful day and although the vines were bare, our guide Andrew was funny and informative and made the tour most interesting. We ended the tour with a tasting of four wines, and being in a small group of 6 made it more pleasant and personal than crowded tours during the harvest. We are really glad we visited when we did.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Winery Pioneer in Napa", "The Robert Mondavi Winery is a must visit if you are in the Napa region. We did the tour and found it very educational with some sample tasting at the end. Arlyss (likely a different spelling) is a hoot and highly recommend her tours."], ["Reviewed January 2, 2018", 5.0, "Highly recommend!", "Went on a tour of Robert Mondavi Winery and it was amazing! The staff was so friendly and we learned so much about wine tasting and the winery itself. Highly recommend!"], ["Reviewed December 30, 2017", 5.0, "If you only had one dinner in Napa Valley", "We were looking for a memorable event for my wife’s 50th birthday celebration. We chose the garden to table dinner at Robert Mondavi vineyards. It was a wonderful experience and started with a walk in garden to pick vegetables. Included full private tour of vineyards and cellars and dinner lasted almost 4 hours. Great wine pairings and conversations with other guests. As we left for night we cut through the “ classic Mondavi logo” courtyard ( pointed roof on all their labels ) and looked up and could see Milky Way. Perfect starry sky ending to great dinner.\nShow less"], ["Reviewed December 26, 2017", 3.0, "Napa Valley Pinot", "Large tasting room set amongst beautiful landscaped vineyards and grounds. Plenty of opportunity to relax and taste a fine Napa Valley pinot. Tasting notes to go along with your potential selections. Easy to get to anx plenty of parking."], ["Reviewed December 22, 2017", 5.0, "Wonderful Scenery, Good Wine", "When we were doing research on which wineries to visit during our tour of Napa we decided to choose Robert Mondavi as our mainstream \"famous\" winery and glad we did. The grounds are stunning and reminiscent of an Italian villa with the architecture, vineyards and rolling hills in the background. We didn't do a tour but my boyfriend tried a flight of wines and I had a bottle of excellent moscato. We had a relaxing visit and it was a great start to our day tour of Napa. Highly recommended.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Enjoyable wine tour", "We visited Napa Valley in November. Not too long after the fires. The town was calm and welcoming.\n\nMy husband and I decided to do the signature tasting at Mondavi winery. Upon arrival the staff wasn’t very welcoming.The winery is beautiful. Our guide Doug was amazing. He was very knowledgeable and answered all our questions. The tasting included 5 wines the only disappointment is I would of liked just a little bit more wine. The gift shop was nice. Big selections of wine. I definitely recommend this winery! Worth the trip to Napa\n\n\nShow less"], ["Reviewed December 2, 2017", 5.0, "The To Kalon Room!!", "Our wine tasting in the To Kalon Room was one of the best ever. Rendall, the visitor center supervisor, was just wonderful. Excellent knowledge of not only the wines, but the history of the winery and Napa as well. We will come back here every time!\nShow less"], ["Reviewed November 17, 2017", 4.0, "A Napa valley classic", "It is a treat to see the building that graces many of bottles of wine I️ have purchased through the years! Like most of the valley I️ think a $30 tasting is expensive but I️ guess that’s just how it is. Enjoy the staff and the wine as well!\nShow less"], ["Reviewed November 16, 2017", 2.0, "The only place who did not seem to care!!", "We visited Napa and Sonoma about a week after the fires and the welcome we got everywhere apart from here was fantastic, so pleased to see us, as the car parks and restaurants were generally very quiet with people staying away.\n\nAt Mondavi, we had high expectations having drunk quite a bit of their wine on our 3 week trip up to this point, but were very disappointed. The place looks fantastic, very classy, but the overall welcome was muted at best, and there was no show of generosity when the wines were poured.\n\nWe started with what I think was a $25 for 4 wine flight and could not believe how miserable the pours were, they were barely big enough for the 2 of us to taste. The cheese for $20 was slightly better, but we decided not to get ripped off by having any more wine.\n\nShame on you, this might be a business but we commented that it felt like they were trying to make up for their lost sales on us!!\nShow less"], ["Reviewed November 2, 2017", 4.0, "Quick Visit", "Called ahead of time for the Wine Basic Tasting Class and they said they were booked for the day we were planning on coming. The lady mentioned that we could do the Signature Tour but it didn't work into the schedule since we had lunch plans. I mentioned that we were planning to come for the walk in discovery tour and I was told that it was available. However when we arrived they said that they were not having it that day and it was a day by day decision regarding doing the discovery tour. In addition, they said that it was meant for families with kids. I told them i spoke with someone who said it was available. A lady behind the desk said that it was probably her but didn't really apologize. They told us we could do the Signature Tour if we wanted. There was no making up for telling us the wrong thing. The only reason they didn't get 3 stars was because the lady serving us the wine was friendly.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Excellent tour!", "We took the Signature Tour. It was excellent. Only 4 people in our group. The tour guide was very entertaining. We loved the scenery and time at the end to taste wines and learn about the different wines. Great gift shop as well. This was our first winery to visit and would definitely recommend it!\nShow less"], ["Reviewed October 22, 2017", 4.0, "Explore the Workings of a Large Winery", "We did the 90 min. Mondavi Winery Tour on Mon. 9/11/17 that started at 3pm. In the winery business since 1943, Robert Mondavi’s vision and ambition was to produce premium wines amongst the finest in the world and he achieved a degree of success especially with his Fume Blanc a Sauvignon blanc wine. The Mondavi Oakville winery was the first large winery built in Napa Valley after Prohibition. The tour explains the types of grapes used in the wines and how they are picked. After a look at the local vineyard, the tour enters the winery buildings to view the presses, enormous fermenting chambers and wine aging in barrels. We saw the automated bottling machinery in action and wound up in the wine tasting room to experience samples of their fine wines. We recommend this tour since it is representative of the workings of a large diverse winery and for its historic value.\nDid this review earn a “Thankful” Vote?\nShow less"], ["Reviewed October 19, 2017", 4.0, "Beautiful vineyard", "We chose to visit this winery since it was possible to go there without an appointment. They offer several tours of various lenght ant it is worth having them since you get to see behind the scene.\nWith a 30min tour we got to taste 2 wines while walking around in a really nice property\nShow less"], ["Reviewed October 15, 2017", 5.0, "Sweet and tasty", "Not the most popular, but still the best winery. Sweet and calm without crowds of tourists. My favorite was Cabernet Sauvignon."], ["Reviewed October 13, 2017", 5.0, "Mondavi Wedding Wine", "Robert Mondavi has a special place in my heart. My husband and I got married at Sandals Antigua and they only carried Robert Mondavi wine so I knew I HAD to stop at the winery when I came to Napa - and it definitely didn't disappoint! The grounds are gorgeous, we had no trouble finding seating, and the service was outstanding. The gift shop was also stocked with some super neat gifts and trinkets to take home as well. One of the cashiers gave me 15% off just because! Love this place and will definitely be back next time I visit Napa.\nShow less"], ["Reviewed October 11, 2017", 4.0, "The After Hours Tour", "My wife and I took part in the after hours tour that starts at 5:30PM. The wine educator fir this tour was very informative and amusing as well. The tour goes through the production facilities for Mondavi and into the TO KALON vineyards. As for the tastings on the tour they are not spectacular; Mondavi wines are not quite to the quality of the smaller vineyards. Their production is simply too large. The end of the tour ends in a private tasting room; where you have the ability to taste as many wines as you want and even do your own vertical tastings for some of the wines. They also provide some charcuterie and cheese as well. Overall a nice visit.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Amazing tour and tasting", "We took the 90min tour and tasting it was worth it! Doug our guide was awesome! Not pretentious at all and very informative about wine in general and the history of the winery. We were able to see the vineyards, the cellars and tasted some great wine! I highly recommend this place!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Fantastic Tour & Wine Tasting", "We attended the 90 minute tour and wine tasting. It was fantastic to get out, see the vineyard, hear about the history, and sample some great wines. In addition to an awesome wine tour, there is some fantastic pieces of art too, Our tour was today (6 OCT 2017) and they were in the middle of harvest--this means we also got to see the pressing taking place too. This must be the best time of year if you plan a tour because the air smells like wine.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Good introductory tour", "We took the signature tour. At $40 a person, it's rather steep, but still a nice overview/introduction to Napa's history and wine."], ["Reviewed October 3, 2017", 4.0, "Great tour and tasting", "We visited as a part of the Napa Valley Wine Train. Tour was very good and informative. Wines were tasty. Got to go into climate controlled wine storage area. Very impressive."], ["Reviewed October 1, 2017", 3.0, "Down for wine?", "Visited here recently for my brother's birthday but I have been here a couple of years before. It was a beautiful weekend, in the 80's and a perfect day for wine tasting. This time around, our group, decided not to do a wine tour but just to enjoy a couple of glasses at the Kalon bar area.\n\nI wouldn't necessarily say the \"bartenders\" were rude but since another party of older folks was there ordering up on the wine, our party of 7 was slightly ignored until we literally waved our hands for attention. My brother and boyfriend got the 2014 Pinot Noir and the rest of us got the 2014 Fume Blanc. The bartender lady ran out of wine at the second to last glass serving us and she was complaining she didn't have time to open another bottle, since her \"group was due to arrive soon\" --assuming this was a group from the wine tour, so as she was walking away she said the other bartender would help.The other bartender, however, was not paying attention until we flagged him and then he proceeded to open another bottle of the Fume Blanc to finish the glasses for the group. Highly recommend either wine and I am a bit biased since Robert Mondavi wines are one of my favorite wines!\n\nOther than this instance, the winery is undoubtedly beautiful and there are lots of spots to take pictures. Come here with friends or family, either will bring you a good time.\nShow less"], ["Reviewed September 28, 2017", 3.0, "Good intro tour", "Six of us took the tour. It was a good introductory tour. Helen, our host, had a good sense of humor. The grounds are pretty. The wines were ok, the one bit of prosciutto and fig was SO good.\n\nHonestly, i think your money is better spent at somewhere nicer such as Inglenook, for just about the same amount of money.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Great wine, beautiful location, your a number", "It does have great reserve tasting! I really enjoyed being able to pick out of the group. The cost is high, but the tasting wasn't small. When in Napa right... overall one of the better wines I tried while down in the area!"], ["Reviewed September 20, 2017", 4.0, "Decent Business", "Went there to taste wine and see the beautiful landscape and was not disappointed.\nThey have a visitor center, Wine tasting area and a souvenir shop. Views are beautiful and staff is courteous.\nTasted the Cabernet Sauvignon and it was ok, nothing great. Best was Non alcoholic beverage they offer, Pinot Noir flavour soda.\nShow less"], ["Reviewed September 20, 2017", 1.0, "Very disappointing wine", "We went as walk-ins for the tasting flite. 2 red and 2 white. The red were so full of tannin my mouth puckered and could hardly swallow. The whites were thin and astringent. Definitely would not recommend."], ["Reviewed September 18, 2017", 3.0, "Wine ok and very touristy...beautiful grounds", "Nice place. You are definitely just a number. Nothing special. Wine was average compared to smaller boutique wineries. Toured as part of the Wine Train package."], ["Reviewed September 15, 2017", 3.0, "Nice place, wine was OK", "We drove up and entered on our own, not as part of a tour, and with some help found our way to the tasting room. The wines were OK but the tasting package was quite expensive, as was the small cheese plate we ordered to accompany our wines. The people were super-friendly and the scenery was nice, so all in all it was a good visit.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Mini vacation", "The vineyard and landscaping was absolutely beautiful the staff were kind and the wine tasting was fantastic. We also did the 30min tour which cost us $25p/person.\nThe tour guide was knowledgeable and fun it did come with two tastings and great way to see the winery.\nOne thing to remember the wineries all close around 5p some maybe 6p (early) so plan accordingly.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Robert Mondavi - Beautiful and Classy", "Robert Mondavi was the first Vineyard I visited in Napa. I was definitely impressed by the grounds and the beauty of the vineyard. We were greeted by the associates and enjoyed the wine tasting with the recommendations given to us. The wine was delicious and everyone was friendly and helpful. A must see when in Napa.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Doug gave us a fantastic twilight tour, great for new winetasters", "I generally prefer smaller, family owned wineries, however we decided to try Robert Mondavi as we'd heard really great things about the tours and we were not disappointed! We decided to do the twilight tour, and we had Doug as our tour guide. He was excellent! He is very knowledgeable and does not push the higher-priced, snobbier wines. He also made it a point to make the winds accessible, and not be pretentious about trying wine. Overall, this was definitely well worth the money and the time, this is a tour that I would highly recommend to anyone, but I think it would especially be valuable for anyone visiting Napa for the first time, and do this tour early in your trip.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Member visit - very welcoming, great wines", "Always love it - yes it's commercialised but the views are awesome, the sun shines, the wines are good and there is a strong choice. Free water and a welcome."], ["Reviewed September 11, 2017", 5.0, "One of my favorite commercial wines not served here", "I couldn't take my wife to Napa and not visit this Winery. Unfortunately, our other tour didn't end until 4pm so I couldn't get here until just before 5 and they had already stopped tours for the day. However, there was still plenty to do here.\n\nMy wife got in a tasting of 4 wines while we relaxed on the patio. We walked the grounds and clicked several pictures of the beautiful landscape and the hills behind. We visited the Gift Shop and purchased a couple of bottles of what she had tasted to take home.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Beautiful Winery - Loved our tour!", "We had limited time, as we were in Napa for a wedding. We had stopped into a tourist information center in town, and were recommended to take the 1/2 hour tour at Robert Mondavi Winery for $20/person.\n\nThe grounds were beautiful, as well as the sculptures and artwork. In a 1/2 hour, we were given a brief history of the winery, shown some of the vineyards, toured through the winery, and were given 2 wine tastings, without feeling rushed. This was a very nice general overview, for those wishing to get a feel for the Napa region, enjoy some wine, and then end in their store, which had some nice gifts for purchase. I haven't been on other winery tours in a while to be able to compare, but this was a very enjoyable way to spend part of our day, and I'd definitely recommend it.\nShow less"], ["Reviewed September 9, 2017", 4.0, "A real treat", "If you visit I hope you are as lucky as we were to draw Rendell as your guide. Rendell is an extraordinary historian and best of all a true expert on wines and what makes each wine special. It was facsinating to learn about the oldest vines in the valley. He is entertaining, engaging and best of all has a true passion for the Mondavi wines and the craft of making great wines. Oh and the wines were all very good. The only negative was the fact that we eventually had to leave.\nShow less"], ["Reviewed September 8, 2017", 3.0, "Great venue, average wines", "We took the tour of the winery which was very good and enjoyable. The wines though were fairly mediocre by Napa Valley standards, so I wouldn't particularly recommend it. Turnbull was our favourite"], ["Reviewed September 6, 2017", 4.0, "Beautiful Winery", "The Mondavi Winery has beautiful grounds, artwork and of course wonderful wine. We found the lady who was pouring our tasting most helpful we lots of suggestions for things to do and see around Sonoma, Napa and the area."], ["Reviewed September 6, 2017", 5.0, "WOW BETTER THEN I WOULD DREAM!!", "I really wasn't sure what to except.This is a vary known wine and sometimes well you know its hard for them to live up to it.But boy boy did they ever..LOVE love the wine the service and the grounds where all amazing I will go again and so should you.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Do the Tour!", "My husband and I came here as one of our two full tours in Napa Valley (with plenty more tastings) and we were very happy we chose this winery to do the tour. It was very educational, fun and beautiful. We toured both inside and outside, and had a wonderful leader. The wines were delicious and we have already recommended anyone who is looking to do only one big tour in Napa to choose this one!\n\nDefinitely plan to come back for another tasting next time we are in the Valley.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Most beautiful winery we visited!", "Visited this winery with a nice, private tour by one of the winemakers...was completely impressed! Astounding views when you walk in through the arch...just beautiful. Was great to learn all about the history of the winery and see how it's all made during the tour. We even saw them bottling The Prisoner wine (one of my faves). The stop in the Reserve tasting room was fantastic and very much enjoyed trying all the wines. Will definitely be back here upon next visit to Napa!\nShow less"], ["Reviewed September 3, 2017", 5.0, "Beautiful Winery", "What a beautiful setting for a beautiful winery. There's tastings, tours, a gift shop, restaurant, and of course the grounds. Staff was very friendly and knowledgable. Great gift items. Tours and tastings are optional."], ["Reviewed September 2, 2017", 3.0, "Classic Napa Style", "Any serious wine taster visiting Napa ought to go to the Robert Mondavi Winery for the sake of history. They know how to make wine. Although my wife and I tasted nothing that we liked well enough to purchase, the fume' blanc was a temptation! Our server was a knowledgeable, articulate, beautiful young lady.\nShow less"], ["Reviewed September 2, 2017", 5.0, "\"Dinner Under the Stars\" was completely AWESOME!!!", "Mondavi's 2017 \"Dinner Under the Stars\" event was completely AWESOME!!! The setting and decorations were amazing, delicious food kept coming, and great wine kept pouring. The Cabernet they released that night was outstanding, and the wait staff were very free with refilling glasses. They also had a live band which rocked, and we had fun dancing. It was a really great experience, and we're so glad we attended!! I HIGHLY recommend this event.\nShow less"], ["Reviewed September 2, 2017", 5.0, "A highlight", "In retrospect, this was at the top of our favorite places during a 5 night stay in Napa. The pairing and tour was the best of all the wineries. Well done!"], ["Reviewed August 28, 2017", 5.0, "A good education and great wine!", "Some may consider this tourist trap, but it really is a must visit place if you want to learn the history of wine making in California. A great tour from the field to the table. This is especially worth it if you do the reserve tasting and then buy some library wines.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Great experience", "If you are pressed for time and you can only visit one winery than this Is definitely the one to do. Tour guide is very knowledgeable and keep the pace going. The place is fantastic and the quality shine through"], ["Reviewed August 16, 2017", 4.0, "Big but iconic", "I did the Signature Tour, which was fun and informative. Mondavi is an iconic winery but all visitors are made to feel welcome. Our guide, Helen, did agreat job maintaining interest and the tasting itself was very good. Worth booking in advance."], ["Reviewed August 14, 2017", 5.0, "Cave tour", "We visited for the evening cave tour. Doug was very knowledgeable. The entire tour was very interesting. I would recommend arriving early for your tour if you would like time to explore the grounds or the gift shop. Everything is closed by the time the evening tours end.\nShow less"], ["Reviewed August 10, 2017", 5.0, "unexpected delights!", "Did not expect so much from a commercial winery. Selection very different than you get in stores. The staff was very knowledgeable and offered a range of wines."], ["Reviewed August 10, 2017", 4.0, "Mondavi's Winery experience", "Yesterday my husband and I went to Napa Valley , visited Mondavi's vineyard and liked a lot. We had a guided tour with Helen: nice and well prepared person! Great place and good wine. Interesting."], ["Reviewed August 7, 2017", 4.0, "STUNNING.....", "We visited Napa valley as part of our 28 day road trip from Seattle to San Diego via the Pacific coast highway so this was a beautiful detour off into a spectacular region.\n\nThis vineyard is absolutely beautiful on all fronts and offers a great tasting experience of super wines with no pressure sales attached at the end. The grounds and building are stunning and it was a great tasting experience in the Napa region.\n\nI think some people are put off by the more bigger / touristy vineyards but personally I like if your just out for a great tasting day I find the more touristy vineyards are not so hard on the upswell of wine after your tasting they let the wine do the work and they just focusing on giving you a good tasting experience.\n\nBeautiful seating area as well to enjoy some wine overlooking the vineyard.\n\nWhen we come back to Napa we'll be back here, Big well done from WALES (UK).\nShow less"], ["Reviewed August 6, 2017", 3.0, "Nice tasting", "We had a nice tasting of the reserve wines at Mondavi. The hostess worked there for 20+ years so she was able to provide a lot of information."], ["Reviewed August 4, 2017", 3.0, "Visiting a large commercial Vineyard", "Nice ambience geared for large crowds.Came on a very quiet Sunday afternoon and everything was very accessible with minimal wait."], ["Reviewed August 3, 2017", 4.0, "Moderately Priced Compared With \"The Best\"", "Napa Valley wineries have converted free tastings into pricy tours and tastings to go along with faux hacienda architecture with art on the inside walls. After searching organic vineyards and \"name\" wineries, we decided on the $25 Mondavi no reservations 30 minute \"family tour.\" Happily, we were comped, a throwback to earlier times. The grounds and vineyards are striking. The operation is corporate, especially the wine making process. The first tasting was Sauvignon Blanc, a middling white. Later, we were offered muscat or cab, surprisingly poured into the uncleaned previously used glasses. The dessert wine was all sweetness while the Cabernet was quite ordinary. During the tour there was a sales pitch to join its wine club, a reminder at the end, which was at the store (kind of a third sales pitch). One would think that very nice wines would be properly offered for tasting to motivate wine purchases or to join the club. Nevertheless, the tour was enjoyable and informative. We're glad we did it.\nShow less"], ["Reviewed July 31, 2017", 3.0, "Very corporate feel", "I guess when you've been around awhile you get to become an institution like Mondavi but its important not to forget what got you there in the first place. Mondavi's looks to be a huge success with big crowds and fairly decent wine but very little charm, very orderly and efficient but doesn't make you feel like either staying long or coming back. Glad we visited but probably for the only time, next time we'd explore somewhere a little more in keeping with the character of Oakville.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Wonderful Winery Tour", "I booked the SIGNATURE TOUR AND TASTING a day ahead. It Featured a walk through the vineyards and cellars and concluded with a sit-down guided wine tasting. Our tour guide was fabulous! She was informative and entertaining. The entire winery was beautiful and relaxing. The tasting experience was first class. I initially thought that $40 per person was expensive but none of us felt that it was overpriced after we finished. Definitely worth the trip.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Great Wine", "I traveled to San Francisco for a conference so I didn't have a lot of time to tour Napa Valley. Robert Mondavi is one of my favorite wines so I decided to make this winery my one tour this trip. I am very glad I did. The grounds are immaculately kept and beautiful. We took the 30 minute tour that goes through much of the winery. Our guide was great and knowledgable. She was ready and willing to answer everyone's questions which took the tour over 30 minutes, but I appreciated her patience and willingness to help. I ended up joining the wine club and receive great discounts on wines I was already purchasing at local stores. I also now get to try wines I would not normally purchase. There are many wonderful winery's in Napa, but I think this is a must see on any trip.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Beautiful", "One of the few wine tours that permit under 21's. Simply stunning location, really fabulous tour guide Mitchel, really informative and great wine!"], ["Reviewed July 21, 2017", 4.0, "Enjoyable but expensive", "We did the Discovery Tour ($25 each for 30 mins) and just walked in and booked. The tour was enjoyable and we were taught how to properly taste wines and told some interesting facts about Napa Valley and its history. However, the tour did feel incredibly short for $25 each. There were two tastings included in the tour but it was very tiny amounts of wine - about an eighth of a glass each. It's a fun experience but pricey.\nShow less"], ["Reviewed July 20, 2017", 5.0, "awesome winery!", "Had a great experience at this winery in July! Tour guide was very informative, views were breathtaking and wines were delicious!! must see !"], ["Reviewed July 19, 2017", 5.0, "Concert, wine, and food!", "Over the weekend we had dinner and a private tasting with Michael, all while enjoying a great concert. The wine is fabulous and smooth. We also saw the care that is taken in providing such fantastic wines. We enjoyed the great NAPA cabs and rose. We picked up a few Maestro bottles for our collection. Michael was very knowledgeable about the wine and was fun to enjoy the evening with. Stop by, you won't be disappointed.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Amaizing Place", "From all of the wineries in Napa Valley - Robert Mondavi Winery is a must see. The layout is gorgeous, take the tour of 75 minutes which shows you the Valley and how wine is made and a tasting after the tour. It is a brilliant experience!!!\nShow less"], ["Reviewed July 13, 2017", 5.0, "A beautiful winery with great wines", "Robert Mondavi was our first visit on the Napa Valley Wine Train. It is a lovely winery with beautiful grounds. We enjoyed our tour and tasting very much, although I wish out tour guide didn't talk quite so much so we could have had more time for wine tasting and shopping. They have a great gift shop! When in Napa you should stop by Robert Mondavi Winery, I recommend it!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Rich reds recommended!", "I had come here last year and was not that impressed with their wine flights. However, their reds this year are amazing - the reserve cab is 95 points! Cheese plate and seating outside is pleasant. Highly recommended"], ["Reviewed July 8, 2017", 5.0, "Great!", "We really enjoyed our tour and tour guide. The gardens are really beautiful and the facility is gorgeous."], ["Reviewed July 7, 2017", 5.0, "Signature Tour and Tasting", "We really enjoyed our visit, tour, and tasting at Mondavi! The tour is informative and great for beginners or first-time Napa visitors. You get to walk around the vineyard and cellars, as well as enjoy a nice tasting at the end. The tour didn't feel rushed, even though Mondavi is a huge winery and has many tours per day. The wines we tasted were delicious and the atmosphere was beautiful! It's a great spot to tour if you're looking to get a beginner's flavor of what Napa has to offer!\nShow less"], ["Reviewed July 5, 2017", 4.0, "Tour & Tasting", "My husband and I booked the Signature tour and tasting and really enjoyed our time there. Helen was our tour guide and did an excellent job of explaining the history, wine making process and the wines we tasted. It was a small tour group, which was nice. We toured the property, vineyards and wine storage area. All of which were beautiful. We ended in a private room with our tour members to taste 3 different wines. I thought it was a little pricey for the amount of samples you received, but overall enjoyed the experience. It was one of the prettiest wineries we visited while in Napa.\nShow less"], ["Reviewed July 4, 2017", 3.0, "Just O.K.", "Out of three wineries we visited, this was the most disappointing. We moved in a large group, and our guide seemed much more interested in \"selling\" the benefits of joining the Mondavi wine club than in actually showing and telling us everything there to see and learn. He was not a year-round employee of the winery, and only came for the summer to conduct tours. In fact, he couldn't answer some of the questions raised by members of our group. I chose this tour because I thought it would be more educational than some of the others, but we were disappointed with it.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Informative and Beautiful", "One of the must visit wineries in Napa, Robert Mondavi has a beautiful, sprawling vineyard. The tour was informative and the tasting was a lot of fun. I recommend it."], ["Reviewed June 27, 2017", 5.0, "Fantastic relaxing garden", "Spent time in the garden and enjoyed the wonderful wine. It has a beautiful view and everyone was so friendly. Great place to spend an afternoon and enjoy the company that is with you."], ["Reviewed June 24, 2017", 3.0, "New tour guide", "We got a young man as our tour guide who was only 6 wks on the job. He was nice, but was not very knowledgable compared to guides at the other wineries"], ["Reviewed June 22, 2017", 5.0, "Choices", "We stopped at this popular winery. The grounds are beautiful. They offer a selection of wines to taste...4 reds/ 4 whites/ 2 sweets etc. at different prices. We chose the cheapest---2 sweets. We sat on the outside patio and were served cookies with the two selections. Enjoyed viewing the beautiful landscaping.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Great tour", "I would recommend starting with this tour before visiting other wineries. The staff is friendly and they do a great job giving the history of California winemaking. Beautiful grounds and facility."], ["Reviewed June 18, 2017", 5.0, "Great wine and professional friendly service", "We decided to hire a car and visit the wineries we wanted to see rather than a tour that dictates how long you can stay and where you have to go. We researched various tours and all of them would have cost at least $100 more than us hiring the car, plus my husband doesn't drink, so his cost would have been a waste. (We are from Australia and driving there was super easy). Robert Mondavi was my favorite winery of the 3 we visited - I only wish we sold his wines here. I was given a wine placemat that clearly labelled what I was drinking; it was poured in a certain order so that one would not over power the taste of the other; thorough explanation was given for each; water was provided so I could cleanse my palette (not provided by others); the pour size was generous in comparison to other wineries. Lovely estate, and you were able to sit outside for wine tastings if you liked. They had various wine tasting packages, starting from $25 for 4 wines which is what I chose.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Signature tour was interesting", "Glad we signed up up for the Signature tour. A group of about 12 people from all over the world! Learned about the wine making process and a tour of the winery. Loved the art and the roses. A tasting of three wines in a private room at the end. tour guide was very knowledgeable. a good time.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Very nice winery visit", "Beautiful winery with great views of the grape orchards, art and of course good wine tasting. Recommend the tour which is informative regarding the history of wine industry in Napa, the historic Robert Mondavi winery and their various wines. The staff are very knowledgeable about wine and will be happy to answer questions and talk about the wines. The wines themselves are very good. Highly recommended visit if you are in Napa.\nShow less"], ["Reviewed June 8, 2017", 4.0, "Must see even if you don't taste", "I'm in Napa with parents who don't drinks so our tour is mostly of the wineries with the best settings. I love Mondavi for that reason. So easy - right across the street from my other favorite V Sattui. Gorgeous grounds. I've done the tour a long while back - good basic intro to how wines are made. I don't find Mondavi wines that great, but a fun easy stop to kick off your Napa visit.\nShow less"], ["Reviewed June 3, 2017", 3.0, "Disappointed", "We added this place to our agenda bc one my friend's favorite wine is Mondavi. She was really disappointed in the experience. None of the wines were great and the inside is standing room only except for one or two round tables. There wasn't that much outdoor seating either. The grounds are beautiful though and that's why it received three stars.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Beautiful Stop", "Busy spot with wine tasting and tours of the winery as well. The wines were very good and staff is very knowledgeable even for us that aren't made it easy to understand the process."], ["Reviewed May 28, 2017", 3.0, "Poor presentation but good wine", "The presentation was poor, the presenter was more interested in selling us the virtues of their wine club. There was very little explanation of the wine process (although we were familiar from other visits). The wine was pretty good although all in all the while event was poor value.\nShow less"], ["Reviewed May 28, 2017", 1.0, "Corporate winery", "Went to Napa expecting some Californian exotica... Instead we were hit with the worst experience you could get, sure they have a great winery, probably make good wine as well, but the attitude was totally off putting. it was typical 'Take it or Leave it' attitude!\nwe had the good sense to leave and found the Turnbull winery just across the street! they were small and cosy and welcoming and everything and more that we expected from Napa!\nShow less"], ["Reviewed May 27, 2017", 5.0, "Well presented winery & vineyards", "Enjoyed our Signature Tour & wine tasting. James was an excellent guide & host. Got to experience the vineyard & hear the history of these fine wines. Well worth attending."], ["Reviewed May 27, 2017", 4.0, "A very good tour of a winery", "It cost us $40 each for this extensive tour but this did include wine tasting with one freshly made food item. There were about 16 people on this tour and our tour guide (I think called Helen) was very good. We started off in a room where she explained how Robert Mondavi winery started and about the Mondavi family and where the winery is now. We went behind the scenes viewing the large vats, the many wine barrels and the bottling plant. We finished in a private room, tasting 2 whites and 2 reds finishing with a 'Cab' and a little bite to eat with it. As red wine always tastes better with food. The tour ended. In the gift shop where you can buy wine or wine associated gifts. A good tour and we were pleased we went on it.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Info", "A lady at a visitor center recommended this winery as a good place to get a bit of education. She wasn't wrong. Being from the Midwest we needed help. Our guide, Eric, was perfect for us. He was clear and precise. One member in our group kept lagging behind and Eric tactfully got him to join us so we could keep on schedule. I would have loved to spend more time talking to the guide but alas I did not buy the long tour. I'll just have to go back.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Highly recommend the upgraded tasting", "great experience, great wine and loved the atmosphere. You must sign up for the barrel room tour if going to Napa."], ["Reviewed May 24, 2017", 4.0, "Beautiful winery, worth a stop", "Huge, attractive winery, quite commercialized, as are most of the Napa wineries these days. Can purchase wine by the glass, if you haven't already had too much on the tours. Worth the time to stop and view the surroundings."], ["Reviewed May 23, 2017", 5.0, "Amazing Garden to Table dinner experience", "If you have the opportunity to do a dinner at the winery, do it! It was the most fun we had in Napa Valley. Our host Eric was very welcoming and made sure everyone had fun. There were only 3 couples for the dinner which included time in the gardens with the chef to gather things for dinner, some dinner preparation with Chef Paloma, a tour of the winery, appetizers, and 3 course dinner outside served family style. Our wine glasses were kept full the whole time! A truly unique and unforgettable experience- worth every penny!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Very Nice Winery", "We did the walk in Reserve Wine tasting and it was worth it! The staff was very knowledgable and friendly. Lovely afternoon as we sat outside in the Beautiful Garden and enjoyed our wine and the scenery."], ["Reviewed May 22, 2017", 5.0, "Beautiful", "We had planned to visit this vineyard from the start but were recommended others instead. Still we got there and it was just breathtaking."], ["Reviewed May 22, 2017", 4.0, "First Napa Trip", "The spectacular property and views offset a lackluster tasting experience. Good wine; the server just wasn't particularly enthusiastic or informative. Still worth visiting."], ["Reviewed May 18, 2017", 2.0, "Wine tasting selection was poor", "Went with the tour and wine testing and the tour was average and the 3 wines to taste where poor. The tour guide asked who liked red wine and almost everyone in our tour group raised there hand. Then the tour guide proceeded to have us taste a wine, blush and a red. All where not the very good and I would not buy in any store.\nThere are great winery's in Napa and this was basically average and expected more.\nShow less"], ["Reviewed May 17, 2017", 1.0, "Very inflexible", "The lady at the front desk wasn't the most friendly. More of a take it or leave it attitude. My dad has difficulty walking fast due to a disability and when I inquired they were unwilling to accommodate him. We ended not taking the tour and went to neighboring Turbull winery where we had a great time!\nShow less"], ["Reviewed May 17, 2017", 5.0, "Signature tour/tasting", "With this being one of the bigger wineries in the Napa area, one would expect a more hyped-up and over-explained tour,. Turns out it was just the opposite! The grounds are extraordinarily beautiful! Our guide Eric was great, explained first the history, then took us on a short walk through the grounds and into the storage facilities. After that we had 3 wines to sample and an hors-d'oeuvre. Definitely would recommend on a visit!\nShow less"], ["Reviewed May 15, 2017", 5.0, "Great tour of the winery and enjoyable tasting", "Fantastic tour by our guide william. Guide was informative and funny. Enjoyed seeing the ins and outs of the winery and learning about the process of wine making. Also enjoyed the tasting. William did a great job explaining the best method to extract the flavor from the wine when drinking. Overall a fantastic tour and an enjoyable experience. Vineyard is extremely beautiful.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Very interesting and informative tour", "stopped here while touring the Napa valley area. The grounds are magnificent. Our guide Helen, gave us a very detailed explanation of the grape growing and wine making process. This was very interesting, followed at the end with a tasting of some really fine wines. If you are in the area, stop by.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Fantastic tour", "We were unsure if we wanted to do a tour, especially at a large winery. We decided to take the chance and do it. It was $40 each and included a tasting with 3 wines. My husband and I both found the tour to be incredibly informative and interesting. The facility is amazing and beautiful. Our guide, James, was FANTASTIC! He was very knowledgeable and friendly. We thoroughly enjoyed our time with him. The tasting was nice. It was a more formal tasting. I would highly recommend this tour if you're looking to learn more about the wineries and the process of making wine.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Enjoyable and Informative Tour", "We took the winery tour which was both informative and enjoyable. Our guide was very knowledgeable and happily answered all of our questions.\nWe toured the vineyards, but probably the most memorable was the barrel rooms.\nEverything was explained as we went.\nThe tastings were good and some paired with a mushroom cheese bruschetta\nWell worth the fee\nShow less"], ["Reviewed April 30, 2017", 4.0, "Educational visit", "We visited his winery to learn how Napa first started. It was very educational and informative. We get to see how big winery process their product from fruits to final products. As for the wine itself, we were underwhelmed. The tasting was great and the instructor is phenomenal.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Wonderful tastings", "Been there and tasted some wines. You can also choose the group of wine styles you prefer to taste.\nThe red wines were awesome but they offered me Moscato D'oro in the end and I can't forget it anymore. It's terrible I can't find it in Brazil. Unfortunately I only bought one bottle which I drank during the trip.\nCan't wait to go to Napa again and buy some more.\nShow less"], ["Reviewed April 18, 2017", 5.0, "I Love This Place", "This winery is so beautiful. I fell in love with it! The scenery is breathtaking. The art all around is beautiful and moving. The Building is so lovely. I could have stayed there all day.\nWe took the basic tour because we were with our 5 year old and the other tours, understandably, require that you are 21 years old. It was a perfect tour to do with little ones in tow. The 2 wine samples we got were quite good. Some day, when we come back, we will definitely spend more time here and do a full wine tasting tour.\nIt was also cool to learn that R. Mondavi's parents were from the same part of Italy as my Dad.\nSo worth a visit!\nShow less"], ["Reviewed April 18, 2017", 3.0, "Tasting Room", "We were unable to get a reservation for the tour we wanted, so opted for the more upscale tasting room instead. The wines were good and the room was beautiful but there was no education or explanation about what we were drinking - a bit of a disappointment. We basically received glasses of wine and a table to sit at - something we can do in any restaurant. I did however really enjoy walking the grounds and seeing the building that I had read so much about in the \"House of Mondavi\" book. We enjoyed the visit but would have liked more value out of the tasting.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Excellent Setting", "My husband and I stopped here while on our Napa Adventure. The building is lovely, and the outdoor patio is fabulous! We had a few glasses of wine, with green olives, and just enjoyed the sun, and the beautiful vineyard scenery. Our server was wonderful, and attentive. This is a great place to just sit, and enjoy the beautiful grounds!\nShow less"], ["Reviewed April 16, 2017", 5.0, "Great way to start a winery tour!", "This was the first winery I visited on a guided tour of wineries, the Mondavi tour guide was like a teacher, he helped me appreciate wine at a much deeper level, and the place is absolutely gorgeous!"], ["Reviewed April 11, 2017", 4.0, "Great educational tour", "We choose this winery tour as one of the two for our visit to Napa. Very educational winery tour that had a awesome guide, Helen. We got to see the barrels, the bottling room and have a small sit down tasting by a fireplace. Out of our two, they weren't our favorite as far as wine. But the tour was the best!\nShow less"], ["Reviewed April 3, 2017", 5.0, "The Wine Tasting Class is a Must Do!", "My best friend and I had already enjoyed several wineries throughout our three day stay in Napa and had learned a lot about wine tasting but we decided to book a wine tasting class anyways, and it was fabulous. The wine teacher, as I called her, Arylss, was absolutely amazing. She was super informative and comical. The class was an absolute delight as it helped us fully understand EVERYTHING we had already learned and made us feel like wine experts now. The winery itself is gorgeous, we couldn't take enough pictures. The wines are delicious, ended up purchasing a bottle of their Pinot Noir as that is what they are known for. This winery lived up to all the internet hype for sure, a must see/do winery stop!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Amazing tour", "Whether you like Mondavi wines or not, this is simply the best winery tour in the Napa Valley. They do an excellent job of giving you the vinicultural history of the region and then a comprehensive tour of how wine is made. Must do when in Napa!\nShow less"], ["Reviewed April 3, 2017", 3.0, "Not what we expected", "We chose to visit Robert Mondavi thinking we had to visit a \"big\" Napa winery while in town. I'm not sure if it's because we stopped in after having visited a few smaller, family run wineries first, or if it was because it was a rainy, dreary day, but our tasting was not what we expected. Very commercial and missing the personal connection we feel we received at the other wineries, our tasting was nothing special. A bit of a disappointment for our day.\nShow less"], ["Reviewed April 2, 2017", 5.0, "nice winery", "got there late, took the quick tour, still worthy. its a very nice winery, and with very good wine. had a lot of fun!"], ["Reviewed April 1, 2017", 5.0, "Robert's place", "Relaxing fun winery. Very friendly staff. No one pushing to purchase memberships. Picturesque. Lots of space to sit, chill and hang out. Place is busy. Nice tours... more wine to drink."], ["Reviewed March 24, 2017", 4.0, "Beautify big winery", "No appointment needed for a tasting\nThe place is very pretty and has matured since we were first here in in 1990. They do charge now ( did not way back when) for tastes, or you can buy a glass of wine. Their wine is not the best but their building is.\nShow less"], ["Reviewed March 21, 2017", 4.0, "Great place to tour", "When in the Napa Valley, the Robert Mondavi Winery is always on the list of places to visit. The vineyard is very easy to get to and you are immediately awestruck at the gorgeous arch, vineyards, and buildings. Mondavi was the very first vineyard we visited. We took the signature tour, which was a great way to start our Napa Valley tastings. The walking tour was informative, and not at all boring, and took us through the vineyards, fermentation and bottling rooms. It was a great way to learn about the wine making process and how Robert Mondavi was one of the first great wine makers. The tasting at the end of the tour was enjoyable, with a small bite given to accommodate the 3 progressively more complex wines.\n\nThe only bad thing (which was pretty bad) about the vineyard was the woman dry heaving/vomiting on the lawn that sits in the center of the winery. This was very disturbing... I expected someone from the winery to assist her (or at least show her to the restroom). This was how we ended our day at Mondavi. Needless to say, this shows how touristy this winery is... versus many of the smaller hidden gems of Napa, the private wineries, that attract more wine aficionados versus people just looking to get drunk on good wine.\n\nOf the 7 wineries we visited, this was one of the only ones we didn't buy from... mainly because I can get the majority of it at home.\nShow less"], ["Reviewed March 20, 2017", 5.0, "Great Experience!", "We had one night in Napa Valley and decided when in Napa.. to visit a Winery! We are far from wine connoisseurs - and hesitated booking the 90 minute tour, worried that maybe we would be \"bored\" or feel totally out of place. Couldn't be more opposite. This tour was definitely a highlight of our trip! Helen was our guide, and it ended up being a private tour as it was during their off season. We had a lot of fun, and also didn't feel embarrassed about the lack of knowledge we had coming in, and actually learned a lot. The grounds are beautiful. Ends with a tasting of 3 wines and a bite to go with, and then a visit at the gift shop which we took a discounted bottle of wine home with us.\nShow less"], ["Reviewed March 18, 2017", 4.0, "pretty architecture", "this was our first stop in Napa. The tour was interesting and educational, the grounds were very pretty and the folks working there were nice and helpful. I don't like the wine and neither did my husband, but we have never been big Mondavi fans. The grounds were beautiful and the architecture of the place was very cool.\nShow less"], ["Reviewed March 16, 2017", 4.0, "Very comfortable grounds with lots of outdoor seating.", "We did not take the tour but did stop for the wine tasting. Easy to find parking. The wine tasting experience was a bit different in that all 4 wines in the flight were poured at the same time and then we carried the 4 glasses out to the tables to enjoy the beautiful weather. The wines themselves were good which added to the relaxing experience. Beautiful grounds (what we experienced) but did not see them all as we did not take the tour. Will definitely take one on our next visit to be able to see more of the grounds and learn more about the Mondavi wines.\nShow less"], ["Reviewed March 9, 2017", 4.0, "Beautiful Winery and Vineyards", "Although we didn't take a tour, we had a great experience in the VIP club room. There were 7 of us and you are able to pick out of a list of wines, I believe 4 or 5. It was unfortunately a cold and misty day, but we were very comfortable in the room. Try to come on a nice day, although I'm sure it would be much busier! I've also heard great things about the tour offered here, but we were traveling with children and some tours are not suitable for anyone under age 12.\nShow less"], ["Reviewed March 8, 2017", 5.0, "Lovely place to visit", "The wine tasting room is situated with a nice view of the grounds. Friendly service and tasty wines to enjoy. Beautiful place to admire and visit. Worth a stop."], ["Reviewed March 8, 2017", 5.0, "Great place", "Really nice introduction to the winery. It was good to learn and see how wine is made there along with knowledge of the family. Grounds are wonderful.\n\nAlso a nice tasting session. Some of the other wineries in Napa charge so much for a visit (Opus One).\n\nTheir Chardonnay is now one of my favourites. A nice rich oaky white, darker in colour to other whites.\n\nShow less"], ["Reviewed March 3, 2017", 5.0, "Best Stop of the Day!", "If in the area this is a must stop, this was our best stop on a full day of touring. The grounds are outstanding and the staff was very friendly. We did the tour which we found to be very informative and full of history. Mike (a young Richard Dreyfuss) was our tour guide, he did a great job, he kept it interesting and fun. We thought the wines were very good, granted we are only novice tasters, but the wines were excellent. We had an awesome time here and we highly recommend stopping!\nShow less"], ["Reviewed February 26, 2017", 5.0, "Napa Visit", "Really nice experience. Wines were great. Such a beautiful place and setting. Staff were so friendly. The dessert wine was my favourite although not approved by the rest of the group."], ["Reviewed February 25, 2017", 3.0, "Beautiful Grounds", "It was raining the day we were there so we didn't really get to see the whole place, but what we did see was quite nice. The tour, as far as what we saw was nice, but the tour guide was terrible. He was a little rude and very boring. They have a wonderful gift shop.\nShow less"], ["Reviewed February 24, 2017", 3.0, "Good, basic tour", "Our host was enthusiastic and attentive but information provided was adequate for novice tasters. Facility tour was informative; with visit of wine making facilities and cellar area. For a noted winery in the Oakville appellation, the wines tasted seemed quite average. Lots of opportunity to take photos.\nShow less"], ["Reviewed February 22, 2017", 5.0, "Treated Like Royalty", "What a great day at the winery! It was cold and rainy and very few people there. Because we are wine club members at a sister winery, we had a private, fireside tasting. Randall did a wonderful job with the wines and really did make us feel like royalty.\nShow less"], ["Reviewed February 22, 2017", 5.0, "Good for just a glass", "Stopped by this busy, vast and well established winery for a glass of Chardonnay with my wife. Lots of others were taking wine flights and children were running around surprising. We sat outside and enjoyed the sunshine right in the middle of the growing vines. It was a quick and easy bug I f you fancy, there are lots of other tasting tours and experiences if you have the time, money and palate. Booking ahead advised.\nShow less"], ["Reviewed February 20, 2017", 4.0, "Expensive, but great", "Great place to visit if you like Robert Mondavi's wines. You can get diferent types of wine tastings (from small to higher prices) and purchase the bottles you like. There are some exclusive wines you can only find in the Winery. The gift shop was very expensive, in my opinion, but there are some nice and beautifull things for you to find.\nShow less"], ["Reviewed February 19, 2017", 5.0, "Best Views", "did not expect to see such an amazing view of the mountains once inside the winery. most activity is outside which makes for an amazing experience. great staff and wine."], ["Reviewed February 16, 2017", 5.0, "Napa Valley with Family", "Awesome place. Perfect atmosphere. Outstanding professionals throughout the promises! I was there over 10yrs ago, reason enough to bring my wife so she can also get the hang of the great location and entrepreneur they produce!"], ["Reviewed February 16, 2017", 1.0, "Disappointing Visit", "Our visit to the Robert Mondavi Winery was disappointing.\n\nWhen we drove up to the winery, we were impressed with the mission-like architecture and sculpture in front of the entrance. Unfortunately, the visit went downhill from there.\n\nThe receptionist was doing clerical work when we walked in. When she realized that we were not going to sign up for any of the premium wine tastings, she resumed doing her clerical work and just waved us towards the gift shop. She said there were no informational tours of the grounds or video that explained the history of the Robert Mondavi Winery and its impact on winemaking in Napa. My sense from her was that she was not going to waste her time on us if we were not going to sign up for the expensive wine tastings.\n\nThe gift shop that was across the courtyard was large. It had a lot of generic souvenirs.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Private tour was unbelievable", "I was there and was asked to take a private tour and it was an experience that we will never forget. The wines from the barrels were unparalleled and we have been in many wineries. Hospitality was the best we have ever been treated to and we will return.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Beautiful property", "This is a must stop while touring Napa Valley. The grounds are beautiful and we were lucky it was a nice day and were able to sit outside and enjoy our tasting. We were a little disappointed in the wines and we paid for the higher end tasting which are wines that are more exclusive to the winery. But we still enjoyed this stop.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Valentines Weekend", "Great time, awesome wines especially the Sav Blanc and Rose, beautiful views! Great customer service and attention to conversational detail. We especially appreciated the barista with short curly hair, glasses and her sense of humor!"], ["Reviewed February 13, 2017", 2.0, "Commercial Experience", "We are locals and usually take our guests to smaller wineries. This week one of our guests, a state dept guest from Thailand had commented that Mondavi wines were popular in his country, so we decided to revisit the winery - we had been away for at least twenty years. It has turned into an expensive corporate money maker - filled with tourists with not a local in sight. The pours are generous, the wines are decent and the young woman behind the bar is charming and helpful. But the tastings are expensive, there is a high charge for the tours and the place has turned into a corporate 'plastic' experience. It's a shame that the historic Mondavi name has been ruined.\nShow less"], ["Reviewed February 12, 2017", 5.0, "Private dinner party", "Wonderful evening hosted by the Robert Mondavi staff. Food and wine were excellent (tried seven wines from the reserve collection). Staff were excellent and made the evening."], ["Reviewed February 11, 2017", 5.0, "Amazing Man, Incredible Wines", "I highly recommend taking their tour, which is one of the best in the Valley. You will discover the history of Napa, receive an overview of wine growing and wine making, hear stories of an incredible and generous man, and enjoy a taste of three current release wines. Robert Mondavi deserves credit for helping establish Napa as one of the best wine producing regions in the world. This is a popular destination so I recommend making reservations and come early in the day. After the tour, I went to their To-Kalon Room to taste their reserve wines, which are truly world class. The Pinot Noir and Cab Reserve are stunning.\n\nBeautiful grounds, Mission style architecture, and plenty of original artwork. What an amazing place. A must see winery.\nShow less"], ["Reviewed February 10, 2017", 4.0, "Impressive grounds", "Large convenient parking lot. Beautiful buildings. We skipped the tour. Gift shop with interesting merchandise. We walked around and bought several bottles of wine. It was our first stop of the day and didn't know how much there was to see in Napa Valley so we didn't stay long.\nShow less"], ["Reviewed February 9, 2017", 5.0, "Great wines and beautiful property", "Robert Mondavi is a must when visiting this area. It's an iconic winery for a reason. The tastings and your were great. I highly recommend stopping there if you're in the area."], ["Reviewed February 6, 2017", 3.0, "Wine industry", "A part from smaller wineries Mondavi Is Corporate Experience which I don't need. Maybe Is good for first time visitors to wine tasting. Not impressed."], ["Reviewed February 1, 2017", 5.0, "Fabulous tour", "Out of all the winery tours we did during our trip, this tour was the best and most informative tour. We also had a sit down tasting with a pairing and it was delicious. We will definitely do this tour again"], ["Reviewed February 1, 2017", 4.0, "Nice Large Capacity Winery and Tour", "We enjoyed this tour very much. It is a larger winery, producing a great amount of all kinds of wine. The vineyard on the grounds is beautiful. We visited on a rainy day, but it didn't dampen the spirit of the day. Very informative and nice wine tasting at the end of the tour.\nShow less"], ["Reviewed January 29, 2017", 5.0, "Great overall tour and learing experience", "This tour is perfect for someone new to wine tasting in Napa. We did the Signature tour and it starting with an educational briefing and then went on to walk us through the vineyards on the way to the barrel room. We learned about the process of barreling and then off to our private tasting room for a tasting of 3 wines as well as a small bite appetizer.* one bite but it was delicious. I liked the wines here and the gift shop was great! A definite must.\nShow less"], ["Reviewed January 27, 2017", 5.0, "Exuberancy", "The visit to Mondavi Winery activates varied senses. The place is majestic, with sculptures and art pieces all around the place. Two tastings are available: a basic wine selection and a reserve wine tasting. We opted for the second one and were invited to taste the wines by the fireplace. Pure luxury. The wines were generously poured and the ambience was perfect. We were there twice, one at dusk, to enjoy the place and buy a wine for the evening, and the next day for the tasting. The wines were complex and exuberant, matching the location.\nShow less"], ["Reviewed January 21, 2017", 5.0, "Informative and Impressive Chocolate and Wine Pairing", "I had the pleasure of participating in a chocolate and wine pairing at Robert Mondavi with Wine Educator, Lindsey Gorfine. She took us on an unforgettable tasting and pairing journey. Rendall Thomas, Visitor Center Supervisor, happened to sit in on our tasting and he made the experience even more enjoyable. We learned so much from Lindsey and Rendall and had a great time experiencing the changes in the wines when paired with various types of chocolate. In addition, I was so impressed with Mondavi's 50th Anniversary Maestro Red Blend and bought 3 bottles. The bottles were securely packed and FedExed to my home which was much easier than trying to pack them in my suitcase. The gift shop had a wide variety of wines and unique foods and gifts. This experience was certainly a highlight of my trip to Napa.\nShow less"], ["Reviewed January 20, 2017", 4.0, "Affordable tastings, beautiful property", "Don't waste your money on this tour!This winery is super corporate now and your tour will not be exclusive or even all that informative. Our tour guide was a girl in college who just did this as a part time job. The behind the scenes stuff you see on the tour is not all that interesting and just looks corporate clean. The tasting, however, definitely worth it. You can sign up for just a tasting and walk around the property yourself. The landscape, the buildings, the statues and plant life are pristine and gorgeous. You will definitely want to check this spot out and will find many photo opportunities here as well.\nShow less"], ["Reviewed January 19, 2017", 4.0, "Real good experience", "First time I had visited a brewery. It was great experience. $20 tour inside is conducted by. U can taste wine twice during the tour ( 21 years above). They take to wine yards, cellar and explain in detail procedure to make a good wine. Enjoyed\nShow less"], ["Reviewed January 7, 2017", 5.0, "Iconic Winery", "Beautiful winery with a Spanish feel. The grounds are spectacular, even on a rainy day. Michael hosted our visit and showed us everything from the amazing rotating art, to the garden, to the wine production facility itself. What was so unique to this winery was the extremely large 56 oak barrels. Michael explained why they have the various barrels they do, showed us a quick video, and took us through the cellar where we then were seated for a private tasting. Michael shared his knowledge and history of the property with us. It was great to hear that Constellation Brands are wanting to preserve Mondavi’s vision for the winery. On top of it all, the wine is fabulous!\nShow less"], ["Reviewed January 5, 2017", 5.0, "A must in Napa Valley", "This is always a wonderful place to visit. They have one of the most beautiful rose gardens. Robert Mondavi is well known for fabulous wines so well worth stopping in. Unfortunately it was pouring down rain, so did not get much time in the garden, but that doesn't stop the wine tasting.\nShow less"], ["Reviewed January 4, 2017", 5.0, "A must visit place !", "I tried to book the tour online 1 day before, it says no longer available, I was a bit upset since I only had 1 day in Napa,\n\nBut that does not stop me from visiting, I went by to at least try the wine tasting, met RENDELL, wonderful and knowledgeable guy, has very good recommendations, chat a lot , all when I wanted to go off, he told me I should try my luck on the tour, guess what it was available\n\nSo anyone of you guys, want to walk in and try your luck! There is a close chance!!! Elsewise at least visit the winery for wine tasting.\n\nThe tour start off great , we were greeted by ERIC . Information, history, winemaking, knowledge, a lot of fun stuff to learn. For the price is definitely worth it!\n\nA must visit place!\nShow less"], ["Reviewed January 3, 2017", 4.0, "Good guided tour and wine tasting", "We got a good guided tour. Learned quite a bit fun facts about wine making process and the history of this winery. In the end of the tour we got four different wine for tasting. Learned some stuff I did not know about tasting wine."], ["Reviewed January 3, 2017", 5.0, "Rosa, Best Tour Guide", "First of all let me say that Robert Mondavi Winery is superb.\nWe booked a tour to see the wine process and cellars and Rosa Uhes, our tour guide was excellent introducing us to the winery and wines and then the wine process and finally the wine tasting which was excellent and here she demonstrate her passion and knowledge of wine.\nA note, Rose is bilingual (Spanish- English) which is a treat for those spanish speakers visiting who does not speak English and want to have the tour. The tour agents have to use this for their benefit, I'm sure the tours will grow if they let people know about this.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Signature Tour a great introduction", "New to Napa? New to wine tasting? Start with the Signature Tour at Mondavi. This tour is all about educating you on the wine making process, how to taste, and how Robert Mondavi shaped the Napa Valley wine industry. It is a great foundation tour that makes you feel comfortable in an environment that can at times be intimidating. I'm not sure a \"wine expert\" would enjoy it as much as we did. The tour ends in a private tasting room with samples of 3 wines and a small treat to eat with the third wine. We were lucky to get Helen as our wine educator. She is so knowledgable and her sense of humor kept us entertained. 10 stars for Helen. She answered all questions and provided so much information to increase the tasting experience. After tasting, you visit the gift shop to purchase wine and wine supplies if you wish. No pressure.\nEven in the winter the grounds were pretty. Try it. A very impressive tour.\nShow less"], ["Reviewed December 30, 2016", 4.0, "Worth a visit", "It was an afternoon tasting tour we had booked. After an introduction we were taken though the vineyards to the winery, a picturesque ivy-clad old building to see the wine making process, the cellars and the tasting room where we savoured three of the wines. The guide was very good and dealt capably with all the queries. Just wished there were more bites offered with the wines not just a single piece of savoury.....\nThe gift shop was way too expensive.\nShow less"], ["Reviewed December 30, 2016", 5.0, "A Delightful Afternoon", "We took one of the tours and had a delightful and informative guide. They keep their tour groups small, and the tastings were excellent. I have a couple of new favorite wines now."], ["Reviewed December 27, 2016", 4.0, "Good Introduction", "We booked the $35 tasting. I am fairly harsh in judging the value of activities like this, but I thought the it was pretty good value for money. You don't see much, but the tour leader was knowledgeable and clearly interested in teaching us what she knew, including about how to savor the three premium wines. Don't do this if you already are an expert. The spiel is pitched to the uninitiated. Another tip -- the guide admitted that the wines on offer in the gift shop were priced at above wine store levels.\nShow less"], ["Reviewed December 24, 2016", 5.0, "Twilight tour with Lindsey", "We went on the twilight tour at 5pm on the off season. It was great with Lindsey who let us chat awhile with our cheese and bread tasting. She even took our picture in the cellar. Very knowledgeable as well. It is $55. It is best to call about reservations for the tour. Fantastic views and scenery at the winery.\nShow less"], ["Reviewed December 22, 2016", 4.0, "Great Views and history", "Drove to Wine Country on a Sunday with the hubby and Robert Mondavi Winery was one of our last stops. We made it just in time to catch the 1pm select tour. Our tour guide was very knowledgeable and had a dry sense of humor which made the tour some what entertaining. We were given a brief history of Robert Mondavi and the area and the significance of what his presence meant to the area. Took a tour of the fermentation area and watched a brief video of that process, walked around and saw the barrels of wine located in several locations within the grounds. After that we ended up in a wine tasting room where we were given a small mushroom filled with cheese appetizer to pair with one of the 3 wines in which we were tasting. After the tasting we ended up by the gift shop to conclude the tour. It was nice to see the various areas of the grounds with the option of going to the tasting room if you did not want to do the guided tour. I would recommend this winery and the guided tour and based on your preference you may want to just sit in the tasting room and open patio as another option.\nShow less"], ["Reviewed December 12, 2016", 2.0, "Better vineyards elsewhere", "Go elsewhere before shelling out money to taste the wines here. Reminded me of the Lindemans winery in the Hunter Valley NSW Australia. Money first, wine second. Found it hard to beleive that this winery has top billing. Dissapointed."], ["Reviewed December 9, 2016", 5.0, "Take the full tour!", "Was a GORGEOUS winery! We took the full 1.5hr tour, which was $35pp and it included a 1hr tour with the process of winemaking, and then a half hour tasting of 4 wines and 1 cheddar crisp.\n\nInitially we wanted to take the short tour, but that wasn't being offered at the time we showed up (something they should advertise), so we hesitated, but took the long tour. It was great! And after learning about the history of Robert Mondavi, I was even more impressed! The grounds are massive and our tour guide was exceptionally knowledgable. The wines were yummy too!\n\nIt was cold and rainy out, but our tour guide still made the tour fun.\nHighly recommend.\nShow less"], ["Reviewed December 1, 2016", 4.0, "Nice wine", "Great views of the vineyards and lovely wines. One of the better known vineyards in California. Well worth a visit."], ["Reviewed November 30, 2016", 4.0, "Beautiful grounds- worth seeing", "We enjoyed the tour and grounds- Mondavi wines are great and well known. Pricey for tastings and tours but still didn't worth it. Great time of year to go and nice staff-"], ["Reviewed November 30, 2016", 4.0, "Unexpected private tour", "No one else signed up for the tour that my husband and I pre-booked, so we had the run of the winery to ourselves. The scale of it is truly immense, and the grounds are gorgeous. I'm glad we had recommendations to come here, because I may have otherwise overlooked Robert Mondavi as a too-well-known/commercialized place to visit.\nShow less"], ["Reviewed November 30, 2016", 4.0, "Lovely Grounds", "The views, the scenes, the grounds, the wine all awesome! We didn't do a tour or tasting (this was our 2nd winery & we didn't feel the need for another tour & tasting). We just ordered a few glasses of wine & enjoyed the views. The staff @ the bar area... just ok. They didn't make us feel welcome at all. There were a few other people there & the staff was occupied with them. Maybe since we didn't do a tasting or tour we didn't get the same service as them??? Not sure, but if it wasn't for the wine & scenery we would have left. We were totally ignored for about 10 minutes. It would have been longer but we got their attention & asked if we could order.\nShow less"], ["Reviewed November 29, 2016", 5.0, "Amazing!!", "Huge Vineyard! Beautiful! We were 3 people and really enjoyed the tour and the wine tastings. Worth the hype and cost!"], ["Reviewed November 28, 2016", 5.0, "Beautiful Winery Tour", "This is a huge winery! They had a really nice tour with a wine tasting and separate wine tastings as well you could purchase. The tour took you inside the winery as well as outside. It was very pretty with lots of good photo ops! My friends and I did wine tastings, but there was enough to look at to keep the non drinkers/ light drinkers entertained.\nShow less"], ["Reviewed November 27, 2016", 5.0, "Loved it.", "First time in Napa, and Robert Mondavi was a great place to start. Tour guide was very informed and put on a unforgettable tour and tasting. Compared to other wineries we visited, this one was SO worth the money, and it wasn't all that expensive."], ["Reviewed November 24, 2016", 5.0, "Beautiful Vineyard, Informative Tour", "Our tour guide was Helen, she did an amazing job improvising on what was a rainy day in Napa. We still got to experience the charm and beauty of the vineyard and learned new ways on how to properly taste wine! The signature tour is well worth the money. Helen was perfect!\nShow less"], ["Reviewed November 21, 2016", 4.0, "A great place to start our winery experience!", "Admittedly it was pouring the day we came, so we didn't get to enjoy what looked like a picturesque scenery, but that was hardly the winery's fault. My father and I each got a flight, and my mom got a glass of rose. The wine was good, though my one complaint is that they do only give four small pours for $20.\n\nWe came right when the winery opened, so we got a nice table to sit at and just chat. While I understand this place gets crowded later in the day, we definitely had a good experience.\nShow less"], ["Reviewed November 17, 2016", 5.0, "Lip smackin' good!", "One of nicest aspects of the larger winery operations such as Robt Mondavi is the broad offerings of many different price points. While I've enjoyed drinking many different types of wines for over 40 years, I remain a value drinker. So for those of us who aren't willing or prepared to shell out mega money for vino, I suggest a visit to this distinguished name cellar.\nMy buddy and I enjoyed the tour with a highly knowledgeable pro. But I especially enjoyed sampling some of the mid-priced reds that retail above my usually modest range of $10 to $15 per bottle. Very enjoyable sitting in the courtyard outside the tasting room sampling some of the $40- $60 bottles by the glass. Love to return!\nShow less"], ["Reviewed November 15, 2016", 5.0, "Excellent Signature tour with wine tastings", "We began our visit to Napa with a 10 o'clock wine tour with Helen. (11/4/16). She was an excellent tour guide. She presented much information on the wine-making process. You also get to see the barrel rooms. It gives you a great background of the area also. And, you end your tour with a tasting of three wines. I would highly recommend this tour.\nShow less"], ["Reviewed November 15, 2016", 1.0, "Tour was fine, Gift Shop personnel....scary bad, disrespectful, smelly & spiteful.", "Four of us took the tour, it was the typical enjoyable tour, Arlyss was our guide. No complaints. The issue was trying to buy items in the gift shop. We were told they weren't for sale and other items that were for sale they would not ship....it wasn't wine, it was their Wine Barrel Adirondack chairs. There staff was about as helpful and friendly as the DMV staff. This includes the smoke smelly manager, Jennifer. They seemed to have zero training around both customer service and the 'romance factor' of their business.\nThey have lost customers for live with this experience, it actually became comical it was so bad. Only one person, Lee, a supervisor, \"GOT IT\". I hope Lee finds an environment where she is under better leadership, as I would replace Jennifer with Lee in a heartbeat!\nChoose for your self, but when we travel we seek good energy, nice people and great experiences...Robert Mondavi's product will not be apart of our experiences ever again.\nShow less"], ["Reviewed November 12, 2016", 5.0, "Best Experience at Napa", "This was by far the best experience my wife and I had while visiting wineries in the Napa Valley. The staff was friendly and helpful and the grounds were beautiful."], ["Reviewed November 11, 2016", 5.0, "Beautiful!!!!!!!", "The property is AMAZING, the views are AMAZING, the tour is great but the tour guide could be better.. she knew about the wine industry and the history of Robert Mondavi but was not great... the wines are great and we had the opportunity to see the process of wine production, wineries and how they produce one of the best wines of California... 35 USD for a VIP tour its a great deal as the property looks and it is AMAZING!\nShow less"], ["Reviewed November 10, 2016", 5.0, "Wine tour", "Grounds are very impressive! Eric gave a fabulous tour and very informative. Highly recommend !!!!!!"], ["Reviewed November 10, 2016", 5.0, "Try their signature tour!", "We took a detailed 90 minute signature tour, that covers everything from the history of vineyards in the Oakville area, to harvest, crop rotation, fermentation, blending and ended with tasting four wines, one of which was paired with an amuse bouche. Highly recommended!"], ["Reviewed November 9, 2016", 5.0, "Amazing tour", "Before I visited the winery I thought this is just a neighborhood wine but then I learned the history and the passion about Robert Mondavi. It's just simply amazing. The tour guide Rosa from Bolivia showed us the great hospitality and her tremendous amount of passion in wine. Definitely it's an awesome experience.\nShow less"], ["Reviewed November 9, 2016", 5.0, "Best Experience All Day!", "My wife and I visited here on a group tour as the first stop of three on our wine tasting tour of Napa Valley. The staff and Robert Mondavi were excellent. They took the time to truly explain the process of wine making and the intricacies that go into it. They walked us through the entire process from vineyard to finished product and provided us with great varieties of wine to taste along the way. I was very impressed with how the winery has stuck to the traditional methods of making wine as opposed to most wineries that have modernized the process to expedite it and increase profit. Our tour lasted less than an hour and we browse the gift shop for a bit longer but you could easily spend longer here if you chose too. The tour is not appropriate for children and they would be very bored anyway. If you visit one winery, make it this one, you won't be disappointed!\nShow less"], ["Reviewed November 8, 2016", 5.0, "Favorite Winery", "We are definitely not the typical tour group. But the guides did great and we enjoyed ourselves. We had our 3 young kids (all under 5) with us and neither my wife or I drink. We mainly wanted to tour the vineyard and processing operations. The tour guide took our strange requests very well and we enjoyed ourselves. This is a beautiful place.\nShow less"], ["Reviewed November 3, 2016", 4.0, "Good group tour", "Your first trip to Napa isn't complete without seeing where it all began. Robert Mondavi has such beautiful grounds and buildings; it was a beautiful visit. The tour and tasting is done in a big group with strangers which was fine, but not ideal. You get to see a lot about the production and bottling of the wine, which many wineries don't offer. It's definitely a larger scale operation which is fun to see. Our guide Channing was just delightful! You can walk from Cakebread and Opus One!\nShow less"], ["Reviewed November 2, 2016", 5.0, "Great introduction to Napa", "I didn't know much about wine tasting Napa.\nOur guide showed us the vineyards, how and where some of the wine is made, and then how to drink it. Very well done.\nThey have a nice tasting area and gift shop also.\nGreat place to start your visit to Napa.\nShow less"], ["Reviewed November 2, 2016", 4.0, "Great tour", "The tour takes you all through the vineyard and inside. It's a very beautiful property. The tour was very informational. I was glad we did it."], ["Reviewed October 31, 2016", 4.0, "Wine Basics Class", "Chose this wine tasting class as a 'refresher course' and as an alternative to tours. There were only four of us, so it was a nice, intimate group at a long table in a dining room atmosphere. Channing was a delightful, experienced teacher. Would recommend to those who are more beginner wine drinkers, but anyone will learn something new if they have Channing as their guide.\nShow less"], ["Reviewed October 31, 2016", 4.0, "wine tasting", "excellent wines!! very friendly and knowledgable staff. they even suggested places for us to eat dinner."], ["Reviewed October 30, 2016", 5.0, "Great beginner class!", "At this winery they have a beginner/basic class. Being new to drinking wine I really enjoyed this tour Doug was fantastic! After class we did the wine tasting tour. The tour was great but much of the same info so I would advise to do one or the other but not both. The wine was terrific, the grounds were beautiful and staff super friendly. Enjoy!\nShow less"], ["Reviewed October 29, 2016", 3.0, "Beautiful fields/large winery", "The Robert Mondavi Winery was our last winery. We chose it because Robert Mondavi was instrumental in preserving and promoting Napa Valley. We went on the cheapest tour and tasting they offered for $20. We got a 30 minute tour and explanation of wine making and tasted 2 Mondavi wines. Once you have gone on a wine making tour you know how wine is made. They all make it the same way. Mondavi just makes it on a larger scale. The tour was less intimate and informative than our earlier boutique wineries. Mondavi is more like a large chain store compared to the boutique shopping experience. They offer a wine club and reserve wines that they do not sell in stores. This is one of a handful of wineries that you might be able to go home and actually buy something with this winery's name on it in a retail outlet. But the retail wines are not the same as the wines you can buy at the winery or in their club. This would not be my top recommendation for a trip to Napa, but it depends on why you are stopping there. I did buy a really nice cookbook there. The gift shop is very nice. As a large winery, I would check out some of their more elaborate food and wine tastings the next time I go to Napa. I bet they do some very special events because of their size.\nShow less"], ["Reviewed October 25, 2016", 4.0, "Nice Tour", "We took the signature tour. The tour guide we had was very knowledgeable and we learned about the family and the winery. The grounds were very well kept. We went inside where you they make some of the wine and saw some of the huge barrels they use to make their more high end wines. It was interesting to learn most of their wine is not done in the wooden barrels, they also use stainless steel containers to make the wine. We tasted 3 wines and they gave us a 1 very small empanada. Overall it was a good experience.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Beautiful Winery", "We visit this winery every time we go to Napa and it never disappoint us. We did the Discovery tour for $20/person for 20 minutes with 2 wine samples. We went inside the winery and the guide explained the process of wine making. 20 minutes is enough for the tour. Our guide was very friendly and knowledgeable. We visited the winery on my daughter's birthday. When they asked for my daughter's ID, my daughter told then that her backpack was stolen including her IDs and the only thing that was with her was a credit card and a picture of her driver's license. They just interviewed her to verify her age.We all sang her happy birthday during the tour and even gave her bottle of wine.as a gift. We had a good time. I would recommend visiting this winery.\nShow less"], ["Reviewed October 24, 2016", 5.0, "Wow! Beautiful!", "Took a nice 1/2 hour tour of the property...so breathtaking! Sums up the Napa Valley, it's history and beauty. Nice gift shop. Bought the Robert Mondavi biography there..great read. Go!"], ["Reviewed October 23, 2016", 3.0, "Great wine but...", "Not much personality. The lady that poured our tastings just poured and told us we could go sit outside. So we did and it was a beautiful day. This was our 7th winery on a three day trip and we didn't need any coddling, but if it had been our first one, it would have been a huge disappointment. All four wines we tried were delicious but we didn't buy any there, so overall... their loss!\nShow less"], ["Reviewed October 19, 2016", 5.0, "Wonderful winery", "With apologies to George Carlin.\n\nHad visited RM Winery a couple of times before, so was skeptical when my friends wanted to stop by here. However, one friend had \"connections\" there and had arranged a very pleasant guided tour of the winery and To Kalin vineyards.\n\nImpressive.\n\nThen enjoyed a small \"library\" tasting, which put us all into a pleasant frame of mind. Sampled the 2011, 2012, and 2013 Reserves. My favorite was the 2012; least favorite was the 2011 (slight vegetal overtone). 2013 also good, but still a bit young.\n\nOne of my buddies from Japan bought a 6-pack of the 2012 Reserve, to take back. It was his first visit to Napa. He told me that the price at his favorite restaurant in Tokyo would be 5 times higher. Ouch!\nShow less"], ["Reviewed October 18, 2016", 4.0, "Big Time Vineyard", "This tasting room is not the place to dwell over tannins or terroir. But it is a place to taste some of the vineyards higher end offerings.\nThe vineyard itself is huge, as one might expect from a large volume producer like RM, with a U-shaped, white visitor center just past their roadside vineyards.\nThe room itself is quite large but we were a bit mystified why there were only a couple of chairs to sit in to enjoy the wines. They did have a beautiful seating area outside but on the day of our visit the temperature was at or near 100 degrees, not exactly an atmosphere for tasting full-bodied red wine. We sat on a window ledge to taste our flight, composed of a Merlot, a Pinot Noir and some very good Cabernets. Our visit was before lunch and we were glad we came early. As we were leaving, we saw a number of guided tours coming off their tour buses.\nThis is not an intimate family vineyard tasting, but what they offer is very good.\nShow less"], ["Reviewed October 17, 2016", 4.0, "Sets the standard!", "You really should make a stop at Robert Mondavi - the place is beautiful, staff is friendly and knowledgeable and the higher end wines are stunning."], ["Reviewed October 17, 2016", 5.0, "Very interesting tour", "We did the signature tasting tour which was great. Our host was funny and very knowledgable (I believe her name was Susan), and it was very interesting to learn about the history of Napa, the winery, the Mondavi family, and of course the wine itself! Lovely tasting at the end of the tour. Great start to the day.\nShow less"], ["Reviewed October 15, 2016", 5.0, "Winery tour", "We joined an excellent wine tasting tour where we learnt how this lovely couple (mr and Mrs. Mondavi）started and developed this land! We also had three glasses of awesome wines to taste at the end! and we bought the Oakville Sauvignon home from this lovely place :) great trip for honey moon !\nShow less"], ["Reviewed October 13, 2016", 4.0, "Pleasantly surprised", "Me and my husband celebrated our 16th wedding anniversary here and was pleasantly surprised. The romantically beautiful setting of the Napa valley hills drew us in and the amazing high end tasting is was an unexpected treat. We had the privilege of having Eric guide us through the grounds and educate us on the history of the legendary Mondavi family estate. We did the garden tour which included five different t pairings and a personal chef. It was absolutely Devine. LOVED it!\nShow less"], ["Reviewed October 12, 2016", 5.0, "Like this place", "It is broad when you first see it, it gives you a comfort feeling that you will like it. Many different wines and It was nice joining the tour and the guy gave us a amazing tour guide and also introduce us to the manager when we ask about the wine business.\nShow less"]]}}