{"Rodeo Drive": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Rodeo Drive", "url": "/Attraction_Review-g32070-d116580-Reviews-Rodeo_Drive-Beverly_Hills_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/10/55/3b/79/rodeo-drive.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "4443"}, "address": {"@type": "PostalAddress", "streetAddress": "Santa Monica Blvd at Wilshire Blvd", "addressLocality": "Beverly Hills", "addressRegion": "California", "postalCode": "90210", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Very Posh", "A place only for the very rich. You will lot of big branded/designer shops. Don't be surprised if you see posh cars and even celebrities."], ["Reviewed 3 days ago", 3.0, "I can now check Rodeo Drive off my list.", "The last time I visited Beverly Hills for work I didn’t make it to Rodeo Drive and felt obliged to do it when I returned again. Well I did and now I can cross that off my list. It’s neat and the architecture of the buildings is cool and artsy but considering I can’t afford to shop at any of the stores it just didn’t do much for me. I don’t feel any desire to go back and see it again. It’s just a street with fancy stores. It was a bit of a downer actually! But I’m glad to have done it now.\nShow less"], ["Reviewed 5 days ago", 5.0, "Must see", "We brought the kids and are glad we did!\nOpulence and over the top would be a good way to describe.\nWe walked the entire drive looking at the shops and taking in the well dressed people and admired the cars littered along the street and driving by!\nGo and see for yourself how the ‘other half’ lives - was fun and eye opening.\nShow less"], ["Reviewed 6 days ago", 3.0, "shopping", "its ok better shopping in London guess more of a tourist place to visit rather than shop many top designer shops here some good restaurants and coffee shops parking available near by and very short walk away is free"], ["Reviewed 1 week ago", 4.0, "It's Rodeo Drive!", "We had a walk around Rodeo Drive, to say we'd 'done it'.... it's all blase, hype...and people renting fast cars to drive round in for the afternoon. Absolutely loved the whole ambiance, but did find it so false! My husband remarked that he'd seen the same woman four times (there is a certain 'look' on Rodeo!!) Anyway, go for a schmooze, treat it for what it is....it's a name of a couple of roads, with expensive shops, it's cool and fun to people watch! By the way, RD you are severely lacking in Vegan restaurants, it's the next big thing.... so get with the programme.\nShow less"], ["Reviewed 1 week ago", 4.0, "Iconic Place of course!", "This iconic shopping venue was super crowded during the President's Day weekend. Gorgeous shops and helpful shopkeepers."], ["Reviewed 1 week ago", 5.0, "Fun stroll down Rodeo Drive", "Don't plan on doing much shopping, but it is always fun to window shop and take a look! The storekeepers were surprisingly helpful and polite, especially in Luis Vuitton and Saint Laurent."], ["Reviewed 1 week ago", 3.0, "Visit", "We just take a walk in Rodeo Drive just to see the famous signature store that only Rich people can afford.. and its true..! We also see some Hollywood star walking around the area plus the added attraction mountain police who rides in a big horses. Great experience!\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting", "Mix of tourists and rich looking people. Lots of amazing cars driving down rodeo so if you're into that have a seat and take in the beauty. The people watching is interesting also. We didn't see any celebs as others indicated but that's ok. It was a weird view into how the absurdly rich shop!!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun drive down Rodeo", "We took the opportunity to drive up and down Rodeo drive a few times just for fun. We did not get out and walk around, but had fun looking at all the stores, cars and people from the car."], ["Reviewed 2 weeks ago", 5.0, "Glamorous for what it is", "You come to Rodeo drive just to gently touch and hardly feel the glamour, fame and richness. If your not some high end celebrity or billionaire don’t come expecting anything else. It’s a genuinely beautiful street. The shops look fabulous and the atmosphere is electrifying. So fun to stroll around, “window shop” and enjoy it all for a while. There is no proper visit to LA without it!\nShow less"], ["Reviewed 2 weeks ago", 3.0, "No Big Deal", "A bunch of high end stores that you can not enter. Ten minutes to walk up and down and window shop? Time better spent else where"], ["Reviewed 2 weeks ago", 4.0, "Envious", "Great place to walk and window shop. The prices are through the roof. Only a lucky and select group of people could actually afford to pay for anything here, certainly not us!! Never saw any famous people."], ["Reviewed 2 weeks ago", 3.0, "Okay if you are rich.", "We walked Rodeo Drive for the experience. Lovely, clean streets, many very expensive parked cars and designer clothes displayed in the windows, There are no prices on the clothes, so unable to guess how much. Okay for the experience but over rated and to me no different than being in Harrodsburg or walking down Regents Street. These designer shops can also be found in Dubai.\n\nGood for the experience and people watching. Most shops had tables and chairs where you can sit. I wondered whether these were for customers.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent expensive experience", "It was great just to drive down this famous street, surrounded by BMW, Jaguars, Lexus, corvettes, & to window shop, at the fine things, to purchase!!"], ["Reviewed 3 weeks ago", 5.0, "Just for Your Eyes", "It is incredible how this place is kind of an island of exuberance in the middle of a normal town. The parade of ferraris, rolls royces, jaguars and bentleys is incredible. The stores are for your eyes only (at least for me)."], ["Reviewed 3 weeks ago", 5.0, "Ritzy part of Beverly Hills", "If you are coming to the Los Angeles area, you have to go to Rodeo Drive in Beverly Hills. Plenty of parking and it's best to walk around the streets. Very nice, but expensive shops to choose from and plenty of places to eat. Fun place to go for a few hours of sight seeing.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Browse or shop if you dare!", "Better on a weekend if you just want the experience-better on a week day if you plan to shop.\n\nDefinitely an experience if you’ve never been. Will probably take a couple of days to see it all well.\n\nLots of restaurants too. Do your research. Price ranges all over the place from what the employees around there can afford to... well...just about anything. All of it is good.\n\nThere are City parking lots that offer a couple of hours free. If you park on the street make sure you keep an eye on the time for the meter.\n\nWhatever you do, you’ll have a good time and make memories!\n\nEnjoy!\n\n\n\nShow less"], ["Reviewed 3 weeks ago", 3.0, "It does what it says on the tin.", "Very very expensive. Lots if shoppers but very few shopping bags!!!!Certainly a must see if only on a tour bus to say you have been there. Clearly the place is immaculate and very up market. You can get low cost parking on the parallel street a couple of hours for 5 dollars which is more than enough time if your in your own car.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Iconic always", "We felt like movie stars out of a movie while we window shopped down this famous stretch of pristine beauty in the heart of Beverly Hills. The weather was perfect, the company was perfect, and it was an early Sunday morning stroll to get breakfast. It will always remind my of Julia Roberts in Pretty Woman. This is where dreams come true on Rodeo Drive.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "It's LA LA land", "Money money and money, Ferrari, Rolls Royce, Lamborghini. Gold, Diamonds at nose bleed prices...but it's Rodeo Drive. Don't expect to run into Clooney or Angelina...its just folks with tons of wealth and tons of tourist gauking"], ["Reviewed 3 weeks ago", 3.0, "High end stores on a beautiful street", "All the designer stores you can think of but prices are higher then you can find elsewhere. The stores are just a beautiful that you will find in Rome or any other major city. The service is excellent in the stores and everyone is very helpful. I was disappointed pointed though when I saw the prices. Purses were about $500.00 more than yiu can find in Rome even with the conversion of the dollar to the Euro.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing", "We had to walk Rodeo Drive in LA. Some of the shops we stepped into were very welcoming , such as COACH, which also offered products which aren't available elsewhere. They also have an on site area for customizing, which was a pleasant surprise. The stores are very luxurious, yet the sales people in most were not friendly or helpful. Reminded me of \"Pretty Woman\"\nShow less"], ["Reviewed 3 weeks ago", 3.0, "A cliche", "This place is exactly what you think it is from all the years you have seen on television. It is basically a place for rich people to show off and spend their money and make poor people like the rest of us feel small."], ["Reviewed 3 weeks ago", 4.0, "Worth a walk", "Beautiful shops, imaginative windows filled with gorgeous clothes or accessories, and perfect weather made strolling this area a worthwhile stop. Especially if “Pretty Woman” is one of your favorite movies. Julia Roberts was nowhere to be seen though. All the luxury brands were front and center. Cartier, Dolce and Gabanna, Gucci, Celine, Louis Vuitton, etc. Loved it!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing experience", "We took in the Drive as a part of a day tour, and it is something that is a \"must do\" if you are in the area - and want to see how the rich and famous do it!"], ["Reviewed 4 weeks ago", 4.0, "Hi END Luxury", "Hi END Luxury shopping attractions where you can explore and experience branded and designer stuff and shop if your pocket allows. Otherwise must visit place for window shopping."], ["Reviewed 4 weeks ago", 4.0, "Loved it!", "We arrived in Beverly Hills around 5pm on a Sunday, bad choice as we were told everything closes at 6pm. Totally forgot it was a Sunday since we were on vacation. It was pretty lit up at night though. Parking was steep $24; ouch but that's Beverly Hills!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Best shopping", "Loved Rodeo drive. All the top designers have their stores on this road. Loved strolling on this road after dinner as they stay open until quite late"], ["Reviewed 4 weeks ago", 3.0, "Hmm", "Worth a visit for curiosity sake. Even the fire hydrants are highly polished chrome. I suppose the wealthy need somewhere to shop, this serves it’s purpose."], ["Reviewed 4 weeks ago", 3.0, "I Was Expecting More", "I was disappointed when I saw Rodeo Drive, we were on a LA City Tour and yes it has all the high end stores, but not much different to other ritzy areas I have been to, saw a couple of nice cars, the tour guide pointed out the store that Julia Roberts (Pretty Woman) went too, no Hollywood Stars, actually there was not much happening at all maybe I was expecting to much.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Loved the area, the shops and the people", "Really enjoyed out time shopping, the people are all wonderful and helpful. I went in jeans and t-shirt and never felt like I was being looked down too or judged."], ["Reviewed 4 weeks ago", 3.0, "fancy but empty on saturday night !?", "we went there on a Saturday night at 9:00 PM and guess what, it was a ghost town, i was really shocked, as i was expecting this to be one of the busiest streets in LA area after the walk of fame of course.\ni am still giving it a 3 stars, because it might be my mistake going there late, and probably i should have gone earlier, all the high end brands are opened there, and you will be easily able to spot those fancy cars parked on the side of the streets, but for sure you have to go there, and hopefully\nShow less"], ["Reviewed 4 weeks ago", 5.0, "vacation", "amazing stores, our first visit to La and the views and luxury homes were awesome. my family did a tour and took pictures for our memory book."], ["Reviewed January 25, 2018", 4.0, "Rodeo drive", "Once is Hollywood you surely want to visit the fashion district of the world .. were all celebrities live (near by) and shop... u have the best luxury brand stores and can spend good time and lose some weight of pocket ... make u feel ur in Hollywood\nShow less"], ["Reviewed January 22, 2018", 5.0, "bring a lot money", "all the top designer and fashion houses can be found, excelling dining and people watching if you like that sort of thing"], ["Reviewed January 21, 2018", 5.0, "A great place to shop and or dine", "Beautifully maintained. Wonderful place to walk, dine and shop. The shop keepers are so welcoming . Truly enjoy this place"], ["Reviewed January 21, 2018", 4.0, "Rodeo Drive cruising", "Rodeo Drive made me dizzy looking from one side to the other as we cruised through. Businesses, houses ... something to see when in CA."], ["Reviewed January 21, 2018", 5.0, "Go to place to empty your bank account", "Wanted to go see what designers are doing & how much I wasn’t following the fashion scene. Amazing & found a killer Michael Kors jacket I have been wanted for some time now"], ["Reviewed January 21, 2018", 4.0, "Great Place to Go", "Needless to say, the most famous few shopping blocks in the world. Every designer that is a designer is on this street. It is fun to walk and shop if you have the money and keep an eye out for celebrities - they are the ones we baseball hats and dark glasses on.\nShow less"], ["Reviewed January 21, 2018", 1.0, "The foulest place on earth", "I hated every minute of being on Rodeo Drive. It houses a collection of decadence which attracts the most vulgar human beings to the worship of money and wealth. Talking my son, who admittedly was wooed by the experience, out of buying a $2000 bag was my greatest achievement here. I hope I never see this place again.\nShow less"], ["Reviewed January 19, 2018", 5.0, "A must!", "When in LA you must visit, shop and drive on Rodeo Dr. We shopped & shopped before heading back to our hotel. This is the only street to have chandeliers as street lighting! Take your credit cards."], ["Reviewed January 17, 2018", 4.0, "Stop if you are in the area", "Lots of neat shops to see. We stopped and had a glass of wine. We didn't dress for the occasion but didn't feel out of place."], ["Reviewed January 15, 2018", 5.0, "Wow!", "Lived up to my expectations for extreme luxury! I highly recommend walking here and visiting the shops."], ["Reviewed January 14, 2018", 3.0, "Fancy street, a bit quiet", "On a sunny day it is not a bore to walk around here. The shops have good design clothing and such. Some cars are fun to see. It was a bit quiet; perhaps everybody shops online nowadays. Fun for an hour on a sunny say."], ["Reviewed January 12, 2018", 5.0, "Wonderful passagatta", "Great shops. Fun afternoon. You can find anything you ever could want or wish on one street. Have been out here since the 70’s and it is always a great. Great shops, restaurants, hotels, even a local television museum. Get out and enjoy life. It’s too short! Do yourself a favor dress up and enjoy!!\nShow less"], ["Reviewed January 12, 2018", 3.0, "A temple to consumerism", "My view of our time on Rodeo Drive would differ widely from my teenage boys. Other than a fine procession of expensive cars (alternating with gawking tourists in chevys) I saw little to recommend this site. My sons were sure to take their picture in front of Gucci to send to their friends but for the most part it feels vacuous and fake.\nShow less"], ["Reviewed January 11, 2018", 3.0, "Boring actually", "Drove down looked around in the windows because you could tell the shops are only frequented by the very rich. You don’t try on the clothes, they are tried on for you. Lol. I didn’t see one single famous person but did see black SUVs with mega tinted windows with drivers standing outside the vehicle seemingly waiting for their passenger so I assume it’s a rich person shopping. You should at least drive down to say you’ve been....\nShow less"], ["Reviewed January 11, 2018", 5.0, "Beautiful street, must see", "The most beautiful street in LA. Best shops, you can see the hotel from Pretty women movie, lovely restaurants. Look for 2 hours free parking."], ["Reviewed January 10, 2018", 3.0, "More about the name than anything else.Lots of window shopping.", "Rodeo Drive lives up to its name in being a money area & you will find all the obvious high end stores and high end designers.There isn't actually loads to see here as its more about the area than the shops.Good to take stroll around but you only need to do it once.\nShow less"], ["Reviewed January 9, 2018", 5.0, "The best luxury fashion street in the world", "I work in fashion and i’ve been everywhere from Paris London Milano but i would say Rodeo drive is the best for me where you can feel the real luxury around and beauty of the street and surrounding you should definitely visit if you’re around if you wanna feel in a fancy Hollywood movie...\nShow less"], ["Reviewed January 8, 2018", 5.0, "Plenty of high end shopping in one area! Great place to see a famous person!", "We like cruising up and down Rodeo Drive. Great place to shop for your loved ones. Located near restaurants and food vendors. There is definitely a little of something for everyone. Consider this to be a small version of Hollywood. The shopping can overwhelm you if the people and cars don’t. We were in the area during Christmas so it was packed for the holidays. It is a very famous spot and a must see travel destination for any and all who come to LA! Great place with amazing items to buy.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Great experience", "Posh shops but even if yoy not planning to shop still what to see and where to take pictures. Sprinkles atm worth try when you visit Rodeo drive."], ["Reviewed January 7, 2018", 3.0, "Dollar dollar bills y’all", "Really expensive stores in the most ritzy of streets I have ever been down! Couldn’t afford to eat anywhere near here but glad I went to see what the hype was about"], ["Reviewed January 6, 2018", 4.0, "Great shops", "We liked the variety of shops and the atmosphere on Rodeo drive. Some great restaurants and places to sit and look for celebrities."], ["Reviewed January 5, 2018", 5.0, "Fun, But Expensive Shopping", "While with a group on a tour of LA several summers ago, we went to Rodeo Drive for an afternoon of strolling around & shopping. It was fun to go into several of the very upscale & classy shops & compare those stores to NY's 5th Ave stores. My wife bought a nice outfit & I got a couple of shirts & a very expensive tie. They even shipped the items back home to NY. Now I have shopped in the very best of 5th Ave. N.Y. & Rodeo Drive.\nI also enjoyed walking around the lobby of the Beverly Wilshire Hotel \"a.k.a. \"The Pretty Woman Hotel\" which is the location of some scenes from Julia Roberts & Richard Gere's movie.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Amazing shops but bring your credit cards!", "Obviously this is the famous street from pretty women and I would say it's defiantly worth a stroll down whilst in Beverly Hills even if you aren't shopping but if you are make sure you bring all credit cards as it's all quite pricey! There's lots of lovely coffee shops and small restaurants to eat in that are fairly priced! Parking is also very easy.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Exactly what you expect!", "Rodeo drive is gorgeous, exactly how you imagine! Perfect for shopping, window shopping, people watching etc. grab a seat outside at the four seasons for lunch and take in the sight."], ["Reviewed January 4, 2018", 1.0, "I must be missing something????", "How can this be a tourist destination?? A few blocks of overly priced stores!! We drove up and down it then got out and walked around, we looked at each other and shrugged our shoulders. Got back in the car and drove away. So why not go to a high priced mall?? That way at least you can get something to eat? But maybe I missed something.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Interesting", "Beverly Hills is a must when in LA. It adds perspective to our world, where a cotton T-shirt is worth $380 🤑. Historical and beautiful architecture!"], ["Reviewed January 4, 2018", 5.0, "Super exotic", "A lot of shops around, super cool place! Road has a lot of famous stores, bijon store too! Want to go back again! I love it!!"], ["Reviewed January 4, 2018", 5.0, "Shopping!", "What can I say Rodeo drive one of the most exclusive shopping places on earth amazing shops and a lot bettter value than you might think."], ["Reviewed January 3, 2018", 3.0, "Outside Mall", "It is an iconic street, so it is worth a visit just for that reason. Otherwise the stores are no different than the ones I find in my local mall."], ["Reviewed January 3, 2018", 3.0, "Nice walking", "Rodeo drive is a street packed with expensive stores. Very fancy. Good to take a look around and maybe take some photos. Nothing special about it at all."], ["Reviewed January 2, 2018", 3.0, "Not What It Was But Still Fun", "This street has changed a lot. Saks et al opening in the Middle East, stymied the flow of Arab princes and princesses coming to visit. 9/11 was the beginning of the end of the Russian Mafia coming to launder cash and the internet has changed shopping habits. That said it's still fun people watching, you still have the Gucci store, Harry Winston, Cartier, Tiffany, Lalique, Brooks Brothers, Bijan and various other tony boutiques. You'll still see a Bugatti or get yourself a very expensive new haircut at Fekkai's. Eating is good in this area but maybe one street over either side. You'll still see wannabee actresses in too tight dresses and heels they can't walk on trying to be \"seen\". Have fun, take photos, dream a little and remember the sale items will be at the back of the stores.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Another world", "See and be seen. Shop til you drop. All pertain to Rodeo Drive. We stayed at The Luxe Hotel, a boutique hotel right on Rodeo Drive. Walk out the front door and the glitz and excitement awaits you."], ["Reviewed December 30, 2017", 4.0, "Classic holiday lights", "Even if you live in/around LA, you are still going to head past here a couple times during the holidays to see the lights. The city of BH makes this their crown jewel and the holidays are no exception."], ["Reviewed December 30, 2017", 4.0, "A classic one", "Last time I was here was 15 years ago, place haven’t aged a bit and is still a classic to hang out in Beverly Hills"], ["Reviewed December 27, 2017", 3.0, "Meh", "It's a well lit up place with lot of big brands like chennel , Gucci etc . This is whole street with shops and lightings . Good place to take a drive after a Beverly hills tour"], ["Reviewed December 27, 2017", 5.0, "Comfortable luxury shopping", "The high end shops are all there, on a few walkable blocks. Like other US cities, Beverly Hills has seasonal sales, so don't be deterred by the seemingly posh location. Service is helpful and friendly."], ["Reviewed December 27, 2017", 5.0, "Awesome", "All famous brands are available here, the shops were decorated very elegantly. Their offered hotel delivery service, which was fantastic, it gives you time to do more shopping."], ["Reviewed December 24, 2017", 4.0, "Come see the Rich & Famous", "The well-known shopping area is where the rich and famous buy their stuff. Most of the prices are outragous but most of those who shop here don't usually care."], ["Reviewed December 23, 2017", 5.0, "Family and friends trip", "This road lives up to expectations. To add to the experience lots of locals drive up and down showing off their flash (and not as flash as they think) cars. Beverly Hills is a parallel universe to normal places."], ["Reviewed December 22, 2017", 5.0, "So classy", "We had a nice time strolling the streets that were so beautifully decorated and cared for and pretending we belonged here. This definitely a must see"], ["Reviewed December 21, 2017", 5.0, "Holiday Lights", "So Stunning! Beautifully decorated store windows and the crystal chandeliers are just spectacular. Easy to walk or drive in the evening hours when there is less traffic."], ["Reviewed December 21, 2017", 3.0, "Rodeo Clowns", "Extremely strange place with strange people, we even encountered a man who in all seriousness encouraged his poodle with the words 'Come on boy, you can do it'"], ["Reviewed December 20, 2017", 3.0, "The top end of shopping", "Heaps of designers and world renowned brands. $$$$$$!!! If your ready to spend your hard earned and let the shop staff know. Your in for a very unique shopping experience."], ["Reviewed December 19, 2017", 5.0, "Fantastic shopping experience.", "Rodeo derive is a fantastic shopping experience, with many high end brands available. If you are on a budget there is also a large shopping centre 10 mins drive away."], ["Reviewed December 19, 2017", 4.0, "Rodeo Drive baby!", "Walked up and down. Didn't see anyone famous. Felt we had to go as we were in LA. There more Security personnel in the stores than shoppers. The Christmas lights were pretty."], ["Reviewed December 16, 2017", 5.0, "Loved it!", "Was fun walking up and down Rodeo Drive. Was just how we imagined it and better. Great people watching and loved looking at the Christmas lights at night."], ["Reviewed December 15, 2017", 5.0, "Get out of the mall, sign off the web - Rodeo Drive is worth an evening stroll this holiday", "The current mayor of Beverly Hills is spearheading an effort to bring Rodeo Drive to a new level of glamour and holiday spirit. The drive has never looked as beautiful at night as it does now and the stores are even open late. I make a point of talking a regular walk on Rodeo a few nights per week. I never get tired of the looking at the decorations, listening to the music and peeking into the store windows. It's a great excuse to get some fresh air and experience shopping outside a mall or theme park. And the best thing as far as I'm concerned is the price - free.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Money, money money it must be funny😀", "And that’s exactly what it is around this place. Name a high end brand and it will be here. Busy any buzzing place. Again another place when in LA to visit😀"], ["Reviewed December 14, 2017", 5.0, "Grewt window shopping.", "The Christmas decorations are beautiful. The window displays are fabulous this time of year. So much luxury to choose from."], ["Reviewed December 11, 2017", 3.0, "My First trip to rodeo drive...", "A lot of flagship stores. Fun to window shop. I was expecting something more unique & interesting...."], ["Reviewed December 11, 2017", 5.0, "Vacation", "Someone took me down Rodeo drive on Dec 7 I had a great time it was beautiful on in Christmas lights!! Next i will go shopping!!!"], ["Reviewed December 10, 2017", 4.0, "Too cute for words!", "Rodeo Drive is all the cliche and more that one would expect from seeing it on TV. It is exactly what you see... couture stores, shops of well-known American designers and high-end boutiques. And of course, it wouldn’t be “Rodeo Drive” without seeing high-performance sports cars and luxury vehicles cruising around, which we did. The chandelier light posts are pretentious (totally the point) but absolutely adorable! It was a cool experience to shop and purchase items from retailers on this iconic stretch of road.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Great Christmas Cheer", "It's always fun to visit some of the most famous stores in the world. The window displays are the real attraction. First class and we'll done. If you want a fun night out and simple, park and walk those three blocks"], ["Reviewed December 6, 2017", 4.0, "Great visit", "Loved seeing Rodeo Drive! Have seen it in the movies and stuff but was really cool to see in person!"], ["Reviewed December 6, 2017", 4.0, "A place for shoppers with lots of money in credit card", "An upmarket shopping destination with people flashing costly outfits and classy cars. Good picture opps too."], ["Reviewed December 6, 2017", 4.0, "Great area to visit and shop", "We took two of our children, which limited our ability to shop..., however, a great time was had by all and we really enjoyed moving through the area and surprisingly had very little difficulty in parking nearby!"], ["Reviewed December 3, 2017", 5.0, "Great to see!", "The Christmas decorations were beautiful and loved the music playing everywhere. There's such a positive vibe walking around and we were treated well in every store we went into."], ["Reviewed December 1, 2017", 3.0, "Madison Avenue on steroids", "Rodeo Drive is nice, high-end stores are interesting to look at even when you can't afford anything in them! However, for a former New Yorker, it's a little ho-hum - Madison Avenue in splashier."], ["Reviewed November 30, 2017", 5.0, "I Love this Street.", "This street just drips money. We had a great time dreaming about what I could buy and just enjoyed walking around the beautifully flower and tree adorned streets. We did buy a necklace from one shop just so we could say we bought something on Rodeo Drive. Don't get excited....it was $25 :)\nShow less"], ["Reviewed November 28, 2017", 5.0, "A Christmas Light Extravaganza", "As beautiful by night as it is by day, don't miss this stunning (albeit beyond expensive) little cobblestone street (Via Rodeo) and the shops lit up and decorated for Christmas. Warm and inviting to stroll along for a little romance, with or without the kiddies. Definitely worth a peek - especially lit up for the holidays.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Wow", "Rodeo Drive is like any other expensive shopping street but it is so clean and has so much charm that it's worth the visit."], ["Reviewed November 26, 2017", 4.0, "Tourists Abound, But BH is Really Pleasant & Inviting", "I'm a native of LA, and I also work in BH. I walk outside to get lunch a few days a week and constantly see just how extremely pleasant Beverly Hills is and even how pleasant crowded Rodeo Drive is. It's easy to park because there are many 1 and 2-hour free city parking lots,and there are great restaurants to enjoy. I especially like the Tory Burch store on Rodeo because it has plush velvet couches to sit in when you try on shoes and they provide bottled water and service with a smile. Plus, there is something dreamy about walking down Rodeo Drive, as if one is walking within a fantasy realm where happiness is just a purchase away and all other cares dissipate into the ether.\nShow less"], ["Reviewed November 26, 2017", 3.0, "Lavish super-upscale shops", "I was playing tour guide and my friends wanted to see Rodeo Dr. The stores are beautiful with the most pristine and beautifully made products in many cases void of price tags. In most stores we walked in we were \"watched\" but not greeted. I'm guessing we did not look like \"their\" customers. The only shop we entered where the staff was lovely and engaging was Burberry's. For this I commend them because one should never judge a book by a cover. Music was blaring from the center divide. I don't know if this is always of for the holidays.\nShow less"], ["Reviewed November 25, 2017", 4.0, "Good to look around", "Nice to wander around . You never know who you will see. The high end shops don't welcome you much if they see you are a tourist. Nice coffee shops. Highlight was going into Tiffany diamond shop and being dazzled by all the lively rings."], ["Reviewed November 25, 2017", 3.0, "Rodeo Drive Baby", "Walking down Rodeo Drive is kinda like a MUST DO when visiting LA for the very first time. I find it a bit soulless to be honest. Its full of tourists just getting photos then moving on to the next photo op. I only ever go down there if i simply have to. I do love Beverly Hills, it's such an amazing area and has so much to offer but i stick to the streets either side of Rodeo Drive. In some ways, i feel embarrassed walking down Rodeo. Each to their own.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Mind blowing", "We walked along here on a sunny Saturday afternoon - it was mind blowing. We both enjoyed the people watching, my wife did some window shopping but didn't buy anything (thankfully), I was amazed by the car watching! There was a wide variety of outstanding cars cruising past and sometimes racing from one set of lights to the next. If you're a car enthusiast, it's fascinating to watch.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Great evening walk", "My son and I walked around Rodeo drive and enjoyed window shopping and people watching. Amazing cars going up and down the street. Expensive everything, but expected. Nicely decorated for Christmas and music playing."], ["Reviewed November 23, 2017", 5.0, "Beautiful area to window shop!", "Even if you do not have the $$$ to shop here, this is a great spot to walk around and site see. It is beautiful at Christmas!"], ["Reviewed November 22, 2017", 4.0, "Luxurious Shopping", "Two mile stretch of upscale shopping in Beverly hills.All high brands. You name it, they have it. Bvlgari, Cartier, Giorgio Armani, Louis Vuitton , Gucci, Ralph Lauren are few among them.\nUsually filled with tourists. Most has no intention of buying anything. Like us many of them were hoping to spot celebrities. Better luck next time !!\nPosh cars frequently parked along the street.\nFree to visit 24 hours a day.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Lovely at night!", "As part of my recent trip to Los Angeles, I made a trip to Rodeo Drive with my husband. We were there in the evening and found parking on a side street one intersection away from the north end of Rodeo Drive. It was all lit up with twinkle lights and was a lovely sight to see. The shops were all very high end stores and although there were many people walking on the street, I didn’t notice many people actually inside the stores. We didn’t do any shopping, however it was a nice walk and lovely to see in the evening. If you are in the area, it is worth the walk for some photos and if you want to go on a designer shopping-spree, this would be the place to do it!\nShow less"], ["Reviewed November 19, 2017", 5.0, "Pretty Woman", "Pretty Woman. Walking down the street. Pretty Woman. I went to Rodeo Drive because of that movie and it did not disappoint. It’s really posh and beautiful in my opinion. You’ll see people who are dressed to the nines and people in sweats and jeans. Not everything is outrageously priced, which is good.\nShow less"], ["Reviewed November 17, 2017", 5.0, "See how the Rich people shop", "Always wanted to visit Rodeo Drive to see where the “other half” shop It was absolutely fabulous to walk up and also to see the Beverly Wiltshire where Pretty Woman was made, also there was a lot of filming going on which was great Excellent experience\nShow less"], ["Reviewed November 17, 2017", 5.0, "Girls shopping trip", "Lots of shops and great restaurants. Loved Chanel, shopping and eating at Fred's, exploring Chanel and LV"], ["Reviewed November 17, 2017", 5.0, "A Winter Holiday Favorite", "We love to spend the holidays with family in Beverly Hills. There’s nothing better than to walk Rodeo drive on a crisp, cold night. What makes Rodeo drive special is that all of the stores decorate for the holidays. The stores are beautiful. The decorations are extravagant, everything you’d expect from Beverly Hills. Wilshire Blvd is usually dressed up with holiday lights too.\n\nMany have the impression you need to spend money to visit Beverly Hills, when in fact you do not. Parking garages offer two free hours of parking before 6 pm. The stores are mostly welcoming, but there are some stores that scare you away, like Harry Winston.\n\nRodeo drive is home to some very expensive stores, billionaire clients, and pricey cars. It’s a scene worth an hour of exploration. There’s a lot to see, not only on Rodeo drive, but throughout downtown Beverly Hills. At the southern end of Rodeo drive is a mini pathway up into a courtyard. You’ll find a slew of stores like Vertu (home of the $22,000 mobile phone) and 208 Rodeo Cafe, a tourist haven! The city has tons of photo opportunities. I love to walk the famous Canon drive to see Spago.\n\nA few more blocks over and you will find Villa Blanca (Lisa Vanderpump’s restaurant; she’s a star from Housewives of Beverly Hills) and the best frozen yogurt in the world, Go Greek Yogurt, on Bedford.\n\nYou might recognize the Beverly Wilshire, located on Wilshire Blvd at Rodeo, from the movie Pretty Woman.\n\nDrop by the visitor center on Santa Monica Blvd for a photo opportunity with the Beverly Hills sign and some cool memorabilia. Have fun!\nShow less"], ["Reviewed November 17, 2017", 5.0, "Loved, Loved, Loved", "Rodeo Drive was one of favourite moments of my Beverly Hills and Hollywood trip! Beautiful shops, fantastic experience and even better weather! Pretty Woman is my favourite film so being in its surroundings was so surreal and felt like a dream come true!! Would highly recommend and will absolutely be going back!\nShow less"], ["Reviewed November 17, 2017", 4.0, "Just a drive thru", "I fingered while I was in LA I should go see this place. It does not disappoint. The ambience was excellent and they had it decorated for Christmas. Beautiful high end places."], ["Reviewed November 16, 2017", 1.0, "Drive through", "What??? It’s a bunch of upper end waste your money stores. Drive through and spend your money on a great dinner or a tour WE LOVE LA That’s a little expensive but its fun, you will have great memories and see lots of the area."], ["Reviewed November 14, 2017", 3.0, "Just walk by", "If you are not interested in buying fancy stuff, don't spare too much time there. A car drive through would be ok."], ["Reviewed November 13, 2017", 4.0, "If into Name Brands and Expensive Cars then Come here.", "Rodeo Drive is known around the world as one of the most elite shopping districts. Fast super cars and fancy bags roam the streets. Everyone has their own preference on taste and if this sounds appealing to you then I'd suggest coming here to see what it's about.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Beautiful, famous and expensive!", "Rodeo Drive is a must see if visiting Beverly Hills or Los Angeles. It really is beautiful, the store fronts are gorgeous, and of course the prices are very expensive! My family and I just enjoyed walking around in the beautiful weather, people watch and window shop!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Atmosphere personified", "Stayed at the luxe hotel , so it was right on Rodeo Drive. Just a walk along the strip lifted you to a whole new level Enjoyed all the high performance cars on display It’s worth the walk, even for a window shop experience"], ["Reviewed November 12, 2017", 5.0, "FUN TO WALK DOWN", "Had to walk down this famous drive with all the high expensive shops. Did not buy or go in any of the shops as my credit card limit on my card was not high enough lol. Fun to do and glad i walked down here."], ["Reviewed November 9, 2017", 5.0, "Love this street", "High street full of high end brands like Prada, D&G, etc and restaurants. Good if you want to splash the cash but also good for window shopping and walk around the streets... I really enjoyed this place and I'd recommend to anyone to visit at least once. Also, it is super close to Beverly Hills park which is very relaxing and nice. Don't miss it.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Peaceful", "I loved Rodeo drive, though its a small street, but they had a sweet weather in summer with the palm tress at the side of the rd. The boutiques were much more updated than the other branches in Orange County and Las Vegas. Its a nice place for Shopaholics, but not the place for people who are seeking for adventures and activities restaurants with beautiful view. Not many coffee shops like Dubai London Paris and Bangkok, mostly restaurants startbucks mini chocolatiers.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful", "I️ had a great time while visiting California,Rodeo Drive was just awesome if you visiting Cal is a must do!!!"], ["Reviewed November 9, 2017", 5.0, "Had to be done", "Always wanted to see how the other half live so this was on my to do list in LA. Obviously it is as beautiful as you'd expect. Lots of fancy cars driving around & the shops are amazing. Bit out of my price range but was good to see.\nShow less"], ["Reviewed November 7, 2017", 3.0, "Nothing special", "Rodeo Drive, what can I say. I'm not the shopping kind, but the shops are nice, but expensive, as you can expect. Beverly Hills is a nice place to wander through, but in my opinion not worth to take a long drive over. But if you like shopping and have some cash to spare, check it out.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Awesome", "Was great to see this, you can take tours but we chose just to wander. Really upmarket and a lot like in movies."], ["Reviewed November 6, 2017", 5.0, "Very nice rea - worth to see", "Not only worth to see but it's also worth to do some shopping there. I can assure you, you will have the best time there."], ["Reviewed November 5, 2017", 4.0, "All the big names", "Firstly we were surprised at how cheap the car park was! Well unexpected. All the big brands are there if you like that sort of thing and can afford it - otherwise it's just a bit depressing! Nice walk to see how the other half live though.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Upscale shopping experience in Los Angeles", "A street in Beverlly Hills Carlifonia with several designer shops...I went to hunt an shop for fashion icons but did not see any... - maybe they have personal shoppers for real. The experience was however just like the movies.. sunny, not crowded and the shop owners let you browse\nShow less"], ["Reviewed November 4, 2017", 3.0, "Spectacular at night", "Visit Rodeo Drive at night to get the full impact. The street is very quite until mid-day - where as surrounding streets are busy with office workers. In the afternood you'll get lots of sightseeing tours - but at night (after dusk) when the lights on the palms come on that's when the drive looks its best. There are still plenty of shops open - that's if you get invited to walk in. I was told the shops on the drive are just there for brand positioning. Worth a trip to drive or walk down - don't expect to see celebs.\nShow less"], ["Reviewed November 3, 2017", 3.0, "Smelled of richness", "We visited Rodeo Drive during a tour of Hollywood with The Anaheim Tour Company.\n\nLovely clean and modern, palm tree lined street with lots of flash cars and just smelled of richness. My credit card could not afford to shop here. There were many high end boutiques and retail shops like Gucci and I did not see many buyers around.\n\nWe dropped into the Luxe Hotel in this street to use the bathrooms and have a look around. Lovely trendy hotel and I notice rates there are around A$500 per night.\n\nIt ticks off my been there done that.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Nice to walk down & have a look at but too expensive for me.", "Lovely to wander & have a look at. Had lunch at Villa Blanca, that was lovely, beautiful food & service."], ["Reviewed November 2, 2017", 5.0, "Had to do it!", "Just had to walk Rodeo Drive! We didn't go into any stores or eat anyplace - just walked around. Even though I felt very out of place (and poor!!!!) it was fun! Lol!"], ["Reviewed November 1, 2017", 1.0, "Too rich for my blood...", "There wasn't anything that was reasonably priced, I was really hoping to see some celebrities but none made any sightings. ☹️"], ["Reviewed November 1, 2017", 5.0, "One stop shopping!", "Really! Everything and anything you can imagine! Food, clothing, accessories, pharmacy, entertainment! Saw some of the lovely sights, spectacular cars, funny dressed folks, and even got my broken phone taken care of at the phone store!"], ["Reviewed October 31, 2017", 4.0, "Fun to walk and shop!", "Rodeo Drive; what more can I say? It is the iconic luxury shopping destination of the world. You see people from all over the world walking the street or driving their uber expensive cars through the neighborhood. Many shops have to buzz you in. If you're in LA it's worth a stop.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Just like the movies", "This place is just like the movies only there is less people. It looks expensive but to be honest it actually wasn’t in comparison to Australia. Lots of buzz to have your photo taken next to the sign but otherwise you could be anywhere"], ["Reviewed October 30, 2017", 5.0, "Classic", "A walk down Rodeo Drive is a wonderful addition to any Hollywood holiday! The shops in the area can sometimes be closed for celebrities and the cats you might see driving around are some of the fanciest you will ever see! A great insight into the ‘hollywood lifestyle’\nShow less"], ["Reviewed October 30, 2017", 4.0, "Pleasant Surprise", "Rodeo Drive was a stop included on my L.A. area tour. Wasn't expecting much, but was pleasantly surprised about Rodeo Drive. Prices were high, but Rodeo Drive isn't that much different from any other shopping area---once you get used to seeing Rolls Royce Phantoms as common as Toyotas on the street.\nShow less"], ["Reviewed October 30, 2017", 4.0, "Luxury shopping", "The place to shop in luxury and high end brands in the LA area, and to see expensive cars and maybe some celebrities."], ["Reviewed October 29, 2017", 4.0, "World famous shopping street", "This street is comparable to NYC's 5th Avenue and Paris Champs d'Élysées. It is all high fashion name brand stores and if shopkeepers know one is serious about buying, they'll treat you well. Otherwise one may get the stares. Very nice location for pictures."], ["Reviewed October 29, 2017", 3.0, "Posh shops", "Worth a visit the shop fronts are amazing , couldn’t afford to shop here plenty of beautiful people wandering about didn’t see anyone famous"], ["Reviewed October 29, 2017", 4.0, "Exclusive", "This is a cool place to see with the most luxurious brand shops. You should definitely enter and buy at least something in one of them, you will get an amazing treatment. I was surprised that you can not see the locals but most of the people actually shopping are Asians.\nShow less"], ["Reviewed October 28, 2017", 3.0, "It doesn't get more exclusive than this", "Worth a short visit but really not that fun. You see and feel it right away. Very exclusive but not mroe than that. Artificial"], ["Reviewed October 27, 2017", 5.0, "Nice cars", "I loved people watching on Rodeo Drive! I love all the cars and the people dressed up. The lights look amazing at night. The fire hydrants are silver."], ["Reviewed October 27, 2017", 3.0, "Fancy", "Good to see and walk around but definitely need deep pockets for this one. All designer stores. Not much to do other than window shop."], ["Reviewed October 26, 2017", 5.0, "Love to Shop", "If you love to shop, then this is the street. Something for almost everyone. From high end designers to restaurants and gift shops."], ["Reviewed October 25, 2017", 4.0, "Great place to people watch", "Even if you can't afford to shop at any of the high-end luxury designers stores, this a fun place to take a walk and people watch."], ["Reviewed October 23, 2017", 4.0, "Always worth a visit", "There is something about this place that makes it special. It's great for people and car watching and window shopping."], ["Reviewed October 23, 2017", 3.0, "Exactly What We Thought", "No different than any other extremely high end shopping area. Exotic cars everywhere, women dressed in their finest clothes, people shopping. I guess the only difference was the amazing weather."], ["Reviewed October 23, 2017", 4.0, "Stinks of money 💰", "This place is great to walk along during day and at night. Great place to see great cars and stinking rich people. Shops are amazing and so many good restaurants nearby. Even if you can’t afford to buy you should still walk along it."], ["Reviewed October 23, 2017", 3.0, "Up market shopping", "Don't actually like it, I feel more like a voyeur when I come here but it all seems so familiar from all your favourite tv shows and movies. For most people, more a place for looking than buying with the expensive price tags in the up market stores.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Fashion and fun!!!", "Omg! Amazing stores and amazing cars parked along the street! We had such a good time going into most of the stores and window shopping. The associates in the stores were friendly and welcoming. Not snobby at all like in some of the reviews. We had so much fun in this area and enjoyed dining at Villa Blanca.\nOf course you have to walk through The Beverly Wilshire, beautiful hotel. We spotted two celebrities that afternoon!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Film Set", "It’s like you are on a film set so many memorable sights from film and screen you feel you’ve visited before even if you haven’t, it’s full of high end shops and not one of them for you if you’re on a budget like the every day person visiting is, you have to visit so you can send a selfie or tag yourself in while there.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Make sure not to park nearby", "Parking tickets are up to $100. Take the metro. Other than that it's a cool street for a little walk."], ["Reviewed October 19, 2017", 5.0, "Very nice", "Visited with my 13 year old and 9 year old. We all enjoyed window shopping the expensive stores. My son got a kick out of seeing the expensive cars parked on the street."], ["Reviewed October 18, 2017", 5.0, "Relaxing walk", "My family recently stayed in Beverly Hills after spending a week at Disneyland. We walked to Rodeo Drive, but most everything was closed before 9:00 pm. There was a nice outdoor restaurant that looked fantastic, but we unfortunately did not have time to check it out.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Fancy", "Worth a visit just to see the store fronts of some of these stores. Nice to walk up and browse. Not actually a very long street!"], ["Reviewed October 17, 2017", 5.0, "WINDOW SHOPPING after dinner", "With a one-night stay only, following dinner, we strolled Rodeo Drive on both sides in the warm, balmy evening, enjoying the peacefulness of this famous street after shopping hours. It is truly AMAZING, the stores are BEAUTIFUL and the strip is very prestigious. A good way to check stores out BEFORE you go back for day-time shopping. Quite busy during the day, with lots of gorgeous, lovely Beverly Hills people stepping out in their finest.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Paradigm of high-end luxury shopping on the West Coast, a Californian version of NYC's Fifth/Madison Avenue", "If you like shopping for luxury items, or window-shopping, you have to come experience this beautiful, expensive street. This is what you usually connect Beverly Hills with, besides the beautiful, expensive houses in the neighborhood. This is just like the Fifth Avenue, but in a Californian style. Actually you can find more high-end boutiques here than Fifth Avenue, in which sense it's more like Madison Avenue. Whichever designer brand you crave for, you'll likely find it here. And there are some brands that you can't find elsewhere, such as Bijan (You won't miss the Bugatti Vron parking in the store front.).\n\nSurprisingly you can park free here. Just find one of these public parking spots that offer up to 2 hours of free parking. There are several in the area.\n\nDress fashionably when walking on this street, to look just 'normal', if you could. Otherwise, people will know that you're just a tourist here for window-shopping. Hah hah... actually nothing wrong with that.\nShow less"], ["Reviewed October 17, 2017", 3.0, "Who can afford to shop here", "I guess a semi must see tourist attraction, as there were a lot of tourists. High end shops, with lots of restaurants. I don't feel the need to go back."], ["Reviewed October 16, 2017", 5.0, "Must see", "Amazing shopping and restaurants. Fun to walk up and down the street and see the cars driving by. We saw many teslas... lambos.."], ["Reviewed October 15, 2017", 4.0, "Great place to watch cars and fashions", "We visited late afternoon which gave us the chance to see the area in daylight and when it is lit up. We saw an amazing number of expensive sports cars. There are roadside tables and chairs where you can watch the people and cars. There are also some reasonably priced restaurants in the area where you can take an outside or window table. If you only have a short time available, I would suggest evening when everything is lit up.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Fun!", "It was a fun to walk around and experience the swanky Beverly Hills shops. The streets are clean and feel safe. It's not something I would do again if I would visit LA BUT I am glad that I did it once."], ["Reviewed October 12, 2017", 3.0, "Nothing special - just luxury shops and fast cars", "Of course if you are looking for it, so it is the place, because deffinetely you will see a lot of fast cars and only luxury shops. The street is pretty short and you can take a walk or drive through it with your car to feel the atmosphere of luxury life:)\nShow less"], ["Reviewed October 12, 2017", 4.0, "Beautiful, clean street", "Worth a look to say you’ve seen it. Very clean, very expensive but enjoyed looking at it and getting a picture with the sign"], ["Reviewed October 11, 2017", 5.0, "Too Rich for My Blood", "Rodeo Drive is a great place to people watch! You will encounter many different personalities and will most likely see a few celebrities as well."], ["Reviewed October 9, 2017", 4.0, "Fun to shop just to say you did", "We walked Rodeo drive on a really nice, sunny afternoon. It was great fun to people watch and to look in stores where you may not be able to afford a thing! Recommend seeing it if you are touring LA."], ["Reviewed October 8, 2017", 5.0, "Rodeo in October", "Beautiful area and streets are so clean it looks as though they have been scrubbed daily. Recommend an early morning walk before it gets crowded then head back to people watch. It is a very cool experience."], ["Reviewed October 8, 2017", 5.0, "Who doesn't love rodeo drive?", "Rodeo drive is a must - always when in Beverly Hills! To make your trip easy... walk the strip and enjoy window shopping and looking @ expansive cars! The display windows are awesome!"], ["Reviewed October 7, 2017", 5.0, "Look but you wont buy", "Imagine all the most expensive shops and designer tags all rolled into one and more and that sums up this part of town,no price tags if you have to ask you can't afford it...."], ["Reviewed October 6, 2017", 4.0, "Pretty woman moment!", "When in LA a wander down Rodeo Drive is a must. The shops are amazing, well worth a look, price tags are what you would expect. The Beverly Wilshire Hotel is located at the bottom of the street for your Pretty Woman moment. Take a table outside for tea and watch the world go by.\n\nTwo Rodeo is more quirky and lovely bits of architecture, at the bottom there is an #onlyonrodeo frame that changes regularly. Time to get a selfie and mark the occasion.\n\nIf the Beverly Wilshire is a bit pricy there is a Starbucks round the corner, coloured chairs and tables line the street, grab a coffee and take a seat. Its all very cliche and fake but fun for a while.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Very Nice Place to People Watch", "We strolled up and down Rodeo Drive and had a great time taking it all in. Its a must see if your in the area, we seen mostly everything and only spent an hour or so there."], ["Reviewed October 5, 2017", 4.0, "Window shopping for sure", "Stopped for a short visit on our bus tour. Fun to walk around and see all the fast cars pass by (especially on the wknd). Dis lots of window shopping!"], ["Reviewed October 5, 2017", 5.0, "Pretty Women Moment! Oh Yea!!!", "After years of hearing about the fabulous Rodeo Drive, I had to finally experience it for myself! As I strolled along Rodeo Drive, I was impressed with each store and people watching. Money, Money, Money! I enjoyed my Rodeo Drive experience, but bring lots of money if you plan to buy anything as it isn't cheap! It reminds me of NY's 5th Avenue or Chicago's Michigan Avenue - all high-end stores with great looks and high prices! Worth every moment as you will see things you wouldn't see else where, such as a belt for $80,000.00 (Eighty Thousand Dollars!). It is solid gold and encrusted with diamonds! It is still there, I didn't buy it, so don't worry!!!\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great spot for window shopping", "While too pricey for us, it was a great experience to walk around the strip and see all of the iconic locations!"], ["Reviewed October 2, 2017", 5.0, "Celebrity Spottings?", "We did not see and celebrities while walking on rodeo drive which was ok but they are reported to have been seen there from time to time especially at georgie's hotel & resteraunt. There is a very pretty garden type area there with tables, fountains and expensive eatery. On Rodeo drive it was fun to watch all the expensive sports cars go by ans all the name brand expensive stores. Fun just to walk around and be a tourist.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Very exclusive", "Great to see and tick off the list but very ritzy and expensive, some of the shops were by appointment only."], ["Reviewed October 2, 2017", 5.0, "We drove through to see christmas decorations", "It was lovely. We window shopped, taking notes what to look for at Ross knock offs. Fun to see this place."], ["Reviewed October 2, 2017", 5.0, "Eye popping", "We went to have a quick look at the Waldorf Astoria and the area generally. The staff at the hotel were happy for us to have a quick look around.\n\nThe jewellery shops in the close vicinity to the hotel were unbelievable. If you want to see what a $6 m diamond ring looks like you should pop into Harry Winston's. the gems were eye popping!!!\nShow less"], ["Reviewed October 2, 2017", 4.0, "Good to see but that's about it", "You can say you have been to rodeo drive! I found some of the people in the shops quite rude. Possibly wearing thongs in rodeo drive can do this!!!"], ["Reviewed October 2, 2017", 5.0, "How the other half live!", "A must do....we had a car so drove down in our Camera with the top down! Full of luxury shops you many only wish to window shop but it is pleasant, free from the hustle and bustle and a nice atmosphere with music playing throughout the street.\nShow less"], ["Reviewed October 2, 2017", 2.0, "Very Pretentious", "Not worth a walk through unless you have a fat wallet. take a quick drive through and a few snap shots, worth a look"], ["Reviewed October 2, 2017", 5.0, "nice!", "thisplace is sonice, attractive and rich! Even we felt quite poor there, we really loved to be there. :)"], ["Reviewed October 1, 2017", 5.0, "Window shopping", "I admit we did not shop here, but it was great window shopping in all the exclusive shops and seeing all the top brands up close."], ["Reviewed September 28, 2017", 5.0, "Exclusive and super expensive shopping area", "We walked around this area, this is in fact close to Beverly hills sign board and little away from Santa Monica Beach.You will all the famous branded shops here.Worth a walk. If you are interested in expensive are you can see in this area. Nice I enjoyed. We went in summer period so dress casually and be prepared for walk a lot. Take water.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Lovely road", "All lovely high end designer shops spotless. Pity the city don't sort out Hollywood boulevard with all the money there"], ["Reviewed September 27, 2017", 3.0, "See where the other half shop", "Los Angeles is a place where you get to see the gap between poverty and luxury. Rodeo drive is a paradise if you have the wealth to enjoy it. It's full of Gucci shops and cars worth more than most people yearly salary. But it's worth seeing if you like expensive things.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Greatest shopping experience ever", "You'll find everything you need from mid prices to upscale merchandise. Walk it at night and take in the rich air with Lamborghinis parked along the road, and beautifully lit store fronts."], ["Reviewed September 26, 2017", 5.0, "Lovely area", "Very nice to walk around. Nice and clean and music playing in the street. Shops all beautiful and ostentatious."], ["Reviewed September 25, 2017", 5.0, "Wonderful", "This is such an attractive area. Worth it just to look at the window displays and pretty sidewalks. It would look great at night as all the palms had lights strung on them."], ["Reviewed September 24, 2017", 5.0, "Shopping", "One of the best places in the world for high level shopping for design oriented shoppers or interested visitors and foreigners."], ["Reviewed September 24, 2017", 4.0, "Like having every ad in Vogue come alive", "The entire street is impressive. Many just visit the collection at the top of the street. There is so much more."], ["Reviewed September 24, 2017", 5.0, "A great morning at rodeo drive!", "Stopped by for breakfast and a little bit of shopping....mainly window shopping! Immaculately clean area. Loved my morning there."], ["Reviewed September 23, 2017", 5.0, "Beautiful and upscale shopping and restaurants", "Where the rich and famous shop and dine. Elegant elite and high end shops galore. Valet parking available with an indoor valet office with public rest rooms was a plus. Beautiful and extraordinary Beverly Wiltshire Hotel part of this upscale area."], ["Reviewed September 22, 2017", 4.0, "Wow, but I thought it was bigger", "Today we took a trip to Rodeo drive to see how the rich SHOP. I was jealous that I didn't have the cash to splurge so I opted for 2 Guess necklaces. There is a definite WOW factor, and I'm glad we did it."], ["Reviewed September 22, 2017", 3.0, "Like high end shopping?", "That's truly all this really is. High end shopping with a few high end restaurants. For those who don't mind spending money on expensive material items you'll find all the best of the best stores and expensive cars to complement the frequent flyers here. Nothing spectacular than what you see on TV.\nShow less"], ["Reviewed September 22, 2017", 3.0, "Walk about", "A place to be seen, not much activity in the stores, lots of staff waiting to serve customers. A place to walk through and say you have done it!!!!"], ["Reviewed September 20, 2017", 4.0, "Hosting our cousin", "Great place to drive through and take photos, otherwise, nothing really to do there except for expensive shopping. Recommend to stop by after visiting the Getty museum."], ["Reviewed September 19, 2017", 4.0, "Great Time", "The Rodeo Drive was amazing, lots of shops but I recommend that it's more kind of a Adult Street. Children wouldn't buy anything cause they are to young but going down the street was just amazing. Had a great time."], ["Reviewed September 19, 2017", 5.0, "Credit card essential 👍", "Firstly it is a struggle to park your car but there is valet parking down the ramp @ G STAR RAW.\nNow to the shopping , as you'd expect it's all the BIG brands and some you may not have heard of including Bijon which is appointments only !\nA very nice area to spend some time and money .\nGo treat yourself!!\nShow less"], ["Reviewed September 19, 2017", 4.0, "Beverly hills...", "This is a great place to walk and check out the high end shops it is very expensive, as you would expect."], ["Reviewed September 17, 2017", 3.0, "People watching", "Good to see and who hasn't heard of rodeo drive? However shopping is nothing special, the majority of the shops are the same in most major European cities with the exception of a few. However it's still worth a visit and to people watch, you do see some sights! But you can't go to LA and not visit rodeo drive.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Stuck-up Rich people at their finest", "Like most things in LA, attractions or places are a \"one and done\" experience. Drive or walk down the street - see expensive cars, see expensive stuff in windows the average person could never afford. Then, when you leave you will go \"ok\"... and never go back.\nShow less"]]}}