{"Ronald Reagan Presidential Library and Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Ronald Reagan Presidential Library and Museum", "url": "/Attraction_Review-g33093-d145836-Reviews-Ronald_Reagan_Presidential_Library_and_Museum-Simi_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/29/9b/01/the-oval-office.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "2587"}, "address": {"@type": "PostalAddress", "streetAddress": "40 Presidential Dr", "addressLocality": "Simi Valley", "addressRegion": "California", "postalCode": "93065-0600", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "A Must See", "This is a must see. It pays a great tribute to a great life. The various exhibits are great. His office with the jelly beans on the desk is amazing. The people working there are so great and knowledgeable. Highly recommended to make the trip to visit.\nShow less"], ["Reviewed 3 days ago", 5.0, "Excellent Tribute to a Fascinating Life", "We have made a habit of visiting presidential libraries and museums and this one is outstanding. It is well designed and placed in a beautiful setting. Reagan in many ways represented the quintessential American Dream saga, coming out of modest circumstances to rise to the highest office in the land. As with most presidential libraries and museums, it does tend to gloss over the negative (Iran Contra comes to mind), but overall they do a good job. Air Force One is definitely a must-see - if you arrive early, go to it directly, as it gets busy later in the day.\nShow less"], ["Reviewed 5 days ago", 5.0, "Excellent, well worth the visit", "Whilst a bit \"out of the way\", a visit to this Library is a \"must \"if you are in Southern California. The views are spectacular, the displays are informative and very professionally presented. The staff are extremely knowledgeable and take pride in discussing the various exhibits. The displays of the Oval Office and Airforce One were our favourite attractions. A very worthwhile visit.\nShow less"], ["Reviewed 5 days ago", 5.0, "Short trip to California to visit Library", "Most Impressive! On their website it said to allow for 4 hours. Well we got there at opening at 10 and closed it at 5! Very well laid out. Lots of staff available if needed. We ate a small lunch there. Kind of expensive for what we had, but to be expected. They had a special Genghis Kahn exhibit that I wished I had skipped and gave myself more time in gift shop and outside. It was a well done exhibit, just not interested. The library was perhaps so interesting to me because I could remember and experienced a lot of things that was talked about it. Plus I entered the military in 1980. I heard a lot of positive comments from other people.\nShow less"], ["Reviewed 6 days ago", 5.0, "Worthwhile", "Seeing this library was informative, interesting, moving and uplifting. Very inspiring! I had never been to a Presidential library before. Worthwhile visit! Amazing President."], ["Reviewed 6 days ago", 5.0, "His library was as good as his presidency.", "The location for the Reagan library is breath taking. The view of the valley around it was clear and you could see for miles the day we were there. Even if you didn't vote for the man, this library is full of surprises. A piece of the Berlin wall and Air Force 1 is a huge surprise! You can pick up a nice snack at the Reagan Pub (actually reconstructed from it's original location in Ireland. Take your camera for outstanding bronzes outdoors and don't hurry or you'll miss something.\nShow less"], ["Reviewed 1 week ago", 5.0, "A Wonderful Stop", "This is one of the best presidential libraries around. What great docents! They are so knowledgeable about every room and the items in them. We were anxious to see Air Force One and it sure was an experience. Not as opulent as one might expect. This library setting is magnificent – what views. Make sure you plan on a good three hours or so to do this justice. Not to be missed. It also has a great little pub and restaurant.\nShow less"], ["Reviewed 1 week ago", 5.0, "A classy presidential library", "We have visited 7 Presidential Libraries and all are put together very well, but in our opinion the Reagan Library appears to be a little more classy. In addition to Reagan's legacy the Reagan library does a great job in presenting the Berlin Wall, the Secret Service and Air Force One. For those that want to absorb history visiting the Reagan Presidential Library is an all-day event.\nShow less"], ["Reviewed 1 week ago", 5.0, "My Wife Loved the Christmas Tree Exhibit !", "We loved seeing Air Force One, the helicopter, and presidential limo. It was nice to see all the information on President Reagan. History at its best !"], ["Reviewed 1 week ago", 5.0, "Genghis Khan and the side of him you never knew", "My second visit to the library, 1st time was for the Titanic event, very interesting and moving to read the stories of the people behind the tragedy. This time was to learn about Genghis Khan - not just the brutal barbarian I had thought but someone who also brought laws, unification and surprisingly some innovations we use today. Loved the music and dance feature, not sure what the instrument was called but what a wonderful sound. We didn't have time to visit Air Force One etc but there is always the next visit. The location is also quite beautiful.\nShow less"], ["Reviewed 1 week ago", 5.0, "A definite YES to visit", "The library is soberly arranged with historical information coupled with interactive activities. Regardless of a persons political leanings, listening to Reagan after all these years gives a strong message of what a people's oriented leader says. Highlights: Air Force One, exhibit of the Oval Office, Berlin Wall, videos of his Hollywood days.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great museum for a great president!", "Visited here with the family and had a great time - even the teenagers. Expect to spend 3-4 hours here easy. The Air Force One plane is the center piece exhibit, but there is so much more. Absolute great place to visit regardless of your political affiliations. It's a great history lesson. A fitting tribute to a great president and man. Must see while visiting Southern California.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very worth the trip!", "This was so worth taking the time to see. I've always been a fan of Ronald Reagan but learned so many new things that are very endearing. One of the best parts was getting to actually Walk On Air Force One and see what it was like for him and other presidents as well. I recommend using the audio tour. There is a lot to read and it could take a lot longer if you don't get to listen to the exhibits. They did a wonderful job with this Presidential Library.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Legacy of a President", "After visiting LA for many years I was finally able to make it up to Simi Valley to see the Ronald Regan Presidential Library and Museum. I wasn't very old at the time when Regan was President, but I wanted to visit more than anything. It was very informative.\n\nI went on NYE, and it was really busy b/c of all the people in for the Rose Bowl. I think I waited like 30 minutes in line to see Air Force One! I loved the Christmas trees they had decorated per each century. Mr. Regan was a great man and President. I couldn't stay long in the room where they were showing his funeral because my grandma also died of dementia and I was crying. I liked seeing where him and Mrs. Regan are buried as well, that's nice it's on that property.\n\nThere was also a Titanic exhibit in another part of the area that was free to visit if you had purchased a ticket to the museum. I really enjoyed that as well, Titanic is one of my favorite movies. It was cool to see some of the props and sets from the film.\n\nIt took about 4 hours to see everything. There's limited parking in the lot but you can park on the road leading up to the museum, but it's all uphill. If you have time go check this out!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing Library for a Great President", "We enjoyed the multiple communication methods used to share of the history of former President Ronald Reagan and his spouse Nancy. Use of the audio tour headphones is highly recommended as it helps maintain focus during the entire tour. There is so much to see, to read, to experience, including a stroll through Air Force One. We allowed ample time to learn, experience, rest, and enjoy the Library. If you are certain age, you may fondly recall memories of the Reagan years as we did. But no matter your age, you will come away feeling you knew \"Ronnie\" and Nancy and what they did for America. The Library is very well done, and the staff are most helpful and friendly.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Classy and befitting a President", "This is definitely worth the drive! Beautiful building overlooking the hills in Simi Valley, CA. You will see his early life in IL, his acting career, as the CA governor, as The 40th President, and even where he and Nancy are buried. Also inside were Marine One, his motorcade, and Air Force One with picture documenting how they got it there. Amazing! The best Presidential library I’ve seen. Give yourself at least 3-4 hours to see it all.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "National Treasure", "Magnificent! I spent 4 hours totally enjoying every minute. Saw Airforce One,the Oval Office, the Berlin Wall and so many wonderful exhibits that reminded me just how great Ronald Reagan was. Probably the best tour of a museum that I have seen since the Louvre in Paris. I am sure all the liberal Democrats would totally hate it, but that’s their problem, they’ll have to wait for Obama’s. Lots of helpful people working here and great shuttle service. I really enjoyed it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Very impressed", "It sits on a stunning location in Simi Valley. There was no expense spare when this was built ! The museums very good ! The Air-force One exhibit is astonishing! It was avert worthwhile visit and ranks right up there with the best of presidential libraries! Give yourselves a good 3-4 hours to go through .\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing and Superb", "I have been to the Ronald Reagan Birthplace and Ronald Reagan Boyhood Home in Illinois, but the Presidential Library and Museum is beyond comprehension. Set on top of a beautiful hillside, the museum does a superb job of showcasing President Reagan's history and accomplishments. Here was a President that lifted up the nation and gave us all hope and courage. Its almost hard to remember how bad things were when he arrived and he turned this country around working with Democrats but keeping to his conservative principles. This was the man that freed millions of people from communism and tyranny, while providing prosperity throughout our own country.\n\nThey advise that the visit will take 3 hours, but we stayed there 5 hours until closing and wish we could have stayed longer. From reliving Reagan's inspirational speeches to touring Air Force One perched proudly in its atrium, this museum is a must for anyone who loves American history.\n\nYou can take advantage of your visit and join the Reagan Foundation, and that will give you free admission to all the other Presidential Libraries, which I fully intend to take advantage of this year!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Need to go", "this was a very nice place. The workers were very helpful and informative. Very enjoyable. It wasn't very crowded when I was there but there was an overflow lot which would worry me. Highly recoimmend it."], ["Reviewed 4 weeks ago", 5.0, "The highlight of our time in California", "Liked Ronald Regan before we visited. However, after touring here he is now my favorite President. We were so impressed with all he did during his time in office. Nancy never impressed me, but I never knew how much an influence she had. It’s hard to decide what I liked or impressed me the most. Air Force One? Berlin Wall? The Nancy Regan room? They all (and more) were so impressive.\nOn a side note, the Irish pub had very good lunch and reasonably priced. The ground are beautiful! The views from every side are breathtaking!\nMy granddaughters have been there several times with out of state visitors and they tell me they never tire of it and find something new each time they go.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "The highlight of my time in Simi Valley", "Ordered tickets online, so avoided the long lines for tickets at the door. It was very busy on a Saturday, and I got there before the doors opened. Parking filled up quickly, so when I came out of the library/museum cars were parked all the way down the drive to the bottom of the hill! A wonderful tour of Reagan's life - very well displayed. Very interesting. I did not go through the Titanic tour, as I have seen that elsewhere in the past. The lines were very long for that. I highly recommend this tour - very well worth it!\nShow less"], ["Reviewed January 23, 2018", 4.0, "A Very Special Visit to the Regan Library", "There is so much to see here so wear comfortable shoes. Dress is casual, no tank tops or shorts. Plan to spend the day here. President Regans Air Force One is actually inside the library and you get to go through it. A great place to take young children to show them a bit of history.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Great Presidential Library", "This library changes every six month or so. Right now the have Titanic artifacts on display. At Christmas they have Christmas trees decorated with each tree representing different countries. They have all the gifts to the Reagans from different dignitaries on display which was interesting to see. They have his motorcade on display right under the Air Force One jet that he traveled around the world on. You can walk through the jet. It's not as nice as the jets they have today but that was a long time ago. So if you are in Simi Valley California, you would be making a mistake if you didn't visit this Library.\nShow less"], ["Reviewed January 22, 2018", 5.0, "great place to visit", "bring your children, your grandparents, grandchildren, your whole family. Air Force One, helicopter, and more. Lots of history included. Learn about the cold war, the history of a great president and more."], ["Reviewed January 21, 2018", 5.0, "Amazing Museum", "This is a great museum. If you are a fan or not of Reagan this is such a great place lots of Reagan movie memorabilia as well as from his presidency. Also the titanic exhibit is unlike any ever seen. Definitely recommend. I plan on trying to visit all the presidential libraries.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Reagan Library and Museum was worth the drive!", "We drove from Redding to Simi Valley to see the Reagan Library and Museum for the first time. All I can say is AMAZING! There was so much to see and read. A day spent there does not really do it justice. I wish we could have stayed at least two. They had the titanic exhibit as well and it was incredible! We also got to go through Air Force One which was so interesting! The staff was so friendly and helpful. I can’t wait to go back!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Worth visiting at least once to see how some people rate President Reagan", "There's enough at The Ronald Reagan Presidential Llibrary to make it worth your time and travel. The view alone is worth it. And there is the Presidential Airplane that is interesting along with pictures and exhibits about \"The Reagan Years.\" I am NOT a big fan of Ronald Reagan. He did many good things that benefited The USA and The World. But there is a negative side resulting from The Reagans becoming among the \"wealthy people\" and making programs that benefit them. For example, \"The Trickle Down Theory\" of economics makes me sick just to contemplate the effect this theory had and is now having on people of modest means. The end of the Cold War is on the plus side. Go figure...Reagan is a mixed bag??? :o)\nShow less"], ["Reviewed January 21, 2018", 5.0, "Emotional journey", "Having grown up in the Reagan era, he was a man that we greatly admired. Many of the speeches that were playing in the library were ones that I recall hearing years ago. He was the great communicator!\n\nWe thoroughly enjoyed the drive up to the library as well as the museum and spectacular views.\nBe prepared to spend at least 3-4 hours. There are multiple stops and videos where you can take more time if you choose. Parking is free and admission is $16.00 as long as there is no other special exhibit such as The Titanic that just closed. Cost will be higher if there are special exhibits.\n\nIf you loved Reagan, be prepared to shed tears! This library is very well done. Don’t forget to go outside and see a piece of the Berlin Wall and the Ronald and Nancy trees.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Excellent Tour !", "Wonderful Staff - everyone very helpful and pleasant ! We meet Sarah Saturday 1/21 over by the gift store entrance - she did an amazing job in answering our questions along with a wonderful conversation ! Very impressed with all the volunteers that were keeping the Library open even with the government shutdown in place.\nVery beautiful and full of information ! Well presented - very handicap friendly as well - a must see if in the area !\nShow less"], ["Reviewed January 19, 2018", 5.0, "Amazing!", "I took my wife and kids (14,12,11) to learn a bit of national history after some fun at Disneyland. I was not disappointed. Not only do they teach about how Pres. Reagan brought America out of the gutter, but they also teach about his character and beliefs. I was able to explain to my son how he helped Americans. They have many graphs and experiences that teach what he did in simple terms.\nThe Air Force one exhibit was neat.\nMy only issue was with some school kids that were touring the museum. I think the museum should inform the schools that if the teachers leave the students unattended then they will be asked to leave. The students were loud, obnoxious, and disrespectful. Not only to us, but to Pres. Reagan. This needs to be addressed.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Wonderful", "We love visiting the Reagan Library. It’s a very interesting and educational experience and is very reasonably priced. We enjoy the various exhibits that are featured there from sports, to politics, to history. If you’re in the area, it is a must see."], ["Reviewed January 8, 2018", 5.0, "RR Helped Change the World", "This museum was well worth the drive to Simi Valley. You will have the opportunity to experience an important part of America's history. The museum is laid out well with 24 different galleries featuring many important historical artifacts. You will start with Ronald Reagan's early years, college days, radio career, movie career, governor of California and his run for the most important office of our nation. I would highly recommend that you purchase your ticket online (the lines can be long) and invest in the $7 head set which gives you lots of great audio information. You will reserve a time slot but we arrived 30 minutes early and they let us in ahead of the long line. Another bonus is this museum houses the Air Force One Presidential airplane. Parking is free and they also offer a free shuttle to make the walk up the hill easy. They are open daily from 10 a.m. to 5 p.m. (closed some holidays).\nShow less"], ["Reviewed January 5, 2018", 5.0, "A MUST SEE, this place was AWESOME!", "If you like history, this place is a must see. The displays were awesome!! I admit, I am a history geek and LOVE going to these places but my wife HATES them. Even she loved this place. So much to see in such a short time. They have a retired Air Force 1 and Marine 1 here that you can walk through, how cool is that? Reagan was a great President but I was only in elementary school when he was in office so this was so much fun for me to see while I was there. I would definitely go back again. This was my 4th Presidential Library and the best one so far! If you upgrade your admission, you can get into some of the other Presidential Libraries for free. Great gift shop also and some absolutely AMAZING views.\nShow less"], ["Reviewed January 5, 2018", 4.0, "History in a spectacularly scenic view.", "Visit the Reagan library and museum. Very bright displays and exhibits rotate through the museum. Board Air Force One and image flying with the President. Excellent hilltop view and sprawling property. He was an Actor who wrote beautiful letters and knew diplomacy as he navigated our country through history. Lovely photos, stories and video make this museum worth the trek.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Beautiful setting", "History in a stunning setting. Fun to walk through Air Force One. I am a life-long democrat but I really enjoyed this interesting library."], ["Reviewed January 4, 2018", 1.0, "60 minutes in line for pre purchased tickets", "Ridiculously long line for pre purchased tickets...then more lines after checking in...won’t go for a long time"], ["Reviewed January 3, 2018", 5.0, "Wonderful Experience", "This is a must visit if you are in the area. There are parts that are very moving. The tour of Air Force One is a once in a lifetime experience. The earlier you arrive the smaller the lines.\nTheir current Titanic exhibit is a bit disappointing but still interesting. I would go back if the opportunity arises.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Outstanding Presidential Library", "Presidential libraries are a national treasure, and this one is no exception. I must admit that I was not a big Reagan enthusiast prior to the visit, but I have a more appreciative view of him now. The docent was excellent, and the exhibits really well done, walking you through the various domestic and international highlights of the Reagan years. The most dominate item in the exhibit is Air Force One, displayed along with Marine One, the Presidential \"Beast\" limo, and a Secret Service support car. Built especially to house these items, the building is large and well appointed. The visitor is allowed to enter Air Force One and Marine One, and a docent answers questions. We were lucky enough to be with a group that had a fantastic barbecue lunch under Air Force One. So, whether you are a Reagan fan or not, this is a great visit into American history, and you WILL leave with a greater understanding of the President.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Beautiful setting", "We went two days after Christmas 2017, so was extremely busy- queues quite long, but could not go any other time. So all we did was walk around the gardens and admire the building, views and gardens. Hopefully we can go again sometime in the future, when not so crowded.\nShow less"], ["Reviewed January 2, 2018", 3.0, "Not my favorite!", "We did a mistake by going on Saturday 12/30. It was overcrowded, it took us 2 hours driving from Bakersfield and another 2 hours from the museum parking to get in!!!\nWe had to wait for the shuttle to take us to the museum and we had to wait in lines for tickets and getting in the titanic exhibit.\nTitanic exhibit was ok, we went to on in Las Vegas was much bigger and nicer.\nThe actual museum was not interesting for me. May be it will be for you.\nThe highlight of the museum is the air force one \"which we had to wait in another line for 45 mins\" there is a prodessional photographer by the plane door. The pictures came pretty good. We also got an audio tour which we didn't use.\nOverall, I was disappointed by the museum but to be honest, being overcrowded played a big role in my disappointment.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Excellent!", "We have visited many of the presidential libraries & Reagan’s did not disappoint. Parking was an issue. Try to arrive early. It was crowded but we went on a holiday weekend. It was a treat to tour Air Force One! It was worth the wait. The mini movies were great! Highly recommend - take the family!\nShow less"], ["Reviewed December 30, 2017", 4.0, "So much to see - so little time!", "The Library was crowded, but I went on a holiday weekend - not advisable. If you get there before it opens, you should still be able to park in the parking lot, but if you come later, you will need to park along either side of Presidential Drive and catch the shuttle back up the hill to the Library.\n\nI was happy to get a senior discount (for 62 and over), but I honestly do not recommend getting the additional handset for listening, because there is so much else to see and read - and so many videos to watch throughout the exhibitions, you may never have any time to stop and listen to what is on the handset (used like a phone to listen). I really didn't use mine, so for me, that was an extra $7 down the drain.\n\nThe Titanic exhibition was outstanding, but actually boarding Air Force One was worth the price of admission for me. They offer to take photos of you and/or your group just as you are about to board, and those pics are for sale later, just downstairs, or online.\n\nThe Christmas Tree exhibit was absolutely wonderful, as it showed the White House Christmas trees going way back hundreds of years.\n\nAside from that, seeing Nancy Reagan's gowns and various work-a-day clothing was a real treat, as was the Camp David exhibit.\n\nThere's just so much to see! I would need to go back on a quieter day with fewer distractions to really take it all in. I regret that I missed visiting the final resting place of Ronald and Nancy. There is an excellent area devoted to the years' long fight against communism, and actual large pieces of the Berlin Wall. There was also a large metal beam with nails from the North Tower of the World Trade Center. I was able to touch that, which meant a lot to me.\n\nThey do have two places where you can eat lunch. The place nearest Air Force One smelled delicious! I did not eat while at the Library, so I cannot comment about food prices. You won't want to miss the gift shop. It has some very nice items.\n\nMy advice: 1) go on an \"off\" day, like a Monday, but not near the holidays: 2) go early in the day; 3) don't pay extra for the handset; 4) be prepared to do a lot of walking. There are quite a few places to sit down if you need to take a rest, but this place is very big!\nShow less"], ["Reviewed December 30, 2017", 3.0, "Reagan Library", "Get a docent led tour if you go. We were not given that option. Only to purchase a membership which we did. We waited in long lines while docent led tours walked to front. I am downgrading this because of lack of information. Long line to park also. No signs. One guy talking to each car and having them turn around saying lot was full when cars were leaving library. We drove to top to drop off people and found a place in the full parking lot.\n\nShow less"], ["Reviewed December 29, 2017", 3.0, "Worthwhile But Pricey", "The Reagan Library is well done and laid out. It’s all here from childhood to Ronny and Nancy’s burial. Air Force One is great exhibit and the Oval Office is special. The World Trade Center beam is moving as is the Berlin Wall slab. The burial site is bland and would have expected more from Nancy.\n\nMy beef is the expense- a family of four will cost more than $175 with mandatory special exhibit charge on top of the base fee. Come on Ronny it’s supposed to trickle down not trickle up.\nShow less"], ["Reviewed December 29, 2017", 5.0, "A Presidential Museum", "Outstanding! The only thing better than the museum were the volunteers that \"manned\" the museum. They were ALL very kind and provided very interesting information. I would highly recommend this attraction."], ["Reviewed December 27, 2017", 4.0, "Titanic Exhibit", "My friend and I went to their Titanic Exhibit today. It was great.\nWe have been here for other exhibits, and are never disappointed. Besides the traveling exhibits, they have various exhibits from Reagan's presidency. Those are interesting to see. I find the beam from the World Trade Center to be difficult to see. Very emotional.\nEven though I didn't care for Reagan as a President, the library is worth visiting.\nShow less"], ["Reviewed December 27, 2017", 5.0, "The Magical Presidential library", "I had been wanting to visit here for the longest time and I am glad that I waited. The Titanic exhibit was great. It was just like you were on the ship with all the mementoes. The plane was amazing as was the helicopter. the Christmas trees were all lite up and so beautiful. The architecture is fantastic.\nShow less"], ["Reviewed December 27, 2017", 4.0, ".....a great peek into recent history....", "The Ronald Regan Library really gives a great insight to the recent history of America at a period of our generation’s birth. Quite a President Regan was during his time.\n\nPluses\nExcellent place to visit for students of political science, public policy or family time.\nVery well organized, from parking, receptions, tour guide, (guides knowledgeable in content and context).\nVery helpful in managing families with strollers, by providing alternative routes.\nTitanic history was very insightful.\nExcellent views of Simi valley.\n\nMinuses\nThe photo collection queue was a slow.\n\nShow less"], ["Reviewed December 26, 2017", 5.0, "Much more than expected.", "Such an unexpected adventure. Went because we wanted to see the Titanic exhibit, and well worth the visit, the library was amazing. They really do an exceptional job there, the displays and historical items are fabulous."], ["Reviewed December 26, 2017", 5.0, "Beautiful Museum, very informative", "First time visiting the museum. Property was beautiful. Lots of information! Posted information, displays, videos, tours, replicas... I loved reading about the love story he and Nancy had. Excellent place to visit."], ["Reviewed December 22, 2017", 4.0, "Semi-Regular visitor - Enjoyed the Titanic Exhibit", "There is so much history packed in this museum. Every time we go, I find something I may have overlooked during the last visit. The Titanic Exhibit was fascinating, and we always enjoy viewing AirForce one. The Cafe in the museum is also actually quite good!\nShow less"], ["Reviewed December 22, 2017", 5.0, "I could spend hours and hours here", "This is my 3rd visit. The docents are amazing, but you really need to go off on your own, too, and take the time to read, watch and take advantage of all the hands on experiences. President Reagan's life is unique in that he was also an actor, governor and well-spoken. You can also see how important a First Lady is to a president. I was not a political fan of this presidency, but Reagan had a class and demeanor I wish we had now. And it makes me sad to see where we are in this country. If your tour includes a meal, rest assured it is a good one and plentiful. The Christmas tree display is an incredible time capsule through the good and bad years. I barely had time to visit an impressive Titanic display. I do wish I lived closer to revisit more often and focus on one or two rooms at a time. It is overwhelmingly nostalgic and interesting. Of the 4 other libraries/museums I've seen (Clinton, Lincoln, Truman, Nixon) this is clearly the most impressive.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Great rotating exhibits and Air Force One", "I'm not a Republican, but I am a fan of the Ronald Reagan library. They have wonderful rotating exhibits, such as: The Titanic, the Interactive, Treasures of the Vatican, the Spy exhibit...the list goes on and on. The cafe is a bit pricey, but the food is very good. President Reagan and his wife are actually buried on the property and one can visit the grave site. But the real jewel in the crown there, is Air Force One. You can actually walk through the Boeing 707 jet in which President Reagan traveled the world. There also a number of other Presidential vehicles, including a Marine One helicopter and a Presidential limousine. As a bonus, the gift shop sells Jelly Belly jelly beans, the President's favorite. We are Simi Valley residents, so we take regular advantage of the discounts available to members and frequent visitors.\nShow less"], ["Reviewed December 19, 2017", 5.0, "When in-laws and family visit this is the go to place", "When in-laws and family visit this is the go to place. I can return again and again simply to view Air Force One. It is still incredible how they landed it on the mountain top. Great collection of Reagan memorabilia and an interesting gift shop."], ["Reviewed December 19, 2017", 5.0, "Great educations and informative look at the Reagan presidency", "I was moved to tears in the part of the exhibit that dramatized the assassination attempt, and so grateful to have had him as president in cold war \"Tear Down This Wall\" exhbit."], ["Reviewed December 18, 2017", 4.0, "Love the patio", "We like to go there to the cafeteria and eat on the patio overlooking the conejo valley. Food is either premodern or you can order food while you wait."], ["Reviewed December 16, 2017", 5.0, "Tribute to Ronald reagan AND a great window on the world of the 1980's", "This is one of the better presidential museums/libraries. Even if you are not a Reagan fan, the insight into the president's life and role are worth the visit. The only place you will ever be on board Air Force One. Many excellent travelling exhibits as well. Just looked at the Titanic exhibit and learned about the how/why it was discovered...another cold war secret unveiled!\nShow less"], ["Reviewed December 10, 2017", 5.0, "Amazing visit with History!!", "What a fantastic facility!!!\n\nMy wife and I spent four hours here, touring all the exhibits, and though we saw pretty much everything, we easily could have spent another 1-2 hours to fully immerse ourselves in the fabulous exhibits, including AIR FORCE ONE, BERLIN WALL, and many others.\n\nWe were able to see the special Titanic exhibit, which closes Jan. 7th, and we’re glad we caught this. This is a 10,000 square foot exhibition which tells the story of the unsinkable ship in a way no museum has done before.\n\nIt is rare to have such a museum, a U.S. President’s Library & Museum, so close to a major city, and yet with the great attendance on the Veteran’s Day holiday, we never felt crowded or rushed.\n\nStaff were great throughout our entire experience…starting with Melanie in the Marketing Outreach department, including Visitor Services, and the many gracious docents and volunteers that add so much to the museum.\n\nThere are lectures and other specially planned events throughout the year. There are multiple cafes and even a place for beer in the pub. The grounds are exquisite, and views atop this hilltop surrounding the Simi Valley are breathtaking.\n\nThis is a MUST visit for everyone, both U.S. citizens, and visitors from around the world.\nShow less"], ["Reviewed December 7, 2017", 5.0, "A must-see in Simi Valley.", "Beautiful surroundings and a building full of presidential history make for a wonderful visit. Being able to tour 'Air force 1', the actual airplane that carried Reagan around is an added treat. itself."], ["Reviewed December 6, 2017", 5.0, "So worth the visit!", "I am so happy that I took the time to drive to this amazing Presidential Library. I'm sure you could take an hour or two but I filled 3.5 hours walking through the exhibits and listening to my recorded information. It was just amazing and beautiful in every way.\n\nI highly recommend the trip - the value is excellent and I actually purchased a family membership with the hope of returning soon with my family.\n\nJust a beautiful spot and a wonderful tribute to an amazing man and a wonderful couple - I loved how much Ron loved Nancy. It was obvious.\n\nThanks for all you do!\nShow less"], ["Reviewed December 2, 2017", 3.0, "Expensive Museum Visit", "This museum was expensive at $29/senior admission, and they tried to upsell (make a donation, buy a ticket for all presidential museums) us before we could even pay. The museum is lavish and reverential of Reagan and wife, and full of docents, some helpful and some bossy. There was an unconnected visiting exhibit on the Titanic, linked to the movie. The museum was well done, with the ability to walk through an older Air Force One jet and Marine One helicopter, assuming you could avoid the pop-up photographers wanting to sell you a photograph entering the aircraft.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Nice side trip", "Visiting Simi Valley, took my wife to see Air Force One and the Titanic exhibit. Very nice, good experience."], ["Reviewed November 19, 2017", 5.0, "Excellent museum and repository for Ronald Reagan's life and presidency.", "An excellent museum experience for the whole family. The tickets are moderately priced but well worth it! The highlights include the Oval Office replica, a walk-thru of the Air Force One jet and helicopter, and the Titanic Exhibit which may be temporary (not sure). Many other points of interest. A must see in the Simi Valley/Thousand Oaks/San Fernando Valley area for sure.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Visit to Simi Valley to see a bit of History.", "An interesting place to visit having lived myself through all of the events on display here. When going through the Presidential Aircraft one of the guides mentioned he was originally from Kirkcaldy having emigrated years ago. Just cannot get away from Fifers."], ["Reviewed November 18, 2017", 5.0, "Amazing........", "This was absolutely an incredible experience for both the adults and kids. Even though we were on vacation we managed to get a little education in without the kids even realizing. Getting to walk through an actual Air Force One and Marine One is a once in a life time experience. Looking back on the time when Reagan was President quite the history lesson. You forget everything that happened and the library brings it all back. The view overlooking the library is absolutely beautiful.\n\nIf you are not sure whether to go or not.....do it. You will not be disappointed no matter what side of the aisle you are on.\n\nGets me thinking what Trumps presidential library will consist of. Lol.\nShow less"], ["Reviewed November 16, 2017", 5.0, "TEN STARS!!!!", "I would give the Library 10 stars if I could. We toured the Library mid-November and mid-week when it was 72 degrees outside and very uncrowded. First of all, the views from the Library to the hills of Simi Valley are stunning. There are several spots where you could bring a picnic lunch if you were so inclined. The architecture of the building is fabulous. As you enter the courtyard, it is a bit reminiscent of the California Mission at San Juan Capistrano. But when you get to Air Force One, the architecture is quite modern, with the plane elevated and facing toward windows that face the mountains such that it looks like it is ready to take off in flight. I did not find the admission fee to be expensive for what you experience--and you can shop around for savings. At the time we went, Costco had admission for two that included audio and also entrance to the Titanic exhibit for $50 for two. You can buy regular admission online or in person. We bought in person because buying online asked for your time of arrival, and since we were coming from San Diego, we didn't know when we would arrive. The line for prepurchased tickets was longer than the line for purchasing on the spot, although neither line was more than 5 minutes. The exhibits are very well done and give a very honest perspective of the man and his values. I knew most of the information since I have lived in California all of my life and he was our Governor as well as our President. For the reviewers who feel this the library is propaganda of Reagan--I respectfully disagree. He became President when interest rates were 18%, jobs were scarce, inflation was rampant and the geopolitical scene was frightening. People were scared and pessimistic. When he came into office, inflation was over 12%, unemployment was 7.5% and the top tax rate was over $55%. When he left, inflation was about 4.5%, unemployment dropped over 2% and mortgage interest dropped from 15% to 10%. His free market policies worked at home, and his geopolitical policies worked outside the U.S. He was a very optimistic man despite governing during very trying times.\nThe Library houses some very interesting letters written by Reagan, that show that he was a clever writer as well as a great speaker. This shows that he wrote many of his own speeches. There are interactive exhibits where you can play an actor with him in a movie, delivering your own lines; or you can pick stocks during his reign and see how your portfolio did during his 8 years in office. The Library displays the suit he wore during his assassination attempt, as well as the gun Hinckley used. There is a lifesize replica of the oval office that is a few feet below the visitors. The docent explained that when Reagan saw the replica, he said it looked like the ceilings were not tall enough. Administrators called the Oval Office and asked for measurements and found that Reagan was correct, but they told him that they could not raise the ceiling because of permitting problems.\nHe said \"Start digging.\" (Which they did). The coup de gras is Air Force One that has a huge wingspan, since it is a 707. It looks like it has just been polished by hand. It was used by several Presidents--some after Reagan, so procuring it for this Library had to have been quite an accomplishment. There are several police cars, a limosine and Marine One (used by Johnson). I found all of these to be very interesting. We had lunch next to Air Force One at the Ronald Reagan Pub. It has self-service items. The wood inside the pub was transported from a pub in Ireland where Reagan visited his roots. When the Library was being built, a trustee learned that O'Farrell's Pub in Ballyporeen Ireland was recently permanently closed and the owner was going to sell the fixtures. The Library bought all of them--hence the Guiness advertisements and beer taps and gorgeous mahogany bar and barstools.\nOutside is a piece of the Berlin wall--stark concrete on the East German side and large pink flowers on the Western side. There is also a replica of the south lawn and the rose garden of the White House, as well as the memorial where both Nancy and Ronald Reagan are buried.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Must see!", "Family road trip purpose to see Reagan Library Museum. It did not disappoint. The location/vista seems so appropriate to the man: rustic canyons. Beautiful building and layout. We loved the 'interactive' format. We loved all the local schools that were there on a field trip: lucky students! All facets of Reagan's life were perfectly balanced with archives, historical memorabilia, information, etc. This was a 5 hour drive and chances are I won't be back, so I took advantage of seeing everything, taking my time. Total took 3-4 hours for our group. One comment that irked us a little happened in the gift shop: a 'salesperson/volunteer' was way too overbearing. Chatty, in our face, to the point of hyper. Older lady. It made my elderly mother nervous and annoyed me. Let the people browse and look at things. Regardless, we all spend a fortune in the gift shop :). Small cafe had a nice assortment of premade sandwiches, fruit cups, etc. We are fans of the Reagan era so loved it!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Educational and Stunning", "Spectacular views that are absolutely breathtaking. The museum is extremely well done. It was really exciting to be able to walk on an Air Force One plane. The staff is friendly and informative throughout the museum. The food at the cafe is really delicious. The service at the cafe is friendly and fast.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Titanic memorabilia & learned about the Reagan's history", "We came to see the Titanic exhibit which has one room of artifacts with information about the person they belonged to which was interesting. I learned some things I did not know even though I am a Titanic fan so appreciated the other part of the exhibit about the discovery of Titanic. The museum gift shop has some great things to browse and consider for purchase relevant to the Titanic - I came home with a bag full of goodies! The Reagan library portion of museum was larger than what we anticipated and we enjoyed the many exhibits. I especially liked viewing the display of some of Nancy Reagan's dresses. Being able to go through Air Force One was cool and informative and there are elevators for those with mobility concerns. The cafe at the museum was very good with reasonable prices and an awesome view. We enjoyed the trip and would recommend seeing the history and displays on former President Reagan's life from birth to death which was interesting and well presented.\nShow less"], ["Reviewed November 15, 2017", 5.0, "1st time visit", "I enjoyed my visit here. I did not know it also came with a surprise. The museum also has a great displace of the Titanic artifacts and history of the discovery of the sunken vessel. The museum has a great lay out of the life of Ronald Regan and his love of his country and wife. A lot of interest things and friendly staff to explain things along the way through. The display of the limo and the Air Force One were really neat as well. There are a lot of place to sit and look at the reason why The president chose this place to be his final resting place. What a cool place with the mountains around the whole area. Kid of pricey to get in but worth the money. What a remarkable journey you get to read about through the buildings. I will return when I am in town again.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful Setting and Air Force One", "My veteran friend and I visited the Library on Veteran's Day and he received free admission.\nParking lots were full so we had to park on the side of the road and take a shuttle bus to the museum. All the cars were parked on only one side of the road and very crowded. One of the shuttle driver's stopped to inform us that one can park on either side of the road and he didn't understand why no one was on the OTHER side of the road. Good clue. Once parked, a shuttle bus picked us up and drove us to the library entrance. If you park on the street, remember to locate the bus stop that is nearest to you so when it is time to take the bus back to your car, you can tell the driver which stop you are near.\nThe Titanic Exhibit was also available but we chose the Reagan Exhibit. There was A Christmas Tree exhibit included in the tour but we did not view it. There was so much to see just in the Reagan exhibit. At the beginning was a short video about the Reagans. The exhibit is in several rooms. No flash photography permitted. One may view pages of The President's daily diary, you see his daily agenda, also a few of First Lady Nancy's gowns, dinnerware, gifts received from visiting dignitaries. View short descriptive videos throughout. Then you come to the HUGE, HUGE hangar wherein you find magnificent Air Force One. Line up to board the plane and there is an option to have your photo captured by a professional photographer but you are not obliged to purchase the photo that will be available at the end of the tour. Air Force One was the highlight of the tour for me. After exiting the plane, if you go down to the ground floor, you may view Presidential vehicles, including limo and motorcycle. There is a pub where a bite to eat and beverage available for sale. The grounds are beautiful. We finished our visit in about 2 hours but I believe if you are a real history buff, you could easily pass 4+ hours enjoying the exhibit. Upon exit from the tour, there is a beautiful monument of the Reagan's and it is okay to photograph this....you could place yourself next to the Reagan's and capture a special memory of your visit.\nShow less"], ["Reviewed November 14, 2017", 5.0, "something worth remembering", "We visited this place coming from Atlanta Georgia. Its a long ride but its worth a visit. It took us around two hours inside the Ronald Reagan Presidential Library and Museum. A must visit for those visiting United States.I come from the Philippines that is why I enjoyed every place in the Museum.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful Place To Visit", "I attended the Ronald Reagan Presidential Library on Saturday, November 4, 2017 with my senior club. The weather for this day was wonderful. We arrived around 10:30 am and left at 4:00pm. The Titanic exhibit with real artifacts with real stories of the unsinkable ship was fantastic. The Reagan Library exhibit was wonderful also. The Oval Office and so many other items to see regarding his life, Nancy, etc. Saw the Oval Office, was able to board Air Force One and also the presidential helicopter. The grounds are just beautiful, peaceful and quiet. Lots of walking but enjoyable. The trip was an adventure and I believe, if you go, you will have a wonderful experience. Enjoy your day and visit.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Worth the trip", "Wonderful museum and very informative with many videos and artifacts about Reagan's history. Enjoyed the entire tour and having Air Force One and helicopter there to tour was a bonus to all the history. Would definitely recommend and encourage visitors to plan for a long visit so they can take their time seeing everything. Was an honor to visit.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Awesome place", "First, beautiful location, beautiful grounds and fantastic buildings. They have done a excellent job sharing the life and story of President Reagan. It is such a encouragement to see how President Reagan was so invested in communicating to the American people.\nThe Titanic exhibition was great also. This is a must do ,if for nothing else to get a glimpse of history.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Amazing!!", "We went on November 10th and they had a wonderful Veterans Day special. All veterans received free admission. The Air Force One walk thru was amazing and i loved all the exhibits"], ["Reviewed November 10, 2017", 5.0, "We wanted to see the Titanic exhibition.", "The location is spectacular and we have attended many events there. Our Granddaughter said it was unlike any other library she has been to."], ["Reviewed November 10, 2017", 5.0, "A memorial to commemorate the life of a US President", "A nice hilltop serene location presents the life, activities and memorabilia of President Reagan. Tour the facility, speak with the guides. visit the Air Force One wing, then grab a bit and a drink and take in the peaceful setting that is the resting place for a President. Simple, yet a powerful symbol for one person's life who led a strong nation during good times.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Third time visiting", "We have visited the Ronald Reagan Museum three times already and always enjoy going. The location with the view is beautiful! The only reason I gave the review a 4 instead of 5 is because of the admission fee."], ["Reviewed November 8, 2017", 5.0, "Fantastic History and Beautiful Setting", "The Reagan Library is set in the rolling hills north of Los Angeles. The facility is beautiful, with nice views of the mountains, a stunning glass atrium that houses the actual Air Force 1 plane that many presidents, including Reagan, used. The presentation of Reagan's life and especially the time as president is extremely well done. There is a replica oval office and the White House South lawn is copied. This is right next to the memorial where the president and former first lady are buried. Well worth the visit.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Interesting", "Enjoyed the visit here as it had different things to see versus the other presidential libraries. Enjoyed the most seeing the Air Force One and Marine One. Gave you a inside perspective of how the president travels. The motorcade car was interesting to see also. There were many school kids the day we visited, so at times, your patience would be exercised as you couldn't read or look at something as they would crowd you out. Overall, glad I got to experience this library\nShow less"], ["Reviewed November 6, 2017", 4.0, "Interesting and informative", "Anyone interested in Ronald Reagan should visit (though don't expect an objective look at this president; you'll walk out with the idea that he was a hero). Lots of information, memorabilia, etc. The staff (all of whom are volunteers, apparently) are well informed and very helpful. The entrance fee is pretty high ($29 per person) but you can easily spend 3-4 hours at the library/museum, and the special exhibits (Titanic in my case) are quite good. It's a bit confusing to navigate the library/museum, even with the map -- this was probably the biggest negative, as we found ourselves walking in circles more than once. Beautiful grounds -- the locale itself is magnificent -- and definitely interesting for anyone interested in US political history.\nShow less"], ["Reviewed November 6, 2017", 4.0, "Ronald Reagan Presidential library", "A very impressive place to visit. You will see here the Air Force One and even go inside of it. And you will also see the other presidential vehicles. They also have refreshment area. The food there is ok. A very nice place to got to and learn about the time of President Ronald Reagan.\nShow less"], ["Reviewed November 5, 2017", 3.0, "A few excellent exhibits in what was otherwise more of a shrine than an educational experience", "First, what I loved--the setting in Simi Valley is spectacular and breath-taking and the building is designed to take full advantage of the views. Any opportunity to walk on Air Force One is a tremendous thrill and the entire presidential vehicle display is fabulous. The docents were friendly, helpful and knowledgable. Finally, there is an exhibit about the history of the Secret Service, only tangentially related to Reagan, that is well presented and taught my quite a bit.\n\nThat said, having visited several presidential libraries, this is the first time I felt the need to pull out my phone (free wifi!) to do my own research because it seemed life information was missing or biased (it was).This museum will be loved by fans of Reagan, it will leave fans of history and the presidency disappointed. Unlike other presidential museums, there was very little information about the historical context of the Reagan presidency, the challenges of being president or the issues that Reagan grappled with. There was no context for how and why he made the decisions that he did. I felt like the theme of the museum was \"He loved his country, Nancy and God, so everything was always perfect.\" No person or presidency is perfect and this museum did not give visitors the opportunity to know Reagan as a real, flawed, human and clearly neglected to mention anything that would make Reagan seem anything other than saintlike.\n\nAdmission is pricey compared to other presidential museums (and they try to get you to spend more money paying for your picture with the plane and helicopter!). I have an membership to the Eisenhower museum so my admission was free. The gift shop is well stocked, with great options. It is great to have two restaurants in the museum, both with inspiring views, but the food is pre-packaged cafeteria fare, nothing special. I am glad I went, because of the positive aspects I mentioned above and because I aspire to visit all of the presidential museums, but this has been my least favorite so far.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Outstanding exhibitions and views", "This normally is not the type of thing that I would look at but we went and I was amazed. The spectacular views of the surrounding coast and mountains are excellent then you have the great library of this deceased President. He lived at exciting times and it is all documented on site complete with his Oval Office and Air Force One. I really enjoyed the displays and the information.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Big and impressive library and museum, as one might expect", "The Ronald Reagan Presidential Library and Museum seemed like a bit of a drive from downtown Los Angeles, but some of that is just the challenging driving one experiences when you are from back east. I got stopped for a good bit because of a wild fire in a canyon I was driving through, but this, I suppose, added to my SoCal experience. The museum is nice and spread out, unlike others that are kind of cramped and closed in. The scenery from the high location of the museum is most picturesque and impressive. They had some nice visitor interactive displays that were fun. Of course the wing that showed the cars and helicopter and Air Force One was certainly impressive. Always fun at any presidential library is the rotating gallery that features changing exhibits. When I was there in (actually November, 2015), there was a display of the history of football. I even met some other visitors that came from Michigan, which is where I went to college. Dining at the cafe was quite acceptable as well.\nShow less"], ["Reviewed November 1, 2017", 5.0, "There's nothing like walking on Air Force One", "Ronald Reagan is one of the more popular President’s in modern history and his library reflects this. After winding up a huge driveway which showcases Presidential history, you’re greeted by a rendition of The Gipper. The museum begins with a short video and takes you through a tour of his history. Everything from Reagan’s life as an actor to his famous “Tear Down That Wall” speech. After the museum, you’re brought into one of the most magnificent rooms I’ve witnessed. A 90,000-square foot hangar, with glass windows, overlooking Simi Valley is home to THE Air Force One that Reagan used while President. The best part, you get to walk through the plane. Afterwards, you can check out the Marine One Reagan used, as well as some automobiles that were in use during his service. After, head outside where you can pay your respects to President Reagan and his wife.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Far More To See Than I Expected !", "I can't comment on the entry price as my host was a member (and I think we got in free). But the sandwiches & coffee were tasty and nicely priced. I didn't opt for the recording gizmo guide - and you won't need it either. Everything is laid out so well that its dead easy to follow - and the docents fill in the gaps, if you occasionally have a query. I was particularly impressed by the Gorbachev section, and the Air Force One visit - and while I have no experience of other Presidential Libraries to compare it against, the detail, the overall layout and the setting are all impressive. A highly informative and very enjoyable visit - if you're anywhere in the region - Recommend.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A Pleasant Surprise!", "This was my second visit to a presidential library, but a first for the other 4 people in our group. Even though we are all diehard Democrats, we had a lovely visit! The grounds are beautiful, the staff was extremely helpful & informative, and the grounds were immaculate. We felt they pretty much captured the essence, class and sense of humor President Reagan demonstrated while in office. Highly recommend. We spent 2 hours even though they recommended 3 to 4. I would suggest you plan for 3 hours. We would have stayed longer but didn’t have the time. We liked it so much that the other Presidential Libraries are now on our bucket list.\nShow less"], ["Reviewed October 29, 2017", 5.0, "1st visit", "We have never gone to a Presidential Museum before and this one set the bar high. It was a 108 degree day and walking around the beach was not very inviting. We chose to go where there was air conditioning. It is a bit pricey, but at the end of the day we enjoyed our trip.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Wonderful Day Trip", "This was a wonderful surprise, and were there much longer than planned, but so glad we did. This is a beautiful library, with so much to see, starting at the very beginning of Reagan's life. The cost was more than we expected, but worth the money. We were able to spend the night in Simi Valley so we were there when the library opened. We also paid for the recorder, but I found that reading the signs were sufficient. You are able to go inside Air Force One, and the helicopter. We purchased a sandwich to share at the food shop there, and the price was good, and there were plenty of places to eat, inside or out with a view. We were also able to see the Titanic Exhibit, which we spent another hour or two viewing. There are many docents there to answer any questions you might have. In fact, some people had private docents, which might be worth checking into ahead of time. I would say it's a good activity for the day, but plan to spend at least 4 hours to see everything.\nShow less"], ["Reviewed October 27, 2017", 5.0, "A Must Visit for Reagan Fans, and All Who Were Too Young to See Pres Reagan in Office", "A sizeable portion of our current electorate know nothing of the man who was a decent Hollywood actor, a convincing and trusted corporate spokesman, a union president, a two-time governor of California, and yes, a president of these (now somewhat) United States.\n\nThey -- and all of us who ever had the privilege of voting for Mr Reagan for President -- must put a visit to the Reagan Library on their bucket list.\n\nIt's a tour de force of Reagan the man and his philosophy, and the incredible impact that that philosophy had on America and the World. Reagan's influence on world events cannot be overstated. He looms as large and as important an American President or world leader as any other person in history.\n\nSo much of the museum will be an absolute shock to Millennials, who haven't been taught true American history nor been taught about Reagan's incredible accomplishments.\n\nThey'll see how a real man, and a true leader, stands up to tyranny and oppression instead of trying to placate despots with bribery, capitulation and \"diplomatic patience.\"\n\nThey'll see how a real politician, who desires to enact policies he believes are best for the country, will take his case directly to the people and get their support -- not stuff the federal benches with liberal progressive atheists who'll effectively write law in order to promote a liberal president's agenda.\n\nThey'll see the heart-warming wisdom and charm of a man who could communicate better than any other politician in history (yes, even better than Slick Willie); but who possessed a hidden anvil hammer of a conscience that would not yield on his moral principles and would guide his actions in the face of America's enemies, both within and without.\n\nLots of great exhibits and multimedia videos will mesmerize you. Especially great is the actual Air Force One and Marine One aircraft -- both of which you can walk through.\n\nBring your camera and a wide angle lens, but no flashes! You're gonna need all day to absorb everything. And then, after making your way through all this history, step out into the California sunshine, make your way over to Ron and Nancy's graves... remove your hat... bow your head and thank God that Reagan was able to give eight years of his life to revitalizing this great country.\n\nIt’s appropriate that the Reagan Library is set atop a hill… in the state that he and Nancy loved so much.\n\nA must visit. God bless Ronald and Nancy Reagan.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Impressive", "While in the LA area, we visited the Reagan and the Nixon Library. I preferred the Nixon library which is very bright and fresh with attractive and interesting exhibits. The Reagan is darker with too much mythologizing. Air Force One, the pub from Ireland, and the current Titanic exhibit are all good. Much more expensive than other presidential libraries.\nShow less"], ["Reviewed October 25, 2017", 5.0, "The Air Force one is REAL", "this is museum that preserve all the history well and most of the things are not replicas. The air force one alone is worthy to pay a visit. The staffs inside are kind and decent elderlies. Give us a sense of the greatness of the America during the visit. After the closing of the museum, my one-year old kid can spend his time in the large garden.\nShow less"], ["Reviewed October 24, 2017", 5.0, "does you heart good to come here and listen once again to his voice of reason and calm", "This was a post wedding event for my daughter, her new husband, my husband's brother and wife and us. Yep, it was on Monday after a Saturday wedding so where else do you go but a place that has a lot of love in it.\nOnly my bro-in-law and wife had not been here before but they like to do Pres. Libraries. We all love this kind of place.\nThe exhibts are well done and grouped in such a way as to make sense and easy to follow his life.\nThe most fun was making our own dinner place settings etc with the interactive board that takes 4 or 5 people.\nThe display of saddles is neat.\nIf anywhere in Southern CA you really have to go here regardless of your political affiliation.\nThe grave site is hallowed ground and when I was there again this time, my minds eye still can see Nancy lay her cheek on Ronnie coffin and kiss it. and I cry all over agian as I am doing now as I write this.\nThey were two most wonderful people and this world is a better place for them, especially him being here\nIf you read my review, will you please give it a thumbs up? Thanks\nShow less"], ["Reviewed October 24, 2017", 5.0, "Excellant way to spend the day.", "The Ronald Reagan Presidential Library is a great way to spend the day. There is so much to see and learn."], ["Reviewed October 24, 2017", 5.0, "What a Patriot", "It is easy to forget some of the details of that era, but the library brings back so many of Ronald Reagan's accomplishments in life. Not only as President, but as CA Governor and as a genuinely wonderful person who had a lot of empathy for all.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Great Way To Get and Learn History", "The Library has various exhibits through out the year that are exceptional. It also has a full Air Force jetliner that Pres. Reagan used as President."], ["Reviewed October 20, 2017", 5.0, "Fantastic Presidential Library!", "This is our 4th library and the largest we've seen. The setting is marvelous. Air Force One is a great draw, of course, as is Marine One. Excellent film to start and very good retrospective of his early years. There is a plethora of memorabilia and video clips. We also went to the Titanic exhibit, admittedly not something I'm terribly interested in but very comprehensive and well done. We had a little meal at the Reagan Pub, which was fine. I would allocate four hours or more for your visit. Really tremendous.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Beautiful setting for a wonderful tribute", "We spent over 4 hours walking around the library. The exhibits are wonderfully designed. It was a nice trip going back to our time with this president. I am proud to say he was my first presidential selection. What help make this last trip special is both Ronnie and Nancy are now there to stop and visit with. Good job and RIP.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Full Day - be prepared to spend time!", "This is by far the biggest presidential library we have visited (#4). We knew from doing a little research, the size would be bigger as it houses a retired Air Force 1 airplane (which you get to enter). It also has a helicopter & guess what, a lounge! We enjoyed a beer & snacks at the lounge. Because of the size (and time it takes to tour) there is also a restaurant. Back to the library. The setting is gorgeous. I guess we should have expected nothing less. The library was very well laid out and we enjoyed the tour. There was an add on - there was an exhibit of the Titanic while we were there. Apparently the exhibit rotates. You could easily spend a full day if not more here.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Wow what a great tribute to a president!", "Get there early and spend all day there and learn from this great president. Spend the 37 dollars for the Audio tour. This place is unmatched in beauty and history."], ["Reviewed October 18, 2017", 5.0, "A lot to see", "I am not a Reagan fan but since I live in SoCal and was driving to Santa Barbara it was along the way and I thought I should check it out. I was kind of biting my lip to avoid saying sarcastic things but as I progressed through I found it interesting and it refreshed my memory on many events I had almost forgotten such as the assassination attempt and his acting career. Seeing the information on those events was interesting. We were there three hours including lunch. We then spent another half hour rushing through the titanic exhibit. If we had read everything and took our time in both the Reagan and Titanic parts we could have been there twice as long.\nAir Force One was interesting to see. Also seeing all the secret service vehicles etc was nice to see.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Wow, you don't have to be conservative to enjoy.", "This place was fabulous. Full day of exploring. 10am to 4pm. Started with an exhibit about the Titanic. I've seen one before, but this one was better. Lots of video from Ballard on his Top Secret mission to find the subs, then on to find the Titanic. No actual artifacts as they're not doing that, but stuff that floated on the water and other from White Star Line.\nThen on to the museum. Little kids will be bored, but my tween granddaughters were engaged with all the personal stuff that is there.\nDecent eating facility that actually tasted good and not too expensive.\nThen on to his Air Force One plane, the actual one, and you board and walk through it. Downstairs to Marine One, and a cold Guiness in an Irish tavern from Ireland. Next is back upstairs for the rest of the museum. Lots of accomplishments, problems, accepting responsibility, and finally his last days.\nI recommend!\nShow less"], ["Reviewed October 17, 2017", 5.0, "One of the Finest Museums", "I was so impressed with the respect and honor given to such a great man. They not only focused on his life but Nancy's life as well and their life together. He truly was a great man and President leading this country through some difficult times relying on his honor and values which you can clearly see on the tour. Air force 1 is also a great addition to the tour.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Highlight of Our Trip", "We were overwhelmed by this experience. The library truly encapsulates the Reagans values, love of America and each other. It is inspiring and hopeful. The grounds are lovely and the cafe is delicious. Do not miss. Recommend going at opening time."], ["Reviewed October 16, 2017", 5.0, "Plenty of thing to look at!", "We were there 5 hrs!! Beautiful grounds, Titanic Exhibit. My husband loved Air Force One, Marine One & the Presidential limo. Very large buildings."], ["Reviewed October 15, 2017", 5.0, "A Classic Library for a classic president", "And First Lady as the story of President Reagan is also the story of his life with Nancy. The Library setting is majestic and befitting this outstanding president. From childhood through every time in his life, we learn what shaped “Ronnie”. All citizens of our country and around the world need to go here. Appreciate his leadership. He fought communism yet formed such a strong bond with his foe Gorbachev that he came for Ronnie’s funeral. Remarkable Library. Walk through the actual Air Force One he used. We spent 6 hrs there!!\nShow less"], ["Reviewed October 14, 2017", 5.0, "A peek into history", "This was a family trip to the library. We have thought about going many times and finally just did it. We are so glad that we did.\nWe all loved looking at Reagan’s life from the beginning through his school years, acting, governor and then onto the Presidency.\nThe one common thing that I came away with is Ronald Reagan had a desire to make things better. He really truly cared about people and his country but it was more reaching than that. He loved mankind with one of his motto’s “It CAN be done” resonating with me.\nI was just a kid when he became president but he left an impact that is forever documented at his library and in history.\nThey had a special exhibit, Titanic, that was enjoyable. They had movie set items and then another floor with actual artifacts. It is cleverly put together.\nWe got there early as the website indicated parking could be an issue. We found this not to be the case today, Saturday.\nWalking through the exhibit did not feel crowded either.\nWe opted to eat at the cafe and it was delicious and only slightly pricey. There are many items to chose from on the menu and it is prepared to order there is also ample seating.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Honor, Taste, Integrity, Great Memories", "Excellent look back at the Reagan years. This exhibit takes you on the journey through his life as well as Nancy's. Very thought provoking walk down memory lane. Plan to spend the day because there is a great deal to see. I especially enjoyed Air Force One, as well as all of the Secret Service automobiles. Several short movies guide you from one era to the next flawlessly. Be sure and take time to enjoy lunch at the upstairs cafe, great choices for light meals and seating is plenty. We enjoyed eating outside and taking in the beautiful panoramic views. At this time the Titanic exhibit was being shown as well. Great detail not only about the actual discovery, but artifacts real as well as recreated by James Cameron.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Time for reflection...", "Everything to do with the former President and First Lady are available. During our visit, the Titanic artifacts were on display.\n\nAmazed to see the \"old technology\" on display, which was state-of-the-art at the time.\n\nOverall, allows one to visit and reflect on the history of the United States.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Tour", "What a great day for a tour of the library. Wish we had more time. You could spend all day here and Enjoy reading all the information given. Great place for lunch and beautiful view from patio !"], ["Reviewed October 13, 2017", 4.0, "HISTORY", "Be sure to get here early, in order to see every thing. Even though I lived through his era, I have forgotten a lot of what actually happened. The displays are very well presented his & it takes a while to read every thing. Especially interesting were the 707 Air Force One, and Marine One helicopter.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Where is Ronnie when we need the most!", "In this very divisive period in our Nation, it was a HUGE mental relief to visit the Reagan Library. Amazing that so many of the things that President Reagan wanted to change (big government, high taxes, declining military, etc, etc etc ) still are a problem . . .was just soooooooo uplifting to spend a day here.\nShow less"], ["Reviewed October 10, 2017", 5.0, "A worthwhile experience for families", "This presidential library is on a magnificent setting in Simi Valley. Many displays are interactive, making them informative and engaging for adults and children, probably from age 7 on up. It was quite an experience to actually walk through Air Force One, the plane used by a series of presidents. Marine One, the helicopter used by President Reagan, is also on display, open for visitors to walk through. It's like going back in history, to actually walk where presidents walked. Get refreshments at the cafe, and keep going! Plan on spending 3 hours, minimally. Longer if you can. Well worth it.\nShow less"], ["Reviewed October 10, 2017", 4.0, "GREAT EXPERIENCE & SENSE OF A MAN", "The Reagan Library is worth the visit. The views of the California landscape is inspiring & seeing Air Force One & Marine One in the building was something. For me, reading the thing that Ronald Reagan , the man, wrote & said are real & inspiring, even if you do not agree with everything he believed. He truly believed in America & its people, & he clearly loved Nancy.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Presidential Libraries", "This library was set up very nice. You can find out a lot about the presidents by visiting their libraries. This had very nice grounds as well as letting you know more about the president and first lady."], ["Reviewed October 9, 2017", 5.0, "Outstanding, must see museum", "The Ronald Reagan Library and Museum was a number 1 destination for our trip to California and it proved to be the highlight of our journey. I will admit I was already an admirer and my wife was fortunate enough to work in the White House during his tenure, thus had very personal reasons for loving the Reagan. Nevertheless, this museum is simply worthwhile for anyone who cares about our country and its history. Having a \"retired\" Air Force One on site added a great deal for most visitors who likely never have had an opportunity to be aboard. The new exhibition on the Titanic was very informative but does not add much to our knowledge of Reagan. I would have rather seen the time and space used more directly to include more information about him and his life.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Well Done", "The setting is beautiful and fits the surroundings. Wonderful drive from the coast. The Air Force One visit is a highlight. Excellent and appropriately-placed quotes, memorabilia, video and timeless photographs. A warm tribute to the character of the man, amidst the challenges of his day. Also, a thorough recall of the background that prepared him for the season of serving. Will certainly return with family and friends.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Just Keeps Getting Better", "It has been a long time between visits and wow, have they been busy adding many great things to see and do at the Library. This is a wonderful place to visit and spend time learning about the President, his family and life and the many contributions they made for our country. Worth the time, drive to visit a very special place.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Glad I finally got over there!!", "This was my first Presidential library experience and I really enjoyed it. And yes, seeing Air Force One was a treat. The building is laid out beautifully, making for a very easy and educational experience. I've been there twice, but we didn't stay on the second visit (Saturday during the summer) as it was packed!!! If you see cars parked all the way down the hill, you can bet it is a very crowded day at the Reagan Library. I'll be back but will try a weekday. My interaction with the staff was wonderful and they were very helpful as I had pre bought tickets online and was unfamiliar with the process. The views are fantastic and late in the afternoon, makes for a gorgeous place to enjoy the sunset.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Planes, Helicopters and Limos", "I was disappointed in the presentation of Reagan's term in office. The displays did not present a concise and clear impression of his accomplishments as president. We have visited over 20 presidential libraries/museums, many of which left us with a clear image of the man and their major accomplishments. The most memorable thing we enjoyed at the Reagan museum was the ability to tour a retired Air Force One plane and Marine One helicopter.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Titanic exhibit is great!", "We have been to the library several times but went today to see the special exhibit of the Titanic. It was definitely worth the trip. It seemed th focus more on Robert Ballard's discovery of the ship but also told of the sinking and rescue of survivors.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Fantastic in Every Way", "The setting, exhibits, pub and presentations are all first class. Allow time to re-live history and enjoy the fabulous setting overlooking the valley. I wasn't much of a TV person, so bringing back memories and learning more about all that he accomplished was amazing for me. Also,seeing how many of his quotes are still relevant today! We spent a few hours there reading and watching videos, walked thru Air Force One & the Helicopter, ate in the pub and took home some fantastic fudge. Time well spent and we were amazed at the many foreign visitors who also enjoyed the exhibits.\nShow less"], ["Reviewed October 3, 2017", 5.0, "a day at the museum", "There were a lot of wonderful. things to see. One of the best ideas was short explanations beside photos and exhibits. Sometimes there is so much to read, you can see as much as you would like. The people working there were 1st class and very knowledgeable. Plan on spending most of a day. They have good food there and a knockout of a view from the outside seating area.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful and informative Presidential library", "On this return visit, we took in the Titanic exhibit and learned so much during our 5-6 hrs there. The Library features different visiting exhibits continuously.\nThere are many artifacts similar to those on the Titanic and much history as to how it was discovered, why the ship was damaged and sank so quickly. All very educational!\n\nYou will enjoy this exhibit. Allow enough time to appreciate it.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Celebrating the life of one of our greatest modern day Presidents", "My visit was a peaceful and sunny Sunday afternoon. Traveling up the long winding driveway to the library I experienced a dramatic view of the Simi Valley, which was even better from the patio behind the main building off the cafe. Having just arrived directly from LAX and a trans-continental flight, I was hungry and headed straight for the cafe. The cafe has two lines, one where you can pick up a quick pre-made sandwich/snacks and the other for made to order grilled items. Fantastic choices and reasonable prices.\n\nOn to the main item - entry was $27 for me and I took the $7 audio tour option, which I would not recommend. I found that each audio station had almost the same information as was on the audio phone. In addition, a lot of the exhibits have video, which makes listening to another piece awkward. The exhibits flow well and you get to experience the life of Ronaldus Magnus, from his early college days right through his presidency. There is a replica of the oval office, a real piece of the Berlin wall (outside) as well as a huge separate exhibit with the original Boeing 707, Air Force One, which you can walk through. In addition, there is a Marine One helicopter, a motorcade and an F-14 (outside - ask a docent to tell you how to get there). You will envelop yourself in the lives of Nancy and Ronnie and be saddened when you get to the end to witness video of his funeral.\n\nI don't know how long this will go on, but there was also a Titanic exhibition there. Fantastic.\n\nIf you go on a sunny southern California day, spend time outside on the patio, overlooking the Simi Valley. It is stunning. Walk through the rose garden and visit the memorial for Ronnie and Nancy. What a feeling of nostalgia and great times.\nShow less"], ["Reviewed September 29, 2017", 5.0, "You will feel good after your visit", "Wonderful educational tribute to President Reagan. Plan on 3-4 hours if you have lunch. Recommend that you join the Reagan Foundation. Free admission for one year and its tax deductible. Friend membership allows two adult admissions and family membership 4 admissions. Plus 10% discount in a very nice bookstore/gift shop and the tasty cafe. Consider visiting Air Force One exhibit first as there can be long lines do to photos being taken. Staff is very knowledgeable and professional. Cafe is top notch., almost everything cooked to order. Book store worth your time.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Air Force One makes this really worth it", "To be upfront, my family loves presidential libraries. We try to see as many as we can. This one was pretty good, but the real highlight is being able to tour Air Force One. That is an experience that is not available at other libraries. Be prepared that the library makes Reagan seem like the best president that ever lived and only touches on his presidency on a superficial level, but it flowed well and held the interest of my children. The view is also spectacular.\n\nJust a tip, even if the sign indicates that the lot is full, take a swing through anyway. We did and there were quite a few empty spaces.\nShow less"], ["Reviewed September 28, 2017", 5.0, "A Fantastic Must-See no matter your political affilation", "On our two week trip from San Diego to San Francisco, we stopped to see very good friends in Westlake, and had not given a thought to this library. Our friend mentioned, so we went, despite my husband's lukewarm desire. True learning experience. The exhibits are first rate - the history of his early career in movies, his SAG leadership, the blacklist etc. Also, he was indeed the great communicator. We spent about 4 hours there, and also toured Air Force1 and the helicopter. The funeral site is such a beautiful, peaceful, and appropriately understated area. Our review is perhaps colored by our boomer ages, Federal govt affiliations, and our interest in political history. But it compares to the museums we enjoy here in DC at the Smithsonian.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Well worth the time", "Really enjoyed this tour. Lots of interesting things to see and additionally got to see the Titanic museum. Learned many things about Ronald Reagan that I did not know. Was not really looking forward to seeing this museum, but am glad we did."], ["Reviewed September 24, 2017", 5.0, "Worth the time", "By all means, when near Simi Valley, take 4-5 hours to go through the exhibits. We lived in that era but had forgotten many of the details of the Reagan presidency. Also on display is the Air Force 1 from that era. It was informative to walk through and it was actually smaller than what I had envisioned. The museum had an extensive display on the Tatanic and how it was found with several original artifacts. Worth the time to visit regardless of political affiliation.\nShow less"], ["Reviewed September 24, 2017", 2.0, "Cosmetic Approach", "Large and attractive, the library and grounds present a grandiose tribute to President Reagan but give short shrift to history. Much of the exhibit space is devoted to Reagan's communications skills and the trappings of the presidency. A portion shows Nancy Reagan's sense of style and honors her devotion to her husband. You will learn little, however, about the significance of the hostages' release on Inauguration Day, the expansion of the budget under Reagan, the growth of unregulated financial industries, the Iran Contra fallout (a small kiosk tells the story and blames others). Even President Johnson, possibly the largest ego to have graced the White House, at his Austin library offered great detail about his role in the Vietnam War.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Awesome Presidential Library", "Great library that tells the entire Reagan story from childhood to President.the views from the library are beautiful.There is the Air Force 1 pavilion where you can tour Reagans 707 plane and presidential helicopter which was very interesting.There is a memorial site where the President and his wife are buried,There is a recreation of the Oval Office which was nice to see. In addition there is a great exhibit on the history of thTitanic which is one of the best I have ever seen including how it was found by Dr Ballard. I would go just to see this exhibit alone This a is a must do site plenty of free parking\nShow less"], ["Reviewed September 21, 2017", 5.0, "Large Museum honoring President Reagan - very cinematic in style", "The museum tells the history of Ronald Reagan from childhood to death (omitting Jane Wyman pretty much), and a very accessible, and dramatic fashion. Lots of film clips and narratives throughout, and great opportunities to see a recreation of the Oval Office and climb aboard the real retired 707 Air Force One and Presidential Helicopter. Staff is very helpful, informative and friendly throughout. Special exhibit of the Titanic (and underwater discovery of two sunken American nuclear submarines) with many set and costume pieces from the film was also very worthwhile. Beautiful setting on top of a hill.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Titanic Artifacts and History", "This is another traveling exhibit to the library. Very fascinating history. Several props and costumes on display from the blockbuster TITANIC movie by James Cameron. This exhibit narrates the finding of the doomed ship. Recommend you also purchase the audio tour as that covers more than the exhibit itself. Give yourselves plenty of time to see and read everything!\nShow less"], ["Reviewed September 18, 2017", 5.0, "A GREAT surprise!", "We had no idea what to expect and we were certainly pleasantly surprised. The grounds are immaculate, the views peaceful and the exhibits are truly inspiring. The bonus, boarding onto an actual Air Force One plane that served various U.S. Presidents. We spent about 3 hours at the museum but certainly could have stayed a bit longer. It truly is a must do!\nShow less"], ["Reviewed September 17, 2017", 5.0, "Absolutely a “Must See” well worth the trip", "Absolutely a “Must See” well worth the trip. The Reagan Presidential Libarary is an amazing place. It’s very informative on all things Reagan. Architecturally it’s interesting, the setting in the mountains is stunning. The areas of information are very well planned, with or without the self guided audio. We did the audio tour. Makes the environment more personal. Air Force One pavilion is incredible.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Fabulous!!", "From the beautiful architecture to the grounds to the innovative exhibits, the entire visit was beyond our expectations. Plan on spending about three hours if you have lunch. . . Which you should."], ["Reviewed September 16, 2017", 4.0, "Stunning Architecture Houses the Reagan Library", "The Reagan Library sits within a stunning building that showcases some of the best of Southern California design. The library is at the top of a hill and uses the spaces beautifully.\n\nThe library moves from room to room gracefully with many videos to enjoy. Air Force One is cleverly on display and is available for a walk through. Also the current exhibition of the Titanic is definitely worth a visit. How the Titanic was found is quite a story!\n\nThere were two problems with our visit. The air conditioning was frigid and should be revisited. Everyone was complaining about the discomfort of the cold.\n\nThe other problem is the dim lighting in the cases displaying the Reagan's gifts and other memorabilia. It's almost impossible to read the cards explaining what's in the cases because of the dim light. Hopefully, this can be corrected!\n\nOtherwise, the library is definitely worth a visit.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Surprisingly enjoyable", "Forget your political affiliation - this place has something for everybody. Located in the scenic hills of Simi, the Library offers a great walk through the history of Reagan and a fantastic finish with the combination of the former Marine and Air Force One's. Not replicas - the real things in all their glory for you to board as you stair out the all glass back wall of the building. We thought we'd work thru the building quickly and spent a half day here. Great part of our trip.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Presidential Library & Air Force One", "This is a beautifully laid out library. It is the third one I've visited, It's biggest attractions are the presidential memorabilia, a complete model of the Oval Office and Air Force One. This is a retired plane so its not as big as the current one. Still quite nice to walk thru and see how its organized. Also there is Marine One helicopter (you can walk thru). Other pieces are a section of the Berlin Wall and a steel beam from 9-11. You cannot walk thru the Oval Office but you get close enough.\nShow less"], ["Reviewed September 13, 2017", 3.0, "Nice library, but rather pricey in my opinion", "My friends and I enjoy visiting presidential libraries. They are historical treasures and being the past back to life. We were very excited to be visiting the Reagan Presidential Library. The museum itself is very nice. But the library is rather expensive - $29 for one adult. By comparison, the Carter Library was $8 for one adult, and the Nixon Library (also in Southern California) was $16 for one adult.\n\nThe library itself is nice, although I wish some of the exhibits focused more on President Reagan's actions and contributions as opposed to the historical events of the time.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Beautiful library", "I've visited several presidential libraries, and this one was by far the best. It is beautifully designed, with interesting presentations and exhibits. It is located in a beautiful area with gorgeous views. It includes a visit to the interior of the Air Force One that President Reagan used, a replica of his oval office, and his grave. It covers his childhood, time in Hollywood, his great love of Nancy, and political life. (Interesting that there was almost no mention of the years with Jane Wyman -- oh, well). There is a lovely display of gowns that Nancy Reagan wore. If you can visit only one presidential library, this is the one!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Worthwhile visit for history and views", "Like all presidential libraries- this one paints a great picture of Ronald Reagan including his early career in Hollywood and the challenges of being a president. My favorite exhibit is Air Force One and Marine One, which you can tour inside, as well as the beautiful views of the Simi Valley foothills.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Marvelous", "Amazing place to visit and get to know a lot more of one of the great figures of the 20th century. Highly recommended, beyond any expectation. In addition, a very nice exposition for Titanic. Do not miss it."], ["Reviewed September 8, 2017", 5.0, "Being a member has its advantages", "It is always fun to take a walk thru the Museum and see the current exhibits. Some might require an additional fee along with your membership, but well worth it. You can stop for coffee and...while sitting under Air Force One and enjoy the view thru the giant wall of glass. And don't miss stopping at the Museum Store before you leave.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Wow! A must see.", "After traveling Route 66 across country, we were ready to explore Southern California. This came up as a top rated thing to do. We had never been to a Presidential Library, but based on the comments, decided to devote 3 hours to explore. Wow! We were expecting a library - however, we never saw a single book - unless you count President Reagan's diaries. This is a fantastic museum that captures his life, his views on freedom, and has many videos of speeches, and important moments of his life. Part of the Berlin Wall is there with the story of the Cold War and the impact he had to help end it. A truly remarkable facility, perched high on a hill, secluded from the nearby community. An added bonus is Air Force One and the ability to walk through it and see this famous American icon up close and personal. Marine One is also on display and likewise you can walk through it as well. The whole facility is just first class. We were very impressed - we need to see more Presidential Libraries. Can't imagine another one being at this level. We spent 3 hours but could have easily spent 5 hours. Get there when they open so you aren't rushed.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Best US Presidential Library in the system!!!", "This is hands down the best US Presidential Library in the system. I spent over 5 hours here and it didn't feel that long at all. The exhibits are all extremely informative and well done going from his childhood and family history, to his movie career, political career, his Presidency and post Presidency. His Air Force One is an incredible thing to see and walk through. Guides and ushers are all on hand all over the library and museum to help answer any and all questions you may have. Enjoy the history of the 40th President of the United States of America.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Beautiful, relaxing and informative", "The Reagan Museum and grounds are beautiful. Set high atop a hill overlooking the Simi and Moorpark valley area. The weather always seems more beautiful there. The self guided tour is great, organized by Reagan's life timeline, with plenty of artifacts and some videos. I especially like the Oval Office, the exhibit around the Assignation attempt and of course the walk through Air Force One. Don't skip the chance to spend some time out by the gardens and the grave stones. It's very pretty and relaxing. I've only been to two \"special exhibits\" that you need to pay extra for (an Abraham Lincoln exhibit and the Vatican Treasures) and both were well worth the additional $10.00. If you decide to visit, plan on getting there around 9:30 or 9:45am as the parking lot fills up fast and you might end up walking up a big hill if you arrive after they open at 10:00am. There are shuttle busses to assist you if you are unable to walk the hill.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Ronald Reagan Library", "Excellent library museum style place to see and remember events of Reagan's presidency. Great memorabilia meticulouslyorganized. The Air force 1 plane and helicopter are part of the great experience."], ["Reviewed September 7, 2017", 5.0, "Best Presidential Library", "First, the scenic views are incredible as the Library is situated at the top of a mountain.\n\nThe facilities are top notch and information content of Reagan speeches and actions are inspiring.\n\nDefinitely a MUST SEE. We moved thru at a reasonable pace - shocked when we completed the tour we had spent 4 hours.\n\nTip: Arrive early - we were able to park close. When we left crowd had arrived and parked on the winding street all the way down the mountain - a long walk.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Excellent, Excellent, Excellent - Must See", "Outstanding collection of Ronald Reagan memoirs, located in beautiful surroundings. The Library is surrounded by beautifully landscaped grounds, located on the top of a mountain with great views of the valley. By far the best Presidential Library I have visited. Must see."], ["Reviewed September 6, 2017", 4.0, "Great library......not so great food!", "This was our 2 new trip to the library. It had been 7 years prior and I had wanted to go back after the burial of Mrs. Reagan. We enjoyed the tour, again. As for the Titanic exhibit.....didn't impress us. We ate in one of the facilities and were not impressed with the food. We actually threw 30 dollars worth of food into the garbage after a couple of bites. This was actually a sandwich for my husband and a salad for myself. I would not recommend eating here while on tour. Other than the food experience, I would recommend seeing this if you are in the area.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Very Interesting", "We had a wonderful time visiting the Presidential library. The location is absolutely beautiful and even if you aren't a Reagan fan it is so much fun to browse through here and learn so much about our country, the past president and see all of the historical memorabilia. Totally worth the trip.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Great day trip- beautiful views", "We stopped on our way to San Francisco and I am so glad we did. The museum was great and we spent our afternoon walking through the exhibits. The kids were thrilled to see Air force 1 and Marine 1. The views from the museum are absolutely breath taking and walking the grounds is a must.\nShow less"], ["Reviewed September 3, 2017", 5.0, "This is a must see.", "Wow ! This is a wonderful experience. The building and displays are second to none. The location is spectacular. Plan for a minimum of 3 hours. I could easily spend two days to really see everything. This visit also included a display (temporary) of the Titanic with the complete story of her discovery. The expedition was actually a cover for the US government's search for Scorpion and Thresher, the two nuclear submarines lost in the 1960s. Fascinating displays and story. Going aboard Air Force One was a real treat. Its a beautiful Boeing 707. Very fascinating to see how the president flies with an airborne White House. The museum is easy to follow from one station to the next with many videos and documents to see. We will return for a second visit in the future!\nShow less"], ["Reviewed September 2, 2017", 5.0, "A MUST SEE!", "As a visitor from the UK I have to confess that I did not know much about Ronald Reagan (the actor) until he became US President during the early 80's. A visit to a Museum/Library...I was a little skeptical (not normally my thing) but I was totally amazed & intrigued for the next 3 hours of the tour. The Reagan life story is portrayed perfectly in this marvelous facility which houses a retired Air-force One in a special hangar alongside the Presidential Helicopter and Motorcade (the first 2 are openly accessible to explore by the public). Staff were great too, on hand to provide in depth information throughout.The grounds are beautifully pristine, this facility is located in a wonderful location with panoramic views of the surrounding mountains. The memorial to Ronald and Nancy is very respectful. A great tribute to the life of this remarkable man and President. Worth every cent of the $29 adult entry fee (and probably more), free parking on site (although limited) We were there on a Sunday afternoon...it was 34C so please brings plenty of consumable drink, although there is food & drink & even a Pub on site too. Highly recommended!\nShow less"], ["Reviewed September 1, 2017", 5.0, "Ronald Reagan Presidential Library and MORE!", "I enjoyed my time at the RR Presidential Library. We arrived at 12n and left when they closed at 5pm. Wish I had another hour. The museum is one of the easiest to navigate. It is very hot in Simi Valley in August, but bring a sweater just in case because it is cool in the museum. I have an annual pass that I purchased at the Ford Museum and I am glad i had it because the entrance fee was a bit hefty. The museum also had a Titanic exhibit that was included in the general admission price but not in my yearly pass. I would not have had time to see it anyway and opted not to purchase the extra ticket to the Titanic exhibition. My husband had to buy a senior ticket and it was 28.00 which included the Titanic. He asked if he had to include the titanic and yes that is the only type of ticket to buy. He went into the exhibit and wasn't overly impressed. Now to the museum. So easy to read and stroll through the library. Starts with the birth of Ronald Reagan to his death. College, Hollywood, governor and President of US. All fantastic. The Air Force One pavilion is amazing. There will be photographer wanting to take your picture, but we managed to by pass that. The airplane is the Boeing 707. Lots of great information on the presidents that used it and how it was taken apart and transported to Simi Valley. There is also a helicopter in the pavilion, along with a nice pub for lunch. The view is fantastic. The grounds are well kept and President Reagan and Nancy are buried on the grounds. I overheard someone saying you need at least 2 hours. Not sure how anyone could see all of the museum in 2 hours. This is my 5th Presidential Museum and Library. One of the best. Although I have to say George W had a very good one also. They all have something special to offer.\nShow less"], ["Reviewed August 31, 2017", 5.0, "A Must Visit", "You don't have to like Ronald Reagan's politics to love The Ronald Reagan Presidential Library and Museum. The fact that you can board Air Force One (and Marine One, although I think more of Nixon with Marine One) is worth the trip and fee. Admission is very reasonable and I even forked over for a family membership. The exhibits are well done. I enjoyed the oval office. Like all Presidential Libraries they kind of gloss over the controversies but it is still a great experience for the entire family.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Republican , Democrat or Undecided, ITS HISTORY", "Great place to spend an afternoon, they have different displays featured, so be sure to call to see what's on display. It's done very well, little kids will like going into Air Force One and seeing Marine One. You can even take your picture with Ron riding a horse. Come on now, doesn't that sound like too much fun?\nShow less"], ["Reviewed August 28, 2017", 5.0, "Wonderful place to visit!", "Fortunately, I live about 20 minutes from the Reagan Library, so it's easy for me to visit. But, for anyone, it is definitely worth whatever you have to do, to get there. The drive up the hill to the library is a winding road, highlighted by flags bearing each of our Presidents in chronological order. There is ample parking, and the grounds are beautiful. The library (really a museum/display forum), is very well laid out, with so many artifacts from Reagan. The belt buckle is my favorite. After you roam through the halls, you can get to Air Force One, which is an amazing sight. Here is this huge airplane right in the middle of the room, You can go onboard the actual plane. There is a cafeteria, as well, with tables indoors and outside. President Reagan's and Mrs. Reagan's burial places are marked. The outside views are beautiful and show why President Reagan picked this spot for his library.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Top Notch - a must see!", "Decided to take a trip to Simi Valley on a recent vacation. This beautiful facility is nestled high in the hills overlooking Simi Valley. It is a beautiful building with a very intense examination of President Reagan's tenure, with great video and pictorial exhibits. Air Force 1 is in the hangar, as is Marine 1, and there is also a small tavern there. A very nice place to visit for a few hours.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Great Museum ! We", "My wife and I throughly enjoyed this wonderful museum. We only had a couple of days in LA and decided to spend time learning a little more about President Reagan. The museum and grounds are beautiful. The staff is completely professional, knowledgeable , and helpful.\nAir Force 1 is a special treat. We also ate at the Reagan Cafe. Food was good and tasted even better eating outdoors overlooking Simi Valley.\nShow less"], ["Reviewed August 27, 2017", 5.0, "A must see in California", "Wow - regardless of your political leanings, the Ronald Reagan library is a must see! The library is set up to take you through all of Reagan's years from the time he was born until his death. It is a fantasizing look at his beginnings, and how they shaped his political views. They even cover the Iran Contra Hearings that happened during his term.\n\nBeing able to walk through Air Force One, and Marine One was really neat. Give yourself at least 4 hours to really see all of it, but spending the entire day will allow you to really dive in deeper!\nShow less"], ["Reviewed August 27, 2017", 3.0, "Well documented, but could've done better!", "We went over the weekend and though we got lucky with the parking, the library and museum are not as impressive. We have visited the Clinton and Carter Presidential Libraries in Arkansas and GA respectively, so our bar was high. While it is a good location and Reagan's life is fairly well documented, the information is not as thorough or as rich as in the other two libraries. Good for a quick visit. I do recommend!\nShow less"], ["Reviewed August 26, 2017", 5.0, "Worth the drive!", "One and a half hour drive south of Santa Barbara. Easy, pretty drive along coast, then inland up into high hill country. The library sits up on the top f a high hill with majestic view of Simi Valley. It is a walk down history's memory lane tracking Ronald Reagan's life. A really classy, well laid out place perpetuating the memory of a really class act President and First Lady.\nShow less"], ["Reviewed August 25, 2017", 5.0, "A wonderful place", "Walking through brought back memories that I had forgotten! A wonderful, comprehensive look at a great man and a great period in our history. Well worth the time. Membership is a very good deal."], ["Reviewed August 22, 2017", 5.0, "Incredible museum", "We arrived at the museum when it opened at 10am, so that we would have plenty of time, which ended up being a good thing because we walked out of there at 5pm! There is so much to see and read and walk through. I loved walking through Air Force One and Marine One. The grounds and the view of Simi Valley is incredible. An equally excellent exhibit was the Titanic that included original pieces from the sunken ship. It was a perfect day. Highly recommend visiting. Now I need to visit them all.\nShow less"], ["Reviewed August 22, 2017", 5.0, "A nice remembrance of the former President", "The long drive to see this attraction was well worth it. The setting is beautiful and the displays inside the museum are well presented. The highlight was to see the Air Force One and Marine One exhibits. As seems to be the case with Presidential Libraries, the former President is portrayed as a wonderful person with flaws notably missing.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Presidential Quality", "The first thing that comes to mind is presidential quality. From the entrance gate, grounds, staff, exhibits, food, all the way through to the grave site, everything was perfect. Respectfully representing a president and his life, from his humble beginnings, family, accomplishments, and later life frailties, the museum took you through his years. A good mix of film, photos and exhibits. A distinct highlight was Air Force One. Being able to board the plane was historically exciting and the manner in which it is displayed is breathtaking. We spent most of the day there, so allow plenty of time. We purchased the audio tour, which has the voices of the Reagans. If you are an auditory learner or speak another language this is the way to go, but it is basically the same information as written on the exhibits. If you live in SoCal, make a day trip here.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Even More than Expected!!!", "Must see! We went to see the Titanic Exhibit that was wonderful but the Reagan Library itself was the best part ever. The space where Air Force One was exhibited was Awe inspiring and can just not be captured with a photo. It was incredible to see an actual piece of the Berlin wall and the larger than life size photos of the president all throughout the exhibit were my favorite. Playful and positive a reminder of the reason so many people were attracted to this president. The whole place is extremely well thought out and very education while being enjoyable. We stayed 2.5 hours and had a light lunch but you could really spend so much longer. We had a long drive and trying to beat traffic but we will definitely return.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Fantastic, don't miss", "This tells the story of Reagan's life. It is very well-done, with videos, speeches and outstanding displays. You can walk through the genuine Air Force One which he traveled on. One of the high points of our entire CA trip, don't miss it,"], ["Reviewed August 18, 2017", 5.0, "Must see", "What a great visit! You come away with a huge appreciation for the man as a human being, one that had a large amount of intestinal fortitude, and made many difficult decisions during his time in office. He did that with great aplomb and humor. Nancy grew into her role as first lady and the two made a tremendous team. Even if you are not a Reagan fan, you will come away with a great appreciation for him and the job he did serving this country. We spent 5 hours there enjoying forgotten history as well as a quite good and extensive exhibit on the Titanic.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Informative, educational and entertaining", "Presidential museums are always interesting, but this one especially so. We made a special trip from the UK to California to see this one, and it was well worth the effort. Plenty of detailed information about RR's background and beliefs, and lots of artefacts to illustrate his contribution to winning the Cold War without taking us to nuclear oblivion. Air Force One is a sight to behold, not to mention the breathtaking Simi Valley scenery. A few pensive moments at RR's graveside to contemplate his achievements rounded the day off just fine.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Great Presidental Library A must See", "On top of a beautiful hill overlooking Simi Valley the Reagan Library is a must see. How many Presidential Libraries have Air Force One that you can walk thru. This Plane looks like it could fly today. The Titanic exhibit is also great offering movie sets from the film Titanic costumes that the actors wore and actual artifacts from the Titanic. The Watch that was found on the body of John Astor to a blanket used by one of the survivors. A hint get there by 11 am to be able to park at the top or you will be parking on the road going up the hill. There is a shuttle that transfers people from there cars if you park on the road.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great to go on Air Force One", "Informative and fun. First time to a presidential library. My favorite part was going onto Air Force One. I really liked the postcards he sent to Nancy such a romantic."], ["Reviewed August 16, 2017", 5.0, "If within a two hour drive this is a must see", "We fought the traffic from Newport Beach to visit the library and it was worth every minute of the drive. To start off with the grounds and view are beautiful and the content of the library will leave you wishing we had someone like him in office now. If you go and see cars parked along the side of the road find an open spot and park. The parking lot is often full and the library runs a shuttle bus up and down the road so you will not have to walk far. If nothing else go for the tour of Air Force One. Just standing behind the plane and taking the wide vista beyond the plane is worth the visit.\nShow less"], ["Reviewed August 16, 2017", 5.0, "loved it", "love the history of this , the air force one tour was awesome , loved all the volunteers that work here , great attitudes and very nice"], ["Reviewed August 15, 2017", 5.0, "Good Visit", "Went there to see the titanic special exhibit which was amazing. Well worth the admission price. All the guides were helpful and you can stay and spend as much time with each piece as you want.\n\nAlways enjoy the museum but really enjoy the special exhibits.\nShow less"], ["Reviewed August 14, 2017", 5.0, "A fantastic tribute to a great man in a wonderful setting.", "We got a recommendation to visit this whilst on holiday. We are all glad we did. We knew little about Reagan, and didn't really know what to expect. His life story is portrayed perfectly in this marvelous facility which houses a retired Airforce One in the building. The grounds are beautiful, its in a fantastic location overlooking the mountains. The grave of Ronald and Nancy are very respectful. We left knowing so much more about the life of this marvelous president.\n\nWe thought the price was very reasonable and we will return for sure someday. Parking is limited.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Stop reading this and just go!!", "Wanted to come here last year but wasn't in the cards. Made a point this year and glad we did. It was pricey but well worth it. This place is massive, beautiful and full of informational facts about the life of Ronald Reagan. Admission for 5 (with kids) came to just over $100, with souvenirs and food we probably spent close to $300. A lot of money but if you live anywhere near this place, buy the membership and go often, we would if we could. The grounds are so beautiful that it's a great place just to relax, stare off at the mountains, read a book or go through the museum.\n\nBesides the Ronald Reagan section we got to see the Titanic exhibit which was also very good and well put together. A lot of interesting facts and actual replicas both from the ship and the film. Start here this way the rest of the tour is all about President Reagan.\n\nSpecial treat was they also have the actual Air Force One that flew President Reagan and 7 other US presidents. They also had Marine One and actual cars from the motorcade during Reagan's era.\n\nThis was a great time for the entire family. The staff was amazing. We met a husband and wife there who both work at the Presidential Library and had nothing but good things to say about the place, Reagan and life. Everyone was friendly and not pushy at all. They pointed out facts we might have missed and told interesting stories about the life of President Reagan.\n\nFood onsight was also very good. Find that in another review specific to that. Overall this is a must go for anyone that lived through the 80s or has a passion for history or the life of Ronald Reagan.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Great show case", "Perhaps best to arrive early or later in day. When we arrived (about 1:30 pm) people had been parking on access street for some time. At the parking lot entrance there was a \"lot full\" sign. But our timing must have been good as many spots were opening up.\nThe museum is well done, and it was nice to be reminded of President Reagan's powerful and positive personal words and view of America and our people. Making this Presidential Museum and library somewhat unique from the other 13 is having the retired jet which served as Air Force One and a helo that served as Marine One. Both are beautifully displayed in front of a wall of glass over looking the valley.\nThe staff takes posed pictures of guests entering the front of Air Force One, for purchase. But be aware for some reason the Museum feels compelled to add a lot of graphics (as if you are in front of a green screen). You don't currently have option too for go the graphics. If you want to see the actual jet with you at the entrance - have some one in your party take your own photo from a lower step. Your not suppose to take pictures as you approach that spot but perhaps if you explain why you want to they will allow it. Perhaps in the future give all the option to drop the heavy graphics.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Most beautiful scenery!", "The library is a must see! Make sure to give yourself plenty of time to tour the whole library. Although, smaller than a museum, it will take time because of the summer traffic. Make sure to see the presidential plane and grab a snack in the pub. Have lunch in one of Simi Valley's great restaurants and then plan your tour for the afternoon. Late afternoons will have less people and more parking in the lot adjacent to the library.\nShow less"], ["Reviewed August 8, 2017", 5.0, "This is a must do!", "Originally the only reason I wanted to go to this was to see inside Airforce One. And Airforce One is such a beautiful Presidential plane and so spectacularly set up in a huge room with a full glass front so that the plane set up in the air looks like it is going to fly right on out just might make the trip there worthwhile all by itself, but really, there is so much more in this museum to see and to enjoy.\n\nThe complex was to me surprisingly large, and taking an audio tour from room to room, even in my own somewhat rapid pace, took all day. Start in the morning when they open, eat lunch there, and stay until closing. (They also have other exhibitions and when I was there, there was a one about the Titanic, which was mostly centered around the James Cameron movie, but it did include some actual Titanic artifacts. This, too, was fascinating, so plan to leave some room to see this, or else whatever other exhibition they have once you finish seeing the Ronald Reagan one.)\n\nI was blown away by the level of energy and love that went into the gathering, organizing, and displaying all this. It takes you from Reagan's early days on the farm, to his school days, his football achievements (\"the Gipper\"), his military experience, his working in Hollywood and then becoming the head of the Screen Actor's Guild, his becoming California's governor, his Presidency, and all the issues, crises, and achievements of that time (the economy, the Berlin Wall, meetings with Russian leaders, his elections, his near-assassination, life on his ranch, his alzheimer's, and his death. Every step of the way was fascinating, educational, or brought back memories. When we got to the funeral section near the end, there were many wet eyes and even some visitors full-on crying. Whether you loved him or hated him, I think you can't help but come away with an appreciation of what were Reagan's admirable qualities and achievements, and realizing how special of a person it takes to even be the President, and to cherish a newly-renewed respect for the office. For those who loved Reagan like I did, it is all a very special treat that you will never forget. Ever since going there to the Museum, I have not stopped recommending that others go. Chances are, it will elevate your pride in American and give you renewed hope for a great future.\nShow less"], ["Reviewed August 8, 2017", 5.0, "A plethora of wonderful history about Reagan!", "What a great tribute to our former President. I loved that the museum starts out when Ronald was born. It tells of his early childhood, his Hollywood stardom, his Governorship of California and then to the Presidency. There are numerous historical documents and some really great movie clips. The replica of the Oval Office was very authentic. You must see this attraction. It's on a \"one hundred acre\" piece of land which is about 45 minutes from downtown Los Angeles. Always take into consideration heavy traffic in this corridor.\nAs a special bonus we got to walk through Air Force One. What an amazing plane. The Marine One Helicopter was very luxurious with fancy couches. It didn't feel like you were in a helicopter. You can have photos taken in front of Air Force one and the helicopter but not obligated to purchase.\nFor an additional price you can buy tickets to see a fabulous exhibit of the Titanic. It was very well presented. The movie clips were great especially when the Titanic was found under the sea.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Love, love, and love! Could visit over and over!", "This is one of my favorite places I have ever visited! It is amazing and well-worth everyone's time. From getting to go on Air-Force One to seeing the remnants of the Berlin Wall to the spectacular views, I think President Reagan would be very proud of his library. It's truly amazing, and I would definitely see it again. I spent 2 hours getting through it and could have spent more! Definitely go!\nShow less"], ["Reviewed August 8, 2017", 5.0, "A beautiful tribute to a wonderful man and President", "By far the best Presidential Library we have ever been to. From the galleries to the Air Force One display and the view of Simi Valley from the President and the First Lady's resting place. Simply Moving."], ["Reviewed August 8, 2017", 5.0, "Beautiful tribute", "I went to the Reagan Presidential Library with my sister and my parents. This library portrayed an accurate representation of Reagan's tenure as President. The library contained important artifacts from our 40th president's life that were very interesting and overall cool to be looking at them. It also had the Reagan administration's Air Force One which is open to visitors to walk on. If all of the the interesting artifacts weren't enough, the both Nancy and Ronald Reagan are buried there so be sure to pay your respects at their grave. The library and gravesite is situated on a hill in the scenic Simi Valley and offers breathtaking views of the valley. Highly recommend!!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Visit The Titanic", "We had the pleasure of visiting the new exhibit at the Regan Presidential Library and Museum. You can accomplish the mission in 30 minutes or do as we did and took three hours to read all the material provided in a most interesting format. The human life stories of the survivors (and those that didn't) were fascinating. Who knew that the wreckage was discovered almost by mistake? I highly recommend visiting the Titanic and while there, take in the rest of the Museum. It's well worth your time.\nShow less"], ["Reviewed August 8, 2017", 4.0, "The Ronald Reagan Presidential Library and Museum is a Good visit.", "The Ronald Reagan Presidential Library and Museum can take a couple of hours to get though with so many exhibits. The location in Simi Valley is beautifully situated on a mountaintop overlooking beautiful views. The exhibits we enjoyed was the Reagan Museum, Oval Office, Air Force One Pavilion, the Titanic Exhibit and the museum store is well equipped. The cafe at the museum is good to eat at too! You can choose to eat indoors or outdoors.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Excellent", "This was a good museum really large we stayed for about 3 hours if you are really into this kind of thing or Reagan himself then you could spend much longer here . The highlight was airforce one a little disappointed with the titanic exhibition .\nShow less"], ["Reviewed August 6, 2017", 5.0, "Great Library that you will want to come to.", "This is a second trip to the Reagan Library. It had been 7 years since we last visited. A new section had been added to this very large complex. The Titanic Collection was on display. It was fascinating. Actually seeing artifacts from the Titanic was impressive. This is a very well put together Collection with a very knowledgeable staff to answer questions.\n\nWe learned from our last trip to come early before the library opens up to get premium close parking. Buying your tickets on line made getting in very easy. We were there when it opened up.\n\nRonnie's and Nancy's final resting place is stunning. Seeing a section of the Berlin wall was impressive. I'll go back again some day.\nShow less"], ["Reviewed August 6, 2017", 5.0, "One of my favourite places in the world - and ever changing", "I've been coming to the library ever since it opened, this must be my fifth or sixth visit. My last was a couple of years ago and it's changed so much once again.\nFirst of all, it's in the most beautiful spot with the most incredible views that sum up this part of California perfectly - rugged beauty.\nAnd if Ronald Reagan shaped any part of your life (the Thatcher/Reagan years were during my teens - they helped to shape me) this is an absolutely must visit attraction. There's so much to see, so much of interest and so much information to take in - of Reagan's whole life, not just his presidency.\nThe full scale replica of the oval office is incredible, but nothing compared to being able to go on Air Force One and Marine One - tremendous experiences.\nAt the end, it's all quite moving, especially when you see where Ron and Nancy are buried. A fitting tribute.\nThe Titanic exhibition was a fun addition, too.\nYou won't regret going here at all.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Terrific library with amazing views", "This is certainly a worthwhile attraction to see. You can see Air Force One and go onboard and have your picture taken at the door. There are lots of interesting exhibits and the grounds are absolutely gorgeous. You can also see a piece of the Berlin Wall and the resting places for the president and his wife.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Different experience", "It is not an easily reachable place but worth to go. It was a really different experience for me. I get on Reagan's plane, airforce1. Can you imagine yourself in a US President's plane? Also Titanic exibition was fine."], ["Reviewed August 3, 2017", 5.0, "Outstanding visit!", "Very informative, awe inspiring, and informative. The highlight was getting to board and tour Again r Force One! Great time in history."], ["Reviewed August 2, 2017", 5.0, "Very Beautiful", "The grounds are very beautiful and you call walk around and enjoy the Beauty from top of the mountain. The inside has so many interesting facts about Reagan's presidency! It's a must see if you are in the area!"], ["Reviewed July 31, 2017", 3.0, "Who the @&\" was Ollie North?", "If you are interested in a history of the Reagan presidency that mentions Iran-Contra not even in passing, you will love the permanent exhibit at the Reagan Library. And if you are interested in an economic history built around Arthur Laffer's mythological claim that tax cuts for the wealthy will grow the economy, you will be ecstatic. But hey, it's their show, and it was largely paid for by T. Boone Pickens, the Marriott s and other family friends, so it's ok. There is no question that the exhibition is entertaining and expertly done, as befits a former Hollywood pro. One take-away, on which a bi-partisan consensus can be easily established, is that Nancy was an interior decorator of considerable skill. Her changes to the White House were all significant improvements, and the exhibition documents them well.\nShow less"]]}}