{"Runyon Canyon Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Runyon Canyon Park", "url": "/Attraction_Review-g32655-d129374-Reviews-Runyon_Canyon_Park-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/07/b3/c9/view-from-the-top-of.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1013"}, "address": {"@type": "PostalAddress", "streetAddress": "2000 North Fuller Ave Hollywood", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90046-2308", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Worth the hike!", "What an incredible thing to experience with my teenage son. Was an incredible hike to the highest peak, and tough on occasions, but the reward of the incredible view at the top was worth it! Highly recommend to anyone visiting the Hollywood area. Unfortunately, no sign of any celebrities.\nShow less"], ["Reviewed 2 days ago", 4.0, "Great way to burn off a lot of calories", "Came up here on a Sunday to get the day started with a hike workout. Finding parking is really your biggest hassle, as it is crowded all over on weekends. But we did finally. Watch those street signs or prepare for a ticket. Many people walking dogs up and down the trail. There is an easy route, and a difficult route. 1.5 miles to the top. Great views of L.A., rivaled by only the Griffith Observatory. Better to go up earlier in the morning, as less crowded. Also bring shoes you don't mind getting dusty, as well as sunglasses for your eyes.\nShow less"], ["Reviewed 2 days ago", 5.0, "May be the MOST popular hiking in all of LA", "So many trail options, beautiful views, dogs allowed, and a terrific work out. No water or toilets so plan ahead, and parking is difficult as trail begins in a crowded residential neighborhood"], ["Reviewed 4 days ago", 5.0, "one of those things you should do while in LA", "Hint : do NOT park on North Vista Street ( you will get $75 ticket fast ) . Park down on Franklin Avenue and walk up . Nice mile long walk to top for good views . LA folks love their dogs and you'll see them walking the most exotic breeds everywhere\nShow less"], ["Reviewed 6 days ago", 5.0, "Great walk, great views", "Jetlagged and up in the early morning, we headed off to Runyon Canyon Park in our sports gear and hiked up the steepest hills - without realising! It cleared the cobwebs out and left one of the best impressions of the city. Helped by the weather, the views of the city skyline are stunning.\n\nThe park was very busy with people out dog walking and exercising on the main trails (lots of friendly people saying 'Good morning!'). But off the beaten track it was nice, peaceful and chilled. We even bumped into a few celebrities like Kendrick Lamar and Hugh Dennis.\n\nDefinite recommendation if you want to escape the hustle of Hollywood and have a few hours to burn (and a few burgers to burn off!)\nShow less"], ["Reviewed 1 week ago", 4.0, "Solid workout, better views!", "Been hiking here a few times. Great to go with a group of friends or by yourself. Can get crowded on the weekends but never a problem on the hike, only when looking for parking. Don't really have to plan way ahead because it never rains in Southern California. The hike can get dusty so don't wear those new shoes!\nShow less"], ["Reviewed 1 week ago", 5.0, "Stunning Views, Healthy Walk", "A must if you are in the LA area. Get away from the city and head up to the canyon. Its a good solid hike. You need to be in good shape, but you don't have to be an athlete to hike this. You can stay on the main trail which is pretty good, but its very hilly so its still strenuous. We choose to go off the trail at certain points, and that is a little rough. The terrain is rocky and hilly so you need to have good shoes so you do not fall. Great Views from the top- on a clear day you can see the hole city out to the ocean.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great short hike", "Lots of people, but probably because it is so easy to get to and is so picturesque and you get great views of the city within 30 minutes of walking. Bring sunscreen as there is no shade."], ["Reviewed 1 week ago", 4.0, "If not athletic start at the top short walk to great view of city", "Park up on top of Runyon canyon and walk thru gates on paved road and not to long probably 1/4- 1/2 Miles great views of the city."], ["Reviewed 1 week ago", 5.0, "Amazing!!", "The views here are fantastic! I recommend starting at the Griffith Observatory and walking to the Hollywood Sign. Amazing views along the way. Definitely worth the visit. Is a very pleasant walk not to strenuous. One piece of advise.... bring plenty of water!"], ["Reviewed 2 weeks ago", 5.0, "Love runyon", "The best hike that you can do alone and feel safe not worry about psychos. Lots of dogs here so that’s a bonus but i highly recommend it if you’re in the la area."], ["Reviewed 2 weeks ago", 5.0, "Beautiful views and good exercise", "Great place to see magnificent views of the city while getting in a workout. We did the moderate trail and it had some fairly steep parts. Most of the trails are paved. It is definitely dog friendly. Bring water with you and allow some time. You won't be disappointed.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "This is La La Land", "A wonderful park with maybe the best view over Hollywood. I was lucky enough to go there on a fresh, sunny morning after a rainy night in January. I ran up from Sunset Boulevard via Laurel Canyon which is not a good idea as there is no walkway. It is a 5 k uphill distance. There is limited parking on the mountain. As soon as you enter the gate of the park and pass the gates with the rattlesnake warnings, you have the greatest 360 view you can imagine. It is all there: the Hollywood sign, Studio city, Los Angeles Downtown and the Pacific Sea. The trails are a bit rocky. Going down I went along the Park road which is very nice (no cars). There are many dog walkers and the atmosphere is very relaxed. Bring enough water in summer.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "\"It's the LA thing to do\"", "It is what they say it is. Full of locals and tourists getting their exercise and social time in. It's a fantastic way to see the broader LA and Hollywood sign."], ["Reviewed January 24, 2018", 5.0, "Excellent Escape, Nice Hiking Trail, Dogs...Sure!", "While visiting my daughter we wanted a nice hike with the dog, Runyon canon seemed to be the best option.\n\nRunyon Canyon is paved most of the way (except the very top) and it's not too strenuous. It was what we both wanted, a little exercise for us and the dog.\n\nWe started down the hill off Fuller Ave on a beautiful warm (cool in the shade) Sunday morning @ 11:00 AM. It was perfect, not too crowded but enough people and other dogs to make it interesting. We hike to the top. Brody the dog enjoyed the outing as we did too.\n\nOne item to note, no restrooms on the hike which if you are drinking water can be an issue. When we finished I had to rush to a gas station to pee. Ther are a couple of drinking fountains as one climbs the hill - two so if you want wanter drink at each.\n\nI always enjoy Runyon.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Must in LA", "Beautiful hike up the Canyon. Wear shoes you don’t love as they get dusty. Lots of great sights to take photos of and amazing views of LA, you can see the Hollywood sign. Lots of people watching with locals walking with friends, pets and PT groups training. Took us about an hour to the top and down but there is lots of different options.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Nice hike......", "Good hike up the canyon, wear shoes that you dont mind getting dusty, good vies of LA at the top including the Hollywood sign"], ["Reviewed January 14, 2018", 5.0, "Great Views of LA", "i always do runyon canyon hikes when i visit LA. its a great workout with the most amazing views. can be a bit tough if you're a newbie to hiking"], ["Reviewed January 13, 2018", 5.0, "Love the view", "The best part of this hike is that you will run into locals. I think there were more locals than tourists. That says a lot.\nPersonally, i loved the view, loved the hike, parking is a little tricky but i don't think they'll tow your car if you park on the street. Everybody does.\nLoved it.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Always a highlight when I visit LA", "I visit LA a few time a year and always hike Runyon. It is a great way to get into nature while in the city and the views are beautiful! The hike is family friendly and dog friendly and just challenging enough to feel like you are getting a good workout. Parking can be tricky at times but I have always managed to find a place to park. Great people watching as well!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Wow!! Tough workout with amazing views!!", "Challenging hike, which is easy to ramp up or down depending what you’re looking for. All choices give amazing views of the hills. Lots of company... but didn’t feel crowded. Lots of dogs... great people watching."], ["Reviewed January 7, 2018", 4.0, "Stereotypical L.A", "Was fun overhearing the locals conversations as we walked up the hill to see the Hollywood sign and views of the city. Lots of dog walkers, yoga and fitness people. Well worth a visit."], ["Reviewed January 6, 2018", 5.0, "Great place to do some exercise", "Great place to do some exercise ... if you have a dog is better because everybody walk the dogs !! Great view to Los Ángeles HILL’s"], ["Reviewed January 4, 2018", 5.0, "Hiking with the Stars", "There are so many celebrities in Los Angeles; and there are so many hiking trails in the city of stars. If you are looking for a place to hike with best chance to run into the stars, look no further than the Runyon Canyon. You may just get some star gazing when you are sweating.\n\nThere are three paths:\n1. far right is the medium difficulty, with steps. Since it is covered with slippery sandy rocks and dirt make the steps very dangerous if you don't have good gym shoes. I had a pair of old shoes with no proper traction ..., I fell on my butt, still have the lump 5 years later. Try not to come down on this path, better off go up from this path.\n2. Middle of the road, it is easy breezy, paved road, if you just want to stroll long and enjoy the view.\n3. Far left, most difficult path, some very dangerous hike, be sure go there with someone if you are not a serious hiker. This path will get you to the highest point.\n\nAt the mid point, you can actually see the Hollywood sign, the view of Los Angeles is stunning.\n\nThis is so LA, people do dress very cute to hike this path, even make ups, the LA pretty people... don't judge, just enjoy the view in all aspect. haha\n\nHave fun!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Wonderful", "Love Runyon canyon - this was right at the end of my road and I used to hike up the canyon every single day and it was full of like minded individuals."], ["Reviewed December 30, 2017", 3.0, "Can see the the Hollywood sign", "I looked up the Mulholland Dr north entrance on Google Maps. I found street parking right by the gated entrance. It was good for walking, jogging, and casual hiking. Pretty good views everywhere and you can get a view of the trails so you can see where you need to go. There are paved trails too.\nShow less"], ["Reviewed December 29, 2017", 4.0, "A Nice Workout With Great Views", "This has just received an extensive renovation so it's much easier to hike now. The views are great, the hike is varied and if you're not too fit take it easy and make sure you are wearing sunscreen and carrying water. You will see a lot of wannabees on this hike and a lot of cute dogs. There are great places for photos. If you're knees are dodgy take your hiking poles which are great for a hike such as this one.\n\nIf you descend using the railroad ties route be careful and look after your kids who will want to jump and try and descend too fast. Do it right and it's fun. Do it wrong and it's a twisted ankle. As you approach the park cross all body parts and visualize a parking spot. They are hard to come by for this hike but I've always been lucky. Have Fun, and enjoy the conversation with your loved ones.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Great place for people & pets: all shapes, sizes, and fitness levels", "What a great place for a walk, jog, climb - alone or with friends or pet. Great views of Los Angeles and of the Hollywood sign. Honour bar at entrance to park - take a snack, drink or fruit, and leave your payment behind. Really? In Los Angeles?? But seems to work! A real jewel.\nShow less"], ["Reviewed December 21, 2017", 3.0, "Lots of Dirt and Cute Dogs, Not Very Picturesque", "I used to hike at this park because I lived near it, and it was a good way to get exercise with friends. I never thought it was beautiful, and when I went back for a hike recently, I saw very clearly that it's relatively barren and not particularly scenic. If you have a dog, it may be a good choice because it's dog-friendly. If you live in Hollywood or West Hollywood, this may also be a good choice because of proximity. If you want to go on a beautiful hike with cleaner air, I highly recommend going to the Pacific Palisades or Malibu instead.\nShow less"], ["Reviewed December 18, 2017", 4.0, "Great workout with a view....", "If you're in L.A. and you're not a native to the area you HAVE TO visit this place. It's a great workout and the view is gorgeous (hopefully the smog isn't heavy lol). Go early because parking spaces are limited as others have mentioned. You can stroll around and enjoy the views or you can get a serious workout in. Either way go and enjoy yourself. Beware, the parking lot isn't paved (at least not the one I parked in) and due to that clay like sand you'll make a mess of your rugs/carpet in your car!!!\nShow less"], ["Reviewed December 12, 2017", 5.0, "I love this place", "Please go early cause it's limited parking. You can park either on the park grounds, but it's only like 12 parking spaces. If you're going to park on outside of the park---please park where the parking the sign says so. The police are always driving around & will give you a ticket. I advice you to wear dark color running shoes cause the orange dirt will change the color of your shoes. If your scared of heights---please don't do it lol. Be careful of the rattle snakes & always watch your step while you're walking.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Probably the most popular walking trail in Los Angeles...", "You can either take the high road and get a really vigorous work-out as you walk up a pretty steep grade around a mile to a mile and a half. Once at the top, you get a great view of the L.A. basin and can see all the way east to downtown and all the way west to Santa Monica and the Pacific.\nOr you can take the low road for a slightly less vigorous, slightly shorter walk with an almost as amazing view...your choice.\nIf you go on a weekend, or sometimes mid-afternoon, don't be surprised to spot an up and coming starlit or movie mogul taking the hike.\nParking can be a bit dodgy as you're in a residential neighborhood, so check the street signs carefully as you don't want a ticket!\nShow less"], ["Reviewed November 30, 2017", 5.0, "A must see in Los Angeles", "This is not a quiet or low-key hike, as it has a lot of traffic on the trails, but that makes it kind of charming in its own way. Its a beautiful trail and the views of Los angeles definitely makes it worth while. If you're new to Los Angeles, this should be on your bucket list for sure. 2 entrances, dog-friendly, and water fountains scattered about. Lots of yoga pants and you may even catch glimpses of celebrities, or at least some upcoming young socialites who think they are important and have to be all made up while they hike. Haha.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Beautiful Hike!", "My friends and I went hiking in this park. This park had the most beautiful views. You can see downtown, the Pacific Ocean, and the homes on the trail. There is also a home inside the park belonging to Randall Keiser, the director of Grease. Met nice people too.\nShow less"], ["Reviewed November 17, 2017", 5.0, "So peaceful", "If you love a great view and nature this is the attraction for you! Runyon is the best place to hike in LA! The view is truly breathtaking. Go early to catch the sunrise!"], ["Reviewed November 16, 2017", 5.0, "Great hiking", "A wonderful escape from the hustle and bustle. Steep hills, paved and unpaved paths, dog friendly, some drinking fountains. Limited parking!"], ["Reviewed November 14, 2017", 4.0, "easy hike, beautiful vistas", "easy hike, can take shortcuts or make it a longer day adventure, will see downtown, pacific ocean, some private homes on trails, great way to spend time with friends and family, go early to get a decent parking spot"], ["Reviewed November 10, 2017", 5.0, "Gorgeous", "Worth the hike. Parking is limited. The view of LA is amazing. Multiple trails. It’s a must if you visit LA."], ["Reviewed November 4, 2017", 4.0, "Good for Exercise", "This is a decent place to go if you want to get a good workout in or do some hill running. Typically there is a lot of smog in LA so if heading here expecting some magical view, this is 80% of the time not the spot. A lot of friends and residents of LA come here for a quick get away from the traffic and city.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Nice walk to kickstart the day", "We walked up Runyon early on a weekday morning. It was great to view LA from up high and get in some exercise on holiday. Lot's of lovely locals to say hi to as well."], ["Reviewed October 22, 2017", 4.0, "The place to be seen when you \"hike\"", "There is both a walk and a hike at Runyon. Be sure to bring water. Parking is an absolute disaster with no parking anywhere around. You'll want to wear your best workout clothes because you aren't there for exercise, but to be seen and probably discovered.\nIf it's raining, do not go. It's a muddy mess.\nEnjoy the views of all of LA.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Not bad", "it is nice for an afternoon hike, It was a little confusing which trail to take. but all in all it is nice when there is not so much heat, cool view."], ["Reviewed October 18, 2017", 5.0, "Hike", "Please take time and do the hardest trail of the hike, it will leave you sore but worth the site and views! Inspirational quotes on the way up and at the top!, BTW bring water!"], ["Reviewed October 18, 2017", 5.0, "favorite tourist hike", "This is a STAPLE of LA. A lot of \"tourists\" come here for the views and pictures for social media. But, if we all take a step away from social media, this is a REALLY good hike with breath taking views and a great amount of incline. Be prepared to sweat! I LOVE this hike/workout!\nShow less"], ["Reviewed October 4, 2017", 5.0, "Awesome Views", "We took uber up to top of fuller st. we hiked the entire park and all the peaks. it was about 4.5 miles. the last peak under the power lines was a bit technical getting up and down a 12 foot shoot but worth it. The views from all over the park are incredible. The hollywood sign is off to the right. there are dogs off leash everywhere which we loved. not sure what the vertical climb is but it's a decent workout. If you ran it, you'd be gassed.\nShow less"], ["Reviewed September 29, 2017", 3.0, "great view but better places to hike in this city", "If you want to watch people roam around with a selfie stick and pretend to be hiking.. this is the place to go to??? i wouldn't call this a legit hiking trail.. this is the instagram only place. Also the least favorite place to hike for most of my friends and I who live here. Also dog poop everywhere and the smell is pretty strong. Come here for your instagram addiction but definitely hit up any other surrounding hiking trail for a real hike.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Excellent Hike, Beautiful Views", "I went for a hike with my daughter and her dog and it was my first time in Runyon Canon Park.\n\nWe started at about 5 PM and the way we hiked provided enough shade throughout the hike. Her dog was in a leash part of the time and off the leash in areas where it's allowed.\n\nLots of LA families walking dogs and hiking with their kids. There is a wide asphalt walkway all the way up and some dirt trails. We stayed on the asphalt areas.\n\nPretty walk up and down, with the dog took a little over an hour. We stopped to talk and play with other dogs. I expect it would have been an hour If we just walked.\n\nBeautiful hike, views of the Hollywood sign and downtown LA.\n\nI will return.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Runners delight!", "This is a gorgeous canyon. There is limited parking at both ends of the trails if I remember correctly, although I was able to walk here as I was staying in the Valley. You can, of course, walk the trails, but know that it is a decent climb not for those who do not reasonable fit. There are no facilities at the top and remember to bring water. There often are celebrity types running with their dogs here, but be forewarned that they are not interested in selfies etc.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Runyon Canyon Park", "A beautiful natural setting. One can hike on paved roads or very challenging trails, made even more so by heavy rain washouts. No facilities up in the hills."], ["Reviewed September 26, 2017", 5.0, "Wonderful run. Beautiful scenery in the midst of the city", "My daughters convinced me to get up at 6am to go for a walk up Runyon Canyon. I thought, oh brother.\n\nWe arrived at the site to find a station with water and refreshments that operated on an honour system for payment. What a tribute to society that this could exist.\n\nThe hike was refreshing and a great start to the day. The views of the city were simply unbeatable. Cudos!!\nShow less"], ["Reviewed September 19, 2017", 5.0, "Such a beautiful outdoor experience!", "My friends and I made the perfect decision to visit Runyon Canyon Park! Although, there are a lot of hills when climbing these mountains.... the views at the top are so worth the exercise and experience. I will definitely return to Runyon Canyon Park during my next visit to LA.... It was such a breath of fresh air.\nShow less"], ["Reviewed September 18, 2017", 3.0, "Beautiful vistas, great hike, but returned to broken-in car :-(", "As others have said, beautiful views, great trails for all fitness levels and lots of beauty of both the human and topographical kind, however, be aware, our rental was broken into (window shattered) and backpack that was under a car seat stolen. Awful ending to a nice nature walk, unfortunately. That is the only reason for 3 stars...\nShow less"], ["Reviewed September 18, 2017", 4.0, "Trek to see Los Angeles from an elevated perspective", "It's easy to drive your car to Griffith Observatory for panasomic views of LA but a great alternative is trekking up Runyon Canyon where you get as spectacular views of LA and a holiday workout all at the same time. You need to have a moderate level of fitness - but the effort is worth it with some great views of the city. I recommend getting up early and tackling the Canyon before breakfast - particularly in summer before it gets too hot. It is worth noting that the haze which constantly envelopes LA makes the views good but seldom great.\nShow less"], ["Reviewed September 15, 2017", 5.0, "In love with this place", "I always love to go for a morning hike here when I am in LA, there is a trail for every level of fit, I even managed to find a trail that suited me when I felt my legs were super exhausted following a demanding half marathon.\nOf course, you have to be in love with the views, they are simply amazing!\nI would advise going here in the morning, it seems to become a bit of a catwalk later during the day, but that can be fun, too.\nShow less"], ["Reviewed September 13, 2017", 5.0, "The place to hike in LA", "This countrified area attracts an eclectic crowd of writers, actors, directors, and locals who arrive early in the morning, many with dogs on leashes and scripts in hand, to hike the abundant trails. Well-paved paths meander for miles up and around the Hollywood Hills. On clear days you can see Catalina Island, Pacific Palisades, downtown LA and snow capped mountains from any of a number of hilltops.\nTake Sunset Boulevard east to Beverly Glen and up to Mulholland Drive. Make a sharp right (east) for about a half-mile.\nParking is limited so obey no-parking signs or you will get towed and ticketed, no joke. Park opens at sun rise and closes at dusk. Bring water, wear sunscreen and a hat, and be ware of rattle snakes (although I hike there daily and have seen any). Also don not smoke or light a fire. The top of the hill has lots of good photo ops.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Once in a lifetime experience", "The hiking trail has every level of experience covered, and the views are indescribeable with 270 degree panoramics of the entire county from Santa Monica to Pasadena, you have to be here to believe it, must do if you are in the area. Best of all it is FREE !! Check out the shelter dog walking group on AirBnB with Ryan!! Great experience\nShow less"], ["Reviewed August 27, 2017", 4.0, "Good park to workout and take in the views", "Enter though the gate at the top of North Fuller Drive and you have the option to take one of three main paths up to the top of the canyon.\nThe path out to the left (called the western track) is by far the toughest and requires at least a moderate level of fitness as the track is fairly steep in parts and has some loose fine gravel. We went at a moderate pace and took only a few quick stops for pictures and it took about 30 minutes to reach the summit.\nAcross the undulations at the top of the canyon took about a further 20 minutes to pitch up the centre tarred path. We then returned down the eastern track that took about another 20 minutes but it's a much easier path than the western route.\nThe centre path is paved and a reasonably simple route.\nTake some good quality runners is you are planning to take any of the paths other than the paved centre option.\nTake water and sunscreen as the heat does get fairly intense and there aren't any water stations other than at the top and bottom of the canyon.\nIf it was quite windy I may give hiking a miss in the canyon as there is lots of loose dirt on the tracks and hiking in a dust storm wouldn't be pleasant\nGreat views over the LA landscape and into the valleys behind Runyon, although you would need a very clear day to see the ocean\nShow less"], ["Reviewed August 25, 2017", 5.0, "great views on this easy hike", "This easy hike provides amazing views all around. Seeing the city from the top, or Hollywood hill and sign, or even the homes around the hike, is like being in the middle of everything yet far away. The trail is populated at all times - lots of very fit people, lots of serious exercisers, and even more casual exercisers around.\n\nDefinitely a joy to see! Although parking is a story of itself. Try parking on the street anywhere you can, but I think the easiest time to find parking is before 9am.\nShow less"], ["Reviewed August 25, 2017", 4.0, "Want to see wanna be celebs & their dogs?", "Runyon Canyon is a \"scene.\" Super fit bodies in cool outfits. Lots and lots and lots of dogs. Crowded. But definitely worth going to once."], ["Reviewed August 23, 2017", 4.0, "We always enjoy this hike", "This hike is not difficult and provides a great chance to get outside and enjoy the day. Great views and great people watching."], ["Reviewed August 20, 2017", 5.0, "Great", "I've been to LA many times but I just discovered this gem. Great hike. I great views. It's all uphill.... So not an easy hike"], ["Reviewed August 19, 2017", 4.0, "Beautiful view of L.A. -- except for the smog and power lines", "My wife and I stopped in at sunset. So glad we did. Would be 5-star perfect without the power lines and smog, but hey.. what can you do?"], ["Reviewed August 17, 2017", 5.0, "Nice hike and great views!!", "A good activity for pets and owners!! Great weather or clouds, this view is amazing!! Take a camera and plenty of water. Family fun for everyone."], ["Reviewed August 16, 2017", 3.0, "Good but crowded", "...and if you cant find parking in 10 minutes whats the pointe. But a fun trail to see doggies and celebs( at least instagram celebs and the pets of ig)."], ["Reviewed August 16, 2017", 5.0, "Fun, Free, Outdoors, Healthy and a Hell of a View!", "Did a <24hr of power tour of LA with my Girlfriend and was recommended prior to coming to LA (by a friend who lives there) to simply go for a run around Runyon Canyon. Good fun and a litle bit tiring(!), but once you get to the top you'll see why it's so popular. It feels away from the city completely, while the view just goes on forever. It also gives you a really good perspective of the LA landscape/layout. Awesome.\n\n*Bring water!\nShow less"], ["Reviewed August 11, 2017", 5.0, "Great hike", "We caught an uber to the entry and walked the east to west ridge. It was quite hot that day so we went early! A few drinking stations to refill the bottles. Beautiful views! A must do when in LA"], ["Reviewed August 10, 2017", 3.0, "Hip trendy park set in the hills of a regular neighborhood", "This is a bit of a hidden gem in the back of a regular neighborhood not far from sunset strip. It gets busy and there are lots people using it but it's a little peace and calm from LA traffic and some great view of the city and the Hollywood sign\nShow less"], ["Reviewed August 10, 2017", 4.0, "Good", "This place is less tourism than Hollywood and Griffith.park, you should definitely try this one, more local people aswell."], ["Reviewed August 9, 2017", 4.0, "Great hike and views", "Great hike/exercise with good view of Hollywood and Hollywood sign. Nice that water stations have been added throughout park."], ["Reviewed August 7, 2017", 3.0, "More of a place to be seen than work out", "Too many people trying to be seen than actually get a good hike in. If you're looking for a good hike try some of the Malibu hikes overlooking the ocean!"], ["Reviewed August 1, 2017", 5.0, "One of my fave hikes", "Living walking distance to runyon has been a blessing. I love the different options, to have this gem walking distance is everything and I'm grateful for it. You can make it into a 2 mile hike or 5-6 mile east ridge has a few steps on the way up great incline and the westridge has a good option of stairs too. Highly recommend it if you are in the area.\nShow less"], ["Reviewed July 26, 2017", 5.0, "A wonderful workout - minutes from Hollywood!", "Just gorgeous! The trails are well-kept, the park is totally accessible. While staying in the city, we did a google search for nearby hiking - and Runyon Canyon popped up. So glad we went! It was such a great hike, and we got to drive along Mulholland Drive to get there!\nShow less"], ["Reviewed July 24, 2017", 5.0, "Amazing early morning visit to Runyon Canyon Park", "Large park with amazing walks and trails . Popular among both local LA residents and tourists. Be prepared for a good energetic walk ..do not underestimate the range .. take it easy when needed and enjoy. Great views and super photo opportunities."], ["Reviewed July 21, 2017", 5.0, "Pure Canyon Hike Trail Dog Tips Too", "I have started to hike around LA and I keep coming back to Runyon because of location and dog friendliness. Key things you need to know. Summer is hot. Remember tourists, it's a canyon and let me tell you the temperature will kick you and your dog. Take water bottles. You can fill them up at the base of the canyon but there is none at the top. I usually catch a ride there because parking can be killer. If you drive, start at the top. There's a nice lot, go early. At the base, they even have bottles for sale on good faith you will pay for them. There are dog treats and some fruit too. Take a couple of bucks you're good. There are two ways up the canyon either is fine. I prefer the left side up. I like the incline. Dogs can go without leashes once inside the canyon area. I have met many folks who are regulars and have given me insight on the Runyon dogs. There are definitely dogs that shouldn't be without a leash. They will be aggressive toward other dogs. (Let me be clear I've never seen nor heard of a dog biting anyone at the canyon). I have a pitbull. She's awesome. I take her and she is trained and on a security collar. Be aware of other dogs and keep your dog next to you when going near others. Most everyone is aclimated to dogs and is very tolerant until they aren't. Dog owners unite AND TAKE A POOP BAG. There usually is a dog waterbowel underneath the benches (right if you are facing the top) and nice views for a rest if too hot. On a beautiful day it's a spectacular view all around. Don't go if windy. The dust will be overwhelming. The canyon is dirt all the way on the trail. In most spots it's wide. One side (right if at base) is rocky and in some parts can be tricky to navigate if you are older or unstable on your feet. Never fails I hear of a celebrity in the canyon on the same day as me and yet never see anyone familiar. I will admit January is the best time to visit Runyon. Watch the weather and pick the perfect day, It will be cooler as you climb to the top so gently layer. I have never seen any wildlife but I'm really not complaining. I go to walk and see the views. It's a unique place. Canyons offer a vantage point to soak in the LA area. It's a great place to get a tast of LA. From runners to walkers, yoga classes at the base, trainers and lifters, everyone heads to Runyon. Sunset is spectacular. Highly recommend for those great outdoors folks and hikers. DEFINITELY NOT MEANT FOR LOWER LEVEL WALKERS\nShow less"], ["Reviewed July 20, 2017", 5.0, "Great adventure!", "If you like hiking or walking on a challenging road, you should definitely go there! It is an amazing workout and a good way to explore another face of Los Angeles. The view is gorgeous and it makes you feel deep in the nature with a desert climate, even though you're in one of the biggest city in the States. But make sure to bring a good amount of water and sunscreen, because it's VERY HOT!\nIt was a very good adventure and I would recommend it :)\nShow less"], ["Reviewed July 18, 2017", 5.0, "Great urban hiking to a view of the Hollywood sign!", "Take it from a local: this is the go to hike for Angelenos. Lots of beautiful people (and frequently, celebrities) walking their dogs and getting some exercise just blocks from busy Hollywood blvd. The top offers a great view of the Hollywood sign and Griffith Observatory, and on clear days you can see all the way to the water.\nShow less"], ["Reviewed July 16, 2017", 1.0, "Trail for the Hollywood people", "it's just an overused train that has a famous person on it sometimes. too many people. it's like a fashion show on dirt."], ["Reviewed July 16, 2017", 5.0, "Fantastic Hike", "This is a great place to go as a local or even visitor to LA. I personally would put this on your things to do when visiting, as you get a great hike in the Hollywood part of town with awesome views of the hills and city. As a new local to Los Angeles, you can definitely talk to anybody and they will tell you this is the hike to make a priority and I can agree with that. It gets super hot here so make sure you have enough water. There are a lot of inclines and declines, of which you can decide which direction you want to head in since you can decide how hard you want to make this on yourself. It's not too long compared to some other hiking options in the area, but you can find yourself a great running path along the hike so keep that in mind if you are into jogging.\nShow less"], ["Reviewed July 15, 2017", 5.0, "A wee stroll before your breakfast......?", "Tough stroll up the mountains. Several walks for easy, moderate or hard options. Take your choice but even the easy option is tough enough for a non hillwalker."], ["Reviewed July 11, 2017", 1.0, "Hot, crowded, smells like dog urine. Numerous dog attacks, be careful", "If it's clear, there can be great views. Very hot and dusty, Take lots of water. Off lease dog tickets are very expensive! Numerous dog attacks by on leash and off leash dogs. Our dog was killed by on leash pitbulls walking with owner. She had 3 and couldn't control them. No parking. Be careful of rattle snakes, especially in the spring when the little ones hatch.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Run with a view, a fresh change from the musty Hollywood streets!", "After being in Hollywood for a while you'll start to notice you need some fresh air, Runyon Canyon is an amazing welcome change.\n\nOpen between 6AM and 8PM you're able to go on long hikes all the way up to the Hollywood sign and beyond.\n\nThere are so many paths and view points, this isn't a place you'd be able to check out in a day, I'd advise making it your morning run before you start your day of activities/tourist things.\n\nIt's just a stroll of Hollywood BLVD so there's no excuse to go check this place out.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great Hike away from the hoopla", "Excellent hike above Hollywood. Not too challenging but good with kids say 10 and up. Great views of LA at top. Can be crowded in the morning but gets very hot midday in the summer. highly recommended way to escape the glitz of Hollywood Blvd and it's free!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Get outdoors close to the heart of LA", "This is a great place to bring your dog and get some exercise with great view of Los Angeles. It is hilly so wear good walking/hiking shoes."], ["Reviewed July 9, 2017", 5.0, "What a view!", "This was the first thing I did when I arrived and what a way to start. Took an Uber here ($5 from my hotel on Sunset Blvd). Hiked up the east trail and came down through the middle trail (the middle trail is paved). Took me about an hour and I was stopping for a lot of photos. Gorgeous views of downtown and the Hollywood Hills. Great for people watching too. Highly recommended.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Nice hike - don't underestimate it!", "We went to Runyon Canyon during a trip last fall and really enjoyed it. It's quite amazing how quickly you can get into nature in a city that is as sprawled and present as LA. We hiked from the entrance in WeHo and didn't only encounter great nature but also very attractive men (it's WeHo after all). Warning to the unexperienced hiker: the east route is quite doable, the west route is a bit challenging.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Views and Pretty People", "Sometimes its too crowded. I would visit Fryman Canyon for more space. Although people come to Runyon for the view and the beautiful people."], ["Reviewed July 1, 2017", 5.0, "Picturesque", "What a lovely afternoon out. We strolled through the paths on a upwards incline. Perfect for walks, dog walks or a relaxing afternoon out. I'm scared of dogs. But the dogs there was no bother at all."], ["Reviewed June 27, 2017", 4.0, "Your effort will be rewarded", "One of the hardest parts is finding a parking spot near the main entrance. Hire a car. There are a range of different trails so it's easy to find one to suit your fitness level, walks seem to be from 2 to 8 km return. For most trails the first part is a paved road and for a walker with moderate fitness is not to challenging. Plenty of spots to catch your breath or have a drink whilst checking out the view. At the top the vistas are great, good views of downtown and the ubiquitous 'Hollywood' sign. You can trek up to the sign from the top of the canyon.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Get ready for an up hill climb", "Wonderful scenic views of the city, but if you don't like dogs beware they are everywhere and often off the leash."], ["Reviewed June 23, 2017", 5.0, "Great hike", "We stayed two blocks away and hiked the path off Fuller. It is very steep but a beautiful view at the top. Also, there is yoga at 10:30 if you want to. Definitely worth checking out but take water!"], ["Reviewed June 20, 2017", 4.0, "Not well signposted, except for the beware of rattlesnakes sign", "It wasn't clear which track to take so we ended up changing directions often. There was security tape in random sections with no signage and paths seems unstable. Would have been a nice view at the top except for the fog."], ["Reviewed June 18, 2017", 5.0, "Go on the paved hike if you are scared of heights ;)", "I was keen to do Runyon Canyon, but we naively took the east trail, the non paved legitimate hike, that goes up 40 stories/floors, in a short time... I was petrified, and more than once wanted to stop, it was quite steep in some spots... but Mark talked me through it... A good work out in the least!\nShow less"], ["Reviewed June 16, 2017", 5.0, "Awesome views!", "We went to hike during on our vacation as that's the way my husband likes to see cities that we visit. Needless to say this is a great workout. You can bring the furry friends too. I loved the view of the Hollywood sign. The views are amazing and weather was so perfect! I would not go after lunch it's just way too hot. We ventured out in the am and ended right before lunch so it was perfect. Carry sweatshirt or hoodie as it gets cold the higher you go.\nOne thing to remember this park is a circle. So if you go too far the only way back is to turn back around or prepare yourself to do the full circle. We did the full, and let me tell you it was rough. Be prepared, we took water bottles but could have used two. Now keep in mind we are not fit people just the average person so for us it was a workout. Others that may be fit could possible run some of it and still get a good workout. I highly recommend to do this if in the area,\nShow less"], ["Reviewed June 15, 2017", 4.0, "Great, even for a short visit", "We just happened upon this park by accident, we were't really prepared for a real hike, but we stopped for a quick visit. We hiked up the hills to the highest part of the canyon, great views of LA, the Valley and the Hollywood sign.\n\nReally cool park, I would love to come back and get a good run in.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Lot of hiking trails - nice views", "nice (tough) hike up the hills - view is spectacular of Hollywood and also the Hollywood sign. Fun. Lot of people walking the trails this weekend."], ["Reviewed June 11, 2017", 3.0, "Go to Griffiths park instead", "Similar and not as good views as Griffiths park. Nightmare to park when we went on a Sat am and everyone exercising there. Enjoyed the drive to it up Mulholland drive but Runyan Canyon itself a little disappointing. Supposed to be good for celebrity spotting though but we didn't see any.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Great view of LA", "My son and I hiked Runyon Canyon at Sunset. It was absolutely amazing. It was a Saturday afternoon and there were lots of people and dogs running or walking the gorgeous area. What a lovely view from the top!"], ["Reviewed June 9, 2017", 5.0, "Exhilarating Trek with Splendid Views", "Easily accessible by public transport.Cool and invigorating 60- min stroll to the summit.Water fountains provided along the way ."], ["Reviewed June 4, 2017", 5.0, "Great Run!", "I did my morning 5 mile run and workout on the trails. Amazing views of the whole LA county. It's crazy how far out you can see on these trails. Such a cool place to go on a run"], ["Reviewed June 3, 2017", 5.0, "Great view", "I went on a tour that took me though this area of LA, so I didn't have a chance to walk around. The views were great and it was nice for someone else to be driving"], ["Reviewed May 31, 2017", 5.0, "Beautiful hike near bustling LA Hollywood area", "This is an amazing park to do hike to your heart's content. Steps away from downtown and Hollywood. You can choose how vigorously you want to hike. My husband and we did about one hour hike. We did not take the dirt road - so it was not a loop hike for us. But the hike has nice views, good inclination and paved path. We enjoyed it a lot. If it's a clear day, you will be able to see almost all of LA from the top or the vista points.\nOne tip is - go as early as possible if you want a parking near the park entrance. If you reach there after 7:30am, you have to wait 15-30 min or find a street parking which is a bit challenging.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Great hiking trails in middle of LA", "This is a great place to get outdoors and away from the hustle and bustle of LA. Some of the trails are a bit challenging so have some water and good pair of shoes if you plan on doing those. If you want any easy walk I recommend sticking to the paved portion which can take you all the way to the top where the neighborhoods are and you still get some great views of the city.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Awesome hike", "Lots of fun. Great people whatching! Not too difficult if you need a quick dose of exercise. Go up the stairs and down the trail for the best workout!"], ["Reviewed May 29, 2017", 4.0, "Great workout trail with a view", "Not too hard to find but parking can be challenging. There were a lot of people hiking at 8am. Pet friendly- I've never seen so many pets in a hiking trail. Almost 2 mile hike up and the view from the top was magnificent. It is a great workout trail for sure. I will come back to check out the other hiking trails and summit. I definitely recommend this place when visiting LA.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Great hike", "This is a great moderately challenging hike. It was pretty steep uphill the first half of the 3 mile hike. The views are magnificent. Can see the ocean on one side and a great view of DTLA."], ["Reviewed May 26, 2017", 5.0, "Awesome hike for locals or tourists", "I always recommend Runyon to folks. There are a few different routes you can take (some harder than others), and if you really just want to pop up for a 10 minute walk you can get to a great viewing area of LA. I live close to the entrance on Fuller so I always walk, but I've heard parking is a pain in the butt. But a great spot for a hike any time of day! (ps check out a sunrise here if you can!)\nShow less"], ["Reviewed May 23, 2017", 5.0, "Amazing hikes and views!!", "A trip to WEHO is not complete without conquering the canyon trail. We visited on a Friday afternoon and the trial was quite busy, I can only imagine the crowds on a weekend!\nDogs, joggers, tourists, families, and your hardcore hikers are all here but don't let that deter you. Wear a comfortable pair of shoes that you won't mind getting dusty and make your way here. There are water bottles, power bars, and snacks that you can purchase on an honour system in case you forget to bring your own.\nThe entire trail loop is a bit challenging but other loops are available for those who may have limited physical abilities. The views get better with every incline, so have lots of memory on your devices.\nI managed to do the entire trail in less than 1.5 hours and it was well worth it!!\nShow less"], ["Reviewed May 23, 2017", 4.0, "A great place for hikers.", "A few years ago we lived a few doors down from the entrance to Runyan Canyon. It is heavily trafficked, and there are a lot of dogs, which can be a down side or not, depending upon your view. A lot of young, fit people flow in and out, as well as all ages. It is a challenging hike but you can choose to avoid the steepest climbs if you wish. The view of the city from different stops on the climb are wonderful. When we were there, there was free yoga on the grass in one area, which was so nice. The parking is hard to find.\nShow less"], ["Reviewed May 23, 2017", 5.0, "The View....", "Great hike trails, has spots along the route with water bowls for your dog if you have one. I love that it's not just one long flat trail. you go up stairs, up hillside, flat and winding trails. Totally enjoyed my visit, will have to go more often. Had friends from out of town visiting, and they enjoyed very much as well. My niece is looking forward to going.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Good hike, great views", "We were looking forward to playing in Runyon Canyon in hopes of seeing some celebrities. We didn't, but we're still really glad we hiked to the top. It was more of a hike than we anticipated, but it was a lot of fun and the views at the top were amazing. You could see from the Hollywood Sign all the way to the Pacific Ocean. I would definitely recommend doing this as a morning activity and then grabbing a smoothie after!\nShow less"], ["Reviewed May 17, 2017", 5.0, "Challenging Hike!", "You should be in shape for this one. Bring plenty of water, as there is almost no shade. I recommend this hike for fall-winter- early spring. The views are amazing!"], ["Reviewed May 16, 2017", 4.0, "Nice views of city - dog friendly", "On a business trip looking for something to do. Walked from the Loews Hotel (15 min) and completed the loop starting on the east ridge. Only had flip flops but would recommend sneakers or hiking boots. Most of the path is paved or groomed dirt. Some sections are steep and required good balance and endurance. People of all ages walking the trails. Open until dusk, felt safe with so many locals. Good people watching since it is LA city hiking.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Beautiful view", "This is a great place to go to get a view of the city as well of the NBC Universal/Comcast building and the Sheraton universal building."], ["Reviewed May 14, 2017", 4.0, "Very nice walk to see LA in all its splendor!", "This is a good place to take a great hike. It has great views of all of L.A. The only downside are all the dogs roaming everywhere without leashes and it's a bit crowded for my liking. It's probably much nicer on a weekday. Make sure you take some sunscreen! Also be ready to park at a distance.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Worth the effort", "My wife and I decided to take the trail up with our toddler and his stroller. Should have worn active wear but was to late.\nParking is limited because the trail is a bit crowded. It's a hotspot for locals and tourists. After all you earn a nice view. There are some drinking water sprinklers and rest areas on the way up.\nShow less"], ["Reviewed May 8, 2017", 5.0, "Great hike", "Hiked to the top of Runyon Canyon park with my daughter. ( she usually runs the trails) parts are pretty steep but it's worth the climb. Views are amazing from the top! Was very sunny and hot so take sunscreen and water. There are warnings of snakes along the trail so be careful .\nShow less"], ["Reviewed May 6, 2017", 5.0, "Great hiking", "I love to visit LA and hike this park - it has great views and good trails and isn't packed full like Griffith Observatory."], ["Reviewed May 5, 2017", 5.0, "Great place for an early morning run/walk", "Runyon Canyon Park is a fabulous place to go for an early morning hike, before the heat of the days hits the valleys. I went for a hike here one Sunday morning and it was nice and cool, but still hazy over LA. Great views of the Hollywood sign, Hollywood Bowl rear and fancy houses off Mulholland. Best to park on Mulholland close to the park gates, but get there early for a parking space.\n\nTake water as there are no shops or booths selling drinks.\nShow less"], ["Reviewed May 4, 2017", 5.0, "A serious hike for serious hikers", "This was my first time there and wow was it a rough walk. The grade must be about 50% incline at some spots but as long as I took breaks at regular intervals I felt good throughout the ascent.\n\nI loved the diversity there! So many age groups and dog lovers and athletes and casual hikers. It was a great experience and I'll definitely do it as often as I can. Great workout and the reward of a beautiful view from the top.\nShow less"], ["Reviewed May 2, 2017", 5.0, "LALA Land Fun Outdoor Experience", "A busy and safe hike in the heart of LA. Loads of hikers and their dogs to keep you company. Enjoy the people watching and the view for miles. It takes about 1 - 1.5 hrs depending on your speed. There are several areas that are semi-steep but only a few areas. You can choose the long hike upwards from the left or the short uphill to the right and the long downhill on the way back. Your choice for type of a work-out. There's not much shade, so wear a hat and sunglasses mid-day.\nShow less"], ["Reviewed April 30, 2017", 5.0, "Sunday hike", "All I can say is awesome and tough!! There are many entrances , we took an uber up and down due to parking may be bad."], ["Reviewed April 26, 2017", 5.0, "Hiking in the heart of LA", "We had a great experience hiking Runyon Canyon. I must say, it was much more difficult of a hike than we expected. Was a great workout. There are numerous trails and routes, and chose a harder one. You have the option of staying on a paved path, or venturing off to the dirt paths. We did not stay on the pavement, as the best views required more of a hike. I like that if we were to go back we could choose a completely different path. The views of LA are breathtaking. The entrance is in walking distance of Hollywood Boulevard, if you are looking to hit multiple LA attractions in the same day. Definitely recommend this unique experience in LA.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Great Views of the City and a good workout!", "Substantial walk/run to keep fit or just discover the incredible views at the top. Hollywood hills (Hollywood sign), skyline of LA, etc. Pet friendly...in fact, a practical dog parade! Highly recommend."], ["Reviewed April 16, 2017", 5.0, "Hiking with my daughter", "We went early in the morning during the week and were still able to get a parking space. There is a paved trail if you don't wish to go off trail. We went off the paved trail but both afford you some wonderful views. I could see it becoming very hot in the summer.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Beautiful View of the City", "Decided to hike here for the breathtaking views of LA. I heard a lot about this hike and was expecting a leisurely hike, but there were parts that were slightly difficult. Regardless of my fear of sliding uncontrollably down a slope that I quickly overcame, I enjoyed the hike here and was impressed by the views of the LA skyline and Hollywood sign.\n\nAnother point of note was the large number of dogs here. I was surprised to see so many large and small dogs here and joked that this was actually a dog obstacle course. If you go, you'll understand this.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Great place to hike", "This is a great place to hike. There are different trails to suit your level of intensity and length of hike. Wonderful views of LA and the Hollywood sign."], ["Reviewed April 11, 2017", 5.0, "trails", "Excellent hiking with beautiful views and is free. We loved it and it is a great way to people watch and at the same time see breath taking views."], ["Reviewed April 10, 2017", 5.0, "Easy to Moderate Hike into the Hills", "This is an invigorating walk up to fantastic views of surrounding LA. The road path is easiest to go up and back. A more vigorous hike involves steps up and then a walk back down on the paved road. Go earlier as the late morning sun can be hot. There are several water fountains on the way for pets and people.\nShow less"], ["Reviewed April 10, 2017", 4.0, "Views", "Great views at sunset and cooler, but aim to be back before dark! Not a difficult hike at all. Lots of dogs around!! Don't forget water!"], ["Reviewed April 3, 2017", 4.0, "Great Daytime Views and a light hike.", "There are three main trails and plenty of goat paths to wander off on if you are looking to get a little outdoor exercise while staying in the city. Get up early, get to the top and take it all in. Location was close to our hotel in BH so this was a lot better than being inside in a gym.\nShow less"], ["Reviewed April 1, 2017", 5.0, "Memorable hike, gorgeous views!", "Runyon Canyon is on my list to visit each time I'm in LA! Friendly people, happy dogs, gorgeous views and hiking that is manageable on the paved path or a bit more challenging on the dirt path. My kids joined me this year, and said it was their favorite experience. Great views of the city and the Hollywood Sign.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Always a great view", "The hike is medium level to difficult depending what part you choose to travel up. The parking is sometimes a pain, but something always opens up eventually so worth waiting for it. Never disappointed by the great views of the city."], ["Reviewed March 26, 2017", 5.0, "A Sunday Hike", "Runyon Canyon is Hollywood and Miracle miles best kept secret. On a clear day, the skyline to the city is amazing. You will love the flowers, trail, and dog park."], ["Reviewed March 26, 2017", 4.0, "Excellent quick hike", "If you're missing the mountains and if you're up for a quick hike while in LA, this hike will fit the bill.\nTake the train towards Hollywood and stop at Highland. Continue walking westward along Hollywood Blvd. Until you hit Fuller Ave. Turn right (uphill) and you should hit the gates.\nI took the rightmost trail (did not turn left).\nWhen you reach the \"top\" , there's another high point (power lines) for which you will walk along the road , past some houses , turn sharp left (uphill ). If you don't turn, you will come out to Mulholland drive.\nShow less"], ["Reviewed March 25, 2017", 1.0, "I Hate Club Runyon", "If you want to meet stupid slutty superficial women, go to a rave or strip club. Runyon exploits the serenity of nature and pollutes the mind with sensory overload in a pornish way. When I go hiking, I am looking to connect with nature. Not someone who is more concerned with a selfie than being in the outdoors. I recommend this place to people with a fresh pair of valour pants that have PINK or JUICY written across the butt. I'm all for dog parks and hiking with dogs but there is too much poop on the trail as dogs are part of the popularity game at Runyon. Fryman on the North side of the mountain is much better. HAPPY HIKING!\nShow less"], ["Reviewed March 23, 2017", 5.0, "Beautiful hike!", "This was an excellent hike on a beautiful day! There are two paths; a moderate hike, and a more challenging one. We chose the more challenging one, however it was not too long, so it was by no means difficult. It took us about 2 hours to do the full loop. Beautiful sights of the city! Would highly recommend to all visitors!\nShow less"], ["Reviewed March 22, 2017", 3.0, "The Re-Do Needs to be Re-Done", "The 2016 upgrade to Runyon leaves L.A.'s most popular park sorely lacking in amenities. A total of 14 new little trees planted, 5 new benches to sit on, 4 new water fountain stations, and a few new fire hydrants for dogs to piss on and for use in fire emergencies. The city couldn't do more than that? The biggest snafu is the black asphalt that covers the main central hiking route. Who determined that was the best choice? Just because it was cheaper than cement? The main path was paved over for emergency fire access. Never mind that it destroyed what little semblance of nature was afforded by the old partially paved road. But asphalt? Doesn't last as long as concrete. Maybe the city wants the partially paved look back again, because that is what it's going to be come a dozen years or so. In the meantime, the 4-legged creatures get to have scorched paws in the hot times, as asphalt absorbs much more radiant heat than concrete. Seems like city planners weren't thinking about those things. What a mistake this was. I hope whoever made that decision is forced to walk barefoot next August September and October in Runyon so they can personally experience how smart their selection was. Park planning is supposed to revolve around the people (and in this case, the dogs) that utilize the park. It's not supposed to revolve around emergency vehicle accessibility.\nShow less"], ["Reviewed March 22, 2017", 5.0, "Great Hike!", "This is a fairly strenuous hike, but totally worth it! The views are incredible! The hike feels extremely safe since there are lots of other hikers/walkers at all times. The trails are well maintained and easy to follow. I would avoid the hottest part of the day since there is very little shade. We didn't see any celebrities but just the idea of star gazing motivated my teenagers to walk the entire loop (about 2 1/2 miles).\nShow less"], ["Reviewed March 22, 2017", 5.0, "phenomenal view from the mountain", "Excellent cardio exercise and phenomenal view from the mountain. There is a path to go up and down and you meet lots of people during your hike."], ["Reviewed March 18, 2017", 4.0, "Hiking but not for wimps", "We hiked the trail-and it's not for folks who are unable to walk long distances in the heat. It was hot the day we went up the trail. Take water with you as there is nothing for purchase. This is a highly trafficked trail so expect to be on the trail with a lot of people. Locals use the trail daily. It is hard to park, so plan ahead. Wear a hat if possible.\nShow less"], ["Reviewed March 18, 2017", 4.0, "Uphill battle but great view", "If you need a little cardio or a nice view stroll to the top of Runyon canyon. Walkers and runners from all levels...and their dogs..call this place home. We are seniors but made our way to the top after several rest stops and some bottled water. Great pics at the top of LA, Hollywood, the Hollywood sign and a on a clear day (good luck there) the Pacific Ocean. It is definitely excercise so if you are more the couch potato type you might want to skip this one.\nShow less"], ["Reviewed March 18, 2017", 4.0, "The view....", "If u go to Hollywood,CA...gotta hike this trail .The view is breathtaking.Make sure u are come shoes and bottle of H20."], ["Reviewed March 16, 2017", 5.0, "Awesome!", "I enjoyed every minute! The trails are pretty challenging and the views are incredible. You could see the Hollywood sign and a great skyline of the city."], ["Reviewed March 15, 2017", 4.0, "Puffed!", "Long hard climb to the top, but plenty of beautiful LA people make easy work of it. Great eye candy on the way up, and great views from the top."], ["Reviewed March 15, 2017", 5.0, "where do the Beautiful People go? Runyon Canyon", "like Dogs, like exercise, like hiking - PERFECT and within 30 mins you are at the top with AMAZING Views.\n\nI am doing this weekly right now and there is such a great energy here - everyone super friendly and relaxed.\n\ngreat visiting escape or weekly routine (Sun very busy)\nShow less"], ["Reviewed March 15, 2017", 4.0, "Fun pics with the iconic sign", "Hiking to the Hollywood sign is a lot work, but it is a great view when you get there. There are various trails you can take for all levels of hike lovers. Note all have some pretty good uphill climbs. We did one of the easier hike which was about 3 1/2 miles. This is to take Beechwood Street and we got parking at the very top by the sunset ranch, which was extremely lucky. Keep in mind, that on weekends, you are not allowed to park on the streets, so go during a week day if possible. (Otherwise parking tickets are $65.)\n\nThe first couple parts of the trail are the steepest and then it gets flatter as you get higher up. You get in front of the sign on this trail. If you want to go behind the sign, this trail has a split that will take you behind the sign as well.\n\nLuckily it was a very cool day when we went, so it was a pleasant hike with a lot of picture spots.\nShow less"], ["Reviewed March 13, 2017", 4.0, "Excellent place to hike in Hollywood", "I've loved it since my first time in L.A. Located in the heart of Hollywood, it's an ideal place to hike, keep your body moving, socializing and walk your dogs. In the AM Yoga groups for free."], ["Reviewed March 13, 2017", 5.0, "Good walk and views", "Fairly easy walk up to the top, amazing views when you get there over the City. Came down the other side which was steeper with some steep steps cut in to the hillside."], ["Reviewed March 10, 2017", 5.0, "absolute must see if in LA.", "my wife and I like to keep active on our travels. we visited runyon canyon and this didn't disappoint - the place is amazing a tough enough hike but the views made it all worthwhile. LA from a vantage point ive never seen before - do make sure and time your visit as it gets very busy. there is no public car park so that can be tricky if you are driving. we got a LYFT from our hotel and then we were within walking distance of Hollywood boulevard after, for us the am was the time to go.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Great hike", "Fantastic hike and worth the workout for the view try and do the whole loop and wear good shoes take your time and enjoy all the view points"], ["Reviewed March 6, 2017", 5.0, "A good workout with fantastic views", "The trail is wide and follows the terrain with switchbacks. The view from the top is spectacular. You can see from downtown to the ocean and the mountains."], ["Reviewed March 4, 2017", 5.0, "Fantastic place away from the hustle and bustle!", "This is a fantastic outdoor area just a short walk from the main part of Hollywood, and was really a highlight of my trip to LA. I visited the park at around 830am on a warm sunny Wednesday in late February. It was quite busy with what looked to be mainly locals lots walking their dogs and getting some morning exercise before work, which was great to see. I followed the less travelled side trails, (off to the left after entering from Fuller) some of which were quite steep and challenging to get to the highest peaks, but the views are absolutely stunning. Getting to the top on such a clear day and taking in the panorama was amazing, and with plenty of stops for pics was easily able to fill in a couple of hours doing the whole park. If you like hiking in the outdoors and great vistas this place is a must to visit when you are in Hollywood.\nShow less"], ["Reviewed March 3, 2017", 5.0, "Great view", "Fun trails to walk around. You can try walking to the Hollywood sign. Best piece of advice is go on a weekday as it's easiest to park closest to the park. Weekends are really hard to find Parking close by."], ["Reviewed March 2, 2017", 5.0, "Great views", "I have visited this park since the late '90's. always loved it. Used to bring my dog(s) too. Nice hike and wonderful views form the top. It is crowded as it can be a celebrity spotting site."], ["Reviewed March 1, 2017", 3.0, "I'm not a huge fan of this \"favorite\" hiking spot", "These seems to be a place many in the area talk about going to take a hike. Apparently many people have \"star sightings\". I found the conditions not well maintained. It's a nightmare to find parking and to me it's not beautiful. There are many other spots I enjoy more.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Favorite place to jog and sightsee", "This place is great! So many different trails available to walk or run. The views are simply fantastic, you see all of LA and even better is done right before sunset."], ["Reviewed February 21, 2017", 5.0, "Great Hike", "WOW! What a vigorous hike with fantastic views of LA! We hiked up the east path (Inspiration Point...also known as Star Trail??) and came down on the paved road and then hiked up the west path (West Ridge Hiking Trail..also known as Hero Trail??) and looped around on the \"bridge\" and stairs to come down the paved road a second time. The east was definately easier than the west. We were visiting LA without a car, so we had our Lyft drop us off at N Fuller Avenue and we went in that gate, but we came out the gate on Runyon Canyon Road. We timed it to catch the sunset from the top of the trail and it was fantastic!\nShow less"], ["Reviewed February 18, 2017", 3.0, "Too Many Dogs Not On Leashes", "The park seemed like a great place to exercise with all the hills. Great views. However, there were too many dogs running around off leashes. Even though the sign says dogs must be on leashes people do not obey and the rules are not enforced. Everybody is not a \"dog person\" I left because of this and really didn't get to see what all the park had to offer.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Canyon Run Rocks", "Runyon Canyon is one of the best running spots in LA area.\nGreat dog friendly park as well with some of the best mannered dogs you'll find.\nGet in for a sunrise run or hike if possible for some amazing views of the city and of course HWood sign. Park is open from sunrise to sunset.\n\nWhether you're running or hiking, prepare for a busting hill climb if you start at the bottom up to Mulholland at the top. Easy downhill back down with some extra offshoot trails if you need more. You'll find more hikers, walkers w/dogs, etc then runners but a great place for a nice uphill run.\n\nIf you forgot your water, there is also an honors system cooler at the bottom with water and snacks. One of the best in LA for sure.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Awesome views, not for the faint of heart or afraid of heights", "Drove my daughter to go hiking here, gorgeous views of the valley and Hollywood sign. All locals, many with their dogs. There is no fence and it seems parts of the path slide off the mountain! Bring comfortable shoes and water. And your camera."], ["Reviewed February 14, 2017", 5.0, "Loved it", "This is the best place to escape the noisy and crowded walk of fame. Just a few minutes away from the walk of fame you will find this Little paradise. Whether you just want to walk or run, here you are right. And if you are lucky you will spot some stars here\nShow less"], ["Reviewed February 13, 2017", 4.0, "Gorgeous View, Mostly Easy Paths", "Runyon Canyon offers some spectacular views of LA and is easily accessible. There are a few different pathways with various levels of difficulty, but no path is really challenging. It's definitely a nice place to go for a light trail and take in the view, but be aware that parking can be a struggle.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Great place to hike", "The canyon is very accessible from the city and it's a good workout to get to the view point. It can be busy which is great if you're by yourself as it feels safe, but if you want somewhere quieter there are better places to hike in the area.\nShow less"], ["Reviewed February 13, 2017", 5.0, "A great place to hike", "I lover Runyon Canyon. It is even better now that part of the walk is paved. Bring you dog - dogs roam leash free - but pick up after it! If you do the whole trail it can be challenging, but it is certainly not impossible for even those of us getting up in years. You get exercise and great views of the city.\nShow less"], ["Reviewed February 11, 2017", 5.0, "Beautiful and breathtaking.~", "By far, one of my favorite places in LA. It's not just a great hike, but a wonderful place to broaden your horizons. The view at the top will remind you why it is called \"The City of Angels\". And the amazing Rock Circle is a mysterious and beautiful vortex to unwind and manifest. There is yoga there and dogs are allowed. It is a special place.\nShow less"], ["Reviewed February 10, 2017", 4.0, "Gem in heart of Hollywood", "Easy to walk to from centre of Hollywood, great place for morning walks and wonderful views......and free!"], ["Reviewed February 7, 2017", 5.0, "AMAZING!!", "This is a must do if you are in the area. The views are spectacular and the hike is a god workout. I suggest going there in the morning and late afternoon for different views of the canyon and the city."], ["Reviewed February 6, 2017", 4.0, "Runyon Canyon Offers Different Hikes for Different Levels", "Very nice place to stop. Took the easiest hike. View was worthwhile. This is not the place to see the Hollywood sign though."], ["Reviewed February 3, 2017", 2.0, "Used to be beautiful", "I remember Runyon Canyon from 24 years ago and it was magical. Very few people, not many dogs, more of a wild feeling, fabulous for contemplating the nature as you hike. Right now it's like the 405 freeway! So crowded on the weekends, it's like walking a busy street in New York! Soooo many people, dogs, loud conversations. It became more of an out door gym. Not to take away from breathtaking views but as for communing with the nature, no thank you!\nShow less"], ["Reviewed January 31, 2017", 4.0, "Great Views", "Great spot for a Sunday walk. Be careful of cars on the roads as they tend to go fast. Take a partner and get some exercise!"], ["Reviewed January 28, 2017", 5.0, "Great hiking and views", "Runyon Canyon is great for a good hike. Beautiful view of downtown LA. Parking is very difficult to find. We got lucky parking on main road. Very dog friendly, it seemed there were as many dogs as there were people. They even have water fountains for the dogs.\nVery steep, going down the canyon is easy but coming up was rough, no idea how some of the people can run it. There is paved road you can walk/run on, or you can climb up on the dirt paths to the very top of canyon (which my daughter opted out of). If I lived in LA though this would be great daily workout.\nShow less"], ["Reviewed January 28, 2017", 5.0, "Must do in LA, celebrity spotting+a work out!", "Every time I come to LA i do the circuit around Runyon Canyon.\nGet above the glitz, glam, filth and poverty of Hollywood and look out over LA from the hills to Downtown the views are amazing.\nGives you just a taste of what it might be like too live in this area. Keep an eye out for celebrities that frequent the track!!\nShow less"], ["Reviewed January 26, 2017", 2.0, "Typical", "If you're trying to get away from the tourist or locals. this is NOT the place. This spot is just filled with the typical LA crowd. There is so many more hiking areas with way more to offer. I think most people go here simply cause its close but can be really busy on weekends.\nShow less"], ["Reviewed January 25, 2017", 5.0, "Ready for a walk", "During our break from the business meetings my husband and I decided to go to Runyon Canyon. Make sure you are physically ready for an uphill trek if you park near Fuller Ave. We took the east trail and it was a winner. Parking can be tricky and we went on a Wednesday. Make sure you use the bathroom before you go because there is nothing in the park. Don't forget the water and a towel to wipe off the sweat.\nShow less"], ["Reviewed January 24, 2017", 5.0, "fun 2 hour hick", "me and kids did a fun 2 hours hick one day - it is not far from Beverly hills - about 30 min drive and it was nice to be out in the fresh air hiking"], ["Reviewed January 23, 2017", 5.0, "Gorgeous views", "I had wanted to hike Runyon in October 2015 but my friend and I couldn't find time, so we made it a priority for my recent visit. Unfortunately a few things outside of our control got in the way of our hike so we didn't get all the way to the top.\n\nNote that on Mondays one side of the street has cleaning, so no parking 12-3pm and then the other side is Tuesdays same time...there is lots of on-street parking but those hours make it tricky. We went from the Fuller St entrance to Mulholland taking the harder trail up and the easier, paved one down. Views are stunning.\n\nBring water!\nShow less"], ["Reviewed January 18, 2017", 5.0, "A must do while in LA!", "This was a fantastic outdoor activity to do while in LA. Before we started our hike we took an outdoor yoga class that we found on Facebook and it was fantastic and based on tips. You'll want to block at least three hours to hike both mountains but time to stop and take pictures and take in the views. There are no bathrooms so go easy on the water. Another helpful tip is there is a man selling cold drinks and fresh fruit at the entrance gate for cheap.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Great hiking with great views!", "Hiked Runyon canyon yesterday while visiting friends. The trail we chose was very scenic, but did have some steep inclines. Will try it again once my legs recover!"], ["Reviewed January 16, 2017", 5.0, "1 of top 10 things to do while visiting LA", "The view over looking LA is amazing!\n\nThere are 2 trails an easy and a hard. It is super busy so safe to do alone, with partner or with friends.\nParking around the area is tricky and parking inspectors are always around so be sure to check the signs or park on the other side of Sunset blvd and make your walk a little bit longer.\n\nMost importantly take it all in... you'll see the mansions in the Hollywood hills, the Hollywood sign, Downtown and out to the coast.\nShow less"], ["Reviewed January 11, 2017", 5.0, "Good hiking and beautiful views on a sunny day", "Took the intermediate-level trail to top of canyon, on recommendation of one of the servers at Hollywood Roosevelt Hotel restaurant. I had 70 degree temp and cloudless sky, so weather was definitely cooperating. Entrance to trail is short walk from hotel, then trail begins. If you don't want dirt and rock trail, you can take the paved trail, which I took on descent to get different view angles. Views along any of the trails are fantastic and truly breathtaking at summit. Entire hike up and back to hotel was about 2 hours, and I'm a slow-pokey walker. Highly recommend if it's a sunny day, but would skip if the sunlight is not cooperating.\nShow less"], ["Reviewed January 9, 2017", 5.0, "Hiking", "The must do hike for tourists. Not too hard n star watching. Take the paved road for an easier experience"], ["Reviewed January 8, 2017", 5.0, "Beautiful Place to Hike", "It's free and it offers breathtaking views of LA. What more could you ask for? It was a great workout and wonderful experience."], ["Reviewed January 7, 2017", 5.0, "Challenging and Fantastic", "Parking can be a little tricky but once you arrive at the trail it's beautiful. We went on a Saturday morning and it was busy but it was no problem. We stopped and thoroughly enjoyed the scenery along the way. The last part of the trail was very challenging as you literally had to use your hands to climb up the hill. I never dreamed I could make it all the way to the top but I did!! I was euphoric!! We would definitely do it again!!\nShow less"], ["Reviewed January 5, 2017", 5.0, "Get fit with a view!", "This is a very popular spot for hiking. I would recommend getting out there no later than 10am. You'll want to be done with your hike before the heat of the day begins. Parking can be tough so that's another reason to get there early."], ["Reviewed January 1, 2017", 5.0, "Amazing Scenary and Easy Access", "The park is very easy to spot and directions are clear. There are many trails to choose from and all of them offer panoramic views of downtown LA and surrounding areas."], ["Reviewed January 1, 2017", 5.0, "Gorgeouos Views with a Good Workout", "We hiked this park as a family the day after Christmas. It was a beautiful southern California day. The terrain is easily managed by hikers of all ages. It was a tad crowded but not to the point of distraction. You get some really fun views of the greater Los Angles area including the downtown skyline with the glimmering Pacific in the background. A great way to burn some calories and have some fun!\nShow less"], ["Reviewed December 26, 2016", 4.0, "Cool walk with views", "You have to go a bit outside the city to make it there and parking can be a bit of an issue especially on a busy day (like Christmas holidays) but the views are totally worth it. The hikes we took were pretty easy but the park is so big that you can find a great number of hikes from easy to difficult. Views range from the Hollywood sign on the back to the Pacific Ocean and the properties in the area are also worst while ur visit up there!\nShow less"], ["Reviewed December 23, 2016", 4.0, "Awesome views, but be prepared for inclines", "We had a great time hiking here. Be prepared for an actual hike, though, at times without a paved road (i.e., it’s not just a flat walking trail). The views are worth it!"], ["Reviewed December 22, 2016", 5.0, "Fun with a pup", "It's a lovely hike but if you don't have a dog with you I think the fun factor drops by about 50%. Parking is super difficult but once you manage that just enter from anyway you can and just walk. It's a hilly hike so not sure why few people said it's a cake walk. It's one of the few hikes that allow unleashed dog so it's super popular with dog owners with well behaved dogs. Our dog was in heaven being able to run around and come back to us as if 'this is crazy...I can go anywhere I want and I won't get lost?\" We had the best time watching our dog get confused and snuggle up to strangers only to find out it's not us. Everyone seems to love dogs on this hike so she was petting and hugged a lot. We managed to keep up with her with a lot of heavy breathing and cardio exercise up and down the hill.\n\nViews are spectacular but where are there not good view in LA? Every hike I've been on in LA has just the best views.\nShow less"], ["Reviewed December 21, 2016", 5.0, "Very surprising", "Difficult to find a parking spot close to the entrance of the park, but when finally in ... the climb starts!!! Whatever direction you take ... it goes up hill. The park is very popular to locals. Lots of dogs, accompanied by their bosses. We enjoyed the walk taking the road up hill. When finally at the top you may choose for other trails as well. We choose to stay on top and walk back from the hill top by the very steep stairs. The overview is great (including the HOLLYWOOD-sign). If the smog isn't to heavy you even can see the islands across.\nShow less"], ["Reviewed December 19, 2016", 2.0, "Giant Pet Relief Area", "Not sure why its so popular. It felt like I was hiking a giant mound of construction dirt filled with dog poop every few steps. So many people take their dogs here on their hike but do not clean up after them. I spent more time looking out for dog poop rather than enjoying the view.\n\nDifficulty of the hike? None at all, and I'm not an avid hiker by all means.\nShow less"], ["Reviewed December 16, 2016", 4.0, "Excellent way to get away from the busy city and get amongst some nature", "We came here straight off a long distance flight (14 hours from Australia) to help work through the jet lag. It's reasonably easy to find and easy to walk (i.e well marked) but a somewhat testing walk down and back up some reasonably steep slopes. You need to be reasonably fit and wear good shoes. But there are some great views of the city and the Hollywood houses nearby.\nShow less"], ["Reviewed December 11, 2016", 4.0, "THE ULTIMATE WORK OUT", "This infamous trail is a must do and is a must do for locals and travelers alike. I find it best with a buddy and gossiping the whole way up. Bring a hat, water, even a snack. The view is obviously the cherry on top of a great workout.\nShow less"], ["Reviewed December 10, 2016", 5.0, "Easy place to see all the city!", "Great workout with the rest of the city and their pups. Even celebrities can be seen! Views around each turn!"], ["Reviewed December 10, 2016", 5.0, "Great views, great place to walk, hike or jog", "If you are driving here and leaving your car I recommend the North entrance as there is a small parking lot here. It is located where Mulholland Drive and Pyramid Place intersect, it runs down alongside Desmond Estates Rd. It is often full (it only holds around 20 cars) but if you patiently wait at the entrance someone will probably arrive and drive away within a few minutes. There is quite a frequent turnover of cars here. There appear be some parking areas at the very top of Mulholland drive where Pyramid place starts but there is a sign saying no parking or you may be towed away so I wouldn't risk it, although you do see some cars parked here just off the side of the road! There are two entrances at the South side of the park on N. Fuller Ave and Runyon Canyon Rd but the parking here looks very restricted.\nThere are many paths to take from the North entrance, either along the paved Runyon Canyon Rd or into the heart of the park itself along mostly dirt paths. There are certain areas where dogs have to be on a leash but most I saw were off leash, but well behaved - mostly! There are many vista points, some have benches where you can sit as people exercise on them and inbetween there are many paths through the canyon. Some are easy, some are harder and one of the peaks requires a bit of a scramble but it is worth it for the views up there. If you're lucky you might even see someone famous too!\nShow less"], ["Reviewed December 6, 2016", 5.0, "Views.", "I love Runyon Canyon.\n\nIt's a great place to walk or run. Its a great place to get away from the busy city. It's a gem within LA.\n\n\nIt's a great place to unwind. And the views of the city are incredible.\n\nIn the hot weather it's a great place to catch some rays too.\nShow less"], ["Reviewed December 4, 2016", 5.0, "Great place to exercise", "Great place to walk by yourself or with friends, great views midway and at the top. Parking is always a little difficult though."], ["Reviewed December 4, 2016", 5.0, "People are always smiling on the hike here", "I took the dog loop. Just watch out because people have their dogs off the leash.\n\nGreat view and a great spot to get away from Hollywood. Easy to find street parking if you are patient.\n\nIt would be nice to see volunteer groups out everyday picking up trash. It is crazy people liter so much in LA. Growing up in S. Cali in the 70's that was a huge no no. Fines were actually given.\n\nPeaceful city hikes.\nShow less"], ["Reviewed November 28, 2016", 4.0, "Jogging trails", "We walked a bit on the jogging trails while on a Hollywood tour. Super close to all the stars' homes!"], ["Reviewed November 28, 2016", 5.0, "Nice Hike", "We stumbled across Runyon Canyon Park cos we hired an Airbnb on Franklin Ave. Neither of us are walking fanatics but we decided to take a hike. Really happy that we did because it is stunning! Well worth the trip.Take plenty of water!"]]}}