{"Safari West": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Safari West", "url": "/Attraction_Review-g33055-d106768-Reviews-Safari_West-Santa_Rosa_Sonoma_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/10/1a/8f/e3/safari-with-giraffes.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1583"}, "address": {"@type": "PostalAddress", "streetAddress": "3115 Porter Creek Rd", "addressLocality": "Santa Rosa", "addressRegion": "California", "postalCode": "95404-9655", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Valentines weekend dream", "The Wonder in the woods was a great Valentine’s Day surprise for my wife. 30 minutes up the hill from Napa wine country. This was a great trip. We added on the lunch as well. Great guides with a wonderful Safari setting!"], ["Reviewed 1 week ago", 5.0, "Wonderful", "Great day--ask for Jeff--he is a great guide! My favorite was the giraffe and rhino. My 80 year old mom loved it as well!"], ["Reviewed 4 weeks ago", 4.0, "Great place to take family", "Family visit on the safari! Nice to see animals not all caged up, they are out free. Giraffes came up to the jeep, very cool! Will have to go back and spend the night in one of the tents."], ["Reviewed January 22, 2018", 5.0, "Wonderful time with granddaughters", "Saw many animals and learned a lot. The tent cabins were fantastic and the food was delicious. I would go again."], ["Reviewed January 21, 2018", 5.0, "Great adventure", "We had a wonderful day at safari west. Our guide was very knowledgeable and friendly. The animals were amazing to see as well as the beautiful property. You can tell how much everyone cares for these animals. Worth the time and the money."], ["Reviewed January 3, 2018", 5.0, "Experience the Serengeti in California!", "I was wondering if this place will even be open considering the devastating fire that engulfed the area in October 2017. Luckily, they survived (thanks to the owner staying back and using garden hoses to fight back flames to save the animals) even though you can see many of the properties on the drive to this location being razed to the ground. The Safari itself is well maintained - both the animals and the vegetation. The guides are both passionate and knowledgeable. The open jeep lets you experience the animals in the wild. If you get a chance ride on the top of the jeep. It lasts about four hours and they even have a restaurant on site.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Safari West", "Awesome! Grandkids were speechless- staff did an incredible job maintaining the overall experience despite the recent fires!"], ["Reviewed January 3, 2018", 4.0, "Despite a few vague misgivings about \"zoos\", went away...Great!", "This is an unusual attraction that I'd never heard of until the fires (which missed it)...You and about 7-8 others tour the very spacious grounds in a safari truck guided by a naturalist who points out (if you can't see beyond the end of your nose) the rhinoceroses, giraffes, ostriches, wildebeests, various African antelopes, monkeys, zebras, cheetahs and (in the aviary) scarlet ibises, roseate spoonbills, etc. The animals are obviously well cared for, and, although this isn't a zoo, adult visitors will sometimes have a nagging concern about whether some of the animals (in smallish enclosures) really want to be here...Put that aside, bring the kids, and you'll have a great time. Pretty unique. Would give 5 stars otherwise.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Wow!!", "I can't tell you how highly I recommend you taking your family on this tour! We ate lunch at their buffet, then set out on the tour. EXCELLENT is the best way to wrap this up, don't miss it. We would have liked to stay overnight in one of their tents, however, understood that with the recent fires that was not obtainable.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Wonderful Experience!", "I took my husband here as his Christmas Present. It was absolutely Wonderful! We began with a one hour walking tour of animals that were not out in the open range. Then the next 2 hours was a safari type ride of the safari west property with sections of different animals, such as giraffes, zebras, rhinos, etc... Our guide Leslie was fabulous and so knowledgeable. She gave us turns sitting on top of the jeep so all could have a Birdseye view. After our 3 hour tour we enjoyed a very tasty lunch with 3 types of salads, grilled veggies, beans, macaroni and cheese, chicken, pulled pork and rolls. I would recommend this tour to anyone. They do a fabulous job of taking care of the animals here, we were so impressed! This should be a tour you mark off your bucket list.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Must see", "Wonderful place, our guide Leslie was friendly and knowledgeable. We had a great time. It was interesting and well maintained."], ["Reviewed December 26, 2017", 5.0, "Animal Lover Heaven", "I took a family of animal lovers to this nice location in Santa Rosa. It survived the ravages of the wildfires earlier in the year. It is a mixture of smaller cages with a variety of smaller animals, birds and monkeys with open fields of larger animals such as giraffe, ostrich, zebra and elephants and you can get up close and personal with most of them inside your tour jeep. The guides are very knowledgeable and clearly closely involved with the 'vision' here. The animals all look healthy and as far as one can tell happy! My wife and daughter are not supporters of 'caged' animals but they were very pleased with the ways the animals are looked after here and Safari West is playing a part in the conservation and breeding of some of these wonderful animals. This is a fine place both to visit and support - highly recommended.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Wild Time", "Absolutely worth the cost. The animals are well taken care of and you experience seeing them in a natural habitat, happily roaming within their area. You get to see a huge array of cool animals up close, including the open-jeep tour portion through a big part of their land and the walking portion, all led by friendly, knowledgeable staff. A truly unique, educational and fun experience!\nShow less"], ["Reviewed December 21, 2017", 5.0, "The BEST experience outside an African Safari!", "The tour in a Jeep is awesome, but the overnight stay is icing on a cake! I went with my family of young kids. With the overnight stay, you get to hear the animals at night!"], ["Reviewed December 18, 2017", 5.0, "Vistas and Birds and Animals, Oh My", "Loved this visit. My first impression - surprised at cleanliness and orderliness of the place, especially with the recent fires, which burned to the edge of the property, and did take home of owner, and others. Richard, our guide, was most accommodating and informative. The tour starts with a pleasant walk about to see magnificent birds and small mammals - then a short break before a longish drive around the property. I loved this place - it isn't like a zoo, nor exactly like an African safari, but animals, all born on site I believe, are well kept and seem quite happy and also left in their wild state to the degree possible. I would definitely return. I took my 4 1/2 year old grand daughter and she loved it as well. Minimum age is 4. Wear closed toe shoes and dress in layers in the winter.\nShow less"], ["Reviewed December 6, 2017", 5.0, "What a gem!", "I did not know what to expect at Safari West since I had really never heard of it until my Father-In-Law booked a trip for myself, husband, and his daughter, her husband and their 3 kids.\n\nWhat an experience! And who knew Santa Rosa housed such a cool spot. We stayed from Friday to Sunday in one of the large tents overlooking the park and pond. It was like you were \"Glamping\" and I loved hearing the animals as we went to sleep. I think I enjoyed the kids reactions the most to everything as they were amazed by all of the animals. Such a great place to take your kiddos!\n\nA couple other highlights: the food is pretty good and they have smores every night around the fire :) There are little birds running around which is pretty cool too. I highly recommend going on the full tour of the park. You get close and personal with the animals which is really cool!\nShow less"], ["Reviewed December 4, 2017", 5.0, "Worth the Wait!", "I planned a trip to Safari West for my son's 12th birthday in October. However, the fires that ravaged the Sonoma County, understandably, caused our trip to be postponed. Even with the devastation that the area, and undoubtable the staff as well, were going through, Safari West Staff reached out to me in advance of my scheduled trip to offer me a full refund or a rescheduled trip. I rescheduled, as we still wanted to make the visit and wanted to continue to support the business when it when they were back up and running.\n\nI would read the updates posted on their website and on their Facebook page, updating caring people on the status of the animals in their care. Ultimately, we were just hoping that they would all remain safe. It was truly miraculous that the park, due to good fortune and the owner who helped put out spot fires on the property, that they had no loss of life.\n\nOur visit was on a crisp Saturday afternoon, November 25, 2017. We were greeted by our tour guide and driver, Alex, and our giant, yellow, tour truck. The tour and Alex did not disappoint. He was knowledgeable and funny and kept all the guests engaged and entertained. The tour lasted around 2 1/2 hours and took us across the sprawling property. The beginning of a guided on-foot tour included a large aviary that we got to enter and walk about. We were followed by one of the residents the whole way, a type of crane I think.\n\nWe later jumped into the aforementioned giant, yellow, tour truck. My favorite part was the section when we came up to the zebras. They were so sweet and had such playful personalities. We also got the opportunity to get up very close to the \"puppy dogs\" of Safari West, a herd of Watusi cattle. Their large horns are, at first, intimidating, but with their docile nature, it was just impressive and beautiful to see them so up close. I had to neglect my inner 10-year old's urge to reach out and pet all of the animals we came into contact with.\n\nThis place may disappoint some who are looking to get so close to every animal that they too feel like they can reach out and touch them. Such expectations are just unreasonable. Also, this place is not a zoo or an actual African Safari. Spoiler alert, you are not going to see African animals wild in nature. I do not expect to pull alongside the rhinos and have them openly grazing beside our truck. That probably wouldn’t be the safest, prudent choice so I appreciate the park separating them. What I was happy to see was a well\nShow less"], ["Reviewed December 4, 2017", 5.0, "Safari West - AWESOME!", "After the devastating fires, and seeing it on the drive up, we didn't know what to expect. When we arrived, the staff were superstars! Our tour guide was really knowledgeable and friendly and answered our young children's questions with patience. Hearing the story of the owner fighting the fires after emergency evacuation really put in perspective the love and care of this place. He risked his own life to save his animals while his own home burnt to the ground. All were saved! Please go visit Safari West for support and donations to this worthy cause.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Wonderful Thanksgiving!", "We had been on safari before so decided to take out-of-town family on safari. When we saw they were serving Thanksgiving dinner that seemed an easy and convenient option for our large group. We were all surprised at how good the food was as well. We didn't miss cooking (or cleaning) ourselves! The safari is always fun- our group had a jeep to ourselves and took turns riding on top. A very special day!\nShow less"], ["Reviewed November 30, 2017", 5.0, "Excellent Experience", "My Fiancé and I were so excited to hear that their weren’t any animals hurt in the recent fires... We had a great time here and were ecstatic that we visited this place in the “slow season.” Their weren’t any overwhelming crowds and we still saw all the animals... We also were able to ride on the top of the suv.\n\nLastly, we enjoyed a great guide/experience by Alex.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Great Experience", "Our whole family loved Safari West - young and old alike! You will not be disappointed! The animals survived the recent fires - a blessing for all of us."], ["Reviewed November 27, 2017", 5.0, "An Absolute Miracle That this Place Survived the Fires!!!", "We took our family to Safari West when visiting Northern California. It is important to make a reservation prior to visiting the site. We visited just a short time after the horrific fires in Santa Rosa and were amazed to see that this place was able to survive and that none of the animals were injured. We had a 9 a.m. tour with Leslie our guide. We first walked some of the grounds including an incredible aviary. After visiting some of the animals by foot Leslie drove us in an open jeep around the property. She was thorough explaining all the species and extremely patient with the many questions from my granddaughter. It is very impressive how much knowledge she has about the animals and loves her work. The property is picturesque and a lovely place to spend the day. They have a snack back as well as a place to eat a full lunch. We ordered and paid for the lunch online. The lunch is a buffet with several options including beverages of either coffee, tea or hot chocolate. Everyone had a fun time.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Thanksgiving Lunch!", "We attended the Thanksgiving event this year and loved being able to stroll around the areas where many of the colorful and entertaining birds are kept. A different holiday experience for sure! The food was good too, I especially enjoyed the mashed potato. Worth it!"], ["Reviewed November 25, 2017", 5.0, "Thanksgiving!", "Fabulous Food! Fantastic atmosphere - Staff was SO professional, helpful, yet totally unintrusive. We had a family party of 20, and EVERYONE enjoyed the experience :) The animals were SUCH a bonus, and given the events of this year, we felt so honored to celebrate GRATITUDE at Safari West. Thank you for a lovely holiday!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Good one time getaway!", "Very courteous and friendly staff and a nice collection of wildlife. Good for a one day getaway away from the city!"], ["Reviewed November 24, 2017", 5.0, "Family Fun and Adventure", "We had a wonderful time and tour at Safari West. A good mix of riding and walking. Our guide was friendly, fun and informative. Perfect day for kids and adults. We added the lunch option and were pleased with the variety and quality."], ["Reviewed November 24, 2017", 4.0, "Dinner With The Animals", "Thanksgiving Dinner at Safari West was, for the most part, an enjoyable experience. Check-in was smooth, seating was indoor or outdoor per your preference. Since it was occasionally showery yesterday we elected for indoor and they already had place names for us where to sit. The soup and appetizers were very good and the dinner itself, served buffet style, was also very good. The one disappointment was the dessert. The choice was Pumpkin or Pecan pie. We opted for the Pecan pie and the serving was small, unadorned by either whipped cream or ice cream and tasted like one of those store bought ones that's sat around for a while. There were a lot of people but it never felt very crowded. Walking around the part of the park that's accessible without buying a tour ticket was enjoyable, there were quite a few animals and birds to see.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Better than Africa", "Well okay I have never been to Africa. But I have never seen such a large group of healthy animals roaming a beautiful habitat. Amazing place. Great guide. I love birds and thought this was a great treat to see all of those African species. This place far exceeded my expectations. 3hrs is just about right. Wish we had pre-ordered lunch since it looked great.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Education & Entertainment for the Whole Family!", "Our whole family loves Safari West - the owners and staff lovingly care for the animals and are very knowledgeable about all of the African natives living on their sanctuary in Santa Rosa, California. This would make a great day trip from San Francisco or an overnight in one of their tent camps on the savannah.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Amazing Overnight Experience", "We visited in August, staying overnight and taking the safari the next day. This was part of a 9 day trip to San Francisco. After the trip I asked my kids (10 and 7) what they enjoyed the most about the trip (Alcatraz, Golden Gate Bridge, Muir Woods, Fisherman's Wharf, Giants game, Russian River brewery (okay - that was for me), Safari West). Their immediate response was Safari West.\n\nThe staff were so helpful (including calling me when I reserved a cabin but forgot to book the safari), the grounds were amazing, and the animals were plentiful. We started with a communal dinner the first night where we met so many other families. The kids were wandering around with new friends by flashlight and having a blast. The next day we took the safari tour which was equally outstanding.\n\nThe kids already want to go back! An unbelievably fun time.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Amazing experience!", "I'd go back again in a heartbeat. We stayed overnight in one of the tent cabins and while expensive, the experience was absolutely worth it. Being able to hear the animals overnight was cool, but likely could only do it for a night at a time - who knew jungle animals made so much noise?? Haha\nShow less"], ["Reviewed October 29, 2017", 5.0, "Safari West", "It was a really lovely experience, but will be closed for a while due to the fires nearby. Please check before you visit. When it does reopen go it is well worth it."], ["Reviewed October 19, 2017", 5.0, "Safari and lunch", "We thoroughly enjoyed ourselves. 2 of our party were elderly and required a little special care which they were readily given. Our docent was very enthusiastic, fun and informed. Lunch was very good.\nGreat afternoon! Hope all goes well and quickly in regrouping after the fire. The best!\nShow less"], ["Reviewed October 17, 2017", 5.0, "Legit place to visit", "Animals come close to the vehicles. Guides are knowledgeable and friendly. Preserve is large with variety. Great for every occasion. Food is also really good. Fresh and organic."], ["Reviewed October 17, 2017", 5.0, "Family adventure", "Fantastic. Adventure-will go back and spend night. So sad that fire started the same day as our visit"], ["Reviewed October 16, 2017", 5.0, "Great time", "Over all I thought it was a neat experience. I loved the Giraffes and the rhinos. Would have been really neat to have some elephants there as well. Borrowing or rescuing a couple from the Oakdale rescue would really add to this experience. Our guide was well informed and sure loved his Antelope!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Amazing time", "The kids, 6 and 10, loved it, especially riding on top of the jeep. The animals are incredible, their environments are fantastic, and the tour guide was friendly and very knowledgeable. Expensive, but totally worth it. That money is going to create a great facility for the animals.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Wonderful experience", "Went to Safari West with my two boys (12 & 15) and husband. We really enjoyed our trip and loved how you were able to get up close and personal with the animals. The guides made the trip even better. We all learned so much about the animals and ones we never really paid attention to. Great experience for everyone. Would definitely recommend making reservations for lunch too!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Amazing Adventure for Young Family", "We went to Safari West for our daughter's birthday and it was very well run--very professional, organized, informative, and fun to see all of these animals you wouldn't normally see up close! Cheetahs, birds from South America and Africa, Giraffes, Rhinos. Just amazing the variety of animals we got to experience. Riding on top of the truck was the highlight for my son.\n\nWe were incredibly fortunate to visit Safari West the Saturday before the wildfires broke out in Santa Rosa in October 2017. Thankfully, it appears Safari West and its animals are safe, but our hearts go out to the owner and all of the animals and staff, and we hope they will be back up and running once the fires subside.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Family fun", "We had an amazing time! Our tour guide was incredible! We cannot believe it took us so long to get there! We would recommend the tour to everyone!"], ["Reviewed October 14, 2017", 5.0, "for kids and adults.", "Wonderful experience for whole family. Guides are knowledgeable and patient. Will go again next year."], ["Reviewed October 14, 2017", 5.0, "So fun!", "I visited with my husband and our 4 year old daughter - it was so fun! I would definitely go again. They were so knowledgeable and great with kids. Also, the lunch after our safari tour was delish!"], ["Reviewed October 12, 2017", 5.0, "Amazing Trip", "Safari West met all our expectations and more. Lunch was very good and all the staff were very friendly and informative. The Jeep experience through the park, seeing all of the animals was exciting and we learned a lot. Our Guide was excellent and very knowledgeable and truly seemed to care for the animals. We would surely recommend this experience to everyone. A great family outing.\nShow less"], ["Reviewed October 11, 2017", 5.0, "GO GO GO!!!!", "Truth is I am usually not such a big fan of these types of attractions- but Safari West proved to be the exception. A large preserve with lots of space to see lots of animals mostly native to Africa. We got to see Zebra and Giraffes up close for the open jeep. Our guide Robert was A++++- nice,knowledgeable and really friendly. He knew everything from mating habits to biology of species. Really smart.\nWe stayed for the lunch afterward which was equally good. Again, a surprise but fresh and delicious.\nWe did not stay overnight but spoke to others who did and they loved it. If you are in this area go- and NOT just for children- we were two adults!\nBeware- it is COLD in the morning tour- it warms up and they supply blankets.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Love those animals!", "Our visit was amazing. Babies all over the place! I loved the free range of the herbivores. Thank you Tad for the great tour!"], ["Reviewed October 10, 2017", 5.0, "Wonderful experience!", "This place is a treasure. Animals are well cared for by professional and highly qualified staff. We learned things, too!"], ["Reviewed October 10, 2017", 5.0, "Safari West Tour", "This place is absolutely amazing! Extremely knowledgable staff and a lovely facility. You can tell that the animals are really cared for here."], ["Reviewed October 10, 2017", 5.0, "Amazing getaway", "What a fabulous place. This is an ideal location for people of any age. Walkable tour of animals along with jeep tour to see animals you would normally have to travel to Africa to see. Tent cabins are charming. Roll away beds are abominable and the noise from the fountain was loud but overall very fun.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Quality Trip", "Our guide Richard was outstanding in friendliness and knowledge. He's just perfect for the job. We loved the whole experience. The grounds were great."], ["Reviewed October 8, 2017", 5.0, "Lovely, lovely, lovely, lovely...", "I surprised my two best friends with this trip. We arrived on a Friday and had lunch on site, then took the three hour safari tour. After the tour we had dinner on site with a few fellow tour goers and a couple that had arrived to stay over night and do the tour the next day. After dinner, we retired to our glamping tent which was amazing. The food, staff, tour & glamping overnight were lovely!! It was worth every penny. I will be recommending it to a lot of people.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Safari West = Wine Country's best kept secret!", "Safari West is just amazing. The animals are so well cared for and happy, and the safari experience is amazing. I definitely recommend staying overnight too - waking up to the sounds of the animals is so special and unique! Also, the dinner was just wonderful. Tad, our tour guide for the safari, was very very well educated and funny too. We really loved everything about our trip, and we'll be back!\nShow less"], ["Reviewed October 6, 2017", 5.0, "A Must See!", "This was a surprise birthday gift to my BFF! We are both huge animal lovers so it was a perfect afternoon and evening. Tad, our guide, was extremely knowledgeable about the birds and animals, their environment and the overall running of Safari West. We loved the fact that profits from Safari West go to help endangered animals and to stop poaching. We stayed for dinner...it was yummy. Our only regret was we did not spend the night.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Great time at Safari West", "My family and I went for the first time recently after we read some great yelp reviews. It was a very good experience and we really enjoyed the jeep tour as well as the extra time walking around the paths to see additional animals/birds. Staff were really friendly, helpful and the food (buffet dinner, breakfast) was plentiful and good quality. We stayed overnight and while it was very cold (October) at night, the blankets were warm and a space heater was provided. Our heater made a lot of noise so we did not use it but informed the management and I believe they will fix this. Overall, great place and we would recommend to others. We also really appreciated the staff who took great care of the animals and emphasized the importance of conservation.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Lot's of fun", "We've been going to the Russian River area for many years and never knew Safari West was there! It's a beautiful, natural area full of wonderful animals NOT caged. The guide (Leslie?) was wonderful, full of knowledge and information about all of the animals, their native environment, and their adopted environment. I can't remember all the animals but there were giraffe, antelope, zebra, rhino, tortoise, pigs, monkeys, cheetah, deer, flamingo (and many other birds and water fowl). All-in-all, it was a lot of fun! Will definitely go again!\nShow less"], ["Reviewed October 5, 2017", 4.0, "Safari West Adventure", "Had a great time staying overnight at Safari West. The safari was cool and everyone was very friendly. The cabin was a bit cold and the dinner was overpriced but breakfast was great."], ["Reviewed October 5, 2017", 5.0, "Unique and exotic", "We had a wonderful time. Staff are polite and helpful. Accommodations were great, food was delicious. Camp was peaceful with an occasional noise from a wild animal!"], ["Reviewed October 4, 2017", 5.0, "Better than trip to the zoo!", "This was the best experience of our 1-1/2 week trip out west! Very organized. Excellent knowledgeable guides. Fun safari experience. Learned so many interesting tidbits about their wide range of exotic animals. Kids seemed to absolutely love it. Even my husband and I thought it was a wonderful experience and the closest we would ever get to a real safari. Our guide Leslie has worked there for 16 years and she knew all the animals and everything about them. You learn everything about the animals and their natural habitat, predators and survival mechanisms. Huge preserve and animals seem well taken care of. We opted for the safari lunch afterwards and it was delicious with so many choices. Overall excellent experience.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Loved it!", "It was so much fun and very informative. Kelly, our guide, was a fountain of information and she made the experience exceptional."], ["Reviewed October 3, 2017", 5.0, "Awesome place", "What an awesome place, to be up close and personal to all the animals. It's far, but not too far from the city. I would love to go back and stay at the cabin next year. I do have to say it can be difficult to hear the tour guide due to the fairly large groups (about 12 people). You might want to do a private tour if you have a lot of people and I recommend Safari West equip their guides with speakers. It should be a relative cheap investment that will make life a lot more enjoyable for the guests\nShow less"], ["Reviewed October 3, 2017", 5.0, "Amazing!!", "I had an amazing time! I went in the first week of October where the weather is perfect and the animals actually come out! During the hotter months our tour guide said the animals are away looking for shade. The animals for the most part where so close you could almost touch them. We had the buffet lunch add on for $15 which was tasty and just needed some salt. Everyone was super friendly. Be aware that the Jeeps they use for tours do go into some high steep places so if you are scared of heights be advised. At times we got pretty close to the edge. This location is also close to the Old Faithful Geyser and Pertfified Forrest 10/15 mind away. Downtown Calistoga isn’t too far either :)\nShow less"], ["Reviewed October 3, 2017", 5.0, "Best Birthday Surprise EVER!", "My husband surprised me with an over night stay for my birthday. Without exception - everything was top-notch. The cabin (I slept toasty warm in my electric blanket). The food (I wasn't sure what to expect, but the dinner meal was delicious BBQ chicken and ribs (Kudo's to the chef(s)). The continental breakfast before our safari tour was perfect. Now to the Safari - \"Thrilling\"! We had a great guide in Jessica. She taught us so much about all the animals and about their efforts to help endangered species. They are doing some serious work out here for these animals. She made the whole adventure fun, educational and exciting. I particularly enjoyed how close we were able to come to the animals. The Giraffes definitely don't disappoint. They were right up next to us checking us out. My favorites were the Cape Buffalo - strength with BIG horns. The bird aviary was amazing too. I live here in Santa Rosa and have known about Safari West for years. What I didn't know was what an incredible treasure this place is. Don't hesitate to book this (Especially families with kids). It's worth it. I'm an older lady and it was thrilling for me. Love, love, loved it! A quick word about the staff - Every one that we encountered was kind, friendly and helpful. The keepers took the time to answer any questions we had about the animals and I appreciated that.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Something fun and different for the whole family", "Tucked away in the Santa Rosa hills. You would never realize the hustle and bustle of a city is a few short miles away. Glamping tents are super comfortable, the food is very tasty, and the guides are informative and fun. Great fun all around."], ["Reviewed October 2, 2017", 5.0, "Nice relaxing safari", "Oh boy.... nice tent camping and fun trip. We were 2 couples getting away for the weekend without the kids.. don get me wrong...the kids would have loved it but it was nice to get away and play as adults. We spent the weekend at the safari and the next day wine tasting in Napa.. what a trip.....!\nShow less"], ["Reviewed October 2, 2017", 5.0, "fantastic!", "We absolutely loved our day trip experience. We felt as if we were transported to a magical place, a real safari far from California, and our \"vacation\" lasted days, not hours. We saw so many animals, and learned more than in our entire life about these animals. Our guide Jenna was truly wonderful, knowledgeable, genuine and fun. And since then, I believe, we recommended the place to about a 100 people - family, friends and strangers. So, thank you, Safari West!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Well worth the adventure", "Our first time to Safari West and we enjoyed it very much. There are a large number of various animals to view from the jeeps. Our guide are fun and knowledgeable. There are also several bird aviaries and enclosures for some animals that cannot roam freely that you view from the walking path. The facility is well maintained. They even have a beautiful koe pond with a waterfall for relaxing after your tour.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great, low key time", "The animals all looked healthy and happy and the staff was courteous and knowledgeable. I would have liked to have seen more large predators but understand with limited space why they can't have as many. The Rhinos and Giraffes were the highlight for me personally."], ["Reviewed October 2, 2017", 5.0, "Fun Family Weekend", "We spent a weekend visit at Safari West with friends and their young children (Ages 5-10). We all enjoyed the trip. The glamping type tents provided adequate comfort during our visit (ceiling fan for warm day, heated blanks and room heater for cool nights, bathroom, etc). We had a great tour of the grounds seeing all the animals. Great information provided about the animals - we took our time and didn't feel rushed. We thought it could possibly be cheesy but didn't feel that way at all. We left feeling we had a great experience and adventurous weekends with our kids! They loved it and had the best time with our friends!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great Safari for adults as well as kids", "Great Safari and staying over night added more to the experience. The people working there are great and there's tons of animals to see. Super set up in the middle of the wine region.\nWe had the buffet dinner at night and it was great to stay in the premise. Good spot, we highly recommend it.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Safari Birthday Excursion", "Our son is crazy for African animals, so planning his birthday weekend around our Safari West excursion seemed like a no-brainer. And we weren't disappointed! The staff was accommodating, our guide was extremely knowledgeable, and the whole tour experience was enjoyable not just for our animal-loving son, but for my husband and I as well. We also had dinner there, and we were thoroughly impressed with the food, surroundings, and everyone there. We only wished that there were tents available that weekend to make our visit complete! Thanks for a wonderful time!\nShow less"], ["Reviewed October 1, 2017", 4.0, "Fun day", "Nice park. More variety would be nice. Monkeys should not be teased with trees above cages. Why not cage around those trees. So monkeys can play in trees. And if cheetahs run so fast why do the have such small areas. They need way more space to be able to have more natural habitat. We would come back if these things were changed.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Unexpectedly high quality park and fantastic guide", "Wow! The animals were so close and very well cared for. We learned so much. Combo walking tour and jeep tour. Guide Ann really knew her stuff. Highly recommended"], ["Reviewed September 30, 2017", 5.0, "Great Visit", "Perfect weather, all the animals were out (which we heard never happens)! Next time will spend the night!"], ["Reviewed September 30, 2017", 5.0, "Get away", "Unique, fun, and entertaining. You can pretend you are in Africa while sitting on your porch and watching the giraffes."], ["Reviewed September 29, 2017", 5.0, "A must visit!", "We had a wonderful time! We chose to do the stay overnite at one of the cabins (#19 up in the hills), do the safari tour and enjoy the dinner. All were just wonderful. Our cabin was a little ways away from the talkative birds but near the pond and it's fountain which was lovely to hear in the evening. Our cabin was comfy and we slept very well. Warm during the day, chilly in the morning. The staff was great- attentive, asking if we needed anything, without being overbearing. The dinner was delicious and we got to meet a very nice couple visiting from Santa Inez. That night there was a special talk on conservation in Africa. between that and the wonderful safari tour with Richard, we learned so much more about endangered species, etc. We will be back and we will be telling our family and friends that they need to visit! Thank you for a terrific time.\nShow less"], ["Reviewed September 28, 2017", 5.0, "A slice of Heaven", "Always a great visit. Your was good. Dinner was awesome and the service is great. A very peaceful get away."], ["Reviewed September 28, 2017", 5.0, "September California Visit 2017", "We heard great things about Safari West and we weren't disappointed. Our guide, Katelyn, was knowledgeable and upbeat. She made the tour most enjoyable. Seeing so many animals up close was a terrific experience."], ["Reviewed September 27, 2017", 5.0, "Better than a trip to Africa", "What an absolutely Perfect afternoon. Sooo many animals out and about on a gorgeous day!!! The young giraffes my very favourites. A 4 month old Tarra and bit older Nikki. Baby only a few weeks old ! All out for us to fall in love with. SWest is one of my Most Happy Places on earth. The animals are lovingly cared for n in turn make beautiful babies!! The grounds are gorgeous the staff the most amazing knowledgable Animsl stewards. We are guests amidst the real life world of African wildlife. Sooo many endangered species. Breeding pair of white rhinos right next to our jeep, happily munching away! God is here in all His glory having painted the stripes and spots n feathers on all His creatires\nShow less"], ["Reviewed September 27, 2017", 5.0, "We Loved Safari West!", "We brought our 4 year old daughter and had a blast. The staff was very accommodating and friendly. Everyone went out of their way to make sure our stay was perfect.\nThe facility was very clean and the animals well cared for. The tents are amazing and very comfortable.\nWe also stayed for dinner, which was delicious. Even this picky eater enjoyed the meal.\nWe will be back!\nShow less"], ["Reviewed September 27, 2017", 5.0, "Just what the doctor ordered!", "Had a nice surprising and relaxing day. Staff was very educated and fun. We stayed for the BBQ- a must! Kids loved it' parents enjoyed the wine and food! Will be back."], ["Reviewed September 27, 2017", 5.0, "We love this placr", "We have been to Safari West about a dozen times with different friends and family. We love the dinner buffet they have and the special events for locales and Earth Day ( our sons birthday) Every trip is unique and different and the staff is amazing. If you love animals, this is a must.\nShow less"], ["Reviewed September 26, 2017", 5.0, "LOVED!", "This place is great and worth every penny! Get the lunch or dinner, its a great bbq meal. We will be back to stay in one of the cabins."], ["Reviewed September 26, 2017", 5.0, "Safari Adventure", "We were really looking forward to this and the experience did not disappoint. Ann, our guide, was wonderful - very knowledgeable."], ["Reviewed September 26, 2017", 5.0, "We had a great time!", "What a great way to spend a Sunday morning, our guide knew so much and was entertaining as well. The animals were excellent! Favorites were the giraffes and baby giraffes! Loved it! The lunch was v ery good as well. Thank you!"], ["Reviewed September 25, 2017", 5.0, "Great day", "My wife and I had a wonderful time at Safari West! We started with a delicious BBQ buffet and then we were off on safari. Both the driving and walking tour were fun and interesting. We were fortunate to see a variety of animals: rhinos, tortoise, zebra, ostrich, wilder beast, cape buffalo, oryx, antelope, etc. and really enjoyed our guide, Robert. We had an all around good time and plan to visit again.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Fabulous Experience!", "Great experience accommodations and food was great! The safari tour was great very exciting! We thoroughly enjoyed the whole experience!"], ["Reviewed September 25, 2017", 5.0, "Trip to Safari West", "We had a great time, the food was very good, and the staff was very friendly. Thank you very much. :-)"], ["Reviewed September 24, 2017", 5.0, "Best Birthday Celebration", "Best experience! Visited for my son’s 12th birthday and had a blast! Will definitely visit again and stay overnight."], ["Reviewed September 24, 2017", 5.0, "Don't miss this!", "We spent two nights at Safari West and couldn't have asked for a better experience. The animals are amazing, the staff is great, the accommodations were wonderful and the food very good. it is an amazing place"], ["Reviewed September 22, 2017", 5.0, "Adventure", "What a great place. This is a must see. Great attraction. You take a tour on a vehicle on the property viewing all of the animals. Food was fantastic. I've been 5 times and will return"], ["Reviewed September 22, 2017", 4.0, "Good tour for young kids & animal lovers", "We came for a tour, over night stay and the dinner.\n\nThe tour was great, the double decker jeep was special, the tour was very informational, we got real close to the animals and were even worried about getting wet from the giraffe's drool! The animals in the Safari are all benign and friendly, nothing wild. The wildest is probably the cheetah which is behind bars. The tent stay/glamping is also wonderful. The tent is beautiful, well kept and the service was nice. For tents in higher hills, they even drove the guests up to the tent. We came on a very hot day, so the cheetah was hiding in the shade. Good thing we stayed over night as early in the morning we could stroll in the area and see the animals being more active as the temperature hadn't raised.\n\nThe only thing we would change if we come again is the dinner. The option of food is ok, but it's kind of rationed (we have to wait in line to get steak and it's rationed on each time) and the price is much higher than if we just took a 20 mins drive back to Santa Rosa.\n\nThe tour had 2 parts, the first 45 minutes was a walking tour around cages of birds, monkeys and cheetahs. The second part was another 45 minutes jeep tour to explore the wider areas where we get to see antelopes, wildebeests, giraffes, hippos, buffalo, etc. The jeep is an open vehicle, so it's not hot or stuffed inside with breezes along the tour. The guide was very informational and knowledgeable. At the end of the tour, you can climb up to the jeep top to take the memorable picture.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Amazing place with knowledgeable tour guides", "My friend and I had the best time at Safari West! The animals are amazing, the tour guide full of information and great personality, plus a friendly staff made it a wonderful experience. It's family friendly and beautiful environment."], ["Reviewed September 21, 2017", 5.0, "A Zoo with a View", "Not far from Santa Rosa sits an excellent zoo called Safari West. Riding on top of a Jeep and getting extremely close up views of African wildlife sure made this a pleasant visit. There are plenty of \"dry\" areas during the trip, but I haven't been to a zoo without some animal too far away to see. Recommended.\nShow less"], ["Reviewed September 21, 2017", 5.0, "A Great Experience", "No doubt, amidst wineries, quaint towns, and any number of attractions vying for your hard-earned $$, Safari West should be at the top your \"must do\" list. It was a total pleasure. Our guide, Richard, was a wealth of information and fun. Don't miss this amazing adventure!\nShow less"], ["Reviewed September 21, 2017", 5.0, "Great place to visit with young kids or old!", "Took my twins for their 5th birthday and had a blast. Much more fun than the zoo. They loved riding on top of the safari truck and were thrilled to see the baby giraffes so close up. The adults enjoyed it just as much. We only went for the day, but would have loved to stay overnight. Books up quickly, so make your plans well in advance.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Safari West Vehicle and walking Tour", "We enjoyed this very much. Our guide John was very knowledgeable and likable. We particularly enjoyed getting up close to so many of the animals. You could almost touch them."], ["Reviewed September 21, 2017", 5.0, "Great experience at Safari West, Santa Rosa", "We went to Safari West, Santa Rosa on September 10th with our friends. It was a great experience & it met & exceeded our expectations. The tour guide Karen O'Conner is wonderful. Thank you, Karuna"], ["Reviewed September 20, 2017", 5.0, "California African adventure", "My husband and I finally went to Safari West. What a treat! Our guide Terry had an incredible amount of first-hand knowledge about all the animals as he had lived in Africa and worked at other wild animal parks We learned a lot and got a lot of great photos.\nShow less"], ["Reviewed September 20, 2017", 5.0, "perfect day", "The entire visit was wonderful. The animals are amazing the guides are knowledgable and very very kind."], ["Reviewed September 19, 2017", 5.0, "Great family visit", "My wife, four-year-old child and I spent the morning at Safari West and had a fabulous time. Our Jeep included two more groups with small children and our guide, Carson, had a great rapport with the kids and the adults. We learned over the years that the earlier in the morning you get to a zoo, the more active the animals are. We took the 9 AM tour and were not disappointed!\nShow less"], ["Reviewed September 19, 2017", 5.0, "Great fun!", "My husband and I brought three of our grandchildren to Safari West for the guided tour. What fun! We had an excellent tour guide named Angel, very knowledgeable and put everyone at their ease immediately Loved seeing all the different animals, and even a baby giraffe! Highly recommend this outing, and the lunch is delicious if you choose to reserve before hand.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Family Fun Safari Stye", "We enjoyed our visit to Safari West celebrating our grand-daughter's 4th birthday! Wonderfully delicious lunch with a variety of sides to compliment the BBQ. Great selection of adult beverages, too. Very friendly and informative guide for our jeep safari. Terrific to see these African animals up close, even in the middle of the day! Very friendly staff, too! Will definitely return...next time for an overnight \"glamping\" experience!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Absolutely loved the experience", "I absolutely love giraffes and when I found out safari west was close I had to buy a ticket. My husband and I had a great morning with our tour guide Nate. Very educational and fun great lunch to follow at the cafe. We will be back\nShow less"], ["Reviewed September 18, 2017", 5.0, "As wonderful as ever", "My wife and I have been to safari west 5 times since we moved here last year and every single time is as fantastic as the last. We've stayed overnight and had dinner there before (well worth it but remember to bring ear plugs) but this trip was to introduce my best friend from childhood. Needless to say two and a half hours later he was hooked and couldnt decide if the rhinos, baby giraffes or the ostrich trying to eat his shoe was his favorite part. Thanks again for all you do to keep the animals healthy and happy. It's greatly appreciated by the patrons!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Family trip", "Our family had a lot of fun. Our guide, Karen O'Connor, very knowledgeable and fun. I will highly recommend Safari West to my friends and families."], ["Reviewed September 18, 2017", 5.0, "Great Experience", "Get to spend a great amount of time touring around and seeing the animals. Includes both a walking and driving tour which is really fun. Sitting up top fun but does require a minimum height so call ahead for the details."], ["Reviewed September 17, 2017", 5.0, "West coast trip", "Loved it ... every minute. Tent 18 the best. Enjoyed the stay Only you & the wild. No tv or internet. Great food. Relax Bed awesome / bathroom awesome."], ["Reviewed September 17, 2017", 5.0, "A 10-year-old's birthday wish", "For my daughter's 10th birthday she asked to be taken on a tour at Safari West instead of having a birthday party :-)"], ["Reviewed September 17, 2017", 5.0, "Safari", "Amazing place to visit...It was like being in Africa The setting was awesome and the staff were very accommodating Perfect!"], ["Reviewed September 16, 2017", 5.0, "Wonderful night away..", "Wow... \"Glamping\" is an understatement. beds were more comfy than most hotels & you can't beat the Flamingo alarm clock!"], ["Reviewed September 16, 2017", 5.0, "Safari West", "I had heard good things about Safari West and was not disappointed. The guide was great and the animals are well cared for. I highly recommend it."], ["Reviewed September 15, 2017", 5.0, "Love the giraffes", "Went to Safari West with my Kiwanis Club for a tour and dinner. There were several baby giraffes (my favorite animal) along with so many other species. It's a great tour on the Jeep and Azelia, our guide was wonderful, sharing so muck knowledge about all the animals. Thank you Azelia!\n\nDinner was very good with a good selection of Sonoma county wines to accompany the meal.\n\nDefinitely worth it. Next time I hope to spend the night....listening to all the night animal sounds.\nShow less"], ["Reviewed September 15, 2017", 5.0, "What an Adventure!", "We did not know that we were in for such an amazing time. Our guide was very knowledgeable and filled us so many surprising facts about the many African species they had. This is no zoo. The animals were lively, active and even happy looking. They are definitely well taken care of and the land was huge. We literally stopped in the middle of a drove of Ankole-Watusi cattle with their gigantic horns as they were going down to the watering hole. These animals are free! It was an experience of a lifetime ! HIGHLY RECOMMEND FOR ANYONE\nShow less"], ["Reviewed September 14, 2017", 5.0, "Wonderful tour.", "The entire facility is fabulous, and the large African animals have more than enough space to roam, along with some necessary water and food. The escort by the crane was an added bonus! Lunch was terrific. Next time we will spend the night in one of those awesome tents!!! Thanks so much for the great tour....\nShow less"], ["Reviewed September 13, 2017", 4.0, "70 birthday", "my friend's 70th birthday nice walking trail around the park. great lunch best coffee ever. the tram took us through the park for the large animals. nice afternoon. camping available if you want to stay over nite."], ["Reviewed September 13, 2017", 5.0, "Awesome!!", "It was an amazing array of animals and even more amazing to be able to get so close to them. Our Guide Ann was very knowledgeable and informative. A good driver too. We went for my wife's birthday and she loved it."], ["Reviewed September 13, 2017", 4.0, "Fun for the whole family", "This is a really fun place. it is also great for field trips for schools. It is pricey but worth it if you are an animal lover."], ["Reviewed September 13, 2017", 5.0, "Loved it!", "Great for families with older kids (mine are 10 & 11). If you stay overnight, bring earplugs for the whole family. Falling asleep to the sounds of crickets was lovely. Until 2:30am when something woke the birds in the aviaries up and they all began squawking. I could only fall back to sleep after I put earplugs in. Otherwise, the Safari was great, the property is thoughtfully designed and very well maintained. The tents were fun and a perfect way to spend my birthday!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Great Time", "Really knowledgeable guide and fascinating animals. The ride on the jeep was comfortable and thrilling."], ["Reviewed September 12, 2017", 5.0, "An Amazing place to visit", "My husband and I visited Safari West last Sunday and did the 3 hour jeep/walking tour. We both just loved the overall experience and we look forward to visiting again soon.\nI don't have a single negative thing to say. This place is just amazing and our tour guy was very friendly and knowledgeable about the animals. All the staff we came across greeted us warmly. Next visit I do want to try the overnight experience along with dining at their onsite restaurant.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Safari West", "Great place to visit. Jessica was a terrific guide. It was beautiful, sunny day in Santa Rosa (shocking - ha!). Enjoyed it very much."], ["Reviewed September 11, 2017", 4.0, "Good Family Outing", "All the family of all ages will enjoy this walk/ride activity to enjoy seeing some of the the wildlife of Africa. The animals are well cared for and our guide was very knowledgable and made the trip fun."], ["Reviewed September 11, 2017", 5.0, "Worth the money-- so close to the animals", "I read about Safari West in the East Bay Times. I'd never heard of it before that, but I've only been in the Bay Area about 6 months. My husband and I went on a Saturday in Sept. It was $93 apiece, which is slightly less expensive than during the summer months. It's off the highway a bit, no cell service in the area, just FYI. Easy to find, signage was fine.\n\nCheck-in was easy; the staff just asked for our last name and gave us wrist bands. Wandered around the gift shop while we killed time, and I got a great hat and earrings. We saw people eating at the lunch buffet, which looked really good-- I wished I'd bought lunch with our tickets, as you have to reserve in advance. We looked at the flamingos and the bird named Abby, and staff brought out giant tortoises for people to see.\n\nMy tour got started about ten minutes late which is my only complaint. The guides seemed to be waiting for more people to check in for the 1pm tour, so those of us who were on time had to wait.\n\nThe tour itself was great. Angel was an amazing tour guide. I think she's only worked there for 5 months, but she seemed like a veteran. She was a wealth of information, gave all sorts of fun facts about the animals, and she has a great sense of humor. The tour had a lot of personality thanks to her. My favorite part was the giraffes-- they were so close to the vehicle, and one of the babies was showing off, kicking around. Also got very close to the cape buffalo, which are apparently one of the most dangerous animals in the world, and the zebras. Saw lots of other cool animals including wildebeest, gazelles, ostriches, impala, antelope, and a bunch of others whose names I forget. Didn't see rhinos up close, they didn't feel like coming close to the fence. The driving part of the tour was about 2 hrs 15 mins, and then we had about 30 mins of a walking tour back by the property entrance. There we saw, in their enclosures, a cheetah and another big cat, a couple kinds of monkeys, and a dog-like small animal. The end of the tour was in the aviary, when a funny white bird was waiting for us near the entrance and followed Abby around for most of the tour, wandering next to & behind her.\n\nOpted not to take a turn riding on top of the vehicle because it was about 83 degrees and sunny. Sitting inside the vehicle was fine. If you get carsick easily this might be tough for you, and the vehicle emits a lot of gas fumes. Will definitely return with others!\nShow less"], ["Reviewed September 11, 2017", 5.0, "An exciting trip to Safari West", "This past Saturday I decided to visit Safari West. I had heard many wonderful things about the preserve. After checking in I purused the gift shop while awaiting the start of my tour. My tour guide was Tad and he was enthusiastic and very knowledgeable about the animals. The entire tour takes about 2 1/2 hours and is well worth it. I would recommend going early in the morning though.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Fun day.", "This is a wonderful sanctuary for animals indigenous to Africa. 425 acres where most animals roam\nfree in a beautiful area of Santa Rosa CA. The guides are fantastic. Very knowledgeable, funny and personable. Our guide was Jenna. She did a great job. Worth the trip and worth the money.\nGo to Taylor's in St. Helena on Highway 29 for a fabulous hamburger after.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Beautiful day in the bush.", "We had a wonderful time my granddaughter and myself. The guide was amazing with a wealth of information. It was a beautiful day. The lunch was delicious with amazing chicken and macaroni and cheese just to mention a few items. Well worth the cost."], ["Reviewed September 9, 2017", 5.0, "Africa in California", "Awesome, breath taking, informative, truly an experience everyone should do. The Grand boys (10 & 4) loved learning about all the animals and helping out. Loved loved loved the Tent living, in the evening you can hear all the different call outs of the animals as well as in the mornings. Everyone that work there is super friendly and helpful. If going on a Africa Safari excursion is on your bucket list and life obstacles keep you from full filling that wish come to Safari West.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Glamping Adventure!", "Wonderfully informative tours. Large array of animals and the tour vehicles are a lot of fun! The tents were very well done and cozy."], ["Reviewed September 7, 2017", 5.0, "Birthday fun", "It was my mother's birthday present and she had an awesome amazing time. Thanks Richard for an awesome tour."], ["Reviewed September 7, 2017", 4.0, "Glamping trip", "We decided to try out the glamping experience here at safari west. We had two children, ages 2 and 4. We had a fantastic time. We heard how loud the flamingos and birds were, so if you're a light sleeper, I would suggest to stay towards the back of the lake. It gets very cold at night so bundle up! A small heater is provided but doesn't heat the entire room. The rooms were a great size and comfy. Bathrooms were nice, and the deck outside was nice to have if you want to relax at night. We opted for the dinner option, and glad we did! The food was excellent (BBQ) and was very filling. Breakfast is included also the next day, basic stuff but tasty. They also do a fire pit for marshmallows at night for the kids. Over all we had a great time and were happy with our overnight, and our kids enjoyed it as well.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Safari West", "Wonderful tour! We took our grandchildren. Everyone enjoyed. Even though we thought the price was steep at first, it was worth it."], ["Reviewed September 7, 2017", 5.0, "Awesome!", "We stayed overnight in a Yurt... what a great experience! It was as comfortable as a hotel room, but such a unique opportunity. The staff were just great- my kids ages 9 and 12 found an injured baby bird, and the zoologists rescued the bird and gave my kids an update the next day (bird didn't make it... but it wasn't for lack of care!). The tour was AWESOME, breakfast was pretty good and the dinner was just ok. But... guests from the Uganda Carnivore Program were in attendance to give a lecture after dinner and we really enjoyed that! No s'mores were served though, as per the website promise. But we loved seeing the animals at night, and waking up to a symphony of exotic birds!!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Loved it!", "What an amazing adventure! Took all 5 of our kids ranging in age from 3-10 and all didn't want it to end. Richard, our guide was wonderful. Can't say enough good about it. :)"], ["Reviewed September 6, 2017", 5.0, "Safari West is the Best!", "I took my wife son and daughter for a four hour early morning safari. We were extremely happy with the feeelong that we had been transported to a beautiful far. Away land.\n\nThe staff were awesome, the animals were beautiful, healthy and well taken care of. The island of Lemurs were too cool. The snakes were crazy.\n\nWe look forward to trying the camping option, and seeing giraffes out of our bedroom window.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fun Time!", "It was great! Our guides were really experienced and knowledgeable, and definitely enhanced the entire trip."], ["Reviewed September 6, 2017", 5.0, "111°F Weekend Review", "I planned an overnight stay and a safari tour a few weeks in advance so I was pretty anxious as the forecast stated 109°F. As I neared Santa Rosa, the car gauge stated 111°F and it felt like I was being sauteed every time I stepped outside. It didn't start to cool down until 9pm so stay properly hydrated and bring a spray bottle so you can cool down your skin.\n\nFirst up, the tents are adequately equipped with every amenity to be considered glamping. The beds are plush and area is clean and tidy. My girlfriend and I stayed at the Hillside tents which is pretty secluded and in front of a lake. Besides the occasional wildebeest mooing and guinea fowl calls, our tent was pretty intimate since it was pretty far from the entrance so there wasn't constant voices from guests and footsteps going back and forth to the cafe. It's about a 5 minute walk to the entrance or a 2 minute Jeep ride for the lazy. I highly recommend staying for at least a night to soak in the setting that Safari West put together. Note that there is no A/C available but there are heaters since it can get chilly at night.\n\nThe safari tour pretty much blew my expectations away. There is a general area for which guests can wander around and admire the animals for which I naively thought was the extent of the sights available for the tour. Turns out there are literally hundreds of gated acres in the back only accessible by safari jeeps and WAYYYY more exotic animals. Our tour guide, Jenna, was the kind of person you would love to kick back a beer with. She's a European chef by trade but comes back to Safari West every now and then to give these enthusiastic and informative tours. Jenna was able to answer every question, give interesting and concise facts about each animal, and read the crowd by telling hilarious jokes! Since there were no children in our tour group, Jenna went into the more \"R-rated\" characteristics or certain animals, and also gave a preview into Safari West Valentine's Day specials, which really livened up the tour. I would not hesitate to go on this tour again. It's a great day activity and honestly, the value of the tour way exceeds the price.\n\nWhether you're looking for an activity to do, booking a romantic getaway, or doing a family outing, Safari West checks off a lot of boxes. Everyone comes here for the African safari tour but don't ignore the overnight stay. I'm honestly surprised I've never heard of this place before considering how much fun I had.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Safari West", "We had a great time and saw many unique animals up close! Julie was our guide and she was very helpful and informative!!"], ["Reviewed September 5, 2017", 5.0, "Love the giraffe", "Loved the preserve even more the second time around! Jeff was a wonderful tour guide. Riding in the safari trucks was a fun adventure for the kids."], ["Reviewed September 4, 2017", 5.0, "Amazing place!", "Loved it! Tour was great and was so happy the animals had space to roam. Would love to come back and stay overnight."], ["Reviewed September 4, 2017", 5.0, "Fabulous visit", "Visited on one of hottest days in Santa Rosa. Our guide, Leslie, did an amazing job trying to keep us cool. She was a wealth of information and made our visit a joy. Would definitely return."], ["Reviewed September 3, 2017", 3.0, "Not what we expected!", "Our trip to Safari West was not what we expected. Our guide was very knowledgeable and great at educating our group. The tour is a lot of driving around and stopping while the tour guide talks about the animals. The giraffes were kept in their enclosure the day we were there so we didn't experience any up close encounters.\n\nBecause it is so expensive, keep in mind that what you pay for is to help offset the cost of caring for the animals, otherwise it's not worth it!\nShow less"], ["Reviewed September 2, 2017", 5.0, "Magnificent glamping experience", "You will pay a fortune, but it will be worth it! Great comfy beds in tents with screens open to the air and the night animal sounds. Beautifully decorated tents with interiors of burlwood, branches, and camp chairs. Great simple shower. Amazing Safari tours of the animals they raise there. If you want to get up close and personal, we recommend the behind the scenes tour. Go during the week when there isn't an event on if you want to avoid a crowd. The dinner buffet is expensive with limited choices, but it's all you can eat, was very yummy, and included a great dessert (all chef's choice). Breakfast is included and had a great selection.\nShow less"], ["Reviewed September 1, 2017", 5.0, "An Amazing, Priceless Experience!", "We could not have loved this day any more! I went with my 9yo son and my parents (in their 70's & 80's), and there was something for each of us to enjoy. The walking tour was nice and mellow, and it was neat to get up close with the monkeys, the birds, and other exotic animals. I appreciated getting a quick snack/potty break before embarking on the jeep portion of our trip.\n\nThe jeep itself was surprisingly comfortable, and our tour guide - Nate - was incredibly skilled going over some of the rough terrain. You could tell he was taking it slow, and we only had one \"Indiana Jones\" moment. :) My son and I sat on the top of the jeep, and I was nervous we'd get knocked around, but it was a solid, sturdy ride. Nate even had umbrellas for us, since it was a hot, sunny day.\n\nNate was friendly, fun, and incredibly informative. I also admired his unending patience with my son's questions/comments. We got up close to so many of the animals - the giraffes, the cape buffalo, the rhinos, the zebras, etc. And the grounds were simply gorgeous.\n\nIt's a long day, but there is everything you need to be comfortable - snack shack, bathroom, breaks. And their gift shop has a huge array of items to walk away with as a souvenir.\n\nWith the high cost of tickets, Safari West isn't something you do every weekend, but I definitely recommend doing it at least once! ALSO: look for deals/coupons online, and check their packages page. I managed to find a 10% off coupon for each of our adult tickets, and I see that for fall 2017, kids are free on weekdays with a paying adult.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Paulette was awesome!", "Honestly, we have been to many Parks like yours so this was nothing new. Paulette our tour guide was, and she was what made our adventure a blast. If we come back it will only be if she is our guide again:)"], ["Reviewed August 30, 2017", 5.0, "Safari West", "Great time..more than what we expected..over the top..the Safari and guide Richard was excellent.nnloved the animals. Breathtaking. Will be back. Tent cabins, meals and staff were fantastic. Loved the animals."], ["Reviewed August 30, 2017", 5.0, "Birthday Lunch", "Live in Calistoga have been to Safari West several times (including spending the night once). My sister and our friend also a Napa Valley resident had never been. It was my sister Birthday we all went had a Great Day has been upgraded since my last visit. Our guide Richard was the best, full of knowledge best jeep tour ever.\nI personally love Safari West as a quick get away. I will do it again next year!\nShow less"], ["Reviewed August 30, 2017", 4.0, "Fun family field trip", "Interesting and informative. Probably could complete the tour in 2 to 2 1/2 hours with less words from our guide"], ["Reviewed August 30, 2017", 4.0, "Safari West Test", "My wife and I planned our trip not worrying about the weather. Well this particular day in August was very hot. We considered not making the trip due to the heat. But, reservations were made and we decided to give it a go. I guess if you you really want to experience the African Safari it should be hot. We booked a 1 pm tour with lunch beforehand. The lunch was excellent and the water was cold and plentiful. Our guide was Robert who was very knowledgeable and answered all of our questions. We wondered why the tour would take almost two hours but Robert stopped at all the different animals enclosures to explain what we were seeing. This is not a drive through experience at all but a well planned experience. We look forward to our next visit when we are going to spend the night in one of the cabins with our grandchildren!!\nShow less"], ["Reviewed August 30, 2017", 4.0, "A unique experience!", "This was our third visit to Safari West. We were accompanied by our grandchildren ages 7 and 4. They were the only children on the tour. The older child opted to sit on top of the jeep with another couple. All three eventually had to come down due to the intense heat.\nMy husband and I found the information provided by the guide, Brian, quite interesting. The tour, however, was over two hours and the children became fidgety. After the jeep tour there was another hour of a walking tour available. Because of the heat and the fact that the children had had enough, we opted not to participate.\nThis is a great experience for older children and adults. Three hours was just too long for a four and seven year old.\nShow less"], ["Reviewed August 30, 2017", 5.0, "A quality filled trip", "We really weren't sure what to expect and were pleased with everything. We arrived a little early and were able to walk around and explore. Then off on our safari filled with facts and fun. After the safari we enjoyed the walking tour. We signed up for the lunch with was well worth the price and absolutely amazing!! Definitely do the lunch.\nShow less"], ["Reviewed August 29, 2017", 5.0, "A safari gem in the Bay Area", "Didn't know this gem existed right here in the Bay Area. Glad we got to go. Loved the knowledge, humor, and kindness of our tour guide."], ["Reviewed August 28, 2017", 5.0, "Almost like going to Africa.", "Great for kids though expensive but cheaper than going to Africa and quicker. Guide extremely knowledgeable like having a 2 hour lecture on animals but with real animals not slides."], ["Reviewed August 28, 2017", 5.0, "Safari West", "Our third visit. Loved it. This time with a 16yr old and an 11 year old. Very knowledgable guide. Excellent food. Highly recommend. We like 4 pm drive followed by 7 pm dinner. Very, very hot this time so be prepared with sun block and sun hats if you hit a heat wave. Vehicles have canopies but sun can still hit the sides.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Safari West", "We have wanted to visit for a while. Finally made time! Safari West was a fun and informative place to visit. Gotta love parking next to buffalo napping in the sun and zebra walking about. A must see kind of place!"], ["Reviewed August 27, 2017", 5.0, "Safari West Adventure", "Safari West exceeded my expectations. I brought my 12-year-old granddaughter as a special treat alone. I wish I had brought the other grandkids. Hearing the animals during the night in the exotic tent cabin was a kick. Our guide on the Safari was personable and extremely knowledgeable. It's a large area with a huge variety of animals and it's easy to get close up. We saw a 3 1/2 week old giraffe racing around like crazy. I highly recommend either an overnight or a day trip.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Awesome day", "Had 4 kids out and totally engaged by the knowledgeable guide. Great close up time with many animals"], ["Reviewed August 26, 2017", 4.0, "Mother's Day Outing with the Family", "This is a great way to spend an outing with your family. Pretty much an un-stressful outing. Come and see for yourself."], ["Reviewed August 24, 2017", 5.0, "Safari West Rules!", "I have lived in the area for over 17 years and had never been to Safari West until Tuesday. I went with my 4-year-old grandson and my daughter who are visiting from PA. We had an all around blast. What a great place. We have all been raving about it since our visit. I will go again with friends this winter and my daughter wants to celebrate her 40th there on an overnight adventure.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Safari West grandchild's delight", "A wonderful experience becoming an annual tradition. As a four year old two years ago her first experience at Safari West was a thrill. This her third visit now a six year old was a delight. She was completely engaged intellectually and emotionally. Watching her inquisitiveness grow and evolve is a grandparent's reward. Plus we had a great time ouselves.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Fun and Educational", "My friend and I had a great time. Took the 10 AM tour. We learned a lot of interesting things about the various animals and our guide was very knowledgeable and a good driver. The road is bumpy at times in the jeeps but it makes for an authentic feeling experience. We also bought the lunch served buffet style after the ride/walk at 1 PM and were both very pleased by the food and the options. I would recommend this trip to everyone. Note: I do not know what accommodations are made for the elderly or those with disabilities, but the jeeps themselves would be difficult for those folks to climb into.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Safari West Tour", "From the reception to the good bye from our tour guide, the experience was fantastic. We will recommend this to all. I have already had an office associate book a tour."], ["Reviewed August 23, 2017", 5.0, "Safari", "It was great. The lady giving the tour was excellent and very informative.i thought the animals were beautiful and very well taken care of."], ["Reviewed August 23, 2017", 5.0, "The children loved it!", "Great family adventure. The children will remember this forever. My husband enjoys ed it thouroughly as well and would come back for a weekend!"], ["Reviewed August 22, 2017", 5.0, "Awesome Safari Jeep Tour", "The Safari Jeep tour is a great experience. The tour guide Jessica is really knowledgeable and experienced. She answered all our questions nicely. My kids love this tour so much. We had so much fun in there. The jeep tour is reservation ONLY. It took about 2-3 hours for this tour (we also had a short walking tour).\nShow less"], ["Reviewed August 22, 2017", 5.0, "Liked it!", "Took my folks to the African Safari over an August weekend. They loved the experience. Be sure to book your tickets online during summers. They go fast!"], ["Reviewed August 22, 2017", 5.0, "Awesome!", "It was great fun! Very nice cabin. Very friendly and helpful staff. We really enjoyed th safari ride also. If you have a choice, you may want to select a specific cabin. They have different views. Some closer to the animal enclosures, some farther. Some get to see a small lake. And some are higher up the hill looking down to the area. I highly recommend.\nShow less"], ["Reviewed August 22, 2017", 4.0, "great fun had by all!", "we had a great experience - showed up a little early so they accommodated us! our guide was a very friendly and knowledgeable guide, and had a few facts that I had never heard before. the animals all seemed well-cared for and the assortment of birds was amazing!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Loved our safari!", "Great tour guide, very patiently waited for us to get our fill at each sighting of birds and animals, great sightings, lots of fun."], ["Reviewed August 21, 2017", 5.0, "Great fun", "We had a great \"safari\" and saw animals up close. The guide was extremely knowledgeable and we all learned a bunch! We loved it!"], ["Reviewed August 21, 2017", 5.0, "Great outing", "Four of us, one with a physical challenge, went on a Monday, arriving for the 10AM tour. Well organized, they divided everyone into groups of 10 and we joined our guides on a nifty safari/Jurassic Park sort of truck for a 1 1/2 hour ride around the park. Lots of information, lots of up close and personal with the animals, particularly the zebras and giraffes. Stop for a break and off again on foot. Walking worked just fine even for our challenged companion. In the aviary, we were accompanied by a large bird who apparently likes men particularly if they are wearing gray, charming animal. Human Guide was loaded with info so we learned a lot more than in a zoo. Afterwards, we had booked lunch ($15 all inclusive) and were very pleasantly surprised by the quality of the buffet, accompanied once again by terrific staff. Overall, a very pleasant 4 hour visit (could have stayed as long as we wanted, which we could see many people doing).\nShow less"], ["Reviewed August 21, 2017", 5.0, "Great family get together", "It was a great trip with a great guide with good knowledge and good effort to see as many animals as possible\nI would go more often and take family and friends but it is more money to do it.\nthe money is the biggest drawback!\nShow less"], ["Reviewed August 21, 2017", 4.0, "A unique overnight trip...", "Safari West was great. The tent cabins were amazing -- beautiful, clean and the views were wonderful. Just remember the cabins are canvas so you can hear your neighbors. Luckily, we were able to drown out the late talkers with the space heater that was in our cabin (we were near giraffes!). The staff throughout the place were not the warmest, however our safari guide was fantastic! He was knowledgeable and super friendly. The Safari was about 2 hour 45 minutes altogether and definitely worth it. I only gave the whole experience 4 stars because of limited food options and, like I mentioned above, the staff was not the friendliest. Also, you should plan to be off-the-grid, while visiting, as there was no cell phone service and spotty internet near check in office and snack shop.\nShow less"], ["Reviewed August 21, 2017", 5.0, "AMAZING EXPERIENCE!!!", "I surprised my boyfriend with this trip as he is a huge animal lover and it did not disappoint! It was such a cool spot tucked away in the hills, just beautiful! We got to sit on the top of our jeep for the first half of the ride, which was the best since we visited the giraffes first and they are literally standing RIGHT NEXT TO YOU! It was just such a different, awesome experience I didn't know you could have right here in California! Our guide, Danny, was also extremely knowledgeable and we learned a lot of great information and have a new-found appreciation for these animals and what they do at places like this. Oh, and the \"braai\" BBQ dinner was also definitely worth doing! We sat by the flamingos eating the great food with a beer and glass on sangria; it was so peaceful. Such an amazing day, we can't wait to come back and stay at in the tent overlooking the giraffes next time! Highly recommend!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Fun had by all!", "Had a wonderful time at Safari West with my husband and 6 year old son. Nate, our tour guide was the coolest! He was so enthusiastic, funny, knowledgeable and had the most interesting fun facts! We would totally come back again and enjoy the whole safari experience!\nShow less"], ["Reviewed August 20, 2017", 4.0, "Stay in a tent!", "The tent was by far the best, most novel part of our stay; my kids absolutely loved it. Noise wasn't bad -- it was other guests until about 9:30, then birds and the occasional car. The safari I suppose was as good as you'll get without going to Africa. But I didn't think there were enough animal encounters (many are in a separate, zoo-like area), and we missed the ostriches and the oryxes (extinct in the wild!) due to time constraints, which seemed a bit chintzy. Our guide was great and the staff/accommodations/food were top notch, I just felt a bit cheated in the safari part.\nShow less"], ["Reviewed August 19, 2017", 2.0, "High price for average service", "night stay- no wifi, no tv, not even entertainment provided by the resort. Just sleep for very expensive tent. Tour- no elephant, lion, hippo, hyena and many more iconic safari animals and yes they do have a lot of animals but you will have a much better experience and worth the money in a real zoo.\nFood- the worst of them all. I expect great variety of dinner buffet for the price I pay, buffet in my city is much cheaper for triple the amount of food. It was serve late and two meat dish choices, what's up with that!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Fun times, great dinner.", "The tour guide Kate was really nice and patient with all the excited kids. Answering all the questions we had and very knowledgeable about each animal. The dinner was excellent also."], ["Reviewed August 18, 2017", 5.0, "Great experience with a wonderful tour guide", "I had a wonderful time at Safari West with my young grandsons. Our tour guide, Nate, was the best! He was so knowledgeable, thoughtful, enthusiastic and just all-round fantastic."], ["Reviewed August 17, 2017", 4.0, "Visit to see the animals", "We liked being up close and personal to the animals. Our guide, Kate, was a book of knowledge. She seemed to know everything about every animal and bird - a great guide. We love animals and missed seeing elephants and particularly cats."], ["Reviewed August 17, 2017", 5.0, "Safari Time!", "My friend and I read about this place in a buzzfeed (?) article, and decided we needed to stop. We are so glad we did. It was so much fun! It was a really cool experience, with lots to see. Our guide, Paulo (sp?), was great. Very knowledgeable, and did well catering to a variety of people on the tour, including families and my friend and myself, who obviously were in wine country for a reason. :) The variety of animals you get to see, and the intimate experience you get to have with the animals really made this stop special and something I will recommend to any family or friends I have going out to the area.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Awesome day", "Awesome adventure! I'm a grandmother who brought her 3 grandkids. Children's pricing is reasonable but adult prices are a little high."], ["Reviewed August 16, 2017", 5.0, "Africa in Wine Country", "You always thought you'd get to Africa. To see Mandela's prison or Kenya or Nigeria. But decades have passed. Money is tight. Many African nations are caught up in conflict... even civil war. Animals are being slaughtered. The world is more frightening. You send money to a girl's school in one African country, and to Doctors Without Borders in another.\n\nYou shrug and go off on a well deserved long weekend to Sonoma Wine Country. The land is beneficent. The vineyards are magical. The wine flows. And then you see a small ad for SAFARI WEST, outside Santa Rosa. Why not? On a whim you go for an afternoon. You spend a half hour seeing monkeys and porcupines and lemurs and other exotic small mammals in pens and cages. Somewhat better than a zoo. ?? You're led into an outdoor aviary with hundreds of strange and magnificent birds. You marvel at the huge nests. But more, you marvel that so many species get along, living together.\n\nThen it's time. You get onto a tricked out jeep/truck/bus with a dozen others. The driver- guide is funny, knowledgeable, passionate about the wild animals on this preserve. He drives you into the dusty golden hills. SO many giraffes. Some babies born here. A couple of dozen zebras appear on the next ridge. Several types of antelopes herd nearby, OK with you on their territory. The Cape Buffalo are not so OK, and their ears perk up, on alert. These hundreds of acres belong to THEM. You round a bend and observe dozens of wildebeest, grazing on the hillside. Safari West isn't Africa. But it's a good facsimile; as close as you will ever get. The animals, many cast off and rescued, get to live out their lives in a safe environment. The rugged land approximates their natural habitat. SAFARI WEST is a gift to the animals, but also to you. You learn a lot. You leave with a deeper affection for the wild critters of the planet. You leave with an abiding respect for the work done on this preserve.\n\nAnd then you go have dinner at a farm to table Santa Rosa restaurant, and drink deeply of a Sonoma County wine. Life is good\nShow less"], ["Reviewed August 16, 2017", 5.0, "Like going to Africa without the flies.", "I highly recommend you visit. I took my 85 year old Mother here and Danny was our guide. Lots of close up animal encounters and comfortable seats in the jeep. Loved the bird aviary whete so many birds were not shy and you could see them up close. The porcupines were stunning and so adorable. We went at 9 am snd saw a lot of the animals active and eating.\nShow less"], ["Reviewed August 16, 2017", 5.0, "A little slice of African safari", "Great weekend getaway that all ages will enjoy. Wear comfortable shoes. We went this August but I am glad I brought a jacket and long pants. It was cool when the sun came down. Dont forget your flashlight or headlights because its dark at night. They do provide or lend you one I think. I hope your a heavy sleeper. You'll hear animal/bird sounds\nShow less"], ["Reviewed August 16, 2017", 5.0, "Awesome experience at Safari West!", "We had such an awesome experience at Safari West. Our guide was very humorous and knowledgeable. The kids (7,5) loved seeing and learning about the animals. We are already planning our return next year and will definitely spend the night next time."], ["Reviewed August 16, 2017", 5.0, "All about expectations", "We visited Safari West understanding that it is a wildlife conservation park where 20 varieties of African antelope roam on 400 acres and may or may not be performing on demand. It is not a circus or a city zoo where exotic animals are confined for display purposes. Our 2:00 tour was not the optimal time of day for viewing, but we still saw active rhinos, most antelope species and giraffe on our drive. It's a fair warning that the steep, rocky terrain makes for a rough ride. We found it similar to a safari experience in Africa. Our tour began with a narrated walk to see the extensive collection of African birds and smaller animals that are in readily accessible enclosures. We returned to this area late in the day and were rewarded by seeing several animals that were napping earlier in the afternoon. We included the buffet lunch in our visit. The BBQ chicken, salad, and vegetarian sides were all quite acceptable. We'd asked for vegetarian entrees when we made the reservation. This involved a wait while they cook put together small servings of vegetarian \"ribs\" doused in bbq sauce. Another time, we'd just eat more beans and mac/cheese. The dessert was best: cold chocolate pudding with cream and shaved chocolate on top. This is NOT a bargain outing. I wouldn't take young children. But we found it thoroughly enjoyable with our teen grandsons and a very fair value considering the cost of maintaining the property, caring for the animals and managing a breeding program that is helping to preserve endangered species.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Great Experience!", "My sister and I are so glad we went! Our guide was knowledgeable and made the tour so fun! Make sure and sit on top of the jeep!"], ["Reviewed August 15, 2017", 5.0, "Great", "Had lots of fun, took the 9am tour, did not stay on the tents so I cannot review them on that but seems like a great thing to do next time, grilled chicken at the BBQ place not to be missed."], ["Reviewed August 15, 2017", 3.0, "Nice but not worth", "The trip is not bad, but with the price, not worth it. Take me 4 hours on the road, and only spend 1 and half hours in the driving tour. About 20 species? Maybe? Waste a lot time open or close the door and other staff.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Amazing experience!", "This was SO much fun! I was a tad hesitant to book due to the price being more than I wanted to spend, but after doing the tour once I'd like to rebook with trying the overnight experience in their cabins! I can't wait to bring my significant other (as I went originally with some friends) so that he can see how much fun it was. Being up on the top seat was a blast. The rules state that we aren't allowed to touch/pet the animals, but if you're lucky (like I was) the animals such as giraffe will come right up to you. The tour guide was so knowledgeable and almost like a walking encyclopedia.\nHighly recommend!\nShow less"], ["Reviewed August 15, 2017", 5.0, "Great finish to a Father & Son Weekend", "Went to Safari West with my 10 year old son. We had a blast!! We arrived at 11:45 for a 12 lunch then 1:00 Safari. Parking was easy, lunch was delicious, and the Safari was a ton of fun. Our tour guide Jeff, was funny and full of great information. I highly recommend checking out Safari West. Next time, we plan on staying in the Safari Tent hotel on site.\nShow less"], ["Reviewed August 15, 2017", 5.0, "A Ton of Fun-Really Interesting", "Been meaning to go there for a long time and when we had a weekend with nothing planned, I remembered it and made a reservation online. Had no idea what to expect but it was an absoute blast. There is a walking tour where you see numerous birds and animals, and then you are on a very cool safari truck seeing all sorts of big animals. I have been on Safari in South Africa and if you cannot get to Africa, this is the next best thing. Our tour guide was great. There is a snack shop in the boarding area where you can get drinks, snacks and sandwiches. Did not eat at the restaurant, but the food looked great and the price was very reasonable as well. The overnight tents from the outside looked very cool. That I bet wold be really fun to do. Pretty close to Santa Rosa so well located. Great for adults and kids. Also they let everyone who wants have a turn at sitting on top, but it looked too hot for me.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Amazing", "It was our first time here and won't be our last. Our guide was Nate and he was so knowledgeable and kind of funny too, haha."], ["Reviewed August 14, 2017", 5.0, "The Safari was amazing!!", "Well you were right near the animals and it was feeding time so they were all out and about. We were so close to the end it was amazing. Our tour guide was extremely knowledgeable and super nice. We absolutely loved our tour."], ["Reviewed August 14, 2017", 5.0, "Excellent place", "Tour guide was amazing, and animals were close to us , we had a fantastic time. Would go again for sure."], ["Reviewed August 13, 2017", 4.0, "Fun weekend out", "We visited here in 2014. It nice to do once but you pay for it. I like the fact the animals have acres upon acres to roam."], ["Reviewed August 13, 2017", 5.0, "Super fun!!!", "This is the first time I have visited Safari West and I went with my 3 children (ages 5, 7, and 13). We all had a really great time!! Our guide was fantastic--do not remember her name, but she was so knowledgeable about every single animal. We learned a lot! The tour starts with about a 30-45 minute walk (with your guide) through the lower area which houses monkeys, cheetahs, and birds. Then, you board the vehicle and have the option to sit up top (seats 4). There were several families that wanted to experience the top seating, so the guide switched us around half way thru the tour. She drove us all throughout the park, getting up close with numerous animals! Zebras, giraffes, buffalos, and antelopes right next to the vehicle! After the tour, we had a really nice lunch from the \"deli\" on site and sat under a pergola overlooking the flamingos. We went in August and the temperature was low 80's yet it felt very pleasant and not overly hot. Living in San Diego, it's way too hot to visit our Safari Park in the summer, so this was very nice. FYI--when we exited the tour, everyone headed over to a buffet lunch that I didn't know existed from the website. Supposedly, if you want to eat a lunch buffet, you must make prearranged reservations. Since we did not do that, we simply bought snacks and sandwiches at the deli on site. This option was casual and I would assume less expensive than the reserved buffet. Overall, a great time and my kids' favorite activity from our Sonoma County summer vacation!\nShow less"], ["Reviewed August 13, 2017", 5.0, "Awesome trip", "We had a great time at Safari West. We were worried that it would be expensive and that you wouldn't really get to see the animals up close. Boy, were we wrong! It was a very close encounter with an ostrich and a buffalo ! All the other cool animals were super up close too like the zebras, giraffes etc. Our guide Danny was wonderful. We asked lots of questions and he was willing to take his time, not rush, and give us a super knowledgeable and pleasant experience. I highly recommend SW. (we did not stay overnight but the facilities are super clean!).\nShow less"], ["Reviewed August 13, 2017", 5.0, "Excellent experience", "Our 7 year old daughter, my husband and I had wonderful time. Our guide, Marina, was awesome, very knowledgeable and willing to answer all our daughter's questions.\nLunch after the safari was excellent. My husband really enjoyed the vegeterian \"barbeque\".\nOverall everything was excellent and we will go back anytime. Maybe next time we'll spend the night.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Safari West is an AMAZING Place to Visit", "When we went to Safari West we went on a safari ride in a real safari truck. Approximately 2 hours of riding and visiting all of the amazing animals (rhino's, zebra's, giraffe's, etc.). Our children loved them and there were certainly lots of oh's and ah's. It was well worth the money spent on this amazing adventure.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Visiting With Teens", "1) The Safari Website shows an elephant - w the jeeps surrounded by giraffe walking freely - no encounters - a pre-warning for parents via email would eliminate disappointment .2) Our tent - had no hot water.3) The buffalo, elan, zebra, kudo etc herds were impressive and close by the jeeps - with the tour guide fun and upbeat and accommodating - great fun.4) the aviary and flamingo pond were spectacular, as were the two mini-fox (adorable) 5) The tortoises were very active (surprising) while the (old) cheetahs were reclusive.(6) The BBQ items were terrific, with the side dishes a bit on the starchy side but certainly delicious. (7) the caged wildlife should be placarded for those wanting to return and see them again. 8) the tent experience was wonderful for the teens albeit they needed to have bunks because they don't sleep together at home - not sure how many bunked tents you have...need more?Thank you!\nShow less"]]}}