{"San Diego Zoo Safari Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "San Diego Zoo Safari Park", "url": "/Attraction_Review-g32358-d104196-Reviews-San_Diego_Zoo_Safari_Park-Escondido_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/62/4e/68/san-diego-zoo-safari.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3393"}, "address": {"@type": "PostalAddress", "streetAddress": "15500 San Pasqual Valley Rd", "addressLocality": "Escondido", "addressRegion": "California", "postalCode": "92027-7017", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "Zoo zoo", "I know everyone raves about this and it was certainly the best Zoo that I have visited. We had a 5 dollar off all visitors supplied by hotel.We went on the bus twice as it was cooler late afternoon,we saw more animals and our guide was better. The animals had a lot more space but some still appeared a bit stressed eg polar bear\n\nShow less"], ["Reviewed 2 days ago", 5.0, "Love this place!", "We enjoyed this even more than San Diego Zoo! Get there early and the crowds are sparse and you can enjoy all of the exhibits! The wide variety of wildlife is amazing!!!"], ["Reviewed 3 days ago", 5.0, "A mini Wild Life Safari Park.", "This wild animal park is VERY well maintained, with animals which are VERY well cared for. Their Tiger Exhibit is wonderful as is their elephant area, gorilla area - I could go on and on.\nDon't miss taking the tram around the valley where the animals are free roaming. So much to see - so very well presented.\nShow less"], ["Reviewed 4 days ago", 5.0, "Best Way to Spend a Day -- Safari Caravan Deluxe", "We booked our visit online & printed out our tickets, thus avoiding all of the lines to get into the park. We scheduled a 1pm Caravan Safari Deluxe, which last 3.5 hours. Before the caravan, we arrived a couple hours early to wander around the park & see additional sites. The Bat Encounter is not to be missed...so interesting!\n\nA few minutes before our 1pm caravan, we checked in at the designated area and met our guide, Alan.\n\nAlan was an amazingly knowledgeable guide with a quick wit and great \"people person\" qualities. We learned so much as our truck took us from one part of the \"world\" to another for encounters with all the various animals.\n\nFeeding the giraffe and feeding the rhinoceros were events that we will remember forever!!! And having pictures of those events...well, the pictures make us smile as we remember our emotions when the giraffe's tongue wrapped around our finger looking for food or the the rhinoceros lip touched the palm of our hand.\n\nWow! Do not miss this opportunity to see Safari Park on one of the caravan tours...and if you can get Alan as your guide...all the better!!!\nShow less"], ["Reviewed 5 days ago", 5.0, "Do not miss this gem", "What a wonderful place to see wild animals in as natural a habitat as you can without spending 10k on a real safari. The park is immaculate, the animals are up close and personal many of them, there are many options (like a safari ride to feed the giraffes for an extra charge), a great tram ride that comes with admission and LOTS of wonderful helpful volunteers to tell you interesting things about the animals and parks. There was a 2 week old rhino baby which was amazing, 6 week old cheetah babies...such an awesome place to teach people and children about animals in a safe and nurturing environment for the animals. I am not a fan of zoos, but this is a great way to teach and to learn about these beautiful animal. Please support them by going here..you won't regret it.\nShow less"], ["Reviewed 5 days ago", 5.0, "Great way to spend a day", "This is one of the best Zoo's we visited. It's so well designed, easy to navigate with zoo staff around the corner that provide information. The train is a great way to see the expansiveness of the park and its animals. I love the tethered balloon in the sky which you can see for miles. One trip up there is worth it for the view. If I lived nearby, I would be visiting this place a lot!\nShow less"], ["Reviewed 6 days ago", 5.0, "UNBELIEVABLE", "Great place to spend a day. We actually enjoyed the Safari much more than the zoo. The tram ride is a good start and very interesting way to see a lot of the animals. We were fortunate to see a baby Rhino the day after its birth.\nShow less"], ["Reviewed 6 days ago", 5.0, "This is a Must-See in Southern California", "It was a bit chilly, but well worth the all-day visit. Since we went on a Tuesday in February, the parking lot was only maybe a quarter filled, and thus no crowds. The Safari Park is well-designed with lots of space for the wildlife. We took the tram to see the Rhinos, giraffes, antelope and zebras. But our favorites were the tigers on one side of the park and the gorillas on the other side. The food courts were just ok, but who goes for the food? Dedicate a full day to this animal park, and you still won't see it all. Loved it!\nShow less"], ["Reviewed 6 days ago", 5.0, "RELAXING VISIT!", "Our visit to the Safari Park was relaxing and interesting, as we leisurely wandered around the premises. Some animals were easier to observe than others, but in this beautiful setting, you'll find new things to learn."], ["Reviewed 1 week ago", 5.0, "Always a great visit, especially to help the mission, brought friends", "We brought family with us from out of town. Besides entry, we also opted to pay for a safari cart ride to Asia (1 hr, max 10 people). price varies with day and time and advance booking, but starts at $54 pp. The tour takes you to areas that are only available by this cart and the truck. We do this once every other year. The walk to the tigers is a bit of a chore for we old folk, but always well worth it. As we had company, we also managed to trek up to Condor ridge as well. The local animals along the way are off exhibit while the new attraction is being finished (early summer).\n\nThe work here is very important. You can spend 2 days here to see it \"all\". Don't miss the gardens too. For those more adventuresome there is a zip line. For younger and still brave one, there is also a tree walk. The tram thru Africa is included in admission. Lots of choices for eating. Don't forget the balloon ride for an overview. Lots of babies. The week old rhino was particularly active.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Adventure", "Wanted something different from a regular zoo, so we came here. We was well greeted by a Shuttle driver because we didn't wanted to walk that much. We enjoyed the bird show. A must see. I was surprised by their parking fee and other fees that are available upon request.\nShow less"], ["Reviewed 1 week ago", 4.0, "Worth the Trip!", "We knew that the Safari Park was going to be quite a bit different than the zoo we had been to a few days prior, and we were excited! Armed with our comfy walking shoes and water bottles, we were ready to explore. We enjoyed the park and especially the Africa Tram. I would recommend arriving early for this, we got in line around 9:40 and by the time it opened at 10:00, the line was really long, but we were on the first tram of the morning. Most of the animals were visible and our guide was great. We had time to stop and see the gorillas on our way to the tram and so glad we saw them early and were able to watch them enjoying breakfast.\nShow less"], ["Reviewed 1 week ago", 5.0, "One of the best experiences!", "We purchased our tickets through the AAA website. Then, drove down on a Tue. and arrived around 11 a.m. We scanned our tickets and off we went. We walked directly to the Tram that was free. Since we can see the same animals but not up close like the Caravan or Cart Safari, it was a great experience. We saw baby animals. Please remember to bundle up in layers. It was very cold out there. We returned and decided to purchase the Cheetah Safari where we spent 30 mins. with animal ambassadors, and had an up close experience with the Cheetah and 2 dogs that lived with one another. In between getting off the Tram at 1 p.m. and the Cheetah Safari, we visited the Roar N Snore campgrounds, the restaurant overlooking the compound of animals roaming free, the elephants, the foxes, lions, and tigers. We rested a few times at the benches and ate a small afternoon lunch. You can bring food and drinks with you if you are on a tight budget. We brought our own water bottles. Before they closed @ 5 p.m., we purchased our cheetah pics (together with the animals) for $30 digital. If there were more animals out in the compound, I would have purchased the caravan or cart tour. Next time, we plan to do the Roar & Snore.\nShow less"], ["Reviewed 1 week ago", 5.0, "WOW!", "We spent the entire day at Safari Park! It was amazing! I especially loved the tram ride. It felt like I was on a safari in Africa with sweeping vistas and myriad animals grazing on the savanna! It is so well done! My criteria for rating zoos has been totally revamped! The have really nice gift shops and cafes too:)\nShow less"], ["Reviewed 1 week ago", 5.0, "Safari Park", "A SUPER TIME! Get there early to get parking (15$) and get a ticket, then go get in line for the tram. First one in at 10 am. You'll get a 25 minute narrated tour of the park and see a lot of animals while you ride in relative comfort. After that wander around and look at all they have - lions, and tigers and hippos and elephants, OH MY!! Well-laid out with plenty of space for both people and flora and fauna. You can easily spend all day here and much $$ and still not do it all. Plenty of restrooms and places to eat too.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing, cannot miss when visiting San Diego if you love animals and nature", "I have been at the San Diego Zoo Safari in the past and I am surprised at how it's getting better and better with time. It's an amazing place, worth a visit for sure. It is expensive but money will go to a good cause. Don t miss the cheetah run, the air balloon and of course the tram or bus safari tour. Take your time taking pictures and strolling around. Park was crowded since was Sunday but still plenty of room and clean toilets... Parking can be busy and expect to walk some distance. Or prepare to pay extra for VIP parking that is close by the entrance. Tip; do the air balloon in the morning since in the afternoon can be windy.\nShow less"], ["Reviewed 1 week ago", 5.0, "Lions and Tigers and....Gorillas, Oh My!", "This is an incredible zoo/park. This is a non-profit park. Their goal is to encourage conservation of endangered species. The animals are in large, open enclosures that closely mimic their home environment. The animals are given enrichment activities throughout the day much to the delight of visitors. When we were there the elephants were returned to one part of their enclosure where there were a variety of food challenges. They actually ran from area to area to search for treats. Another delight was watching the Chetah Run. A chetah and her Laborador friend race after a stuffed animal. They are almost close enough to touch The animals seemed to enjoy it as much as we did.\nYou will walk a lot at this park. My step counter showed that we walked five miles. There are places to stop and enjoy exhibits, shop or grab a bite to eat. It is a very relaxing experience. There is also ample parking but be advised that it does cost $15 above the entrance price. There are a variety of additional activities like a zip line, private tours or a safari drive in a private jeep. These are very expensive and really not a necessary part of the experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great walks and views", "I thought this was a drive through safari, but it's not. You pay for parking and if you want to pay extra you can go on the safari. The tiger encounter is excellent. Better than the San Diego zoo. The walking paths here are beautiful and makes for a nice walk with the kids and stroller. If you can only do the zoo or safari, do the zoo. If you can stop here it is worth the visit.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Walk About Australia is Coming!", "A day at the Safari Park is always relaxing. You can see animals in their natural habitats, you can see babies of many of the species, and you can learn about many of the animals via the ambassador program.\n\nChildren can go the the petting areas.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Love that they're a not-for-profit park", "I had a great day at the Safari Park. The tram ride was great and we were able to learn and see the animals live and move about in their environment very comfortably. Was a breath of fresh air from typically seeing animals in zoos. Great place to bring your kids and family to learn more about animals. My favorite part was finding out that they're a non-profit and that every ticket helps towards animal conservation. Their shops sell great gifts as well for all kinds of people in your life. Definitely would go again.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nice", "Great place for the family . Especially for kids Nice tours and great atmosphere Love it and I may come again Check the weather before you go"], ["Reviewed 2 weeks ago", 5.0, "See the rhinos!", "See the white rhinos some of the only ones left in the world! Also arrange to take a cart safari or a caravan safari. There is so much too see here it is difficult to do in one day but they have a good trip planner online so you can make sure to see the highlights up close and personal of your choice when go! You can map it out online. And if you buy a zoo pass it’s god for entry to both locations. Definitely buy a souvenir and also bring a backpack with water, maybe a hat, and take pictures.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fourth time visiting and it is as great as the other times!", "Spent the day at the park on a recent visit to San Diego from the East Coast and went back for the fourth time, but this time this was without the kids! In spite of having none of the offspring with us, we still LOVED it! We were very happy we went on a weekday in February (i.e. off-season) with almost the entire park to ourselves! We went on one of the backstage tours - the Rhino Rescue tour. Unbelievable! I know it is a bit pricey as a destination, but the cost of the ticket and the over-priced foods, drinks, and souvenirs are fund-raisers for everything in the park, specifically sustaining the animals and the breeding programs, so it is worth it! Looking forward to our next visit!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Rhino Behind-the-Scenes experience was terrific", "The SDZ Safari Park is a very big player in international conservation efforts, including a fascinating plan to prevent extinction of the northern white rhino. The Rhino Behind-the-Scenes experience was the perfect way to learn about this exciting project in depth. My only disappointment was that we did not have enough time to do everything else the Safari Park had to offer, so I recommend scheduling two days for the Safari Park-- do a Behind-the-Scenes experience each day and use the rest of the time to see the Park in detail. If you love wildlife, it will be the highlight of your trip to San Diego.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Safari without vaccinations", "Great collection of African and Asian animals. Pricey admission, tours, and extras. Tour guides were knowledgeable and pleasant. Start at top (condors and future Australia exhibit ) and work down hill I If you're not too energetic."], ["Reviewed 3 weeks ago", 4.0, "Great experience", "Super visit have ur most comfortable walking shoes lots of walking vegetation is amazing price is high for a 1 time visit but im good with it if it helps the animals and workers...you can get a coca cola always a plus for me..staff are super kind smart and helpful...\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fabulous!", "This is the most amazing animal park I have ever visited. It is incredibly large, the African Plains section really does have a feeling of being in Africa. They do amazing work with breeding and having nice large natural enclosures. We added the Cheetah Run and we were very pleased with the event. There are Ambassadors (volunteers) to assist you with directions and questions. I can't say enough about how great our visit was.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "The girafffeand lyons were great but our favorite was the gorillas", "This was my second visit to the Safari Park and the first visit with my granddaughter. My son and I pulled her in her Radio Flyer wagon and she loved seeing all the animals!\nThe park is large but you can walk at your own pace and see the areas that interest you if you don't want to spend all day there.\nWe had a late lunch at the Kijami Overlook. The food is average at best but its the nicest restaurant in the park. The views are spectacular! While sitting at your table, you see dozens of giraffe running in the distance.\nThere is also a lawn where young kids can play and watch the animals.\nMy granddaughter is 11 months old and taking her first steps. She loved the animals; we'll go back again in a few months. My son is a member there and goes often.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "How can you beat feeding rhinos and giraffes!", "We had a company outing here, and had a very nice time. The family part of the park itself was just OK - lots of smaller animals and good to walk around - but the real fun is the safari part, where you get to drive around in a truck amongst the rhinos, giraffes, water buffalo, deer and all sorts of other animals. There are two sections, \"Asia\" and \"Africa\", and we drove through both. The guide was VERY knowledgeable and friendly, which made the visit even better. Later we had a company dinner near the tigers, and the food was surprisingly good and varied. I enjoyed it very much!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun Experience", "My family has a tradition of bringing in donuts and eating them by the duck pond before we start our day. The San Diego Zoo Safari Park is a unique experience in that the animals have large enclosures. I have spent many days exploring the park ( we have passes growing up) and some of my favorites include: 1.) The Nursery 2.) Riding the monorail tram 3.) Cheetah Run\n\nI highly encourage you to stop by and visit the San Diego Safari Park - I know if you are planning a trip to San Diego it might seem out of the way, but it's totally worth it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Nice Day with Teens", "We hadn’t been to the park since the kids were younger. We had a nice time enjoying the park and reminiscing about previous visits when they were “so much smaller”. It was great to see how they keep updating the park and making new paths, making new structures, and keeping things in tip-top shape. Although we likely won’t be back for quite a some time, we enjoyed our day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Perfect day", "It gets hot, even in wintertime. Lots of educational signs and activities. The ballon ride gives you an awesome view of the whole park and its surroundings."], ["Reviewed 4 weeks ago", 5.0, "Truly Worth the Visit", "I come from back East, have visited several zoos, and I know that the Safari Park is truly exceptional. This is a rare opportunity to see animals integrate with others from their natural habitat. It’s simply beautiful! Humans are contained in a train as they ride through the park visiting different areas of Africa, Asia, etc. the gorilla exhibit is spectacular. Food is not bad, and in the summer stroll around in the evening, listen to indigenous music, and enjoy a glass of wine. There is SO much to see and do. Special exhibits, guest dancers such Watusi's that gave mr granddaughter a bracelet - it’s wonderful. I am a very satisfied member!\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Food is terrible", "Eat before you go or bring a picnic lunch because the food is substandard even at normal prices. We’re locals and go three or four times a year, today was the first time we ate there. Four of us, 2 chicken tenders, 1 corn on the cob, 1 Mac and cheese and 1 beer, cost $59. Tenders were ok, corn was awful, mac was awful, beer was warm. McDonald’s on Beethoven/I-15 is a WAY better choice. Otherwise the park is alright, the tigers are pretty cool.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Beautiful Scenery", "The park is beautiful but very spacious, might be a lot for small kids. The park was super empty that makes it really fun for the kids to get individual attention from the trainers but food selection was limited and few and far between. The safari tram is amazing and very informative. The entrance to the zoo has trainers that share animals up close and personal, which is very exciting and informative. However, the highlight was the bird show, it was very unique and excitied the adults and kids. Great experience but might be a little exhausting for the smaller ones.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Animals!", "I want to give this a 3 1/2 rating but the 4 is for the wonderful animals. The park itself is great, we saw a lot of the animals, which was wonderful. The gorillas were very neat and provided entertainment during their dinnertime.\nHowever, several aspects were a little disappointing on the day we visited. By this I mean the following: it seems we were there on a day when young children were visiting in huge numbers. And many got very bored on the Safari Train - loudly. It would also be nice if they provided maps that were easier to follow.\nI do feel this is a much better way to house these wonderful wild animals. So I would like to say keep up the good work!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "fun experience", "Family of 5 on a road trip from Washington, mom, dad, grandma, 11 year old son and 3 year old daughter. We were very excited about the safari park. I decided that we would pay to do the lion and friends encounter in hopes that we would get to see a few animals up close! It was totally worth the money! We were on a big golf cart with us and 3 other people! Our host took us behind the scenes through the Africa and Asia areas. I think the tram that's part of the admission only takes you through Africa. And the line for the trams was pretty long! I was able to take lots of great photos with my long lense camera. I'm glad we spent the extra money to do this. We didn't get close enough to feed any animals though, if you want to be able to feed the rhinos or giraffes you'll have to do the caravan tour. Our tour of the lands was about an hour and then we got out and we learned about the lions and got to see them pretty up close! We didn't get to touch them, but they were so close! We were able to get our water bottles refilled here too! After seeing the lions we got back on our golf cart and went to this animal care center and we got to touch and see some other animals really up close. We got to touch a hedgehog and saw a bird do some tricks and got to see a lot of other animals in their habitats. These animals are not out in the public to see so it was a great treat! Our party really enjoyed the experience.\n\nAfter our encounter we got dropped off and had lunch. We had lunch at Thorntree Terrace. The food here was pretty good. We got a couple of burgers and a couple of rice bowls. Price was expected for a park. Then we made our way through the safari park. I have to say that the path around the safari park wasn't as great as the zoo. Sometimes I feel like we walked quite a bit before we saw any animals. Our favorite was the orangutans. We probably spent about 30-45 minutes here just watching them interact with each other. We watched one of the little ones do some break dancing, then he decided to steal the baby and the dad totally went after him. It was pretty entertaining.\n\nAfter we left the orangutans we kept walking the path, but a lot of times I felt like we were lost. This park is really big and there's a lot of walking involved.\n\nOverall it was ok. I think I actually enjoyed the San Diego Zoo more. I think if we hadn't done the extra encounter then I would feel like it would have been a bit of a bust.\n\nIf you've never been here then I recommend it, it's still fun. Spend the extra money for an encounter. I think we spent about 5 hours here. Bring water and you can refill at the water fountains. Parking was $10 or $20 and there was plenty of parking.\nShow less"], ["Reviewed January 22, 2018", 5.0, "So Much Fun!", "This park is a must see. We went on a week day which I recommend. It has such a peaceful serene natural setting and I immediately felt so relaxed. He parkmis later out very well and we were able to see and do all we wanted in 5 hours. Park closes at 5pm and we arrived at Noon so we were concerned that we would need to rush to get through it all. Once we reviewed the map and identified what we wanted to see and when the shows started etc., that helped us determine what direction to go in first. I’ve been to Africa in a real safari and must say that this park os so well done that it transported me back in time tonthat African Safari trip. And the best part is we were able to see most all of the BIG 5 safari animals and many others in a matter of a 15 minutes tram ride when in Africa that process took days in the wild. Very well done! We will be back again.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Caravan safari", "Ignorantly opted to purchase the tickets. No expectations just complying with granddaughter’s wishes. The guide was knowledgeable as she answered questions outside the scripted information. Having said scripted, the tour was not scripted. There no way to script animals in a natural setting. Every passenger participated. Fun, educational and worth every dime. Plan to go back!!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Love it here!", "I'm in the keepers club and live about 5 mins from the park.. I'm there quite often. Its different from the zoo be cause it's a more natural environment.. The zoo is more geared towards the tourists... I love spending time at the gorilla exibit and the African team is a must on every trip.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Heaven on earth!", "Best place to visit! The scenery is absolutely amazing and what they do for the wild life is admirable. A must see for all!!!"], ["Reviewed January 20, 2018", 5.0, "This safari park is a major treat", "If you wear comfortable shoes and clothes and are ready to walk and enjoy wonderful animals this is a major treat. There is a lovely bus tour where one can see giraffes, gazelles, and other grazing animals. But there are also beautiful paths and trails where the visitor can see gorilla families, condors, lions, cape buffalo, and many many others.A MAJOR highlight was the cheetah run. This was truly astounding. Their cheetah lives with two dogs that are his pals. The cheetah and the dogs are brought to a 100 yard run. Visitors stand on the sides and watch the cheetah emerge from his cage in a truck, and race after a toy rabbit that is on a very fast moving rope. This animal can attain speeds up to 70 MPH. The cheetah run was worth the entire visit. Do not miss it.\nShow less"], ["Reviewed January 20, 2018", 5.0, "A magical experience", "Wow! I was sort of looking forward to our visit here and the safari, and then was totally blown away by how fantastic this place is. The animals are super well kept, there are lots of interesting educational activities, and even the park food was good and reasonably priced. If you can swing the caravan safari, do it. It's worth every penny. I don't know when I'll ever be able to hand feed giraffe and rhino again! Next time we're in the area we'd return in a heart beat. Could have spent a whole week there.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Like visiting Africa without paying the airfare", "It's been decades since I was here, and I really enjoyed it. Several areas have lush greenery. You could feed birds in one aviary for $4.00, but keep in mind that the money goes back to caring for the animals in this park. The African tram ride, included in the admission, is not to be missed. I learned a lot about animals from the talk, and you can see the animals roaming free in a natural setting. It's like being on a safari. In the future, I would like to take one of the extra fee safaris which take you down among the animals. For $10, I took the tethered helium balloon ride that goes higher than the Statue of Liberty. The view is beautiful from up there. I would also say not to miss the Watering Hole restaurant. The food is delicious, bar drinks are available, but most of all, you have a spectacular view of the African animals wandering below. It's like being in Africa without paying the airfare. You can take a long walk up to where condors live. I suggest wearing comfortable shoes. In Summer of 2018, they will open an Australian section, which will give me something to look forward to seeing. I believe the summer gets really hot and crowded, so I will probably wait til Fall. If you are interested in animals, I think you will really enjoy this place.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Absolutely worth any time spent there", "Always an amazing day when I get to be at the park. I live fairly close and have the membership that gives me free parking, so I go often. Always something fun and different each time."], ["Reviewed January 19, 2018", 5.0, "Jurassic Park", "Took the family on a trip to San Diego(buy the city pass) kido kept saying its like Jurassic Park. We did several of the extras, oh boy was it worth it!!!! Food/drink won't break the bank. Look forward to visiting again."], ["Reviewed January 18, 2018", 5.0, "Lovely day at the park", "Spent the entire day wandering around the park exploring all areas. The landscape is absolutely fantastic and the animals are well cared for and as much as possible in their natural environment. Parking, adult entry tickets and lunch for two cost well over $200 for the day. Expensive price but worth it while visiting the area.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Great time in huge park", "The park had some animals in very large areas, but you could get very close for pictures.\nThe tram took you on a vast land where giraffes horses and other animals roamed free. There were many guides to answer questions and direct you to the trails. Also do not miss the free bird show!\nShow less"], ["Reviewed January 14, 2018", 5.0, "Enjoyed more than the SD Zoo!", "Growing up in SD I have had the annual passes for several years. I have always enjoyed the San Diego Zoo Safari Park(also know as the Wild Animal Park to SD natives)\n\nBeautiful botany lines the paths and the exhibits are much larger than the zoo which is beneficial for the animals.\n\nIf visiting with toddler/preschoolers, plan the tram ride around nap time and let the tram lull them to sleep while you snuggle them and enjoy giraffes and rhinos!\n\nAlso, the cocktails at the elevators overlooking the balloon/tram area are great and come with cute little hurricane souvenir cups.\n\nLastly, there is an awesome water play station perfect for young kids. Perfect for the weather in Escondido as it is usually 5 to 10 degrees hotter than SD on average!\nShow less"], ["Reviewed January 12, 2018", 4.0, "Well Done, Lots of Walking, Lots of Upselling", "Enjoyed our day here with two 17 yo boys and 11 yo daughter. I was very impressed with how well maintained everything was, and how clean it is kept. We were there in mid-December, on apparently a slow day, as we did not have lines for the Africa Tram or any real crowds to contend with.\n\nWe went first to the Condor exhibit which is in one far corner of the park, and worked our way back. I was surprised at how much walking we did during the day, much of which is up and down hills, so it was a workout. Wear comfortable clothes and shoes!\n\nAll of the staff was friendly and helpful. We happened upon a couple of \"meet the animal\" talks where we could get up close and ask the keepers questions. Particular highlights were the Flightline Safari (long zipline over the animals), and the bird show. The zipline is an extra cost items. As noted in many other reviews, there is a lot of upselling in the park. Check out the website in advance and decide if any of them are worth it for you. Keep in mind that some things like paying to skip the line at the Africa tram or for special viewing area for Cheetah Run might be worthwhile on a busy day but are not really necessary on a slow day.\nShow less"], ["Reviewed January 10, 2018", 3.0, "Nothing Special, expensive extras!", "Pretty disappointed after the zoo which was amazing. I've been to pleanty of Safari park in the past, UK, Bali, Florida to name a few and this one just didn't do it for me.. Even my little girl got bored after 4 hrs. I think the big negative was the additional costs.. Parking $20, flying fox $79, Rope safari $85 even a small kids carousel... $5/6, if you want to drive through the wild area close to the animals like most safaris it's $125, all on top of your admission ticket.\nThe up side was the enclosures were a good size and the animals all seemed happy.\nIt's ok but don't choose this over the zoo..\nWe chose it over Lego land and wished we had gone there instead!\nShow less"], ["Reviewed January 10, 2018", 5.0, "Full Day of Fun but Bring the Water!!!", "We always take our Grandchildren here and they love to get to know the animals--- looking forward to seeing how they are at every visit. We always take the ride around the compound to give our feet a rest. That's where your water bottle comes in handy! Well kept and clean. We're happy to see the animals so well cared for...\nShow less"], ["Reviewed January 8, 2018", 5.0, "Absolutely awesome experience for kids and adults alike.", "Been to the Safari park 3 times and have always loved spending a day there! If you're a nature and animal lover then its definitely worth a visit. I also love seeing young kids at the park as they have a lot of interactive and learning experiences that can be a tremendous positive influence on appreciating nature.\n\nThe exhibits are awesome. The African tram is like a scene out of Jurassic Park. The tiger section, gorillas and the bird show, cheetah run are all brilliant. Overall, the collection of animals and the free range they've given them in terms of space makes it a very enjoyable experience.\n\nPro tips -\n1. Get to the park early and knock out the Africa tram first as the lines get more crowded as the day goes on. Also, its a big park with a lot of walking and you'll need all day to do it properly.\n\n2. Lemur exhibit - Go early as these guys sleep in the afternoons and you may not catch the little ones.\n\n3. Don't miss the tiger talks - it's a great learning experience for everyone and the tigers are just incredibly majestic.\n\n4. The Bird Show is very entertaining and informative.\n\n5. The Cheetah run - This is a sight to behold.\n\n6. Feed the Lorakeets. This is super cute as they come and sit down on your hand and lap up all the nectar mix (time independent but better to go early as the birds may get full).\n\nOverall, all the shows are well spaced out in terms of timings. Plan to go in the above order and you'll have sufficient time to visit all the exhibits in between.\n\nTo anyone visiting San Diego for the first time. Plan two days for the zoo and safari park. They're independent and have a lot of mutually exclusive animals. Its truly an experience and something I cannot recommend more to anyone who loves nature and wild life.\nShow less"], ["Reviewed January 7, 2018", 5.0, "First thing to do when you get there (after paying for parking--grrr) is take the naturalist bus tour", "Our tour bus guide/naturalist was fantastic---great info and running commentary. The Park was perhaps 25 minutes from our Mission Beach hotel and you have to pay for parking. They have shuttles from parking lot to main entrance gate. Keep your eyes peeled to find the baby animals---they are soooooo cute!\nShow less"], ["Reviewed January 5, 2018", 4.0, "Nice park - lots of walking", "Very nice park - well spread out with a lot to see. Safari ride was nice and included with admission but you don't get to feed the animals unless you upgrade. The tethered balloon ride was wonderful and worth the extra $14/person. They mentioned that this is a non profit establishment and everything goes back into the park etc. so that was nice to hear. We didn't buy any food or drinks so I can't comment on prices. Really nice to have a lot of helpers to direct you to your destination.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Handles a crowd well...", "Went to Safari Park (aka Wild Animal Park) during the holiday break. It was a crowded day but after getting past the entrance, the crowd disperses well across the large park. It never felt that crowded until we got in line for the Safari Expedition; an hour wait for a 30 minute 'safari'. Great guide, funny and a good message for the kids to engage with nature as much as they do with technology. Don't miss the African Woods section of the park...it seems to be a little out of the way but the animals were active and fascinating...the secretary bird seems to be a cross of an eagle and a tall chicken. TIP: use the kiosk to buy your tickets, way faster!\nShow less"], ["Reviewed January 2, 2018", 4.0, "New Years Visit", "This park has a lot of walking and definitely takes more than one visit to see it all. I promised my girls I would bring them back so we could see the tigers. Therefore we came back on New Years to enjoyed the park. As usual, I brought along a backpack with extra water and toilet covers. But it was not as busy as I expected it would be (maybe because it rained a little). Anyways, we enjoyed seeing the tigers and my girls also enjoyed the festive music from the very colorfully dressed singers. They even got to help sing Feliz Navidad.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Worth the money if you prepare your foods/drinks", "Went there with no plan. Bought the entrance ticket which include the African tram plus all the trail by walking. Prepared simple lunch for the family and waters. Gone home very happy as the site is so beautiful and animals are gorgeous.\nAs for the additional service they provide at a price, i think it’s fair but I am fine with the basic plan.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Cheaper Than A Trip to Africa... Barely", "This is a zoo with more than the usual walking. Don't be fooled into thinking it's not. There is one open expanse that feels more natural that has the giraffes and rhinos and some gazelle-type animals. Otherwise, the lions, tigers, elephants,cheetahs, and gorillas are in normal zoo habitats. There is a huge push to force you to spend more than your entry fee. They want you to pay to go on 'safari' or get premium seats at shows. It teaches kids that the rich people don't have to follow the rules everyone else does, that is a terrible message. The bird show was entertaining. We didn't go to the cheetah run because it was such a small area we couldn't imagine we would be able to see anything. We did pay extra to go up in the tethered hot air balloon. The views were great, we would recommend it.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Save yourself some $$$", "If you have not seen the San Diego zoo and the Wild Animal Park (2 separate attractions with separate admissions), you should do so. World class (& I have been all over the world)\n\nThese attractions are not a cheap date. They used to be so, but now they are up there with the cost of Disney World.\n\nFirst step is to see their website and see the cost of the various offerings, e.g. combined visit, a bunch of potential add ones, etc.\n\nNext, go to arestravel.com. Their tickets are sold at a significant discount. You print them out after payment.\n\nKeep in mind that you can also purchase add ones at the park.\n\nParking is $15 and can be easily 3 or 4 blocks away. You can buy close in parking for an additional $18. An alternative strategy is to drive right up to the entrance, unload everybody, and have the driver go back and park the car.\n\nYou might consider bringing food and drink. A corn dog was priced at $10. Items can easily be twice as expensive as they are outside the park\n\nIt is still a great place to visit, especially for kids, but with a little planning you can save a bunch of $$$.\n\nFinally, get there as early as possible. They are not open in the evening, so if you come at 10am or so, you will not be able to see it all\n\nShow less"], ["Reviewed December 28, 2017", 5.0, "Our USA honeymoon", "We really enjoyed the safari park, beautiful animals and it was great to see them out and not just behind bars. We were lucky enough to see the 2 tiger cubs that had been rescued from the wrong hands they were absolutely adorable ( yes big cat fan here !)\nAnother San Diego place we will return to.\nShow less"], ["Reviewed December 27, 2017", 3.0, "Animal kingdom wannabe - overpriced safari add on’s", "Very disappointed in my visit to this park. It has a tram safari for free but to get an up close experience you need to pay 125 per person extra . Actual premium tour is no better than Animal kingdom (Orlando) safari which is free. Scenery is far less attractive than Disney’s animal kingdom. Cheetah safari for $60 per person gets you a reserved standing place at something you can see for free. The San Diego zoo is fabulous and one of the best in the world . It’s hard to believe the Safari Park is run by the same organization.\nShow less"], ["Reviewed December 24, 2017", 3.0, "Visit the zoo instead!", "The park is nice but the fact that you can see the boundaries of the enclosures at all times, does take away form the safari experience. If you are traveling with kids younger than 6 yr olds, you will not be able to go on most of the exciting safaris (the cart safari, just didn’t seem worth it). The staff at the park is excellent and the facilities are good. But we felt that the shows and enclosures at the zoo were far better. In short, this park is good if you are a local, have a membership for multiple visits and time to drive to this park. But if you are a tourist and have only a few days in San Diego, then this can be skipped.\n\nTip - please pack your food when you go. They allow outside food. Food options inside the park are limited and expensive.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Beautiful Place", "Our previous visit was in May. Since then, at the Okavango outpost, they have substituted a two brother cheetah coalition for a mother and five cubs. We saw a really interesting animal encounter at Okavango where a particular cheetah now has two Rhodesian Ridgeback dog companions. In the nursery area there is a cheetah kitten who is adorable and in the tiger exhibit there are two tiger cubs who are very entertaining. we are looking forward to the opening of the Walkabout Australia next year which will feature the only duck billed platypus outside Australia.\n\nThe only negative at the safari park is the poor food. Earlier this year they opened the Watering Hole at a gorgeous spot called Kijami overlook. We thought, finally some good food. We tried it and the food, service and drinks were mediocre to poor. What we don't understand is why the food at the park is so poor, when they have Albert's at the Zoo as a model where the food, service and drinks are excellent. It's almost as if it's two different organizations who don't talk to each other - maybe that's how they are organized. I note however, that there is a San Diego Zoo Global President/CEO Doug Myers. I wonder if he knows how bad the food is at the park? In order to avoid eating at the Safari Parkj, we have a large late breakfast, skip lunch and then have an early dinner\nShow less"], ["Reviewed December 22, 2017", 5.0, "Something for everyone - educational and great fun", "From the gorilla forest to the African Plains, there is something new and interesting around each turn. Watching the cheetahs run is great. Walking through the aviary exhibit is always fun. The Africa Tram ride comes with the basic admission and is an excellent way to see some of the African plains animals up close. A new Australia area is scheduled to open in the summer of 2018 - I can hardly wait to return and see this addition.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Great day out", "The Zoo Safari is a great place to take your children to learn and see the animals in their own home. This place is huge and the animals have plenty of space. The kids can play as well in al the kid friendly activities the have set up for them. A must visit place if you have children or if you like the out doors.\nShow less"], ["Reviewed December 22, 2017", 5.0, "C. Vallese", "If you want to go on safari without spending a lot of money, come to San Diego, CA. The San Diego Safari Park is located in the rolling hills of eastern Escondido. There are walking trails, but you can also choose to ride one of the trams that take you right into the animals habitat! There are nursery windows to gaze at new babbies born recently. There are genetic experts in residence trying to prevent the extinction of some species like the white rhino. So if you want to get up close and personal with some beautiful and rare animal, without risking your life and limb, come see our beautiful park where it feels like summer almost year round! There are also opportunities to take a photo caravan ride to get even closer. You can feed a girrafe from your hand! There are also zip-lines that take you over and above the action!\nShow less"], ["Reviewed December 22, 2017", 5.0, "Don't miss the cheetahs run.", "This facility is part of the San Diego zoo. It is also a breeding ground for many endangered species. The Safari area is open and compatible animals are ranged together. The gorillas are a must see as well as the rhinos.\n\nThe chettha run is so impressive. There animals are so fast at 70 mph and can do zero to 60 in 3 seconds. This is high performance car time. Don't miss it and don't blink.\n\nThere is food and beer available but more expensive than even Disney.\n\nThey do have gift shops and many professional photographers for those who want souvenirs.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Love the cheetahs", "OMG, those cheetahs run so fast. I love to see animals roaming around & out of danger. So enjoy the apes,elephants, lions and the rhinos. Don’t forget to take the tram to see the the rest of the animals."], ["Reviewed December 21, 2017", 5.0, "Fantastic place to visit wildlife", "I’m a big fan of the San Diego Zoo but never got the chance to visit the safari park until recently. What a miss as this place is fantastic. There’s not much that I can say that would be different from the other reviews here. However, I would say that this park is $6 cheaper than the zoo but has just as many animals and it’s not as hilly as the zoo. I suppose you only really notice when you’re pushing a stroller up those hills. It also has the Africa tram where you can take a 30 min break during the ride. So based on that, if I didn’t specifically want to see an animal at the zoo like pandas, then I would probably come here just because it seems like an easier place to manage with small children. All in all, a great place\nShow less"], ["Reviewed December 18, 2017", 5.0, "Yep, Still the Best Zoo in the World!", "Second trip to this zoo and, yes, it is still the best in the world. What makes it the best? Well for starters its the staff and the volunteers. They go out of their way to help you find exhibits, restaurants, bathrooms, attractions, gift shops, safari jump off points, and everything else at the park. Then there is the environment that the animals enjoy. This is like nothing I have ever seen before and I've been to some of the best zoos in the world. The exhibits are spacious and realistically designed to mimic the natural environment of the animal. Then there is the ability to watch the cheetah run on a long open track. You just have to see the fastest land animal in the world explode down the track at 70 mph! It is thrilling. Then there are the Condors, Tigers, Lions, Parakeets, etc., etc. Do yourself a favor and just go to this park!\nShow less"], ["Reviewed December 15, 2017", 5.0, "This place was fantastic!", "We decided on here over the zoo as we have done many zoos over the years. I would have to say this was fantastic. The layout was great and easy to follow. Safari ride was interesting and lovely to see such a big open space with so many animals roaming. We really enjoyed our time here and even discovered an animal we had never heard of the Okapi (so beautiful).\nShow less"], ["Reviewed December 11, 2017", 5.0, "Great visit - tons of baby animals", "The safari park was so much fun. We did one day here and one day at the San Diego Zoo. The safari park was great, so many baby animals to see - tigers, hippo, cheetah. Definitely a must go to when traveling to San Diego it's worth the 30-40 minute ride\nShow less"], ["Reviewed December 7, 2017", 3.0, "Far", "Ovarall a nice zoo. Do not confuse with the San Diego Zoo. The safari pair zoo is a long drive outside San Diego in the middle of nowhere. Plenty of animals and clean but felt past its prime. The apes on view was my personal favorite. Prices for food was extremely high, $30 for 2 sodas and sandwiches. Definitely need stroller for young children, a lot of walking, some parts have very steep inclines. I would have rather spent this time at the other zoo. However if had enough of one it would be fine day there.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Always fun. Get there when right it opens and visit these animals first", "First thing to do in the morning is the tiger trail. The tigers are wide awake and are moving around.\n\nThen head to the gorillas, next the lemurs then the lions on the way to the tram. By the time you get to the tram it should be open. Check times to make sure.\n\nIf you go to all these animals too late they will all be sleeping :(\nShow less"], ["Reviewed December 4, 2017", 4.0, "Safari Without Shots!", "My wife and I took a little family trip after our little guy told us he wanted to go on a plane and see the ocean. With another boy on the way in March, we figured we'd make his wish come true before his little brother joined us.\n\nWe read all kinds of reviews from the very worst to the very best and made a decision to check the Sand Diego Zoo Safari Park out. Some folks said it was confusing how everything worked and what they should or should not pay for, others said you don't get to see too many animals, lots of people said it was a bit spendy while others flat out said it wasn't worth going. Well, my wife and I had our experience and hopefully it helps some of you out.\n\nFirst, it is true, the Safari experience (like a lot of things in California) is indeed expensive. Starting with admission, possibly hopping on a safari experience/behind the scenes adventure and grabbing a bite to eat, you will need a second mortgage if you have a big family. But there are some ways to save and get a great experience out of your trip.\n\nFirst, pack a lunch and snacks to hold you over until dinner time. We could have done this and we saw plenty of groups that did just that. This will help with costs BIG TIME.\n\nSecond, EVERYONE gets a free safari tram ride through the African exhibit and lasts about 30 minutes AND we saw a ton of animals during this ride as well as while we were walking throughout the other parts of the park.\n\nThird, Well worth the visit! If you can pull off spending some extra money, take the Asian Safari Golf Cart ride which is about an hour long and very informational. In all, we spent about 4 hours at the park and saw the entire park.\n\nYes, it's expensive, but we would recommend the Safari Park over the Zoo any day of the week. Same prices at both parks, same \"park food\", similar options for tram rides and learning opportunities, but the Safari to us was a better experience and more enjoyable.\n\nGo early and see the tiger cubs! They're only out until noon...\n\n#knowbeforeyougo\nShow less"], ["Reviewed December 3, 2017", 4.0, "Close Encounters of the animal kind", "This is a delightful park for both adults and kids. Very friendly staff, and many great spots to get you close to the animals. The Gorilla area, and the bird show are both fantastic. The lion and elephant areas gets you very close to those magnificent animals. There are a lot of options on how to see the animals in the park, and if you take the tram first it will give you an idea of where to go next, etc.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Experience Excellent ... Prices Outrageous", "I visited SDZ Safari Park with my daughter, who was a member. Before we even hit the entry gate, there was a $15 charge to park our car. Basic entry is $52 for non-members, and the special \"safari experiences\" that make this a safari park instead of a well-planned zoo cost $50+ per person in addition to the entry fee. That said, there is plenty to see and do with basic entry. We especially enjoyed the Animal Encounters, in which trainers talked about the animals and the natural behaviors they were displaying. We also enjoyed the Cheetah Run, which was a highlight of the day. The walkways are comfortable and the exhibits are well landscaped. Not sure it's worth the money though.\nShow less"], ["Reviewed December 2, 2017", 5.0, "EXCELLENT ZOO AND NICE WAY TO SPEND THE DAY", "My wife and I have been members of the San Diego Zoological Society for many years and we try to visit the zoo at least a couple of times a year. (We don't live in the area.) Their work to preserve endangered species and to create a less stressful environment for the animals while educating the public is outstanding. This organization should be on everyone's list of organizations to support. This place is a great place to visit whether you have children or not.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Very impressed -- once again!", "We went (six family members -- three adults, three young kids) for the better part of a day until the kids \"ran out of gas.\" It IS expensive but well worth it --- and the money goes to a good cause. Wonderful animals, excellent viewing (tram and walking), lots of helpful volunteers along with multiple paid staff. The tiger exhibit was especially impressive.\nShow less"], ["Reviewed November 24, 2017", 5.0, "A must see", "Definitely don’t miss out seeing the safari park. Awesome! Half day. Animals are amazing. Lots of fun animals to see don’t miss the safari really cool!! $17 for parking. Fun day."], ["Reviewed November 22, 2017", 4.0, "Amazing Experience, Incredibly Pricey", "We really enjoyed the San Diego Zoo Safari Park. I'm really glad this place exists and contributes so much to conservation efforts. However, it's incredibly expensive. I wonder about the ability for low-income families to visit. I also think the extra, optional activities you pay for are very expensive (e.g., you pay around $52pp entry fee and the \"Cheetah Safari,\" which is an extra educational experience where you meet and learn about cheetahs is $54pp). Also, the food is terrible. $30 for two tough (not sure if it was even meat) burgers and 1 coke. $10 for a corn dog. I'd still recommend this for the experience and the place is gorgeous and well run. I just wonder if you really have to charge such high prices for the extra activities. And, they're charging so much money for food, it would be great if they tried just a little harder on the quality front so people walk away with a bit better value.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Always a joy to visit the animals", "Always a joy to visit the animals. We have been visiting the park for nearly 40 years. Each experience has been a little different. Hard to tell the temperament of the elephants and lions. Just a fun place to explore and wander."], ["Reviewed November 21, 2017", 5.0, "Fun at the zoo", "We decided to the wild animal park today. We thought about getting a one day pass. My husband and I got a season pass. They don't offer season passes unless you're from the San Diego area for children. We enjoyed riding on the tram. The bird show was neat. I really enjoyed the Gorillaz. The tigers are awesome. Also with the season pass you get a discount on your food and free parking. And also a discount on merchandise. My kids really enjoyed the zoo. It was very relaxed.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Love the Rhinos!", "We took the Safari Truck Tour so were able to go into the pasture with the Giraffes and Rhinos and feed them. It was a wonderful tour with a very knowledgable tour guide. We also went to watch the Cheetah Run and were able to get some very good pictures. I would highly recommend wearing good walking shoes and taking your sun screen.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Fun, Educational Great for Families", "A must do if you are in the area. Amazing to see, in real life, animals from around the world. Highly educational for all ages. Highly recommend the tram to see the African Safari. I thought the park was well run, clean and neat. The ambassadors were friendly and helpful. Plenty of options for food and drink. All in all a great day for all of us.\nShow less"], ["Reviewed November 16, 2017", 5.0, "This park never gets old", "We went as a family group for the day. We wanted to see elephants and rhino, we wanted to ride the train, we wanted to be outdoors, we wanted good food.\n\nWe got most of it. The line for the train was too long for our 5 and 4 year olds so we gave that a miss this time.\n\nThis is the park to get up really close and personal with the animals. The prime location must be the African Plains. Across this landscape roam (literally) rhino, giraffe, water buffalo, zebra, antelope and much more. Having been to Africa a few times, and seeing the real thing, I think this is the closest you will get to that experience on the West Coast. All right there.\n\nFor food, go to the Watering Hole restaurant. On the park map is a bit off to one side, but it is the best place to view the African Plains and it was virtually empty when we were there. People tended to head for the food court type dining places more centrally located. Leave those behind and come here. It is a great place to watch wild animals while having a burger and fries.\n\nMake sure you know you will not see everything in one visit. If you live local and have family buy a season pass, it will pay off, and visit specific sections on one trip.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Amazing afternoon of fun", "This park is first class You can get up close and personal with most of the animals. Very clean and well run You will have a great day!!!"], ["Reviewed November 10, 2017", 5.0, "Bigger and Better than the San Diego Zoo!", "Got your attention! Bigger in area and more large animals. There is a tram that takes you around an Africa safari so that you can see animals in a more natural environment. This is not a one hour and leave, this is all day and even another day to see everything and to experience all of the exhibits.\n\nIt is best to arrive when they open, and stay as long as you can.\n\nBring a camera, not a cell phone, if you want to capture the animals close up in their environments. Visit tiger trails, lemurs, lions, and the elephants.\n\nGreat place to bring children.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Always a fun and educational day!", "I am a pass holder, every time people come into town I take them here. This is the sister park of the San Diego Zoo and if you are looking for something more interactive, I recommend this park. You can do a tug of war with a full grown tiger. Feed birds- great for pictures and it’s only $4. If you have the cash, they even have a safari. You go into the giant African enclosure and get to feed rhinos and giraffes.\n\nIf you are a first time visitor to San Diego, I would go to the zoo over this park IF you aren’t going to shell out the extra money for the encounters. However, if you can afford it, this park wins hands down in my opinion.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Quite Pleasant", "Went on a weekday, less people Very relaxing, able to capture great photographs.The weather was perfect."], ["Reviewed November 9, 2017", 5.0, "Great place to spend a day.", "You can visit Africa without actually going there. It has an easy shuttle and friendly staff to guide you through the confusing areas of the park. A nice three to four mile walk to see it all."], ["Reviewed November 9, 2017", 5.0, "Huge Park with Lush Gardens, plus numerous bars for the adults!", "Massive park that is well worth the trip. You can spend the entire day just wandering around the zoo and animal enclosures. The trees and vegetation are outstanding and help cut the heat during the summer months. Try to go midweek in the fall. the...More"], ["Reviewed November 9, 2017", 5.0, "Don't pass this up. The best zoo.", "You need at least 2 days to see everything at this zoo. 1,800 acres devoted to wild animals. And growing. The ability to see wild animals in a more natural habitat that gives them acres to roam is unbelievable. It really is like going on...More"], ["Reviewed November 9, 2017", 5.0, "Don’t miss it!", "This is a very special place that shouldn’t be missed if you’re in the area. Our family purchased the basic admission and did the tram tour. We also walked the entire park in about 6 hours. The area is huge and seeing the animals roaming...More"], ["Reviewed November 8, 2017", 3.0, "A Zoo not a Safari Park", "It was a lovely day but it's not Safari park. It's Zoo with a Safari Trail that you drive around on cart for 30 mins."], ["Reviewed November 7, 2017", 5.0, "Huge Park", "This is a amazing place, its huge so be prepared to walk and walk. The Cheetah run is awesome try not to miss it!!. The animal safari is so-so you dont get very close to the animals, so I would prob give it a miss...More"], ["Reviewed November 6, 2017", 5.0, "Well Worth The Trip", "Visitors to the park have to drive up the I15 freeway and take a long country road to get there. It's worth the trip, it is one of the nation's zoological treasures, with animals roaming the hills and plains of San Diego backcountry. Make sure...More"], ["Reviewed November 6, 2017", 5.0, "Amazing and so informative", "We bought general admission plus the Cart Safari. It was not cheap, but we loved it! The guide for the cart safari was so informative and cared so much about her job. I'm still talking about all the amazing things I learned. We went on...More"], ["Reviewed November 5, 2017", 5.0, "Amazing park and caravan safari", "This park is fantastic! My mother, who can’t get around very well, and I spent the money on the 3.5hr caravan safari. It was so amazing. We fed giraffes and a rhino and saw so many beautiful animals up close and personal. It was expensive,...More"], ["Reviewed November 5, 2017", 5.0, "A treat for young and old alike", "This humongous park extends over 1800 acres and would be the largest I have seen. There are a lot of exotic wild animals preserved in their natural habitats. The aim is to educate as well as entertain.\nThe kids were thrilled with Lorakeet feedings, the cheetah runs, the condor viewings and the tram which takes us through the vast African settings. Particularly interesting is the programme to breed rhinos which can be observed at a close distance. A paid hot air balloon ride is a highlight not to be missed.\nThe park involves long walking and step gradients but mechanized and manual wheelchairs are available for rental. There are a lot of eating options and one can carry food from home too. Restrooms are abundant.\nAlthough expensive, the activity can help you spend an entire day\nShow less"], ["Reviewed November 3, 2017", 5.0, "Don't miss the Behind-the-Scenes Safari of the Rhino Rescue Center", "We made sure to visit here again when we returned to San Diego. We really enjoyed the Behind-the-Scenes Safari of the Rhino Rescue Center - we learned so much, it was well worth the added cost. Besides learning about the rhinos, we got to hand feed a pair of Okapi, which was really cool.\nShow less"], ["Reviewed November 2, 2017", 5.0, "This was one of the highlights of our trip!!", "Way back in 1967 and 1968 I visited the San Diego Zoo in Balboa Park but until we were planning our trip this time I only just found out about the Safari Park. This was so worth the money. I just wish we had gotten there sooner to be able to see more of the animals. The Caravan Safari Adventure was the best ever. Our driver was Allison and our tour guide was Jeanne. Jeanne was a hoot. We learned so much on that tour. Not only did we get to feed the Giraffes but we also got to feed the Rhinos. One Rhino Dakar came from a place in Tampa, Florida and we found out that a cousin of my hubby's had taken care of her for about 5 years. What a coinkydink!!\nShow less"], ["Reviewed November 2, 2017", 4.0, "Very Good Safari Park", "The Safari Park is certainly worth attending. It is about an hour from the San Diego Zoo. It is rather costly with a $15 parking fee. One should spend at least four hours here if not the entire day."], ["Reviewed November 1, 2017", 4.0, "Great place", "Its a ways from San deigo and took us about a hour to get there\nGet there early, the park is big and the only thing included in the admission price (USD 52) was a safari tram ride which was excellent. Our tram safari guide was well informed.\nThe volunteers and staff on site were great.\nShow less"], ["Reviewed October 29, 2017", 5.0, "If You Love Animals--this is the place for you", "Wonderful place for up close contact with animals. The park is a bit pricy even for seniors, but since we did not expect to get back there we choose to take the Caravan safari and were not disappointed. We got to feed giraffes and a rino from the truck which was a once in a lifetime experience (without going to Africa). Food is very very pricy in the park so would suggest that you take drink and a snack with you. We entered the park shortly after it opened in the morning and left when it closed. There is plenty to see. The map you are give of the park is sometimes confusing but they have plenty of friendly volunteers who are there to help you have a great time.\nShow less"], ["Reviewed October 29, 2017", 5.0, "AMAZING!", "This place is most definitely worthy your visit if you are in San Diego. It is so big, so you will need at least half of a day for it. They have so many animals I haven't seen anywhere in the world. They are kept in environment that really looks like their natural habitat and they look happy.\nShow less"], ["Reviewed October 28, 2017", 5.0, "A Wondrous Day!", "Important: Get there early, for multiple reasons: (1) Parking is $15, and plenty, but getting a nearby space is always good. (2) It's cooler earlier in the day, so animals are more animated. (3)The Loop Bus takes 45 minutes, and is a very nice way to get oriented, but it gets long lines as time goes on. (4) Go on a weekday if you can so you have more elbow room all day. There's a LOT to see, so plan for the whole day, which would include a stop for a nice lunch. Keep your eyes on the show schedules, they were surprisingly good (especially the Bird Show... sit in the middle, halfway up... you'll see why).\n\nThis venue goes to great pains to make sure phyisically challenged visitors have all the accommodations they need. Nice to see.\n\nOur experience here made for a VERY enjoyable Friday. We are a middle-something-aged couple, no kids... NOTE: OCTOBER is \"Kids Are FREE Month\" (here, and at the Zoo, itself), so there were many children about. They were marveling, and happy, chaperoned, and all very well behaved. This made us feel more enthusiastic and able to enjoy our own childlike wonder at all we saw.\n\nThey have \"adult\" beverage stations along the way, including wine and beer, not cheap, but not horribly priced, either.\n\nThere were many friendly volunteers in red vests just standing around, as you walk about, ready to inform, guide, and encourage you.\n\nWe walked the entire park at a relaxed pace. First, we took the Loop Bus for an overview, that was helpful. The environs were all clean and neat. The animal enclosures were large, natural and humane (as best we can judge). The staff reminded us often that the work of the institution is research and preservation of species. The park food stations were run quite efficiently and were also clean and neat. The were plenty of seats throughout the park so you could stop and take a rest, and places to stop and make good use of your refillable cup. Bathrooms, too, were plenty.\n\nAt certain animal exhibits there were volunteers stationed and ready to answer questions, such as the Gorilla enclosures, pants and giraffe exhibit.\n\nOver all we felt that we had spent our money well, and nobly to help animal conservation. We learned a lot, enjoyed a whole day, had a nice lunch and left comfortably tired.\n\nIf you have REAL digital camera, better than your phone, this would be the day to bring it.\nTake your time, be patient, and make a few photographs that you will be proud to display.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Amazing experience!", "My boyfriend and I went mainly for the caravan ride and it was well worth it just for that! The guide, Rebecca, gave lots of information and was VERY friendly! We got to feed a giraffe and a rhino! Rebecca offered to take couples pictures with the giraffe and knew about every animal in the exhibits. The driver, Dave(?), was great also, very friendly! We had time to walk around and saw the gorilla exhibit which has a baby gorilla in it! We also happened to stumble upon an educational show including a kangaroo! Lots of kids were gathered. I personally would not pay for the preferred parking on a slow day because it’s not worth it. I’m not happy with the fact that the parking person told us we’d have to walk up a steep hill if we payed for regular parking although there was almost no one parked and preferred parking was two rows away from regular parking. Entire waste of money. Food was great, the drink cost came with a souvenir cup for $6 which I think is a great price!\nShow less"], ["Reviewed October 24, 2017", 5.0, "Great experience for the kids", "When we first looked at coming to the safari park we thought it didn't appear that big on the map they had online. We were wrong, we got here at 10am and left as they were closing. I think we saw everything. It was so much fun for my family and there was so much to see. There are a few areas that are pretty steep if you have a stroller, but even with my three kids on our stroller I still managed fine. This was a great adventure, an exhausting one, but great!\nShow less"], ["Reviewed October 21, 2017", 5.0, "Great time", "Went on the safari! We had a great time. So relaxing. We went on a week day so no crowds. The animals are really amazing. Worth the drive."], ["Reviewed October 18, 2017", 4.0, "Fun morning", "My husband and I visited the zoo one morning and made the drive here for another morning. Our favorite part of the visit was the Africa tram. To be honest we didn't feel like paying for the other safaris because we could walk around and see so much nfor just the price of admission, but we saw them going by and people seemed to be enjoying themselves.\nShow less"], ["Reviewed October 17, 2017", 4.0, "JAMBO!", "Took the family to the Wild Animal park and enjoyed a nice day seeing the entire park. We arrived when it opened and had plenty of time to see it all. It was a comfortable 87 degrees and there were many animals on the move. The tram ride, elephant watching and the bird show were the most entertaining. The bird show and the tram ride could have been longer. If you want to see more animals closer up, the park offers special encounters for additional fees but we were fine seeing Elephants, Giraffes, Lions, Tigers and Gorillas from where we were. Missed the Cheetahs though... Food was ridiculously priced. They do let you bring in waters and backpacks with food. I will be posting a review for a local breakfast spot we tried called Pegah's. We went there before the park so we were good all day until dinner. ps. Parking was $15\nShow less"], ["Reviewed October 16, 2017", 5.0, "All The African Wild Animals", "They’ve developed 1,000 of their 1,800 acres here. Tons to see and takes all day unless you’re a sprinter. The animals are amazing and interesting. We recommend the African Cart Tour for the best view and most Info. They have it All !"], ["Reviewed October 16, 2017", 5.0, "CARAVAN SAFARI - MEMORABLE EXPERIENCE!", "I visited the park on a Thursday to experience the Caravan Safari DELUXE, this particular tour consists of 3.5 hours which allowed more time to view the animals and of course more time to feed the giraffes, see rhinos and have the opportunity to feed and use branches to \"tickle\" their backs. The tour guides provided a lot of information sharing how important and the purpose of the park is for sustaining species that are endangered in areas that poaching is eliminating so many beautiful animals. Experiencing a giraffe's tongue as it wraps around to eat the leaf is an experience I will never forget, seeing a rhino open it's mouth so you can drop apples into it was more than I thought I'd do. This tour I highly enjoyed and will definitely do again, and again!!!\nShow less"], ["Reviewed October 15, 2017", 5.0, "Full day fun", "Safari park is definitely worth a visit when you are in the San Diego area. If you are an animal lover you can even get a 2 day pass which offers both Safari admission and the San Diego zoo. I went with my 13 years old brother who also enjoyed the safari. We spent about 5 hours touring the zoo part at our own pace. The $11.99 souvenir cup was worth the money as we both finished cups and cups of pop and water through our 5 hours walk through the park. You can refill the cup with pop or iced water at any of the stations with the same day receipt; so hang on to it! My brother loved the Gorillas. The Gorilla family was mostly chilling in the shades with younger playful ones swinging on the ropes. Although the park closes at 5pm, our twilight caravan safari allowed us to stay in the park until 6pm. The 2 hour $125/person trip was pricy but very unique. We got to fit the Rhino and giraffes, both of which are very unique experience! My brother and I enjoyed it so much. We were pooped and required a full day relaxing in the hotel to recover the next day! :)\nShow less"], ["Reviewed October 14, 2017", 3.0, "Disappointed", "After driving 30 minutes from our hotel it wasn't an easy place to find. No signage on the roads. After paying $15.00 to park walked up a steep driveway to buy tickets. Having to use the restroom I walked into complete darkness. That's when we found out there was a power outage. None of the shows would go on. No shops were open. That also meant no food or drink available. They shut down the Lions, Lorikeets and other areas.\nWhat can you do except see what was open especially after paying for parking and the drive. I was sad to see all the children there with nothing available to drink or eat.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Great Animal views", "We had a wonderful trip to the Safari Park today and the grandkids loved it. Wonderful place to take the family. The tram around some of the park is great. The place is easy to get too and not extremely crowed."], ["Reviewed October 13, 2017", 4.0, "Interesting", "There seems to be enough to do to keep young and old entertained. We spent 5 hours and feel satisfied we saw everything. Hang onto your wallet - things are expensive"], ["Reviewed October 12, 2017", 5.0, "Amazing experience", "Visited with friends while in the San Diego area. The park is very large with so many things to see and do. This park offers additional safari experience options. These options cost extra in addition to your normal park admission. I did not purchase any of these options but they are tempting. They allow you an up close experience with the animals. I enjoyed the park immensely. There is a lot of walking but you can see the animals in a more natural environment. Also this park is focused on conservation and helping to breed animals that are endangered. Amazing work this park has done. It is about 40 minutes north of San Diego but we took Lyft to get there. Roundtrip from downtown San Diego was about $100 but absolutely worth it. Highly recommend visiting the park will definitely go back they are constantly growing and expanding. Best money I spent while on vacation.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Best \"Zoo\" EVER", "When I lived in San Diego we became members and would go to the part twice a month. There is so much to see and do that everytime you go you see more. If you have time do the private Safari. It's expensive but well worth the price. You spend 1/2 day on the back of a truck driving through the park feeding live wild animals as they roam freely in huge open spaces. The guides on these trips are amazing. They also have a sleep over in the park which is also another thing I have to highly recommend. The San Diego Zoo is one of the best in the worlds but it cannot compare to the Safari Park. This place is here to help keep animals from going extent and knowing my money is helping to support this cause makes my visit even better. Take the whole family. Spend the day. Spend the weekend. Make sure you don't skip this attraction while in San Diego County.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Astounding", "The park it self is massive and you can tell is very well taken care of. Construction is a small pain when you are closer to tiger trail as they are adding an Australian exhibit. The construction it self wasn't too noticeable but there were a few exhibits that were closed due to it. If you have the time take the tram through the \"safari\" itself.\n\nI was disappointed that the tram and the cart safari ($) were similar. Had I known this ahead of time (Which could partly be my fault for not doing the proper research) I could have spent my money on a different paid safari. The cart safari was neat, it is an hour long so you do get more time vs on the tram. You also get to throw a small snack to the Okapi they have. The cart safari was an educational experience, and you did get the chance to stop and take lots of pictures.\n\nAsides from the park being very expensive (Cart safari, admission, parking and food if you don't bring any in) it is well worth it to visit.\nShow less"], ["Reviewed October 11, 2017", 5.0, "outdoor fun", "This wild animal park is a must to visit tram rides, zip lines walking paths,shows,special vip tour, overnite camp,food court,and more"], ["Reviewed October 7, 2017", 4.0, "It's the safari!", "First off the only reason this isn't 5/5 stars is because they charge an arm and a leg for admission and any extra tram rides, I think for 5 of us to take a safari cart and entry it was 550$ American which is ludicrous, It's all there though and it's for the animals but my goodness is it expensive, the safari cart was cool though we had a great experience with it, you got to really love zoo's like we do for all of this, we got to see the new lions cubs they rescued! So cute! Also the apes were active and the lemurs had just woken up from snoozing all day, we were told since it was a hot day not many animals were out but I didn't get there untill later so it cooled down a bit. I met up with my group, they got all kinds of birds too if you into that. On the safari cart we got to throw some carrots inside there pen and almost every donkey came to the fence and that was fun, also the lions were right up against the glass and it not being such a busy day we got some very very good photos, the only way I justify spending all the $$ we did was because it's for the animals also probly never come back and partly due to being from Canada. Any staff I interacted with was cheerful and helpful. Overall very good experience but my poor wallet :(\nShow less"], ["Reviewed October 7, 2017", 5.0, "Actually it’s called the Wild Animal Park", "I just renewed my annual pass for the 35th year. Back in the day you could drive through the park where ostriches would poke at your car windows.\n\nIt is only gotten better since as I frequent this place for its solitude and beauty of the animals even if it is for quick lunch.\n\nI am still dismayed by the name change from the Wild Animal Park to the zoo safari. Political correctness gone way wrong And the Board of Directors should reconsider the name to with historical roots\nShow less"], ["Reviewed October 6, 2017", 5.0, "Safari Park Visit", "The Safari Park - part of San Diego Zoo - is very large. Has many animals that the Zoo does not. There is a free tram which goes around the African Exhibits. There are many other safaris including balloon rides, caravan among others, offered at additional cost. Many places to eat and shop. Next year, new Walkabout Australia exhibit opening - reason to go back.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Mesmorizing", "I am not a fan of seeing wild animals caged but San Diego actually helps endangered animals and takes impeccable care of them. They work to find options for farmers who may have issues with certain animals eating their crops, etc...One of the guides provided invaluable information about the orangatans they house. it was also super clean.\nShow less"], ["Reviewed October 4, 2017", 5.0, "As good as the Sea world and the Zoo", "I really enjoyed this Safari Park, although a bit far away located from Coronado where we were staying. Thank God the traffic was very light so we reached the place in some 45min, with help from printed google directions and after buying our tickets from Coronado del mar's concierge, saving us some 2 dollars.\n\nThe staff was very nice and friendly and although the school holiday ended, there were some kids around yet mainly it was quiet. We enjoyed checking the tigers, as it was a tiger's birthday (one tiger had some amazing eyes as came face to face with us), then checking all the other animals, checking the views over the safari park then checking the large enclosure of all the animals, together with other people in a guided tour, then feeding the little parrots in their enclosures by purchasing the food from a nearby shop.\n\nWe ate at Thorntree and the food was good too.\n\nWe also checked the baby tigers in their nursery playing with the toys and the supervisors were eager to tell us facts without being asked.\n\nIt was great to discover that people can be so nice and friendly and welcoming. Great place that deserves a return visit.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Marvelouse Extention to the Main Zoo ... Do the Caravan Safari!!", "There is more to do here than you can shake a stick at! We have done the main San Diego Zoo, and it is also fantastic - a 'not to miss.' But my wife had gone with our (grown) daughter and raved about the balloon ride and other things she saw, so she insisted while I was out here I take our (grown) daughter back and suggested the Caravan Safari (alert: there are six or seven types of ways to take your money - several safaris plus a balloon view, zip line, etc. ... but all contribute to the upkeep of this fantastic park and its efforts to breed and expand its endangered inhabitants, so feel good about it). This safari is two hours, with a guarantee of feeding giraffes. Which is pretty neat. Photos all around! What they don't say - because it is only something like a 50/50 chance - is you might also get to feed a rhino - also way cool. The guide was extremely knowledgeable with virtually no question however trivial going unanswered. He was also just fun to listen to. The drive slowly takes you on the tour that also includes various antelope and deer (not North American versions), but they don't come too close to the vehicle. The rest of the park is also excellent. Enjoy the Lorrie feeding - worth the few bucks to have them sit on your hand and lap up the sugar water. We got in the tigers and condors and some others before tiring out. They currently have a couple tiger cubs, with tiger cub play area to watch them, but they'll eventually grow up. All in all, a great experience for young and old alike.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Wonderful wild animal experience", "The San Diego Zoo Safari Park is a great way to experience animals in a more natural setting. The Zoo has gone out of their way to care for these animals in a setting as close to their natural habitat as possible. There are many attractions and events for children to learn about these endangered species.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Worth a visit", "We visited the Safari park the day after we visited the Zoo and, although there weren't as many animals at the safari park, in some ways you got to see more as the enclosures are very big & there aren't as many obstructions in terms of viewing the animals.\nAdmittedly, there were a few areas currently closed due to refurbishment but it didn't affect the day & we still got to see a lot.\nThe main thing we did here, & I would highly reccommend it to anyone planning a trip here, was the Caravan Safari.\nIt will cost you extra but it is well worth the money!\nWe were taken in to where the giraffes & rhinos are, up close, & even got to feed the giraffes.\nYou get taken through to other areas as well & it lasted a good 2 hours.\nThe guide was also very informative & was there with the answers to any questions.\nLike the Zoo, this was a great day out & the caravan safari really made it.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Conservation at its best", "The Safari Park is a unique and very special experience. The layout, animals and plants are a showcase for conservation and good planning. If you can't get to Africa, this place gives you an opportunity to view animals in their natural habitat and to learn about them and the rescue efforts that are underway on the animals behalf.\nShow less"], ["Reviewed September 29, 2017", 2.0, "Not impressed. I could have seen more at the zoo.", "Not impressed. I could have seen more at the zoo. maybe my expectations were to high. First you pay for parking, then they have several \"extra\" add on's. I give to several conservation organization, so I didn't care about the money. I just felt i wasn't getting much for anything I paid for. They seem to have more places to eat and gift shops than animals. Go to the Bird House. It's about as close as you get to any animal. It good for children. I suggest the grown ups go somewhere else.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Fantastic oppurtunity to see animals in their habats", "The Safari Park is a wonderful experience and not far from the resort. The attraction features an amazing leopard run."], ["Reviewed September 28, 2017", 5.0, "Wild animal zoo", "Very clean. Volunteer staff very knowledgeable. Very enjoyable day. Tram ride very interesting and enjoyable. Good time watching gorillas be fed their sack lunches."], ["Reviewed September 27, 2017", 5.0, "Safari park", "Wonderful park. Wear comfortable shoes & take water. Concessions a little pricey, but throughly enjoyed the park"], ["Reviewed September 27, 2017", 5.0, "Lots and Lots of Walking", "This huge park was beautiful and well-laid out. It's so big, I took a shuttle at one point to save my feet and knees. Didn't get to most of the park before I popped out. The Africa Tram gives a great view of the big open spaces where the giraffe, rhinos, antelopes, etc. are gathered. Extremely helpful and friendly staff. Knowledgeable docents. Would be a fabulous spot for a wedding, corporate party or family reunion.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Roar and Snore", "After much contemplation due to the high price, I finally pulled the trigger and booked a tent. I booked the classic tent which is the cheapest option available. You basically get a white enclosed tent and thin sleeping bag pads, and a lantern. Which was good enough for us as it was just one night.\n\nI took my two nieces (8 & 9) and nephew (12). Luckily the weather was cool and overcast so it made our day and night more enjoyable. We were there on September 16th - I probably wouldn't recommend this in the summer because the tent was quite stuffy even on a cool night.\n\nYou do get park admission for two days, we bought our tickets at the park with a coupon. We visited the gorillas, lemurs and bats while waiting for check in to start.\nCheck in we great, chose the long walking tour for the evening. After you get your wristbands, you sit in the shaded tree area and listen to an animal handler talk about an animal. He was excellent and entertaining and the puffy little falcon was adorable. They're all about education there and animal preservation. Also, each staff member was amazing!! I've never experienced anything quite like it. They all seem to genuinely love their jobs and the animals. A special thank you to Rachel and Mansour, they were so nice.\n\nOnce everyone is checked in, we departed into groups towards the camp area. Let me just saw there was probably about 120 people there and they run this program like a well oiled machine. Everything was done in a non fussy orderly fashion. We were part of the first two groups to head down to dinner. The food isn't anything to write home about, but it was edible. I know they're a non profit, but the offerings and quality could be stepped up a bit.\nAfter dinner, you're welcomed to go to your tent to settle it. All the while, our dinner view was the open area of the safari park where herds of animals roamed around. It was awesome to see. And there is no one else in the park aside from the the campers. The tent area is nicely laid out and the bathrooms were in great condition as well. Some tents are closer together than others but quiet time begins at 10:30.\n\nAfter we settled in, the walking tour starts at 7:15. Once again we meet at the table area and divide up into our groups. We were visiting the elephants and tigers. Gorgeous creatures!! One tiger was even stalking us inside the enclosure. And the elephants were lovely walking about and munching on plants. Highly recommend a flashlight. I bought the kids headlights off of Amazon and they loved it.\nAfter there was another animal presentation. Again, we are still in groups so it feels more intimate vs being with 100 other people. They've spaced everything out so different groups are participating in different activities so it never feels crowded. Then we had smores, popcorn and hot coco. They also had a large Jenna game and corn-hole for us to play with.\n\nWe headed back to our tent at about 9:45 but other campers headed back earlier. You're free to stay out by the campfire and enjoy the animals up until 10:30.\nThe lion had already started roaring by that time and it was incredible to hear in person. Throughout the night we heard all kinds of animals such as the elephants and birds.\nFirst wake up call is at 6am. We got up and dressed, then packed up all of our bags. We wanted to hurry down to see the\nLions. Don't skip this opportunity!! He was pacing back and forth in front of the glass and roaring because they knew breakfast time was quickly approaching. You won't get another chance to see them before the it's over. The lions go in for breakfast while we have breakfast and don't come out again until the park opens. Which by that time they are sleepy.\nThen we finished with a tram tour, which was fun but don't think I would stand in a long line for. This experience is worth the price and I highly recommend it!!\nShow less"], ["Reviewed September 22, 2017", 5.0, "Highlight of our West Coast trip", "We visited on a quiet day in September and after a walk around all the interesting exhibits that are so beautifully laid out and maintained, we went on the Caravan Safari through the African and Asian enclosures. We were lucky as the tour trucks can seat 16 but there were only 6 of us on the twilight tour (starts 4:30pm in Sept) so we all had a chance to spend time feeding giraffes and rhinos and hundreds of photo opportunities. Our guide Danielle and driver Stan were both impressively knowledgeable about the outstanding work on wildlife preservation and protection that has been pioneered by SDSP for many decades. They were also delightful company on the tour.The terrain is very hilly and the truck has to negotiate a lot of steep slopes and gated sections between the enclosures. The 2 hours sped by so quickly. Without doubt, a not-to-be-missed tour.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Very nice park", "We went today with our toddler. She loved the animals and play areas. The animals were kept in areas that seem more natural for them than your traditional zoo. Everything was clean and well maintained. The children play areas were very child friendly and well above average. Food choices were pretty good and plentiful for this type of park. Prices were a little high but pretty typical for this kind of park and location. We took the balloon ride which was ten minutes and offered a great view of the surrounding area but not a great view of the animals so if money is a concern ($12 per person) you may want to skip it. Staff were friendly and there were a lot of volunteers around to give directions and tell you about the animals and enclosures. We will definitely go back.\nShow less"], ["Reviewed September 21, 2017", 3.0, "It was a ZOO!", "We visited the park as part of my wife's work related party on a very hot, muggy August day. Unfortunately, the heat coupled with very long lines for every attraction made the day very long and almost unbearable. It was very crowded and congested in most areas of the park and apparently they do not have the capability for staff to make adjustments for long lines or crowded areas. It was such a distasteful experience that I do not plan to visit the park again.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Nice but also a bit disappointing", "We went to the San Diego Zoo and Safari Park in two consecutive days. I have to admit that I was somewhat disappointed in the Safari Park, particularly in relation to the Zoo. There were certainly some very nice aspects to the Safari Park - some close up and personal views of the lions, tigers, ...and gorillas. But the tram tour itself, which to me was supposed to be the highlight of the park, was underwhelming for me. Not long enough and in an environment that wasn't very interesting to view. Not a lot of \"texture\". Certainly we saw many animals - mostly variations of antelopes, but all the animals were out in a field.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Great place to visit", "First off, it is far away from San Diego but well worth it. It is also expensive but well worth it too. We did the safari truck ride and got to feed a giraffe and a rhino too. Really a great time."], ["Reviewed September 16, 2017", 5.0, "Mind blowing experience", "Visited with hopes that it can match some of the safari experience in Cape Town, it does matches up to it.\n\nWas able to see a cheetah run a 100m stretch up close, ride out to the wild where the animals are free to roam around, no doubt being \"enclosed\" in certain areas; watched the gorilla, 7 of them, taking their snacks and being explained by a volunteer there, separated just by the glass with the lions who were resting just behind the glass.\n\nGo on a weekday! It helps as the crowd is not huge and you don't have to wait for the trams and joist just to get a good viewing of the animals. Volunteers are very helpful and full of knowledge as well.\n\nPlease support them as they are a non profit organization, helping to grow the population of many endangered species in the world.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Up Close and Personal", "What a magnificent way to display the animals in a natural environment! Each exhibit shows attention to detail in highlighting education and awareness about animals and their habitat and dangers the animals face. The fruit bat exhibit was particularly great. You able to observe the bats moving and feeding. The zoo educators were knowledgeable and engaging. The tigers were so close I felt like I could touch them! Lunch at The Watering Hole was like being on a safari. We observed animals roaming about while enjoying a delicious meal. The Safai Park is top notch, San Diego!\nShow less"], ["Reviewed September 15, 2017", 5.0, "A Fabulous Day with Exotic Animals", "Mid-September is the perfect time to visit this beautiful venue. Schools are back in session and family vacations are over. It was an unseasonably pleasant day (high 70s) and overcast so all the animals we visited were awake and active. The baby tigers were extremely entertaining, the bat exhibit me of a kind and worth the 30 minutes we watched these unusual mammals. Employees were friendly, knowledgeable and eager to educate us. The conservation efforts of this organization are helping to save many species endangered and some on the edge of extinction. The safari tour tram (part of your admission ticket) was excellent!\nA fabulous way to spend the day!!!\nShow less"], ["Reviewed September 14, 2017", 4.0, "Animals Galore!", "My husband and I chose the 3-1/2 hour Deluxe Caravan Tour which was a bit pricey but worth it for anyone who can afford it. It does not include the entrance fee to the park so together it was approximately $200 for each of us. Our guide was Jeanne and it was obvious that she loved her job and she was very knowledgeable of all the animals and their behaviors. That made the tour even more enjoyable. Of course we loved feeding the giraffes and rhinos and petting the rhinos. You are not allowed to touch the giraffes. There is also a lot more to explore on your own around the park. My only complaint was the cost of the one photo they took of us when we first boarded the caravan. With the cost of the tour I thought it should be free but instead it was $27.00. We decided to pass on the photo since we took so many photos of our own on the trip. Otherwise I would have given an excellent rating for this attraction.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Amazing!", "This is a must for animal lovers! Amazing endangered animals. The giraffes are my personal favorite. We got to see a 3 day old giraffe during this visit. Fun for the whole family!"], ["Reviewed September 13, 2017", 4.0, "Fun day with the family", "Safari park is awesome. Most animals free to roam. Plenty of other attractions to walk through. Kid friendly!"], ["Reviewed September 13, 2017", 5.0, "Make sure you book a caravan safari!", "We spent a great day at the park, but the highlights were definitely the caravan safari where we fed giraffes and rhinos, and the cheetah run. It's worth the money to book a safari for sure, so don't miss out on that experience!"], ["Reviewed September 12, 2017", 5.0, "An amazing experience", "Quite a drive from San Diego but well worth it. Acres of land enabling the animals to live and reproduce in a natural environment which is what your entrance fee is all about, protecting endangered species Lots of 'experiences' to pay extra for but again...More"], ["Reviewed September 11, 2017", 5.0, "Do Safari Park FIRST!!! you won't be disappointed", "We arrive on our last full day in the States after a 5 week road trip 11 States 22 Motels!! we got to the park a little later than we wanted. Oh MY Goodness we should have been there 3 days before hand and then...More"], ["Reviewed September 7, 2017", 3.0, "Too hot to visit in summer", "It is a well planned and well managed park. I think that it is a good environment for the animals. The highlight is seeing the elephants. For my son, the fun activity is to comb the goat. However, the weather is just too hot for...More"], ["Reviewed September 7, 2017", 5.0, "Awesoem", "I went here with my friend and it was great! Many animals to see. Definitely do the team tour! I loved the tigers and the elephants. They have comparatively big exhibit, so they have space to walk around in. There were a couple talks about...More"], ["Reviewed September 6, 2017", 5.0, "Liked this better than the zoo!", "Don't get me wrong, we loved our trip to the zoo. However, we loved the safari park MORE!! When we went to the zoo two days earlier we bought a combo pass so we vpcould go to both. We were fortunate to hit this on...More"], ["Reviewed September 6, 2017", 4.0, "Roar and snore", "My husband and I glamped at the park. We had a great time despite the heat. Tour guides were very helpful and extremely enthusiastic about their jobs. Would suggest it to any animal lover to try at least once."], ["Reviewed September 6, 2017", 5.0, "Like a tour of Africa", "Getting very close to African species, in with birds, butterflies, near the Apes, close to Lions, watching Cheetas run at 70 mph. Going on a guided tour, seeing nearly extinct species. Very good knowledge shared. Not so much a zoo as a refuge for wild...More"], ["Reviewed September 6, 2017", 5.0, "Get a pass and just go for a walk the entire place is beautiful", "This is an amazing facility responcibile for the preservation of endangered animals as well as terrific exhibits. There are wonderful areas to picnic. The toddlers will have fun in the splash area on hot days. The safari park has camp outs that area really, really...More"], ["Reviewed September 6, 2017", 5.0, "DO THE CARAVAN", "We had been here in more than 20 years and wow how things have changed. It was HOT HOT HOT the day we were there, but still they have plenty of cooling areas with water misters and shade. We took our grandkids (10 & 7)...More"], ["Reviewed September 4, 2017", 5.0, "Just one of my favorite places! =)", "I hadn't been for 10 years & it's still wonderful, yes, even much better! The food at the restaurants is great, though expensive, they have beer, bar drinks, ice cream, etc., all the usual theme park stuff. Fantastic shredded BBQ sandwich. Because I know animal...More"], ["Reviewed September 3, 2017", 5.0, "2nd visit for the Ultimate VIP Safari", "This is our second visit and again had the host for the day - Alan who is absolutely outstanding guide on our personalized Safari adventure. The awesome thing is - the money you spend on your VIP Safari goes towards the care health and housing of all the great animals in the collection. Tokari and Chichu (Giraffes) and Mamboo (Elephant) and Johari (Cheetah) and all the animals we saw were awesome and it was great to spend the day with all of them.\nShow less"], ["Reviewed September 3, 2017", 5.0, "We pet and fed a Rhino", "We did the Deluxe safari tour which was very expensive but in the end was worth it. The tour itself was $175 a person and then you also have to pay $52/person to get into the park and then also pay $15 to park. I was mad when I found out I had to fork out another $119 after already paying $350 for the tour but after feeding and petting a 6,000 lb Rhino I didn't care about the cost. The tour was scheduled to have 10 people but only 4 of us showed up which was awesome because we we able to move around in the flatbed truck and take the best pictures possible. The flatbed is covered to keep you from the sun and the tour guide was able to answer pretty much all of our questions. It would be a great tour for the family if you can afford it. They offer a bunch of different tour packages but I believe only the deluxe package allows you to feed and touch some of the animals.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Caravan Safari is amazing", "Visited the Safari Park a couple of weeks ago and did the caravan safari. Our guide (Jeanne) and driver (Barb) were friendly, entertaining and informative. Saw lots of the animals up close and had the chance to feed giraffes and rhinos. The group on our tour were a mix of ages and we all had a brilliant afternoon. If you plan to visit the safari park definitely consider booking this tour.\nShow less"], ["Reviewed September 1, 2017", 2.0, "Very Small and overcharge", "Very Small and overcharge. I have been to many wild animal parks in the world. Very Small and overcharge."], ["Reviewed September 1, 2017", 1.0, "SAFARI PARK Address: 15500 San Pasqual Valley Rd, Escondido, CA", "Entering the park your given a map, Columbus had a easier time finding the new world than find anything from this map. Lucky there were enough rangers to help finding things. Most of exhibits are birds. We took the tram, very hard to make out what the animals were, too far. Tickets cost $52.00 to enter ($15.00 parking) if you want to ride the caravan it was an additional $111.00. per person. Everything to see the animals closer was additional monies. We left after an hour and fifteen minute, a big waste of time and money. GO TO SEA WORLD.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Best Part of our Trip! Zip lining is amazing!!", "We loved the safari park!!! The Highlight was the zip lining. Yes it's pricey but sooooooo worth the experience!!!! The park is beautiful and you can really spend an entire day there. Loved it!!!!!!! FYI: It's not close to the San Diego zoo which people don't always know.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Don't miss the Frequent Flyers Bird Show!", "We were able to spend 4-5 hours here. Most of the walking tours had trees around so was in the shade quite a bit. Our favorite was the Frequent Flyers Bird Show where they had several different birds such as owls and falcons fly right over your head. The tram ride through the enclosures was very informative and you were able to see lots of different animals. The Cheetah Run was good but quite a crowd to see it so might want to arrive early for a good spot at the fence. We ate at the Watering Hole. A little pricey but had an incredible view overlooking several of the enclosures. We purchased Go San Diego passes ahead of time so got a discount as well as didn't have to wait in line at the ticket counter.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Walking Tour", "Very doable for us sixty year olds. Drink and food are pricy but available. Its historic. The sky ride highlights the amazing city."], ["Reviewed August 27, 2017", 5.0, "Plan to Spend the Day", "Our schedule was such that we could only spend a few hours at the safari park. Please don't make the same mistake that we made. This is a remarkable facility that is doing some wonderful work saving endangered animals. To get the most out of your visit, sign up for the optional paid tours and animal encounters. They are expensive but keep in mind the money goes toward supporting the work of animal preservation and the tours will greatly enhance your visit. Keep in mind that, although they are referred to as the 'San Diego Zoo and Safari Park', the zoo and safari park are completely separate facilities that are 30+ miles apart. You can, however, buy a 2 day ticket that can be used for one day at the safari park and the second day at the zoo.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Great Experience", "This was one of the highlights on our SoCal trip. We had the 2-day tickets already purchased (used the other day at the Zoo) and found much, much more could be spent for several of the activities within the park. We were able to get there at opening and found our way back to the free tram ride. This really set us up well for the rest of the day to learn so much about the animals, the park, and how they continue to exist. This is really a wonderful setting to see the animals in a more \"natural\" behavior.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Deluxe tour a must", "Got to pet/feed a think and feed a giraffe with the deluxe tour. Well worth it. Online could not get the two day pass with the deluxe tour, though they fixed that for me at the zoo; yeah to Kristiana and Tonya.\nPlan to spend the day. Such a wonderful experience. Only disappointment was the zebras we're not part of the tour; love those guys.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Nice to animals moving", "The day we went was cloudy and in the low 80s so the animals were much more active then when we visited in the past. We arrived after 10am so still some feeding going on. Staff members were very helpful and friendly. Our 6, 8, 10 year old grandchildren were happy to visit again, they are season ticket holders.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Fantastic day out", "Second visit to the Safari Park, the last being 9 years ago when we were last in San Diego.\nWe all decided we wanted to go back and so glad we did.\nThe park is well laid out and gives the feeling of being out in a remote African country.\nThere is so much to see and do that you need to plan a whole day.\nWe love spending time watching the elephants and gorillas- fascinating to see how they interact together. The elephants in the pool are a joy to watch.\nThe trainer talk for the tigers was also excellent and we enjoyed the bird show.\nThe tram around Africa is great and well\nNaratted and you should also plan to see the cheetah run.\nWould also like to mention the volunteers who can be seen around the park. They are both knowledgeable and friendly and give good insight to the various animals.\nGreat day out and will be certain to visit next time we're in the area.\nShow less"], ["Reviewed August 23, 2017", 5.0, "We booked a tour and the guide, Hannah was superb!", "The San Diego Zoo Safari Park is for just about everyone. Our group ranged in age from 72 down to 2 years of age.\nThey have something for just about level of interest wildlife from Asian and African continents.\nVisitors can walk, or ride from place to pace inside the park. Tours are also available.\nWe chose to take a tour. Shuttles are also made available for no extra fees.\nShow less"], ["Reviewed August 22, 2017", 4.0, "MUST SEE", "You ride around and see so many animals wandering through the well kept and gorgeous grounds! A must see. Went in 2011 or 2012"], ["Reviewed August 19, 2017", 5.0, "Wonderful zoo, great experience", "Wonderful zoo. Very clean with friendly and helpful staff. It is a large park and the encloses even for the animals which do not run \"wild\" are larger than usual which creates a much more life-like experience. The real highlight for us was the safari. We paid extra for one of the safari tours; the guide was excellent - knowledgeable, friendly and entertaining but always professional maintaining the safety of ourselves and the animals - and the experience was amazing. Everyone in particular enjoyed feeding the giraffes; we were also able to see a wildebeest in labor (we heard she gave birth just a few hours after we saw her). We arrived at 11am and felt a bit rushed to see everything before the park closes at 5p, so would recommend arriving as close to opening time as possible. The extra excursions do add up quickly but I'd highly recommend not just the zoo but the safari experience as well.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Amazing", "Granted. This place isn't that cheap, but it it is so worth it. We did the VIP Cheetah Experience as well as the backstage tour with the tigers. Our guide was extremely knowledgeable and friendly. We got to see tigers up close as well as meet some animal ambassadors and feed the okapis. It was worth every penny. We spent pretty much all day there. I'd recommend coming early so you can see as much as possible.\n\nAlso, they offer a priority access pass for visitors who have trouble standing for a long time in line and a shuttle service for those with mobility issues. My husband had a stroke a few years ago and this made the visit a lot easier for us. It's quite accessible for handicapped people.\n\nCan't recommend this place enough! Be prepared to pay for parking though and the typically high cost of concessions.\nShow less"], ["Reviewed August 19, 2017", 5.0, "A full day of joy !", "Get there early for good disabled parking sites. You can buy your tickets 15 minutes before the park opens and use the restrooms without going inside the park. We had one person with mobility issues who rented a scooter with a canopy and was able to enjoy the entire site. Like the Zoo, they also have a Get Easy Access Pass you can pick up at the entrance - you could use to move ahead of any line (ADA). Would recommend getting on an early African Tram ride as the lines get longer as the day goes on. We saw a lot of animals in a setting more like their natural habitat (as compared to the zoo). The Stage next to Thorntree eatery has acts going on every half hour or so. Get there early to get a seat in the shade under the tent. Enjoyed the African Acrobatics show most of all. The Frequent Fliers Bird Show was really entertaining. We most enjoyed Shirley's Cheetah Run and thought the $14 for VIP Cheetah Run viewing was worth the cost. We had some shade from the trees and the Cheetah finished her run right in front of us. We were there all day.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Better than the San Diego Zoo", "This place is awesome! So much to do and see but the best part of it was taking the 30 minute tram ride around the park to see all the animals at a closer view. For additional money, you can take a caravan which is about 2 hours longs and allows you to feed some of the animals close up. The Safari Park feels less like a zoo where the animals seem more in a natural habitat. We also learned a great deal on the tram ride about the animals, their behaviors and more. I highly recommend taking your family if visiting San Diego. There is a lot of walking, but nowhere near as much as the zoo.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Best Zoo Experience-closes at 5pm.", "I really enjoyed my visit. I did not pay for anything extra. Just general admission and parking. Make sure you catch a ride on the Africa Tram ride. Luckily it was the first week of school for the kids in the area so getting around was relatively easy with no crowds. This zoo is very clean, organized and staff are very friendly. It does not feel like someone cut out a chunk of property to build a zoo, rather it feels as if you are stepping into the animals habitat and it is huge. One of my favorite experiences of my San Diego trip. My 8 year old had a great time. It was worth the money.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Roar and Snoar Fun!", "My son (age 7) stayed overnight as a part of the park's \"Roar and Snore,\" and it was awesome!\n\nPROs: Value for the money, dinner and breakfast included in cost, camping right on the animal reserve, great staff, loads of activities\n\nCONs: If you stay more than one night, you have to completely check out the following morning (around 0900) and then re check back in (around 4PM). Also you must purchase park tickets in addition to the cost of \"Roar and Snore.\"\n\nParking Cost: $15.00\n\nCheck In: Around 4pm, and the staff will bring your luggage to your tent -- so make sure to take your camera out of your bag! You also have to pick which walking tour you want to go on -- short, medium, or long. The long walk is about two miles, but it's all on a paved path, which is one my son and I took.\n\nSoon after, you get your first animal interaction. Jayme showed off a Pygmy Falcon, which was pretty cool. After you get to the tent area, your fed dinner.\n\nAfter dinner, you have some time to check out your tent before your hike. On our hike we were able to get very close to the elephants, deer, and even a tiger (naturally in it's exhibit area).\n\nAfter the hike, we got another animal interaction. Then the kids had s'mores, and the adults drinks (cost extra).\n\nAt night you will hear the lions roaring, which is amazing. And the tent next to us had someone snoring, so the camp lived up to its name.\n\nDay 2: Get up early (by 0600) to watch the lions that will still be active. You luggage has to be packed and outside your tent by 0715 -- so we got up at 0545, packed, watched the lions and ate breakfast. From there (around 0745) you get a private tram tour followed by a walking tour before the park is open. The tour ends around 0900 and you have the option to take an extra safari to feed giraffe (you must sign up for this earlier and it is for ages 6+). Cost was $65 per person, but it was awesome to fee to the giraffe from the safari truck. Our safari drive, Paul, was awesome too!\n\nHope this helps!\nShow less"], ["Reviewed August 14, 2017", 2.0, "Zoo charges for entry, parking and many other ativities", "While I understand their admirable mission, they have turned the entire exhibit into a \"carny midwayh experience\" by the way they have vendor stations every fifteen feet selling different items - - like reaching into your pocket for money...sadly it diminishes what should be a pleasure to be there....we attended with 3 grandchildren.\n\nRestrooms were also hard to come by...\nShow less"], ["Reviewed August 14, 2017", 5.0, "Fun", "We had a very wonderful time at the zoo it was absolutely beautiful. The Gardens where wonderful and it was easy to see the animals."], ["Reviewed August 13, 2017", 5.0, "Wonderful way to spend a day away from the beach!!", "I had not been to the park for about 30 years and boy was I ever happy to return!! The entire place is built in a way that you are able to be closer to animals than in most settings without disturbing more than they should be. I brought my niece to show her where I remember as a young child and we both loved it. I did splurge on a behind the scenes tour and I will say without hesitation that you should absolutely do it. We did the cheetah safari and we were close enough to be splashed by a serval playing in the water, touch a live echidna, and hear a cheetah purrrrrrrrrr!!! So absolutely worth every penny to help them with the mission to save so many endangered species. Go and enjoy and get away from the city for the day. Fair warning!! We showed up before the gates opened and had no issues doing everything and seeing lots of activity. If you go towards lunchtime you may catch more sleeping than playing :-)\nShow less"], ["Reviewed August 13, 2017", 5.0, "Outdoor fun for the entire family!", "Honestly, it had been years since we had been to the San Diego Zoo Safari Park. (I still have a mug from when it was the Wild Animal Park, lol)\n\nI'm going to keep this to the bullet points, as I tend to prefer short and to the point reviews myself.\n-There's a lot to do and you can make an entire day of wandering the different parts, seeing the demonstrations/shows, eating and relaxing.\n-It's generally hot and a bit crowded with people, some of which do not have good instinct for \"animal etiquette. However, there are misters, drink kiosks, water misters and a lot of good shade options to help with the heat, and a great staff to help with the animals. :)\n-They have shuttles & buses to help those who are overwhelmed by too much walking, and there are wheelchair friendly paths. However, you will want to plan ahead if you have any challenges being outside walking for hours in the sun.\n-We didn't eat there, so I'm afraid I cannot comment on that. I did like that many of the eateries had great views associated with them.\n-They sell Koala items, but there are no Koalas at the Safari Park, only at the Zoo, closer to downtown San Diego. I'm sure this might be the case with other animals. I find this odd and love Koalas, so I'm mentioning it.\n-GET ON THE AFRICA TRAM and check out the free tour. It is enlightening.\n-We honestly enjoyed everything, especially the upgrades to the Tiger enclosures, making it easier to see them during the day.\n-The only added experience we paid for was the Balloon Safari. LOVED IT. Wouldn't have done it if my father-in-law hadn't offered to pay for it, and I'm truly glad he did. The view was incredible.\n-There are restrooms within decent traveling distance to pretty much everywhere.\n\nI wish I lived a wee bit closer and could afford a membership. I found a few spots to spend time reading and take in nature. Definitely looking into if you do that sort of thing.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Hot Day in the Park!", "Always remember the Safari Park is hot in the summer! Sun block, water, and hats. Exhibits are always first class. Be sure to feed the lorikeets and walk through the Lemur cage. Several play areas for children, including water fountains. Children's petting area. Tram and special tours available. Handicap rides back up the hill available. Summer entertainment. New restaurant and bar called the Watering Hole. Nice break from the crowd and heat. Misters and Savana views.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Great experience", "This was an amazing day trip. Beautiful views, active gorillas and the included tram around the park was great. Downsides were lots and lots of walking to different exhibits. I would take our own drinks next time."], ["Reviewed August 11, 2017", 5.0, "Family Outing.", "I am confined to my wheelchair and dependent on family to take me to visit places such as this. I was a member for many years when it originally opened and often enjoyed it with family and friends before my \"stroke\".\n\nThis was \"a must visit\" always.\n\nWhat a pleasure to go again!!!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Absolutely Wonderful!!!!", "Do not visit the San Diego area without visiting the Safari Park. This non-profit park focuses on conservation and keeping animals out of extinction. Plan to spend the day, plan to walk a lot. I recommend the caravan, which will take you out to the animals on the plains. Restaurants, snack areas, and gift shops are located throughout the park. Plan to make it to the Cheetah Run area by 3:30 to see this incredible animal in action. As I mentioned earlier, this park focuses on conservation. Animal breeding goes on here, so plan to see baby animals. Make sure you take the time to visit the California condors. Animals are very close you in this incredible facility. If you really want to experience the safari park, I also recommend the Roar and Snore area, which will allow you to spend a night in the park. The tents are large and very clean. It is quite a treat to see the animals up close in the morning. The Safari Park is highly recommended.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Baby animals everywhere", "We visited the park when it opened on a Sunday and could get to the front of nearly every exhibit. We saw baby boars, a very young giraffe, an adorable clingy gorilla infant, ducklings, young wildebeest and more. The park was clean, docents were helpful, and our five hours at the park flew by.\nShow less"], ["Reviewed August 9, 2017", 5.0, "the zoo", "beautiful place to visit. friends, family or solo. Short drive from San Diego. Restaurants, snacks and souvenirs."], ["Reviewed August 9, 2017", 5.0, "Loved the Zoo Safari Park", "We visited with teenage kids and younger. Everyone loved this Safari park. Just a great day! Animals roaming is a great feeling."], ["Reviewed August 9, 2017", 5.0, "Conservation", "Be ready to walk miles in this location without knowing it. The animals are more up-close than San Diego zoo, the shows are entertaining, and the environment is vast. While walking around, you can't help but think of all the caring people that are behind the conservation of the animals. It's an eye-opener. Don't forget to eat the soft serve ice-cream twist. It's meant to be shared. This place is a must see.\nShow less"], ["Reviewed August 8, 2017", 5.0, ".Don't miss out!", "An exhilerating experiece for childen young and old! I've been to this park a dozen times over the last three years. It's our \"go to\" place to take the grandchildren. We always have fun, and we always learn something new. While the prices inside are a little high, it's worth it when you learn that the park is a non-profit and all monies go back into the park and the animals.\nWe are now members and get a few perks: free parking ($10 normally), discounts on purchases, and invitations to special events.\nOne of the great things, the park serves alcohol! Nothing like a tall, cold glass of beer after visiting the park!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Gorilla watch!", "This is a fantastic zoo in the wild. Get to the Butterfly exhibit early...lines are long. Don't miss the safari ride through the open area, and especially don't miss the gorilla ezhibit."], ["Reviewed August 7, 2017", 4.0, "Safari", "The safari park is beautiful a little over a 1,000 acres and has quite a variety in species. Very well designed and is friendly to outside food. I think the general admission is worth for a day trip but I think the highlights will be in the other safaris and from the general grasp it seems that the caravan safari is the one to go with but it is over a 100 dollars not including general admission.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Safari Park Tips and Tricks", "Tips and tricks for the Safari Park 2017:\n\nWe went August 2017. Escondido is a LOT warmer than on the beaches. It was hot, hot, hot.\n\nThe park itself it a bit confusing. Lots of trails. We got lost like 10 times.\n\nWe did a Caravan Safari. Totally fun, totally worth it. We got to feed the giraffes (multiple times). It brought the whole thing to life.\n\nPricing was a bit high, but it is what it is.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Great park", "The day started with a 9:30 am Caravan Safari and although it was expensive, it was worth every penny. Not only did I get the chance to see the African and Asian animals up close in their habitat, but I also got to feed the giraffe and pet the rhino. This was definitely the highlight of my stay in SD. I was able to walk through most of the park and most of the animals were out and about. The animals I enjoyed the most were the Condors, Elephants, Lions, Lemurs, Gorilla, Wings of the World, Flamingos, and Hidden Jungle.\nShow less"], ["Reviewed August 3, 2017", 5.0, "A real adventure", "The tram ride is well worth the price just to see the African animals au natural. We enjoyed every corner of it. Be sure to get in early and get to the tram ride before long lines appear. Then see the rest of the park."], ["Reviewed August 2, 2017", 3.0, "A bit overpriced...", "The animals have their own spaces and it truly has a safari feel. We did the safari tour which was okay (we saw giraffes, rhinos, buffalos,...), but way too short and kind of disappointing. The Gorillas were pretty fun to look at and the Tiger spent the whole time just in front of the glass barrier offering us a great look at it. There was a loose deer near the elephants area who approached us and we got to take picture of it. But in my opinion, it is a bit overpriced.. You have to pay a minimum of 80-100$ if you want to spend a full day there (including parking and food).\n\nAlso, the shows there were okay, but not great.\nShow less"]]}}