{"San Francisco Museum of Modern Art (SFMOMA)": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "San Francisco Museum of Modern Art (SFMOMA)", "url": "/Attraction_Review-g60713-d105418-Reviews-San_Francisco_Museum_of_Modern_Art_SFMOMA-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/b5/e6/5a/best-view-of-the-oculus.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1490"}, "address": {"@type": "PostalAddress", "streetAddress": "151 3rd St Enter on Howard or Third Street", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94103-3107", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "great", "we arrived late so unable to visit all floors, but the Bend collection of latin art on main floor worth seeing. They had the Rauschenberg show but I really can say I don't like his work at all. But that's my taste......."], ["Reviewed 4 days ago", 4.0, "Rauschenberg Exhibit", "Worth a look, but if you are not enthralled by modern art, it might not be for you. Also, if you are a MOMA regular, you could be somewhat let down."], ["Reviewed 6 days ago", 4.0, "Beautiful Museum with interesting exhibits", "Loved seeing the Warhols and Lichtensteins. Wouls like to see more! Interesting exhibits and my 3 kids under age 12 were interested and loved the gft shop. We stayed at the St Regis so this was an easy walk right next door! We had ample time to explore before our 2pm cross country flight the day we departed.\nShow less"], ["Reviewed 6 days ago", 5.0, "Put on the bucket list", "Outstanding collections on many floors. Many artist you will recognize. Nice restaurants and gift shops. Put in on your most stop."], ["Reviewed 1 week ago", 4.0, "Contemporary Art Collection Outstanding-New Wing and Interiors Disappointing", "The entrance experience has lost some of its drama in the expanded Museum. Orientation is overly complicated with too many dead end galleries. Elevators very slow; should have been electric traction. People are annoyed when waiting several minutes to move between floors. Gift shop at street level is well worth walking through with no entry fees. New specialty restaurant at street level pricey and not as inviting as the former cafeteria. Special exhibitions excellent.\nShow less"], ["Reviewed 1 week ago", 5.0, "One visit is not enough!", "After long renovation period, San Francisco Museum of Modern Art (SFMOMA) is one of the best museums of modern art in the States. Beautiful building, interesting exhibitions and cool museum store. You need at least a few hours to visit all the floors and I highly recommend visiting this place more than once. It's a paradise for modern art enthusiasts. There are permanent pieces in their collection, as well as new expanding collections. The last floor was closed during my visit, which was a bit disappointing, but they need time to arrange a new exhibition. Another reason to visit SFMOMA at least a few times. Every visit is a new adventure!\nShow less"], ["Reviewed 1 week ago", 5.0, "Always a wonderful new exhibition to see!", "I managed to get to the museum before the Rauschenberg exhibit closed. It's an exquisite exhibition that really shows who this man was ie., a force of creative nature. He worked in so many media: painting, found objects, set design, photography, you name it. By the way, there is always a fabulous photography exhibit. I try to get to the museum every few months. Tip: great restaurants there. And book store.\nShow less"], ["Reviewed 1 week ago", 4.0, "My Favorite of San Francisco's Museums", "I've been visiting the SFMoMA as far back as when it used to be at the War Memorial Theater and later to its new incarnation in the 1990s on 3rd Street and its even newer expansion in 2016. I love it most for its permanent collection with works from Frida Kahlo, Diego Rivera, Roy Lichtenstein, Gerhard Richter, Andy Warhol, Jasper Johns, Josef Albers, Alexander Calder, Robert Indiana and so many more iconic paintings and photographs and sculptures. I'll keep going back because I think it's the one most vibrant and relevant art scenes, and there aren't enough hours in a day to take it all in.\nShow less"], ["Reviewed 1 week ago", 4.0, "Strong Collection of Modern Art", "This is a well-designed building with a small permanent collection and several floors of rotating collections of modern art. The real strengths are in the special exhibits. There are several seemingly fine cafes throughout the museum. Avoid the floor-level \"exhibit-cafe\" in situ. It's a poor excuse for either an exhibit or restaurant.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful", "We only had a couple of hours, so focused only on two floors - 2 and 5. We had a few wow moments! Great collection, carefully curated and displayed, and with just enough detailed information to help us understand some background on the pieces and artists. Kids were free, which is a great sign that a gallery values its community. Their favorite part was the sculpture on floor 1. Loved our visit, look forward to going back and seeing more.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Good but a bit disappointing as 2 exhibitions were closed", "It was nice but it was a bit disappointing as 2 exhibitions were closed. We actually came to see photography floor which was closed completely. The rest was very good. 2nd floor has good collections. Museum has good presentation of American artists."], ["Reviewed 2 weeks ago", 5.0, "Worth the visit", "The MOMA for us did not get the must visit it deserves .. it is definitely worth a visit\nWe are not great modern art lovers but it’s educational and challenging\nIt’s close to town and a easy walk from union square\nThe art is as expected a good combination of new and modern and its set out in a very good way .. there is also a good cafe shop !!!\nThe audio device is worth getting for 6 $ as some of the art definitely needs a bit of explanation to appreciate\nWell worth the visit .. we took 90 mins\nShow less"], ["Reviewed 3 weeks ago", 5.0, "needs more than one visit!", "We went in for the Rauchenberg, but there was soo much more! The cafe is a piece of art too, and we always check out how the livng wall is progressing!"], ["Reviewed 3 weeks ago", 5.0, "Splendid imagination", "Sometimes architecture is important. Architecture as Museum is beginning something as Art in itself. Famous architect designing Museum and you see the results. San Francisco could not stand behind.\n\nIt is not only the building, but the concept of Museum is amazing especially as Museum of Modern Art. I started at the first floor but it was little bit annoying for European artist I can see everywhere in Europe.\n\nSo I started looking for American artists an artist who lived in the USA with emphasis on those from the West Coast. then the visit became exiting.\n\nAndy Warhole, Roy Lichtenstein, Robert Rauschenberg but also \"Europeans\" as Mopndriaan, Willem de Kooning and the couple Frida Kahlo and Diego Riviera.\n\nTake your time and take it easy.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Not a fan of modern/contemporary art, but this museum is a hit.", "We spend a lovely afternoon with the whole family in the museum, there's enough exhibitions to keep you busy for hours, some of them are just contemplative some are hands-on. We are all adults, it may not be suitable to keep small kids entertained for long though.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lovely modern art museum", "Simply a great place to see some stellar modern work, with sound, electricity, and some very cool exhibits around the tech of our age. There are seven levels and it's good thing they ask you to start on level 7 with the sound exhibits. Then you can enjoy your way down through all the displays down. I spent about 4 hours here and couldn't see all of the museum's work.\nGet there early or buy a ticket online to skip the lines. The museum store t ground level has some nice science toys for kids.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great Collections of Modern and Contemporary Art", "This was our first visit since the new building was completed. The premises were expanded to accommodate the spectacular Fisher collection, the museum's own expanding collection and for exhibition space. We believe the completed building project to be an unqualified success and the airy galleries add to the delight of viewing the important works on display. We spent two days at the museum rather than the one we had planned. Additionally, there are three separate areas to eat, a good coffee/tea bar, a world class cafe (where we enjoyed two lunches) and a fine dining restaurant which we did not have the opportunity to sample. Aside from the art and the dining we appreciated a free group tour of one of the temporary exhibits led by a knowledgeable guide. Finally the gift shop offers many unique items as well as lots of interesting books about art.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Excellent Museum in the Heart of the City", "An excellent museum, very convenient to visit. Wish we had more time to explore the extensive collection and special exhibitions! Especially enjoyed the Robert Rauschenberg retrospective!"], ["Reviewed 4 weeks ago", 5.0, "Wow", "This was my first visit there since they completed their major renovation. It's much, much bigger than it used to be. The building itself is a work of art. Many beautiful spaces to just sit and linger both indoors and out. Highly recommend it."], ["Reviewed January 24, 2018", 5.0, "Vision", "I love to always visit a Museum on the Big City’s and this time it was the time for SF MoMa is amazing all the Vision that this modern artist have. From the gigantic Spiders to the relaxing sound creat by porcelain pots; from the upside down drum to a one color paint; is really a nice experience; don’t forget and always open tour eyes to ART\nShow less"], ["Reviewed January 22, 2018", 5.0, "Everyone needs a bit of LOVE", "What is art? Although some of the works shown at the SFMOMA may make you question the concept, they are all accessible and well curated. The museum itself is beautiful from both the inside and out. A visit outdoors to the various outdoor sculpture areas is a must. Best is that the museum participates in reciprocal relationships with museums from around the country, making it accessible to visitors who might otherwise question the steep price tag.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Excellent Museum - something for everyone", "Nice collection here. Even if you are not a fan of modern art, there are exhibits here that you might find interesting."], ["Reviewed January 22, 2018", 3.0, "austere modern art format", "Nothing very notable given the dominance of this museum in the SF art scene - Legion of Honor Museum was more interesting. It seemed cold and the security very prominent. The visiting exhibits will, of course, make or break the visit. We were not impressed with what was on offer, but others might be and they change. There is a nice permanent collection.\nWe compared it less favorably to the Broad in Los Angeles.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Amazing museum", "The museum of Modern Art is spacious, pleasant and well curated. My kids (11 and 9 years old) enjoyed it as well as my husband and I. We spent about 5 hours there, each floor has different exhibits - photos, works of art, music and sounds.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Just gorgeous", "The building itself is art. There are 7 floors including outdoor spaces. Many different types of art on display. The music installations on the top floor were just breathtaking and so innovative. So glad I stopped by."], ["Reviewed January 21, 2018", 5.0, "First rate museum; a tourist must", "SFMOMA, since its added galleries, thanks to the Fisher family, sports some of the best contemporary and modern art in the country. Both the Fisher collection plus all the other art and significant exhibitions are a must for anyone interested in this art. Vistors to San Francisco should put this on top of their list. Note that you can't use someone else's museum card because they check ID when you go to the ticket counter. Shop is excellent with books, jewelry and other great objects. Good restaurant in the museum. Beautiful views of the city while walking around the galleries. Parking is easy and within a block of the museum.\nShow less"], ["Reviewed January 21, 2018", 3.0, "An Average Experience", "The title is actually an overstatement, perhaps because I've been to too many great museums around the world. It has some nice pieces in the collection; so it's more a matter of how you present them. We went to see the Walker Evans show in particular. The ticket agent told us it'd take two visits to see the whole exhibition. The 2-hour experience of actually seeing it was underwhelming, in part due to how it was curated. There's definitely room for improvement.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Open until 9:00 pm on Thursdays!", "Great museum, manageable to navigate and really fun! Walker Evans was the featured artist while we were there! Very cool!"], ["Reviewed January 17, 2018", 4.0, "Three hours", "Put a little culture in your life. Seven floors of fun to open the mind and heart. Its a nice way to see what happening and people what. The free tours are every interesting."], ["Reviewed January 16, 2018", 5.0, "One of the best modern art museums in the US", "The title says it all; worth the visit if you have even a passing interest in modern art.\nIf you are a member of one of the modern art related museums in the US ask about free entry based on reciprocal relations (there are two museum networks).\nShow less"], ["Reviewed January 14, 2018", 5.0, "Make sure you see Chuck Close and Andt Warhol exhibits", "Personally I prefer the MoMA in New York but the Chuck Close mosaic like portraits are mind blowing - view them from a distance and then gradually walk closer and closer to see how the portrait is built up from abstract circles and shapes separately coloured which transform in to a near perfect likeness of whomever he has painted.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Great but expensive", "Really enjoyed my time here but the tickets were pricey. They had famous artist's work there and some interactive exhibits."], ["Reviewed January 10, 2018", 4.0, "Interesting new exhibits", "Not our first visit, and most likely not our last...\nWe are quite familiar with MOMA's collection, so it is easy to quickly go to the new exhibits and spend time viewing only those. The museum is big and has so much to see that it is not surprising when some reviewers express being overwhelmed. Best advice would be to spend no more than 2 hours, and to plan which exhibits are most interesting. We love coming here!\nShow less"], ["Reviewed January 9, 2018", 3.0, "It was okay...", "Somehow this was not nearly as exciting as MOMA in NY and a couple of hours there was more than enough. I would not visit again unless there was a particularly interesting display coming to town."], ["Reviewed January 9, 2018", 5.0, "Modern Bliss", "The majority of the art is quite modern, clearly true to the name San Francisco Museum of MODERN art. I love walking through this museum and getting lost for hours. The structure of the building is beautiful, meditative and relatively newly renovated. Each floor has a brilliant collection of photography and modern art as well as interactive displays.\n\nOne of my favorite parts of the museum is the very top with a noise instrument type display with video art on all three walls. I can't recall the name of it but if you are there in the next few months, please visit and make it to the top.\n\nThe museum alternates exhibitions often, but every time I visit, about once per year; I am pleasantly surprised at the quality of work and precision in the display. Highly recommend.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Wonderful exhibits", "A visit to this museum could easily fill a day. After lunch elsewhere with friends we arrived about 1pm and headed to the 5th floor to work our way down. We took our time on each floor and were not able to see all the exhibits. I enjoyed walking outside and viewing the City from atop. I am more of a traditionalist when it comes to art, but this museum was fun to visit with so many different forms of visualization and sounds. It truly amazed me to think of how much work goes in to changing out the art for new exhibits. I would visit again and allow more time.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Arts", "SF Moma gets interesting every floor. You can go up to the fifth floor down to the first or go the other way around. So much art to see and appreciate!"], ["Reviewed January 3, 2018", 5.0, "A lot of modern arts", "The only thing I don't like is expensive parking fee. But it's SF, so I shouldn't complain much. Public transit is always a viable option too. You can easily spend half a day or a full day at SFMOMA."], ["Reviewed January 3, 2018", 3.0, "A bit pricey but worth visiting", "Place was packed on a Saturday afternoon. Not too much modern art but some exhibits were interesting. I especially loved ‘the visitors’."], ["Reviewed January 2, 2018", 5.0, "So much to see!", "We spent the day at the museum and were able to experience all seven floors. The art was diverse and interesting."], ["Reviewed January 2, 2018", 2.0, "Overpriced, not family friendly, not worth it", "I was very excited to check out the MOMA after its recent renovation. I was underwhelmed. For starters, I was hoping to spend some time on my own wandering around the museum, but when I called, they were unapologetic about being unable to offer anywhere to pump. Thankfully, I was able to drag the entire family so that I could go (and breastfeed when needed).\n\nWhen we walked in, the temperature was suffocating. I don't know if they were trying to compensate for the cold outside, but it was horrible. The lines to get tickets, even in the membership line, were also long and slow.\n\nA couple of the exhibits themselves were interesting, but I thought it was lame that they are rotating political posters in phases (please, come spend more money so you can see the other ones!). Most of the exhibits were just OK, and none were really interactive. Needless to say, this is NOT a kid-friendly museum.\n\nFinally, the cafe was absurdly overpriced. For $15, the least you can do is add a little salad to the small and sparse sandwich. And my daughter's meal was about a half a teaspoon each of peanut butter and jelly on 2 Hawaiian rolls. For $7.50. I spent more here for less food than I have ever spent at any museum or zoo, and we were all still hungry!\n\nThere are so many great museums in SF. I'll go to them.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Wide Variety of Exhibits", "This museum occupies seven floors with a many different exhibits on each one. The second floor is a photography exhibit with photos from around the world dating back over a hundred years. It was great learning the evolution of photography. Other floors had paintings of all types. One are had pictures of people. When you got close, you could see that the pictures were composed of many small shapes. There was a musical floor where there were musical contraptions that were fascinating to watch and listen to. We were entranced by the exhibit on the top floor that had a round pool of water that had many bowls of different size. The water had jets that caused the water to move. This caused the bowls to gently bang into each other creating a relaxing melody. We spent most of the day there and could have stayed longer if time permitted.\nShow less"], ["Reviewed December 31, 2017", 2.0, "If you really like AMERICAN modern art, so it is ok...", "The place carries 95% of AMERICAN modern art. They advertise having Diego Rivera, Frida Kahlo (for her popularity), Max Ernst and Matisse just to attract people and have the courage of displaying them side by side with less important american ones.\nI am not saying it is bad but miles back if you compare with Pompidou, Tate or NY MOMA although they might have spent a similar amount of money.\nShow less"], ["Reviewed December 31, 2017", 4.0, "interesting space", "great foyer, but the lighting sent me running out of the museum after @45 min. due to feeling dizzy. The guards are not helpful, they did not know not could understand when I asked several where I could find well known several SF artists' works in the museum like David Parks and Richard Diebenkorn. The collection is worth seeing if you are not light sensitive. The gift shop looked fabulous, but I couldn't stay and shop, needing fresh air. Elevators are available but there's a gorgeous staircase.\nShow less"], ["Reviewed December 31, 2017", 5.0, "World class!", "So we went on a Thursday night and discovered the SFMOMA on our first night in San Francisco during a one week vacation. My wife and I are modern art enthusiasts and we were not let down by this amazing place. San Franciscans have a lot to be proud of, but this museum is exceptional. Having experienced many wonderful modern art collections around the world my wife and I agree that SFMOMA is world class, and has a great app with interesting and well produced audio tour... must see!\nShow less"], ["Reviewed December 30, 2017", 4.0, "Great variety and plenty to see", "Large and thoughtfully curated collection of modern art. Some interesting exhibits on my recent trip that included a sound theme running through various exhibitions.\nThe store is fun and the restaurant In Situ is a highlight. They \"curate\" their menu from famous restaurants and chefs around the world.\nIf you want to see everything you should invest at least 3 hours.\nShow less"], ["Reviewed December 30, 2017", 5.0, "fun, fascinating, provocative", "We had a great time exploring this museum today! (It helped that instead of paying the $25 adult admission price, we had free tickets.) We explored all of it, enjoyed much of it, and especially appreciated the soundscape exhibits. There's so much mindfood in here!"], ["Reviewed December 27, 2017", 5.0, "Fabulous Collection", "This place is huge and the building itself is so interesting. I only had a few hours and you really need more and multiple visits to do it justice, Although at $25 a visit, that may not be practical. There is a huge variety of styles and genres exhibited here; from quite early modern art including impressionists and people like Braque, Picasso, Klee, Mondrian up to brand new installation art. At present on the 7th floor there is a remarkable exhibition which focuses on sound made by art objects. My favourite is a large pool on which are randomly floating plain white china bowls of varying sizes. They clinking and tinkling as they lazily make their various ways through shallow blue pond. It is aurally and visually calming. Lovely.There is a coat check on the ground floor and it may pay to leave your bag as the gallery insists that bags are carried to the front of you so you don't bang into anyone or anything - it's a pain. On the upside - you are welcome to take non flash photos.\nShow less"], ["Reviewed December 26, 2017", 3.0, "Good varied Collection", "I rated average because didn't feel it was \"Very good\" but it is good. Interesting varied works but quite expensive. I wouldn't go out of my way to visit as a tourist."], ["Reviewed December 22, 2017", 4.0, "Variety of exhibitions", "I suppose it is inevitable that the display of the early modern period is limited. There are only so many works to go round! The Museum had a number of special exhibitions which were well explained. These included experiments with sound, and an exhibition of photography. There was a lot of very modern art and sculpture. I was disappointed in the Californian art, perhaps I expected indigenous work to be shown.\nThe other essentials of an art museum, clean toilets and good coffee bars were there in plenty. The cost of entry is $25 with a small discount for seniors.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Interestingly different exhibits.", "We have been to various modern art museums in different cities and this one didn't disappoint. Thee special exhibitions showed works which I hadn't seen beforehand. Alexander Calder's sculptures were one of our favourites. As was Robert Rauschenberg's, Erasing the Rules. However, for something totally different, Soundtracks needs to be experienced. This was an exhibition of sound sculpture which stirred all your senses. It culminated in a Meditative pool with sound producing ceramic bowls. Fascinating! A recommended visit.\nShow less"], ["Reviewed December 21, 2017", 5.0, "More than a gift store", "More than just a gift shop. The Museum Store offers all the usual trinkets you expect to find in a gift shop but it doesn't stop there. Its a mini book store, with books about the artists you see in the museum, as well as books on architecture, color, shapes, and more. Boutique like jewelry is showcased. Along with the usual T-shirts and sweatshirts with the museum logo are high-end designer scarves . But I was most impressed by the tech wall. Something for every techie on this wall. I'm not a techie so I wouldn't do it justice, you'll have to see it for yourself. So even if you don't have time for the museum, take time to see its store. You won't be disappointed.\nShow less"], ["Reviewed December 21, 2017", 2.0, "My definition of art", "If I can do it, it’s not art. I know my own limits and it seems a reasonable definition to me. If you disagree, you can quit reading now because my review won’t be helpful. When I walk into a gallery and see two orange squares, that’s not art. A white canvas lined like graph paper, not art. A circle cut in half and mounted at an angle... you get the idea. There were pieces that showed skill-I could not have painted them. But they were almost uniformly dark and depressing. Sorry, but that was $25 and two hours wasted.\nShow less"], ["Reviewed December 21, 2017", 5.0, "MOMA will mesmerize you", "Sometimes I find that a day at the museum seems too long. When we visited MOMA however, the various galleries were distinctly different and on each floor and around each corner you run into something interesting. From sounds to sights, you will not want to miss SFMOMA while in San Franicisco.\nShow less"], ["Reviewed December 21, 2017", 5.0, "A Day at SFMOMA", "This was my first time, as i believe when i was last in SF they were still working on completing this museum. It is a very cool museum. There are six floor so we started at the top and worked our way down. I will probably need to go back so i can take my time and really enjoy each floor. Their gift shop is amazing. I love museum gift shops.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Fabulous museum!", "This is a really great museum. It recently underwent renovations, and they did a beautiful job.\n\nWe saw a wonderful photo exhibit chronicling the career of Walker Evans. It was a huge show spanning a lifetime in photography, and a huge body of work.\n\nI plan to make SFMOMA a regular stop on all of my future trips to San Francisco.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Not Really Into Modern Art...But This Place Is Amazing", "Loved SFMOMA. My family had a couple hours to blow on a Sunday afternoon so we decided to check out the MOMA. I am not a fan of modern art but this museum kept us inspired room to room. My kids 12 and 17 also loved the museum.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Fantastic museum", "Great place to view the modern and the old art exhibits- loved the show on the top floor - a jugalbandhi of music all done one sunset on the Hudson river- a great finale to a great day at the SFMOMO"], ["Reviewed December 14, 2017", 4.0, "Time and Money Commitment", "This museum is impressive but overwhelming. Too much to see in one visit and for the admission price it’s hard to not feel pressured to see as much as possible. Incredible collection."], ["Reviewed December 11, 2017", 5.0, "A guitarist can accompany your art viewing", "This museum has great modern art - Andy Warhol, Matisse, Robert Indiana, etc. But they had something I haven't seen at other museums - a guitarist can walk around with you playing music for you while you view the art. Very cool!"], ["Reviewed December 6, 2017", 5.0, "Nothing but Modern Art", "You like urinals as art this place might just be for you. Loads of modern and contemporary art. The cafe on the 5h floor is great, the restaurant on the 1st floor is almost absurd as the art. (over priced as well)"], ["Reviewed December 4, 2017", 5.0, "Incredible!", "We started in the gift store, which was really fun. It's the best museum store, and I have visited many. We then went to lunch on the 5th floor\nwhere my friend had peanut noodle salad and I had the grilled salmon. Both were about $16 and melted in your mouth. We then enjoyed the Walker Evans and Rauschenberg exhibitions which were amaaaazing. It was a lot to take in but worth the time and money.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Amazing", "A very interesting Walker Evans exhibit followed by some Lichtenstein and Warhol. A beautiful building, interesting store and a must do."], ["Reviewed December 3, 2017", 5.0, "one of the great museum experiences", "Following a three-year closure and an expansive (and expensive) enlargement and restoration, SFMOMA reopened in 2016 as the country’s largest modern art museum, exceeding even New York’s MOMA. The museum collection includes top-notch examples in every field of contemporary art; the seven floors can be quite daunting, so it’s best to do a little homework and focus on one or two areas of interest. The temporary exhibitions (which at the time of writing include world-class retrospectives of Walker Evans and Robert Rauschenberg) set a gold standard in comprehensiveness. Best of all, the museum’s top floor is devoted to large-scale installations, at which SFMOMA has always excelled. Whatever your interests, it’s worth starting there for a glimpse at some of the most innovative art on display anywhere.\nShow less"], ["Reviewed December 1, 2017", 4.0, "❤️Soundtracks exhibit!", "Nice museum. Smaller than I expected. Soundtracks exhibit on the 7th floor was definitely my favorite! Check it out before it ends!"], ["Reviewed December 1, 2017", 5.0, "Sound and Vision", "I wish we’d been able to spend more time here but what we saw was brilliant. The soundtracks exhibition was particularly inspiring although I was sad I couldn’t work out where the Brian Eno exhibit was. No matter, so much else to see and to listen to. And the view of the city from the balcony is rather breathtaking too, a real work of art in itself.\nShow less"], ["Reviewed November 28, 2017", 5.0, "IMPRESSIVE", "SF MOMA offers a comprehensive collection of modern art in a beautifull and functional building. The Rauschenburg exhibition was the feature when we visited. The museum devotes space to all aspects of art including painting, architecture, film/video, sculpture, and photography. A must see."], ["Reviewed November 27, 2017", 5.0, "Great learning experience", "I’ll admit there’s more I don’t understand about modern art than what I do. I enjoyed my experience at MoMA and learned a lot. Definitely worth the time."], ["Reviewed November 26, 2017", 4.0, "GF snacks", "Love art. Liked the museum. You could honestly do this in a few hours or stretch it out and take a few days. I’d recommend as many guided tours as you can stand. (I usually move at a faster tempo than most so I could only do so many)\n\nIf you GF like me, eat before hand. I stopped into the cafe for a snack and a cappuccino. Cappuccino was good but over priced for the amount you get and the only GF snake they offer is a chocolate cake. The cake for being GF was good, kinda tastes like pudding. A bit too rich to eat the whole thing.\nShow less"], ["Reviewed November 26, 2017", 4.0, "Really enjoyed the Walker Evans photography exhibit as well as Ragnar Kjartansson, The Visitors, 2012; music installment", "Both of the special exhibits we saw were fantastic. Wish we had had more time. The Visitors was such a different kind of installation. Taking 8 different artists each playing their instruments in a different room of the mansion yet all playing in sync was not only interesting and a clever idea, but it was engaging and made you want to move around and watch each of the individual artists over and over again. Highly recommend.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Great place for lunch", "Lunch at the Moma was great and comfortable. Great menu and fun atmosphere. Quick service and organized set up."], ["Reviewed November 24, 2017", 4.0, "Such an interesting place!", "I visited alone while my spouse was at a convention next door. I found the main floor and the 7th floor were my favourites! There were so many interesting things to see and interpretations."], ["Reviewed November 22, 2017", 5.0, "SF MOMA was worth the trip", "We only stay at museums and art galleries for an hour or two (as my head gets full), but the SF MOMA visit was different. Everyone was so helpful, the art was wonderful and the special exhibits were spectacular - we stayed for hours!"], ["Reviewed November 19, 2017", 5.0, "Had to see the renovated bulding", "I have been to this museum several times, but this is the first time I have been since the building reopened after remodeling. They did a beautiful job and there is so much more space for things. For some odd reason, a lot of the permanent collection is now hidden away on the second floor -you have to actively search it out. Louise Bourgeois' Spider sculptures have a stunning new room - don’t miss the oculus bridge. Also, don’t miss the giant Richard Serra sculpture accessed from stairs on the second floor. Lots to see.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Excellent Musem showcasing high quality Modern Art", "For the Bay Area, the SF MOMA matches the brilliance of Silicon Valley with an incredible display of art reflecting the times we live and presenting the most exiting modern artists."], ["Reviewed November 19, 2017", 5.0, "Awesome collection of modern art from around the world and across time periods.", "Don't miss the Paul Klee Gallery, with its many Matisse works, and the German Art after 1960 Gallery (a lot of impressive Kiefer, Richter and Polke works). And there is always a wonderful special exhibition."], ["Reviewed November 18, 2017", 5.0, "Fantastic MOMA", "I love checking out art museums in the cities I visit. Being an old deadhead I’ve done quite a bit of traveling over the past few decades following that band and every chance I get I check out the art museums in whatever city I’m in. This MOMA truly lives up to its name. It’s pretty strictly modern art and it’s collection is fabulous. Well represented contemporary collection with the greats of modern art Warhol, Calder, Lichtenstein, Still. And many other lesser known but equally talented artists. The floor space is open and airy. The building itself has multiple floors and each floor has top quality representation of the artists in their collection. Not only did I like it my teenage daughter did as well and that was a surprise. In fact she ended up doing all the floors which totally shocked me. The outdoor sculpture gardens were great. Nice place to get a little air and sit down to rest. There is an elevator but it’s slow and the stairs may be a bit arduous for some people. It’s probably better to try to do this museum over two days but often that’s not practical. There’s a small cafe area for coffee. And best of all the gift shop is out of this world. We bought so much we had to have it shipped back home! But awesome stuff which you don’t see in every gift shop and believe me I’m a gift shop girl. I know my gift shops. If you’re in San Fran and you are an art lover this place is a must. If you want to find artsy or unique gifts just stop in the shop. You won’t be disappointed. World class all the way.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Excellent temporary exhibitions", "Very good museum with modern pieces from different decades. Excellent temporary exhibition on 7th floor dedicated to the connections between sound and the world we leave in. Innovative outside tour to experience the sound of electromagnetic waves in SF."], ["Reviewed November 15, 2017", 5.0, "Modern Art classics", "I had a brief time to explore the museum, and the woman who sold me my ticket gave me a quick overview of the highlights. With her suggestions I saw much of 4 out of the 7 floors and whetted my appetite for a longer exploration in the future.\n\nAlong with iconic modern art pieces like Robert Indiana's LOVE, Warhol's Marilyn Monroe graphics, Calder's mobiles, Diego Rivera's and Frida Kahlo's paintings, I was excited to be introduced to many new and international modern artists, and to re-examine Matisse's paintings through a modern art perspective.\nShow less"], ["Reviewed November 15, 2017", 5.0, "SF MoMA - wow!", "Not a huge “modern art” fan but this was a total Wow! Enjoyed the paintings. Enjoyed the sculptures. Highlight was top floor audio/video exhibit of musical performance. Highly recommend."], ["Reviewed November 14, 2017", 5.0, "Beautiful museum", "It was a rainy day in San Fran and this made for a great way to go inside and enjoy a couple hours. The best exhibit was on the 7th floor an involved music and video - amazing."], ["Reviewed November 13, 2017", 5.0, "Oculus Bridge Takes the Best of Show", "After visiting SFMOMA today I did a Google Search for Oculus Bridge listed on their map of the 5th floor. It led me to a photo with the following caption: Photo: “Best view of the oculus with the bridge suspended under it. Taken from lobby. Best musuem feature”\n\nI felt vidicated because as I waited for my wife on the ground floor I looked up and saw it. It was a living Escher whose posters I had on my walls in college. I said to myself \"this is probably the best thing I'm going to see all day\". I was right. Sure there is some cool stuff there but how many people don't stop in the lobby and look up? Give it some time for some people to wander on the bridge to nowhere, suspended 5 stories above the ground floor (it's a long way down) From below the people appear to be walking in up, down, and sideways, like an Escher. As the caption says \"Best museum feature\"!!!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great museum", "I visited in August 2017\n\nEven if you are not into modern art, this place is great, and there is something for everybody! Definitely visit every floor. Undiscovered gems abound! Well worth the price for the entry. The café is great too, and well priced, in stark contrast to that at the Legion of Honor.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Worth the Cost", "The SFMOMA has a lots to offer. Really interesting installations and right now a audio playscape exhibition that kept us in a single room for at least 15 minutes. Walker Evans is there now, but they’ve got highlights like Warhol, Lichtenstein, and plenty of abstract art to have you thinking for hours.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Beautiful, challenging and thought provoking (the art, that is)", "I enjoyed my time at MOMA. Okay I went on a Monday morning so it probably wasn't at its busiest but I enjoyed the quite spaces and the atmosphere.\n\nThe building itself is a piece of art in itself although to a first time visitor it's not the most straightforward to get around. Each floor is not too large though so there's no chance of getting lost.\n\nThe main disappointment about this museum is that, unlike galleries in many cities around the world, you have to pay to enter. I could probably go an about art being free to everyone regardless of their background and wealth, but that's probably one for politicians and not the people who run SFMOMA. What the trustees do get to control however are free cloakrooms and the ability to take photographs. Thanks!\n\nThe exhibitions are of a decent size and there is a good mixture of installations and wall art. I loved some of the individual spaces. For instance there were several Agnes Martin pieces showing in a hexagonal room, all surrounding an hexagonal couch for one to sit and contemplate. The peacefulness of this space suited the art beautifully to me. Her particular designs in that particular space added up to the feeling of having been in a math lesson.\n\nIf you like art, you don't need to be told this is a must visit location. But even if you only have a passing interest this is a great escape from a bustling city. You will find something to like here.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A Day of Bliss", "This museum has 7 floors of artwork. Each floor has a different focus. The exhibits are beautifully displayed. The museum has an outdoor statue gallery off the cafeteria that had a nice selection of foods and coffee. I spent the day here by myself while I waited for my son to leave work- great place for alone time.\nShow less"], ["Reviewed November 9, 2017", 5.0, "More Marvelous Time At SF MOMA", "The new SF MOMA rocks! As a local I'm a member visiting monthly on my own or entertaining clients at an exhibit. I like to start on top floor and work our way down stopping at the Cafe/Sculpture Garden for a great glass (yes in a real glass not plastic!) of wine or champagne. The garden is awesome and if chilled in our famous SF fog, sitting inside is just as nice Then we can continue on our journey ending up at the cool museum store in Lobby. Go slowly and you'll probably pick up an inexpensive very cool gizmo that wasn't on your bucket list but you'll smile when you get it home.\nShow less"], ["Reviewed November 9, 2017", 5.0, "MOMA ON MONDAYS", "One of the rare Museums opinion Mondays, this temple to generosity houses well-know, innovative and provocative works, plus hosts special exhibits, lectures and films."], ["Reviewed November 9, 2017", 5.0, "Really interesting and loved the Walker Evans exhibition", "I managed to spent a good 5 hours here soaking up the works, avoiding others and having an amazing lunch! The soundtracks exhibition on the 7th floor was very mixed for me. Loved some it, but the electrostatic works literally got on my nerves. I couldn't tolerate the feel of the room - os certainly got a reaction. I thought the Walker Evans exhibition would be a quick walk through, probably too American for an outsider but I was so wrong. It drew me in. His candid shots of people on the city streets and the images of extreme poverty were captivating and moved me. We used the app for the audio tour and the one for how to look at a photograph was so effective at opening my eyes. I loved it.\nThere are iconic works from iconic artists of the 20thC. My other major highlight was the lunch at In Situ. The food was amazing and the service was excellent and informed too. apologies for all the superlatives but I would be back at SFMoMA tomorrow if I could!\nShow less"], ["Reviewed November 8, 2017", 4.0, "Modern Art Museum", "Newly expanded museum that recently opened. Excellent docent explaining the artworks. Seems like there was a lot of wasted space. Had a variety of modern art pieces and was easily displayed. Not busy for a weekend visit. Parking in nearby lot"], ["Reviewed November 8, 2017", 4.0, "Very interesting", "Very interesting Museum about modern art in San francisco, you can find many kind of pictures and sculptures along five o six floors."], ["Reviewed November 8, 2017", 4.0, "easily worth an hour or two", "Elegant building, just off market street. Good displays of American Art (with some of the Gothic we wanted). Special exhibition of Munch - really great. We hickjacked ourselves onto a guided talk, and naughtily because she realised we knew about him, she focussed rather on us!) Queue controller was delighted at my faultering Norwegian.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Really enjoyed my visit!", "I had not been since it reopened after a redo and really enjoyed my visit! Spent about 3 hours here beginning at the top floor and working my way down. Stopped in for a coffee at the café. Enjoyed all of the exhibits especially the floating bowls exhibit. My favorite!\nShow less"], ["Reviewed November 3, 2017", 5.0, "Inspiring place", "This museum is an inspiring and lovely place to spend your time! It may be smaller than other museums of modern art, but the exhibitions are of great quality and the building as such is so airy and modern. The outside gardens offer great views as well. My favorite place was the 7th floor. The museum stores are huge.\nShow less"], ["Reviewed November 1, 2017", 5.0, "World class", "Dont miss this museum. World class in both the permanente exposition and the exhibitions. Love the museum store. Free wifi."], ["Reviewed November 1, 2017", 5.0, "wonderful museum with world class art", "loved this museum, the exhibits were amazing...masters and other artists Multi media film and the walking tour on their app was easy to use and was extremely informative"], ["Reviewed November 1, 2017", 5.0, "Sountracks Exhibit is a MUST!", "There is an exhibit on the 7th floor up now until January - please do yourself a favor and go. It was one of the best exhibits I've ever seen - immersive in the senses and incredibly thought-provoking. Meditative. Highly, highly recommended!!"], ["Reviewed October 31, 2017", 5.0, "Unexpectedly Cool", "I tend to visit traditional art museums more often, perhaps because 'modern' versions are less frequently available. Here, art explores a much wider range than oil paint or, say, ceramics. The soundscapes, especially by Brian Eno (Talking Heads, etc) were fascinating. Younger kids might be a bit restless here. I was solo and it was a treat.\nShow less"], ["Reviewed October 31, 2017", 5.0, "the moma is a must", "take your time when you decide to visit the moma. excellent permanent exhibition as well as fantastic special shows, good restaurants and cafés give you a great time."], ["Reviewed October 30, 2017", 5.0, "Beautiful Art, Amazing Building", "When I went they had an exhibit for Edvard Munch. It cost a little bit more than the general admission fee, but it was so worth it. I suggest purchasing the audio tour so that you get a chance to view the museum through the eyes of curators. It has a location setting so that you can move at your own pace and learn about specific pieces.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Great musuem!", "This was the first thing we did on our family vacation. Very well run museum with incredibly friendly and helpful staff. Exhibitions were wonderful. We started at the top floor and moved our way down, but easy to visit each floor however you'd like. We had a stroller and had no access issues. Eat there- their chef is incredible! Finding it and parking was a little tricky, but was worth the hassle to spend a few hours there. Dont skip this!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Excellent displays of various aspects of modern art", "We initially thought that the entrance fee ($22 for seniors) was expensive but after spending over 4 hours in the museum thought that the entrance fee was well worth it. The museum spans 7 floors with well spaced exhibits which means they can be viewed without waiting for other visitors to move on. Whilst a few exhibits were not to our taste there were plenty of interesting other aspects of modern art to keep us hooked. Because there was so much we had to take a break have lunch and a beer on the 5th floor restaurant where you could sit inside or outside on the terrace. This was the best modern art museum that we have visited in a number of countries.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Edvard Munch exhibit~", "This exhibit was fairly comprehensive, minus the Scream. Very good descriptions and paragraphs about the works, following his clear patterns and deeper psyche. SFMOMA had them in several rooms, a fairly basic temporary display setting. We had no time that day to see any of the rest of the museum.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Very Large and Comprehensive Museum of Modern Art", "The San Francisco Museum of Modern Art (SFMOMA) is seven packed floors exhibiting modern art in its many forms. All mediums are well represented. The wall spaces are spacious, allowing the art to be presented without physical limitations. Of particular interest to this reviewer was a circular pond on Floor 7 in which pottery bowls were floating. As they contacted each other they emitted a pleasant and soothing sound. The objective is to create exactly a contemplative mood of rest and reflection. This, as many other MOMAs is well worth a visit. Plan on 2-4 hours to cover it fully but lightly.\nShow less"], ["Reviewed October 21, 2017", 5.0, "What a lovely day!", "First, a confession. We do not like contemporary art. We don't understand it. We need something more realistic, not just a cacophony of colors.\n\nHaving said that, we had a great visit. Great building, lots of space, nice elevators - if somebody has moving difficulties, they don't need to take stairs at all, and plenty of benches around.\n\nNow \"Side by Side\" exhibit is highly recommended. My favorite were Frieda and Diego, and a painting named \"Two Drunk Artists\". And Warhol. And outdoor statues. Husband enjoyed most of all the meditation room (?) where dishes float on water, and people sit around them. Soft sound of clunking dishes, just lovely!\n\nWe went to the restaurant on the 5th floor just for snacks - needed coffee, ordered at the counter, and took them outside.\n\nAnd... if you are a SF resident, you can print free passes off the SF library website.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Amazing", "We spent several hours at SFMOMA and didn't even begin to see all. We left only because our eyes became such a blur that we realized we needed a break. But we will return. Why? This museum has so much fantastic art and so well displayed, with thought-provoking descriptions that make you think about what you are seeing. And it has so much to think about!\nTickets are expensive but well worth it.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Great Selection of Modern Art", "The museum itself was beautiful and their selection is fantastic. There were so many artists that I was happy to see and some new artists that I was excited to see for the first time. On the 7th level they had an exhibit called \"Soundtracks.\" Words cannot give this exhibit justice, it was one of the most inspiring exhibits that I have ever seen. You must check it out before it closes on January 1, 2018.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Buy a Ticket, Get the App, Enjoy and Excellent Museum", "This is an excellent Museum. However a mistake would be to take the offer of a free visit and just see the permanent collection on the second floor, because the upper floors really have some wonders to offer.\n\nThere is an excellent App, which you can download free (type in SFMOMA in to the App store and download the red SFMOMA app to avoid the fake version also on offer). The app locates you in the gallery and allows you to bring up brief audio guides on the work that you can see.\n\nThe collection is (compared to its New York cousin) relatively small, but high quality with all the big names represented. I was struck by a very interesting Diego Rivera landscape and a magnificent Rothko among others. Also don't miss the little video booth on the way out of the collection. This features short videos and interviews with the artists. Some of these are really beautiful. My favourites were footage of Frida Kahlo and Diego Riviera together in the blue house, an interview with Georgia O'Keefe walking over her favourite hills in New Mexico, an interview with Anselm Kiefer and footage of Warhol completing one of his screen prints.\n\nGoing up the floors highlights for me were the Clifford Still works on Level 4, the room of dual portraits on Level 5 and all the Germans on level 6 - especially Keifer and Richter.\n\nJust when you think you have had enough, find some more energy for the seventh floor. Up there you will find some amazing works featuring sound. I found Ragnar Kjartansson's video installation particularly moving. It features nine musicians (including the artist who is singing in the bath) playing together in a decaying mansion in upstate New York. The impact of this work is quite amazing.\n\nFinally, find your way to the cafe and sculpture garden on level 4 (I think) with a gorgeous view of the surrounding buildings.\nIf you like modern art SFMOMA is a must see destination in San Francisco.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Munch and more", "Nice art museum with variety of art forms. Nicely laid out and thoughtfully curated. Enjoyed the Andy Warhol and spider exhibit, in addition to being a little angsty about the Munch."], ["Reviewed October 11, 2017", 5.0, "must visit for art lovers", "this is a must visit place for art lovers, you will spend a whole day easily. personally I really like exhibition on 6th floor. check guided tours, they are great and you will learn more from these."], ["Reviewed October 11, 2017", 5.0, "Lots to see", "SFMOMA has something for everyone and something for all senses. The designs, paintings, interactive exhibits and musical displays are all worth a visit."], ["Reviewed October 11, 2017", 5.0, "Diverse collection with intelligent curation", "There is an awful lot of art crammed into this museum. The wide range of exhibits, the thoughtful organization and the clear labels really explains each piece and gives you a feel for some of the trends in modern art.\n\nI spent nearly three hours here and would have stayed longer if I could.\nShow less"], ["Reviewed October 10, 2017", 3.0, "Almost too much art to experience in one visit", "With the inclusion of the Fisher collection and the recent expansion, SFMOMA actually has too much art to take in during one visit. So be choiceful of what you want to see, and don't rush thru every single gallery. In fact, you may find that due to the collection restrictions and curatorial direction, you will end up seeing so many works from a few major artists (esp the Fisher collection), that the artwork practically loses their individual impact in physical relation & juxtaposition of other works -- yet without the contextual storytelling of a full retrospective. I miss the old Blue Bottle Cafe that was on the sculptural garden level. But the addition of In Situ as a nice sit-down restaurant (albeit very pricey for small portions) is a welcomed change from the former cafeteria offering on the ground level.\nShow less"], ["Reviewed October 9, 2017", 5.0, "HEAVEN", "Amazing museum....a gift to California. Don't miss the Abstract Expressionist floor as well as the new additions from the Fisher Collection. This museum will cause all your synapses to fire and your own Genius to flare!!! Do not miss Mark Bradford, Agnes Martin, Joan Mitchell, Krasner, De Kooning, Motherwell, Rauschenberg ,Rothko, Defoe, the list is long and so fulfilling, ENJOY!\nShow less"], ["Reviewed October 9, 2017", 4.0, "Our First Visit to SFMOMA", "We visited the famous San Francisco Museum of Modern Arts on a Saturday AN . Though it was crowded , we could get our tickets at the counter within a few minutes. The museum is well laid out in six floors in various categories like gadgets, paintings , photography etc . It took us about 2 hours to see the exhibits .For more detailed study , it will take anything up to 5 hours or so . There was very good order in the movement of visitors and the sign postings are helpful. There are two cafe's ,one at the 5th floor and a smaller one at the third floor .\nThe museum gave us a good understanding of the American modern art,its evolution and identify some major artists . A pleasant experience overall .\nShow less"], ["Reviewed October 8, 2017", 5.0, "The usual suspects and more", "The collection is impressive, well curated and presented. The ongoing exhibitions are great: Edvard Munc (without 'The Scream'), Walker Evans, and the video installation 'The Visitors' of Ragnar Kjartansson."], ["Reviewed October 8, 2017", 3.0, "Another Visit to the Museum", "I accompanied a friend to the museum who is an Arts major to see the exhibits from a different point of view. I have to say I am still nota modern arts appreciator.\n\nI saw Edvard Munch exhibit and have to say much of it was kind of dark and what wasn't dark was more about pictures of himself. While he did this in the late 1800's, I still ask \"why\" so dark...was he a madman? No scream at the Museum which is why I know who this person is anyway, but then again, it's scary and not something I would ever consider as art anyway.\n\nTook in other exhibits but found myself asking \"why in the world is this considered art\". Different shapes painted single colors of red, blue, green, yellow is like child's play and means every kindergartener should be considered an artist. I've concluded I still don't get it! Hats off to those of you who love this stuff...you are special.\nShow less"], ["Reviewed October 8, 2017", 5.0, "So good - maybe even better then MOMA NYC", "We really enjoyed the total experience! Exhibitions, restaurant, the Architecture - and feeling. The right feeling when enjoying high level art and the creative and intellectual agora offered. As regular visitors in SF it is a standing activity to visit MOMA."], ["Reviewed October 7, 2017", 2.0, "At SF MoMA you could learn, what is art and what is not", "Let me start with a simple question: what is the art? How would you define the art without checking Wikipedia?\nLeveraging on Coleridge definition of poetry (\"the best words in the best order\"), I would define the art as the closest approximation to the perfection in the search of harmony and beauty.\nThis definition gives me ability to differentiate between the master piece and piece of sheet (the typo intended).\nNow I could review the SF MoMA. Absolute majority of exhibited artefacts demonstrates that collectors have much more money than good taste or knowledge and understanding of arts.\nThe permanent collection is a thoughtless waste of millions of dollars on stupid attempts to make something \"original\" by people who pretend they are artists, but have no talent, gift or ability to paint, draw, or carve.\n\nThere are some really great paintings of Henri Matisse, René Magritte, and Willem de Kooning and few other artists.\n\nSo the permanent collection doesn't worth to visit. But the SF MoMA had an absolutely fabulous exhibition of Edvard Munch (till Oct 09, 2017).\nShow less"], ["Reviewed October 7, 2017", 5.0, "Well worth a visit", "I intended spending a morning and spent a whole day instead! I was lucky enough to see the Munch exhibition, but the permanent collections was great too. The building is also very airy and pleasant."], ["Reviewed October 4, 2017", 5.0, "Superior as usual", "Went to see the Edvard Munch, a special exhibit, that was interesting but disturbing. After that, seeing a bit of the permanent exhibits was very nice. So many great things to see and a great building to visit on the whole."], ["Reviewed October 4, 2017", 3.0, "Not impressed", "Probably this is one of the poorest MOMA's I have ever seen, mainly 'packed' with modern, hilarious, art on the upper floors, with the exception of the ground floor where you have a small exhibition with art by Picasso, Dali etc.\n\nThe security seems to be tight here, more like showing off, bearing in mind how small this place is compared to museums like this you find in NY or London\nShow less"], ["Reviewed October 3, 2017", 4.0, "Cool Venue for Cool Art", "Spent several interesting hours in this cool museum. If you like modern art, you should definitely visit. We were lucky enough to catch the Edvard Munch show. I highly recommend that."], ["Reviewed October 3, 2017", 5.0, "What a great place!!", "we went to see the Edvard Munch exhibit, and also wandered through a few other exhibits. What a great experience!\n\nMuseum is spacious and very nicely laid out. Plenty of space to walk around, exhibits are very nicely done with great lighting.\n\nCoffee shop and restaurants available, although we didn't try them.\n\nWe enjoyed the terrace with a few Calder sculptures and the \"living wall\".\nAlso enjoyed browsing the quite extensive gift shop.\n\nAll in all an excellent visit, and we'll be back.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Spectacular museum but don't see Munch at the weekend", "World class museum with some surprising art - we loved the 7th floor sound exhibits including the water chimes and lots of good sculpture. Not much modern 'filler' art like you see in many such museums - its basically all very high quality.\nBUT they had clearly sold too many tickets to Munch, despite timed tickets - it was really too crowded to see things properly, maybe my own fault for going at the weekend.\nWe spent 3 hours at the museum, which is a personal reord - also good coffee shop with outdoor seating.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Great Collection in an Impressive Building", "I am no expert, but I find the crazy stuff quite entertaining.This is a big collection, with lots of well known artists. Not as many risqué works as a comparible European gallery. Ground floor resturant was incredibly pretentious (and expensive) but we found something to eat in the café. which has a terrace outside.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Arty", "Saw the Eduard Munch Exhibition. Place is very orderly and organised. Staff friendly, helpful and knowledgeable. Pleasant experience."], ["Reviewed September 30, 2017", 4.0, "Quiet tranquility in city", "Very extensive gallery with several worthwhile collections and themes. Like much modern art I couldn't understand some of it!!!. The Eduard Monck exhibition was on whilst we visited and this included about 60 of his works and they made the visit."], ["Reviewed September 28, 2017", 5.0, "LOVE this museum", "It's been a couple of years since I have visited SF MOMA. In the interim, the inside of the museum has been remodeled. Today, I specifically went to see the Edvard Munch exhibit which was well done. I also visited the rest of the museum which I enjoyed.\n\nOne of the BEST things I have ever seen in a museum is the audio portion that you can get on your mobile phone. You must download the app first, but no problem as the museum offers free WiFi. When you use the app, it knows which painting you are standing in from of, if there is information about the painting. When listening, I was amazed at the curators that spoke as well as other artists or people involved in the particular work of art. This is an audio tour DONE WELL. I have traveled all over the world and have visited other museums in the greatest of places: Paris, Vienna, Roma, Florence, etc. and have taken the audio tours (which often cost). Furthermore, the audio tours are not necessarily done well. SF MOMA - you did it. The BEST ever! Great museum, great facility, great audio tour, great collection. I'll be back!\nShow less"], ["Reviewed September 28, 2017", 5.0, "Stimulating Your Creative Mind", "We recently visited SFMOMA on a family trip. This museum is brilliant in every single way. The exhibits are top notch and the layout is friendly and easy to follow. From painting, photography, sculpture and one of the most brilliant video pieces I have ever seen, Ragnar Kjartansson, The Visitors, 2012 which brought literal tears to my eyes this is a place for every art lover to visit. Do not miss this museum if you like Warhol and Lichtenstein. We also took in the Edvard Munch exhibit which was also showing while we were there which inspired so many ideas for the new horror book I am writing. One minor criticism, there are a few names which seemed to be overlooked in the exhibit. Where were the Keith Haring, Basquiat, or Maplethorpe? Other than those exclusions I felt it was an amazing place. I guess it was so amazing it left you wanting more.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Nice Museum, Though the Name is a Mis-Nomer, in my Opinion", "This is a nice museum, covering 5 floors (6 counting the lobby).\n\nIt bills itself as a museum of \"modern art\", though what I saw was mostly contemporary art. I'm from the East Coast (Boston). Maybe this is how they define modern art on the West Coast, or maybe they're using the term \"modern art\" in a very general way. I'm thinking of the Museum of Modern Art (New York), Institute of Contemporary Art (Boston), or Mass MOCA. To me, Modern Art encompasses Abstract Expressionism, Surrealism, Cubism, Russian Constructivism, Dadaism, etc, roughly 1900 - 1950. What I saw here was mostly more recent than that. The only exceptions were the Isamu Naguchi exhibit (big Naguchi fan here), and one room of genuine \"modern\" art on the second floor. In my experience, Contemporary Art includes large installation pieces, video art, all created since about 1960, and that's mostly what I saw here. A good museum, just not \"modern art\" by the strict definition of the term.\n\nI had lunch at their \"Cafe 5\". Over-priced (it's a museum, and it's San Francisco), but the best fish sandwich I've ever had.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Newly remodeled art museum", "The new space at the SFMOMA is wonderful. There is more space and light, and the art is exhibited nicely. Great exhibits, but of course that depends on your personal interests. Check before you go."], ["Reviewed September 23, 2017", 5.0, "I love to see all this invisible stuff", "Wow. You may think you don't love modern art, but this place will change your mind. In more ways than one."], ["Reviewed September 18, 2017", 5.0, "Nice visit to MOMA", "We had an enjoyable visit to MOMA. The music/art exhibit on the 7th floor is so interesting and should not be missed. The Living Wall is breathtaking and fascinating. And of course, they have the best gift shop in town!"], ["Reviewed September 17, 2017", 2.0, "Alight", "Was okay and not impressed at all and steep price to get in. I enjoyed the gift shop alot more. Would rather do something else as everyone was raving about this place."], ["Reviewed September 16, 2017", 5.0, "Great modern art museum experience", "Stunning building and diverse collections an exhibitions, which cover the vast definitions of what constitutes art. This will become one of the great modern art museums of all time in the perfect city for creation and in the perfect location within the city. The Munch exhibition had stirred up much interest although personally I find his work depressing and seeing it on a large scale makes it worse. There is the In Situ restaurant in house, worth a visit and a great shop for all sorts of interesting things.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Rothko, Munch and more - what a treat", "The Edvard Munch exhibit was simply outstanding. The audio guide is a must have - it is so intuitive and relaxed - so beautifully curated - most recommended.\n\nThe pieces of art are sublime. They have benches everywhere - and in front of really important works - it was my first experience of seeing Mark Rothko and I was moved to tears.\n\nThe Munch exhibit has so much about his life and the reason as to why his work 'Scream' is so important. Mind you, that painting wasn't there - I know it was stolen from a museum in Europe earlier - but don't know if they ever got it back. What a shame.\n\nPlease visit, and leave at least half an hour for their gift shop- it is very very tasteful!\nShow less"], ["Reviewed September 14, 2017", 3.0, "Between the good and ordinary", "We went here for the Edvard Munch exhibition, Between the Clock and the Bed, which was very good and instructive (if lacking one obvious painting). The entry tickets ($62 for two) allowed access to the whole museum, but we thought this was expensive. It was not easy to find the stairs between floors. We liked some of the other modern art, but some of it was of the 'white cat in a snowstorm' school where we did not see the merit in it. We stopped in the café for a snack but it lacked sufficient seating. Great building overall.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Moma Excites with 7 floors", "Moma sets a standard for modern art museums. The building itself is art. I particularly loved to pop art floor."], ["Reviewed September 13, 2017", 5.0, "Must Visit", "Every visit is a great time! Always something interesting to see in the changing exhibitions, and the permanent collection is just great and well organized. Loved Edvard Munch."], ["Reviewed September 12, 2017", 5.0, "World Class!", "We went to Edward Munsch exhibition. Very high quality show. We were equally impressed with many of the permanent exhibits. This museum is as good as any in Europe. Bravo - San Francisco!"], ["Reviewed September 11, 2017", 5.0, "Edvard Munch exhibition", "Loved this place and loved the Munch exhibition. Lots of other fabulous stuff by Lichtenstein, Warhol , O'Keefe etc . We could have stayed for ages but had time constraints. Nice restaurant and frankly everything was excellent. Would I go back? Absolutely"], ["Reviewed September 9, 2017", 4.0, "Beware closures", "Visited in August 2017 principally to look at the Pritzker Center for Photography, which was relatively recently opened and touted as \"the largest space permanently dedicated to photography in any art museum in the United States\", displaying works from a collection of \"more than 17,800 photographic works\". Incredibly, however, not a single photograph was on display! The whole centre was closed, except the small and poor \"hands-on\" (really \"digital\") gallery.\n\nThere were also many other gallery closures throughout the museum, with signs saying \"Our staff is hard at work on installation of a new exhibition. Please refrain from distracting them with photography or conversation\" - hardly welcoming (not a single member of staff in sight). The museum map also was not accurate, as several artists marked on it were no longer on display.\n\nApart from this, the collection is well worth looking at, with a mixture of very good pieces by the big names of modern art and more regionally-relevant modern artists.\n\nThe quality of the food in the usual posh cafe is very high, with a limited but interesting menu, and not too outrageously expensive, at least by normal museum standards. The main store is also amazing.\n\nFailed to find any educational activities in the whole museum, rather incredibly, but my 11-year-old daugher still managed to keep her attention for a couple of hours.\n\nThere are no discounts for American Alliance of Museum members, despite the museum being affiliated - very poor form, imho. The entry price is not exactly cheap.\nShow less"], ["Reviewed September 8, 2017", 3.0, "At $25 only worth it if you love post 1945 art", "One of the most expensive art museums to visit (extra for special exhibitions) and lots of space for large questionable post 1945 but not truly contemporary pieces. With the exception of the German artist Richter, no-one was comprehensively covered so the content is disappointing. Many better museums and sights in the city.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Well worth it", "This is well worth a visit if you are into modern art. The collection is extensive over 7 floors in a bright, open museum. Less crowded than NYMOMA and with much the same flavour."], ["Reviewed September 7, 2017", 5.0, "Interesting Collection, Manageable Size", "One of the highlights of the trip - the collection is interesting, includes higher profile modern artists, and discovered some not previously familiar - the Mike Mandel photography exhibit and German Art After 1940 were standouts. Was sorry not to have enough time for the Munch special exhibit. For a smaller sized museum, a really impressive diverse and interesting collection - can easily be done in a couple hours.\nShow less"], ["Reviewed September 6, 2017", 5.0, "One of my favorite museums.", "Wanted to see the remodel and was not disappointed. The additional 4 floors with their room after room of art wsa amazing. You need half a day to go through all the floors, and an hour in the gift shop!"], ["Reviewed September 6, 2017", 5.0, "Edvard Munch, Between the Clock and the Bed", "Great exhibit especially if you're into the worlds most famous Norwegian artist. Interestingly his most famous painting, the Scream isn't present but the exhibit is filled with references both pictorially and didactically that bring deeper meaning to this most of icons. I didn't know much about Munch (sorry) but this exhibit was fascinating and I left with a new and better understanding of the man and his art. Worth a detour if you're in downtown SF and definitively another good reason to go to this fabulous museum. Don't forget to see the Fisher museum and also a concurrent show, Soundtracks, which, not to spoil it, has an amazing work that involves bowls and water.\nShow less"], ["Reviewed September 6, 2017", 5.0, "WOW!", "The newly remodeled SFMOMA is a great treat. I don't know how many more square feet they have added, but I was blown away but the new spaces and the art it houses. We went to see the Munch special exhibit, but there was so much more. There was too much for just one visit. We look forward to returning. (We're from LA.)\nShow less"], ["Reviewed September 6, 2017", 5.0, "Splendid job remodeling.", "They did a splendid job remodeling it; it was worth the wait. The Munch exhibition was the best we have seen on this artist. Dining there was excellent too: Café 5 provided the perfect lunch."], ["Reviewed September 6, 2017", 5.0, "Massive museum!", "The renovated space is gorgeous and the museum is now immense; it would be hard to complete the entire space in one day. Strong permanent collection and amazing exhibitions. Coffee bar and cafes inside. Do not miss it!"], ["Reviewed September 6, 2017", 5.0, "Fabulous Museum!", "Art is at the top of my list when visiting a city. SFMOMA is a world class museum. Visiting the city Labor Day weekend, we booked tickets for the Edvard Munch painting exhibit. I was equally thrilled to see the portrait \"Side by Side\" exhibition, the Noguchi \"Playscapes\" and more. This is a wonderful museum. Kudos on the remodeling. Do not miss any floor.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Temporary exhibition of Munch", "An absolute must see when you are visiting San Francisco. The 50 or so paintings grasp the artists tormented inner and are so more meaningfull then his world renown \"the scream\"."], ["Reviewed September 3, 2017", 5.0, "Now a world class museum", "Now that most floors are showing stuff this has gone from a solid SF museum to one worthy of world class status -- I used the term joyous -- it's fun -- well laid out and constantly changing"], ["Reviewed August 31, 2017", 5.0, "Best Modern Art Museum!", "Loved every floor. The exhibits are diverse and interesting. The building is easy to manipulate your way through. It is a must see for even those not so much art lovers."], ["Reviewed August 30, 2017", 5.0, "A great adventure for those who love modern art ( and pastries)", "I must say there are art exhibits that intrigue the mind and some are...just for the name of the artist. But the highpoint of our visit to this museum are not just the quirky, avant-garde art experience, but as well as the pastries they offer in their cafe! Would love coming back just for those pastries...I am a foodie more than an art lover...\nShow less"], ["Reviewed August 30, 2017", 4.0, "Guide tours great.... Guard at entrance not!", "If you can sign up for a guided tour of one of the exhibits I highly suggest that you do. The guides are knowledgeable and cater each for to the exhibit and interest of their tour members.\nHowever we are nearly shoved aside physically when attempting to use the elevator for a handicapped person. There are three elevators on the ground floor. One is labeled staff only but it not labeled this way on the second floor! We pushed the up button the times and each time the elevator on the staff only side opened. We guided to take it but were rudely told to get back and that we were not allowed on that elevator. We said it was the only one that opened. The guards then proceeded to get on, close the doors and then come back out.... He had to be watching us from a good 20+yards away... Very disappointing way to start an otherwise good visit.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Fabulous Museum", "This is a first class contemporary collection in a great space. Be sure to allow enough time. We visited it when the Munch exhibit was on which was great."], ["Reviewed August 28, 2017", 5.0, "Take time to visit all the floors", "As many Europeans, I was quite shocked by the $33 entry ticket, but it comprises the fabulous Edvard Munch temporary exhibition, and gives access to six floors of very diverse modern art, beautifully displayed, with extensive explanations in English.I highly recommend visiting this museum"], ["Reviewed August 28, 2017", 4.0, "The Nicely Curated Exhibition of Edvard Munch", "We visited The Exhibition of Edvard Munch in July which was nicely curated, though the traffic flow was not so smooth. Nevertheless, we enjoyed the magical strokes of the expressionist painter from this comprehensive collection “Between the Clock and the Bed.” The guides and descriptions were of sufficient help, too.\nSFMOMA has an abundant collection of modern American Art, definitely worth your time to explore.\nAlso, SFMOMA has been engaging in digital appliances. One of the appliances is an SMS service namely“Send Me SFMOMA,” by which one can text the museum’s number with keywords, and it will feed your relative artworks. Very cool!\nBTW, The restroom of the first flood is colored in fantastically red.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great exhibitions !", "The permanent collection is great ! With pop-art icons and alternative forms of art as displayed in the 'soundtracks' part, one can discover real Modern Arts ! Also, the Munch exhibition is awesome and explanations about the paintings and the choice of the rooms are of high quality !\nShow less"], ["Reviewed August 27, 2017", 5.0, "A fabulous place", "I only had half a day to spend here and could have stayed longer. There is so much to see and take in. A must see place"], ["Reviewed August 23, 2017", 5.0, "Agréable visite", "Even before I saw the collection I already liked the museum, nice building, really nice staff, a place (free) where I could leave my big bag and a museum free for people under 18 ( or people of 18yo) and a reduction for Young adult !\nFor the collection, everyone loves different type of art, but this museum offers a large choise so it is really nice and can please to everyone ! Lot of different artists and forms of art, and not only the very recent art exposed but also art from the beginning of the modern period.\nAs I really enjoy I took a lot of time to visit it (+ than 3hours ) so you can spend a lot of time into it.\nThe special exibition (munch) was also free for 18yo and less !\nShow less"], ["Reviewed August 23, 2017", 3.0, "Closed on Wednesdays!", "Be sure to check the museum's hours before planning your visit. While most attractions are maybe closed on Monday and/or Tuesday, SFMOMA is always closed on Wednesdays. This caused us to have to make last-minute adjustments to plans."], ["Reviewed August 23, 2017", 5.0, "Great Cafe in the Museum", "The new MOMA is beautiful and HUGE and I want to put in a good word for the cafe on the 5th floor. Especially the pulled pork sandwich, delicious. There are lots of choices for lunch, coffee choices (Illy) and pastries. You order at the counter and then your food is brought to you at your table - very quickly. There's lots of room inside as well as outside on the patio with umbrellas.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Excellent", "Had an excellent visit to SFMOMA today with my better half during our \"hooky day\" while traveling for our respective jobs.\n\nWe asked the ticketing docent about how much time we should be budgeting, as we were supposed to meet friends after. He asked what our interests were and made excellent suggestions accordingly.\n\nBeing a DJ, I found the \"Soundtracks\" collection on the 7th floor to be a real treat!\n\nOverall the collection is superb. Often collections are repetitive or sparse. Neither is the case here. You can get close enough to see any details you'd want to and pictures are not discouraged.\n\nA ticket price of $25 might seem high to some, but for us it was money well spent and we enjoyed ourselves immensely.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Blew me away", "This is a must see - I have been to art galleries in other major world capitals and this ranks right up there."], ["Reviewed August 19, 2017", 5.0, "Best modern art museum in the U.S.", "With the recent expansion, SF MoMA has become an absolute world-class museum in terms of its architecture, permanent collection, and special exhibitions. Just a gorgeous space to see art, and you will not be able to see everything! Too many newly built or renovated museums put architecture before the art but not this one. The architecture is gorgeous, but it is all in the service of art. And art there is, everywhere. There were multiple exhibitions on view, and all were superb. It would take hours to see everything - best to choose a few shows and look at them in depth. I honestly think this museum puts the NY MoMA in a second tier. This is an absolute must see.\nShow less"], ["Reviewed August 19, 2017", 5.0, "An amazing self-guided tour!", "The SFMOMA has free wifi that you can use to download the audio guide app. This uses your real-time location to tell you all you need to know about the artwork in front of you! Perfect for everyone whether they're an Art History buff or simply curious to find some deeper meaning in the artwork.\n\nThe current Edvard Munch exhibition is beautifully curated and gives a very touching insight into the artists life.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Great works that will blow your mind!", "SFMOMA is the perfect place to go on a chill afternoon with family & friends. The exhibition space planning is perfect and modern.\n\nThere is a café inside, a gift shop, and fun restrooms! Make sure you go to the bathroom on every level (no joke).\nShow less"], ["Reviewed August 17, 2017", 5.0, "LOVE THE NEW MUSEUM", "Five Stars now and not able to see everything in one visit. That's a good thing. The new flow is fantastic and there appear to be enough museum staff throughout to ask questions about directions and exhibits themselves."], ["Reviewed August 16, 2017", 4.0, "Really interesting varied collection", "We had a wonderful day looking around the MoMA. Wide range of art, some interactive and all thought provoking. The building itself is photo worthy, and it's a well stocked bookstore full of great toys and visuals. Highly recommend -- try to go when the crowds are down, it can get crazy\nShow less"], ["Reviewed August 16, 2017", 5.0, "Beautiful building", "Lots to see so plan your visit. Spacious viewing areas and places to catch your breath. Restaurant was good too. I'm not commenting on the exhibits as this is down to personal choice."], ["Reviewed August 16, 2017", 3.0, "A few attractions are also visible without an entry ticket.", "We came quite late to the SFMOMA and at that time there were no tickets available. But you can also visit a few of the exhibitions on the ground floor without a ticket."], ["Reviewed August 15, 2017", 5.0, "Very Interesting", "Not as big as NY MOMA, but has so many interesting pieces. Location is central and very accessible. Loved the terrace sculptures."], ["Reviewed August 15, 2017", 3.0, "Nice museum", "SFMOMA was a good museum, but seemed lacking in some aspects one might expect in a venue of this calaber. The narriative for headsets was disappointing (free for I-Phone, $6 for androids). There did not seem to be enough elevators for a museum that size and the staff in the galleries did not seem very informed about the venue. The Edvard Munch exhibit was interesting.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Best MOMA", "I spent half a day here and could have stayed longer. It's jam packed with incredible art and sculptor both modern and not. Some special greats also. You can download an App and use your own cell and headphones to do your own audio tour. Ensure your cell phone is 100% charged with charging cable and your own headphones in order for this to work. There is free wifi to download and run the app while you are visiting. This is by far one of the best art museums I have seen in the world.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Really interesting", "Went for a short 1 hour tour with my family. Especially enjoyed the exhibition on the 7th floor which was very interesting.."], ["Reviewed August 13, 2017", 5.0, "Kids and adults loved it!", "We came on Sunday at 10:30. The line wasn't bad at all. Adults were $25 each, and kids under 18 are free. We decided to go straight to the Munch exhibit in order to avoid the later-in-the-day crowds. It was very impressive. My seven-year-old and nine-year-old daughters were both very interested in the artist's pieces and his life and struggles. From the Munch exhibit, we decided to head to the cafe for an early lunch. Again, we were really impressed. We all really enjoyed our lunch. I had a fantastic salmon/dill/feta salad, my husband had the shrimp on rye, and my kids opted for the mac and cheese from the kids menu (freshly home made).\nAfter lunch we headed to the 5th floor to see the Warhol collection and thoroughly enjoyed the entire floor of minimalist artwork by various artists.\nFinally we decided on heading to the 7th floor and explored all of the sound-related exhibits. We all really enjoyed all of these installations. They were very interactive and really kept my kids' interest.\nAfter the 7th floor, our kids had run out of energy and had reached their fill, so we called it a day. Would love to go back and check out the floors we missed!\nShow less"], ["Reviewed August 13, 2017", 4.0, "Loved the Munch exhibit!", "Beautiful museum, recently renovated. Take your time to enjoy multiple floors of varied art exhibits. Bright, airy and large enough to give the feeling of space even on a busy summer day. Nice museum store, too."], ["Reviewed August 13, 2017", 5.0, "A Wonderful MunchExhibit", "We were in The City to celebrate our 50th and decided to spend one afternoon at SFMOMA (it had been a while since were visited it). The presence of an exhibit of the work of the Norwegian artist Edvard Munch motivated this choice. We have seen pieces of his work in all the great museums of the world and in 1994 had visited his museum in Oslo. It was a superb exhibit, with work from all stages of his life. And we were not the least upset that The Scream was not among the collection presented. We have seen it on many occasions in other museums. We recommend that visitors to The City take the time to visit SFMOMA.. the building is beautiful and this exhibit very special.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Another amazing museum in this wonderful city.", "HUGE! Thats the word for this museum, it is huge and I didn't have time to see everything in 1 day, so I had to go back the next day, which wasn't a problem for me because i really loved this museum."], ["Reviewed August 11, 2017", 5.0, "Delightful !", "Wonderful art museum with an impressive permanent collection of artwork and photography. One of the delights of this trip was a special exhibition of Edvard Munch, the artist best known for \"The Scream\". Excellent exhibition with close to 100 of his works showing his life and development as an artist. Highly recommended for a break from the usual sightseeing !\nShow less"], ["Reviewed August 11, 2017", 4.0, "Munch exhibit minus The Scream", "OK, I feel a little dumb. I was expecting to see my favorite Munch piece, The Scream Of course that was not here. The exhibit was wonderful, but I must say I was disappointed and wish I had asked first before buying a ticket!\nWarhol, Dali, Mondrian, lots of other great works. Café is delightful\nShow less"], ["Reviewed August 10, 2017", 5.0, "GREAT ARTISTS ARE HISTORIANS", "Several years ago I majored in art history at UC Berkeley. My emphasis was on mainly on French Impressionism. When I was a junior in college I enrolled in an art history course - American contemporary art from the 1960s and onwards. One of the assignments of that class was writing a 10-page paper a single piece of painting at the old SF MOMA. I don't recall the name of the painter however I remember the name of the painting \"White\". That painting had different variations of white with visible brushstrokes. Just imaging writing a 10-page paper on this painting? Yeah it was that difficult especially since I'm not a fan of contemporary art. There was something intriguing about SF MOMA when I was at college. However when I went to the old SF MOMA I felt the layout of museum was dated and unorganized as some of the galleries didn't highlight the exhibition or artwork. Maybe that was why I did like contemporary art. The last time I went to the SF MOMA before it was renovated was in 2007 to see the exhibition \"Pablo Picasso in American Art\". This was best modern art exhibition I have ever seen because it not only showed Picasso's art but also other American artists that he had influence on.\n\nWhen the SF MOMA opened after its renovation I wanted to go here especially since the museum is about less than a 10-minute walk from my work. I admit when it comes to visiting a museum it is due to the exhibition. During the Memorial Day Weekend there were two exhibitions that were on the day after Memorial Day - \"Monet: The Early Years\" at the Legion of Honor and \"Matisse/ Diebenkorn\" at the SF MOMA. Claude Monet is my favorite painter of all time. I do believe in order expand my repertoire of art appreciation I needed to go to the SF MOMA for that exhibition. Before I decided to go I did some research. I heard about Henri Matisse but not Richard Diebenkorn. I discovered he graduated from Stanford in 1949. That is the reason why I decided to go to the exhibition because as a novice art historian who graduated from Cal I wanted to see works from an artist who graduated from Stanford. I was very glad that I decided to go to the SF MOMA that weekend. From looking at the Diekenborn's paintings you progressions from throughout the works. Even though he graduated from Stanford you see his paintings from his Berkeley series how he interprets the layout of the city. What I liked about this exhibition is you see a painting from Matisse side by side of a painting from Diebenkorn. Even though the paintings are not exact you see how Diebenkorn referred to Matisse when it came to shades of color. The similarities of the paintings would involve the same subject matter however each artist interpreted differently the subject matter such as Henri Matisse's \"Woman with a Hat\", a painting of Matisse's wife, or Diebenkorn's painting of his wife. Going to the SF MOMA for this exhibition challenged me and I was glad for it.\n\nWorking in the Financial District in SF I would pass by the Academy of Art and sometimes noticed some of the artworks. I felt these students would try to become like Picasso with his cubist style. Well to understand how Picasso became Picasso you have to understand what was his influences. If artists who aspire to become Picasso then have to study Diego Velázquez, who Picasso studied a lot from to incorporate his works. For aspiring artists the SF MOMA is a great access as it is downtown SF and is close to Bart. In the future if there are other exhibitions like \"Pablo Picasso in American Art\" or \"Matisse/ Diebenkorn\" I say it is a prerequisite for aspiring artists who want to progress because history is influential in art.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Wonderful way to spend half a day if you're in the city", "Time flies when you're walking around this museum. There are countless exhibits, some very timely and some more permanent ones. There's something for everyone, from sculptures, photography, memorabilia, and some of the finest paintings. There are seven stories, so if you want to see everything, I would suggest at least three hours of open time. If you have any less than that, you can simply visit the first three or four and still get an awesome experience.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Comprehensive collections", "Beautiful building with a stunning entrance hall!\nThe mix between permanent and temporary exhibits is good. Good mix as well between US and European artists.\nWe were fortunate to see a temporary exhibit on Munch that was very well thought and taught us a lot.\nExhibits are well presented and lit.\nDefinitely worth the money!\nShow less"], ["Reviewed August 7, 2017", 5.0, "Renovation was worth the wait!", "Was a bit dubious about paying $25 and then another $6 for the Edvard Munch paintings but so glad I did. Very much worth it. Was expecting two rooms of Munch paintings and was amazed there were almost 50 different paintings in 8(?) rooms! Unlike many other exhibits which are often grouped in a linear manner (e.g. first 10 years, 2nd 20 years, final 15 years) each room had a theme such as \"love\", \"nocturne\" and \"death/illness\" (to paraphrase). It had a much stronger impact as you could see progression as his life changed and as he aged, within a specific theme.\n\nThe building itself has always been open and lovely but with the new addition, there is even more open space and room. No matter how many people were in the museum. it did not feel crowded and there was plenty of space to see exhibits from all angles.\n\nThe Calder and Warhol galleries are highlights.\n\nThere is a some what precious cafe with good coffee and pastries and modern, comfy seating.\n\nBy 11:45 am on a Monday, there was quite a line to buy entry tickets so if you are short on time, or just don't like waiting in line to pay, buy tickets in advance online. In fact, you MUST buy advance, timed tickets for the Munch exhibit. The website says there are \"limited\" tickets available for same day purchase. So don't disappoint yourself and buy tickets for the Munch exhibit in advance if at all possible.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Excellent combination of permanent and temporary exhibitions", "We had bought timed tickets for the Edvard Munch exhibition, which were definitely worthwhile. The other areas of the museum are excellent too. We totally loved the soundtracks exhibition on the 7th floor! Had a lovely lunch on the 5th fllor cafe as well."], ["Reviewed August 7, 2017", 5.0, "Save room for the gift shop", "Seven floors of exhibits are a lot for even the most respectable museum patrons to take in, so my best suggestion is to pace yourself and take a break at the cafe.\n\nRotating exhibits always keep things interesting and supporting the arts benefits all.\n\nIt's also close to the Jewish museum if you are inclined.\n\nLastly, leave time to poke around the gift shop. Even if you don't need anything there are lots of fun gifts for family and friends who didn't get a chance to go.\n\nArt makes us beautiful inside.\nShow less"], ["Reviewed August 6, 2017", 4.0, "EDVARD MUNCHEN EXHIBIT A MUST!!", "We recently visited the San Francisco Museum of Modern Art for the first time since the reopening and renovation. We bought our tickets in advance online. I'd recommend that if you are not already a member. That way, you can just go in and avoid the ticket lines. We went on a Saturday so it was quite busy. You may HAVE to buy tickets in advance to lock in an arrival/check in time. It seems as thought that's a requirement nowadays.\n\nWe went there specifically to see the Edvard Munchen exhibit. We highly recommend this visit and you will have to pay separately. It's worth it. Many of his famous paintings are available for viewing, including \"Despair\" and \"Despair 2\". The only odd disappointment is that \"Scream\" was not part of this exhibit.\n\nBut wait, there's more to the museum of course than just the special exhibits. As all great museums, they have continuing and permanent collections of great artists like Alexander Calder, Wayne Thiebaud, and Ellsworth Kelly, Andy Warhol, and special local artists/exhibits like Mike Mandel. There is also a 7th floor exhibit with some unique creations by various artists (very interesting). Check out the suspended upside drum playing and the floating water bowl chimes.\n\nUnfortunately, the only issue was with the audio devices. We've learned over time and visiting other museums that these devices are not seamless in operation. Again, one of our audio players would malfunction and had to be reset. Of course, we would have to go back to the main exhibit entrance to reset. Also, the devices will run low battery. This seems to be an ongoing problem. The audio devices really do add to the education and understanding of the artists and pieces.\n\nWhen you go please plan on taking your time and plan on enjoying a full day or afternoon. It's worth it.\nShow less"], ["Reviewed August 5, 2017", 5.0, "SFMOMA (So far my only museum article!) - the perfect place to take your Munchkins!", "O.K. Call me a Philistine if you will. I live only forty-five minutes from San Francisco, but I can't remember the last time that I made the effort to get from Pleasanton into the city twice in the same week. That changed for the first time in years recently when I was drawn from my East Bay refuge by the Edward Munch exhibit currently showing at SFMOMA. I must admit that part of the attraction was to experience the recently renovated building, but it was the opportunity to view the Munch canvasses that sealed the deal! The SFMOMA is an amazing, bright and airy building in which to display works of art, but the advances in art appreciation that it provides are just as impressive. By accessing their free SFMOMA app on my iPhone, I was able to listen to commentary on a selection of the Munch canvasses, which was vastly superior to simply reading the tiny panels hung on the wall near to each work. I enjoyed myself so much in the Munch exhibit that I continued my exploration of the museum's other floors, discovering to my immense delight an exhibition on Andy Warhol and the Pop Artist movement and many more of my favorites such as, Matisse, Magritte, Dali and more. I took a break for lunch and enjoyed a delicious cheese and charcuterie platter with a glass of Cote de Rhone in the museum restaurant. There is also a coffee shop for those in need of a quick caffeine fix and a pastry. As I wandered through the various floors of the museum, I saw so many parents with their kids pointing out facts about the artist's life and painting style. It occurred to me that a museum like SFMOMA is a pretty cool place to take the kids during summer vacation. They are never too young to develop an appreciation of art and SFMOMA is a perfect museum to start the process.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Loved it!!! If you love art you'll love this", "Top 2 floors were the best. A great mixture of modern art, musical and mechanical exhibitions. We loved it. Amazing water pool with chiming bowls. Good few hours of interesting art. Under 18s are free!"], ["Reviewed August 5, 2017", 4.0, "Interesting collection with plenty of free space to inspect the art", "While primarily visiting the MoMA for the current Edvard Munch exhibit (which was very good albeit a bit depressing and lacking his greatest painting, The Scream), we toured nearly the whole museum. The second floor has a great, somewhat limited Impressionist and Cubist section. Upper floors have modern art and photography with some rather unique structures and paintings. There are four floors in total with plenty of space for viewing. There did not appear to be any prohibitions on photography. There is a cafe in the middle and a peaceful outdoor area with sculptures including several by Calder. Definitely worth a visit to this museum. Entry cost was $25 for adults (discount for those 65 years and older) plus $6 for the special Munch exhibit.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Edward Munsch Exhibit", "The numerous Edward Munsch paintings on display made this excursion worth every penny. We visited the floors with Warhol, Lichtenstein, and Rothko exhibits as well. This was a lovely way to spend a few hours in the city."], ["Reviewed August 3, 2017", 4.0, "Beautiful building", "The museum is newly renovated and it is very beautifully done. The art has plenty of space which really gives you the opportunity to enjoy it without being overwelmed. I especially liked the photography section of the museum. There is also a big focus on american artists which was very interesting from a european point of view.\n\nWhen I visited a surprisingly large number of rooms were closed off due to setting up new exhibitions, so it felt like half the museum was not accesible. Also there were a lot of noise from the cafe in the middle of the museum and from the entrence which you could hear all over. It was sometimes a bit disturbing.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Loved New Addition", "Went to see the Munch Exhibit currently at MOMA. The exhibit was very good and totally enjoyed roaming the rest of the museum to see the new collects and addition. Well worth the visit."], ["Reviewed August 1, 2017", 4.0, "Huge!", "Really big museum. We'll worth a visit. Allow a couple of hours for visiting. Highlight for me was seeing some works by Andy Warhol."], ["Reviewed August 1, 2017", 5.0, "First Time Since New Addition", "If you are a fan of Modern Art this is one of the finest in the world. The extensive renovation and additional space has transformed a wonderful space into one that can better showcase their permanent collection (now enhanced by their partnership with the Fisher family collection) and still have adequate space for special exhibitions (presently a wonderful presentation of about 50 of Edvard Munch paintings). The docents are exceptional and they are trying out a new method using headsets so that the distractions of others in the museum don't disrupt the docent leading the discussion. many of the docents like to get the group involved making for an interactive as well as educational time. Especially with modern art, everyone has their own opinion and that variety enhances the experience. The cafe is pretty much the same (didn't go this time) and the outdoor sculpture garden (a magical place) was being renovated. The only downside to the new facility was the signage especially between the new upper floors (six and seven), the bridge, and the new areas. Without the paper \"map\" one could end up wasting time going back and forth.\nShow less"], ["Reviewed July 28, 2017", 5.0, "excellent museum!", "I live in new york and have traveled as well; always going to museums in each city. the SFMOMA was simply the best museum of modern art I have been to."]]}}