{"San Diego Zoo": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "San Diego Zoo", "url": "/Attraction_Review-g60750-d104122-Reviews-San_Diego_Zoo-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/62/45/04/san-diego-zoo.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "23071"}, "address": {"@type": "PostalAddress", "streetAddress": "2929 Zoo Drive", "addressLocality": "", "addressRegion": "California", "postalCode": "92101", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Be sure to wear comfortable walking shoes", "Such a gorgeous zoo in an equally gorgeous setting! The zoo is situated on 2 hills with a deep valley in between so you do a lot of walking up and down hills. Almost all of the zoo is wheelchair accessible so the paths are very easily negotiated. Entrance fee includes a ride on the \"sightseeing\" bus as well as Skifari, an overhead tram. For an overall view of the zoo with some interesting facts thrown in, ride the bus and you can discover those areas you'd like to go on foot and see more. We thought we could see some of the animals from the Skifari but the vegetation is so dense you only wind up seeing the tops of trees - but that isn't a bad thing because it's beautiful up so high. As stated, they have a lot of trees so finding shade when it's hot is fairly easy. We were surprised to see a long line of people waiting to see an animal and found it is was for the panda exhibit. I don't feel that seeing any 1 particular animal at the zoo is worth an hour wait, but you may feel differently. The volunteers we spoke with were quite friendly and knowledgeable, pointing us in a couple of directions we might not have gone otherwise.\nShow less"], ["Reviewed 2 days ago", 4.0, "Get there early!!", "I have visited twice and the experiences were very different. I saw much more animal activity when visiting in the morning. On our afternoon visit, I was very disappointed in how many animals we couldn’t see. I understand that nature is that way so take my advice and go early!\nShow less"], ["Reviewed 2 days ago", 5.0, "Exceptional day", "We visited the zoo yesterday. Last time here was 1999!!!! It was wonderful. The animal displays, the bus tour, the aerial tramway were great. We never had occasion to use the kangaroo bus. The bus tour was a great way to start the day as it gave a good overview of the whole property. It is amazing that long range planning permitted the establishment of this great facility. The walking paths, the botanical displays and the animals are all great . Favorite animal? The pandas!!!! Definitely the place to visit in San Diego\nShow less"], ["Reviewed 2 days ago", 5.0, "What an excellent zoo.", "We loved our day at the zoo, unfortunately with two small children we didn't get to see everything before tiny legs got tired and just wanted to go home. The enclosures are huge and the animals look very happy and very well looked after. The zoo is appealing and the different areas are so lovely. It is really nice that there are lots of pedestrian only areas. The cable car and the bus tour (included in ticket price) are great too. The food options weren't vast but we did find good we liked. Would definitely recommend a day trip here.\nShow less"], ["Reviewed 2 days ago", 5.0, "Great way to spend a day in San Diego", "The last time I visited the San Diego zoo was 20 years ago and so much of it has changed. It rained the day we went so many of the animals were hiding but the animals that we did see did not disappoint. Plan on getting a lot of exercise as many of the exhibits take you up hills. We walked about 4 miles that day. San Diego zoo has done an amazing job with the exhibits that house the animals. We would like to go back again on a day that’s not raining and maybe we’ll see more of the animals.\nShow less"], ["Reviewed 2 days ago", 4.0, "Great zoo!", "The best thing we did here was the bus tour. The zoo is very big, and was an enjoyable day. The vegetation is much nicer than that of other zoos."], ["Reviewed 3 days ago", 5.0, "Best zoo!", "World class zoo. Every day at the San Diego Zoo is a magical day. There are so many fantastic animals to see here. The play areas a wonderful too!"], ["Reviewed 3 days ago", 5.0, "A unique experience not to missed", "I have seen many Zoos in the world. But this is probably the most beautiful I have ever seen. It’s an absolute must, if you can spare 4-5 hours. The landscaping is outstanding and so is the presentation of the animals. Buy your entry on the Internet, you may safe a few dollars\nShow less"], ["Reviewed 3 days ago", 5.0, "Wonderful", "Loved our visit to the infamous San Diego Zoo. Seemed a bit pricey but was comparable to Disney World Animal Kingdom In Orlando but by far a better animal show case. Lots of volunteers to help you as you tour with any questions or concetns."], ["Reviewed 3 days ago", 5.0, "great zoo", "Loved this zoo. So glad we went. It was very well maintained and had a lot of great looking animals."], ["Reviewed 3 days ago", 5.0, "The Animals were so active!", "Maybe it was due to the unusually cool weather, but all of the animals were active. Makes for great videos and photos. The grounds are beautiful. I would recommend the 40 minute tram ride at the entrance allowing you to get a view of the entire park before you set out on foot.\nShow less"], ["Reviewed 3 days ago", 5.0, "Wild and wonderful", "How can you spend anytime in San Diego and not visit the San Diego Zoo? Well we couldn’t and visited this extraordinary Zoo on a perfect San Diego day, sunny but not too warm. Personally I’m not a fan of zoos generally ( I don’t like seeing wild animals caged) but considering the world wide reputation of the San Diego Zoo I felt I had to visit it and am so pleased that my wife and I did. If you go....go early. We spent the whole day and didn’t see it all. Enjoy and don’t miss the pandas at dinner time.\nShow less"], ["Reviewed 3 days ago", 5.0, "Enjoyed by teens!", "Went with family. Kids are a boy and a girl, 13 and 14. A little nervous that they would think the zoo was stupid or boring. Not so!. The whole family enjoyed ourselves all day long. Arrived at opening and left an hour before closing. Enjoyed the bus tour twice, once first thing and second time in the afternoon when our legs got tired from walking. Thought that the 4D movies shouldn't be an additional charge. Bought tickets online with AAA discount which saved a few dollars.\nShow less"], ["Reviewed 3 days ago", 4.0, "One of the best Zoo", "I am not really a zoo person as I don't like to see animals in cages. The zoo was well done and it looks like the animals were well looked after.\nOn top of the high prices, I can't believe they were charging to see the 4D movies.\nShow less"], ["Reviewed 4 days ago", 5.0, "A wonderful place.. Awesome Zoo", "This is a great place, and worth going. This required a full day visit. Animal have been tried to place in natural habitat, so you will enjoy with kids. Must place to visit in San Diego."], ["Reviewed 4 days ago", 4.0, "Great Zoo", "Kids loved it; favorite part for them was seeing the pandas and watching zoo staff do physical therapy with the oldest elephant, Mary. Clean, good assortment of animals."], ["Reviewed 4 days ago", 5.0, "Incredible zoo", "This was an incredible zoo to visit. A vast amount of animals and the zoo was very well presented. Clean and tidy. Highly recommend."], ["Reviewed 5 days ago", 5.0, "Animals galore", "A lovely zoo with so much to see and do. Beware that it is quite hilly - there are some moving walkways and buses to help you avoid them, but you'll walk up at least one! My best advice is to take the cable car to the back of the park and work your way back to the front. We were here for 5 hours and didn't quite get to see everything. I loved the pandas and the elephants.\nShow less"], ["Reviewed 5 days ago", 5.0, "Awesome Zoo", "My wife and I spent a full day at the San Diego zoo in February of 2018, and it is easily an all-day event. The zoo is beautiful, the animals appear to be well cared for and have attractive habitats, and the layout is as naturalistic as they can make it will still serving as a zoo. The variety of species (especially African and Asian) is outstanding and it's easy to see why this is one of the premier zoos in the world. Bring comfy walking shoes and plan to make a day of it... there are several restaurants of relatively decent quality throughout the park. Parking is ample and free, and there are several bonus shows/lectures etc. that you can plan to attend throughout the day. There's a free bus tour for an overview of the zoo (and for those with difficulty walking), as well as a sky-tram that will take you from 1 end of the park to the other. Allow all day, take your time, and you won't be disappointed. Would also be great for kids.\nShow less"], ["Reviewed 5 days ago", 5.0, "Wow!", "What a great zoo The pandas were great and the gorillas were amazing. Funny to watch the gorilla clap for more food. The others were entertaining . This place is Hugh we spent all day there and even though not all of the animals were not out because of the time of year it was still fun\nShow less"], ["Reviewed 5 days ago", 5.0, "School vacation trip", "This was our second visit to the zoo... went about 4 years ago. So much to see. We started with a bus tour, which gave us a great overview. Then took the sky ride to the polar bear exhibit. We ate lunch at the Pavilion... it was great. Lots of fresh options. We went on an overcast day, so crowds were sparse, and the animals were active. Loved seeing the pandas and the orangutans.\nShow less"], ["Reviewed 5 days ago", 5.0, "great place", "Was there on presidents day with a million of our best friends. You really need 2 or 3 days to take it all in. Three place is terrific, a San Diego icon."], ["Reviewed 6 days ago", 5.0, "One of the world’s best", "We noticed that the most active time of the day for most of the animals is in the morning. I recommend you get there at opening time (9am). After noon, most of the animals get lethargic and nap. We saw a lot more activity at this zoo than most others we have visited, and the staff seemed to engage more often with the animals before noon. They have more species than most zoos and more varieties. They have more birds than most zoos as well. We had a great day and will return if we have the chance.\nShow less"], ["Reviewed 6 days ago", 4.0, "AMAZING ENCOUNTER W/ CHEETAH", "We made our whole experience over the top when two of the handlers walked by with a Cheetah. Pretty special moment. You need to preplan your visit with the hills and the walking. The skyride can help along withn the escalator."], ["Reviewed 6 days ago", 4.0, "World class zoo", "We went for the pandas but enjoyed everything. Large zoo that is known worldwide. Don’t miss out. Great day out."], ["Reviewed 6 days ago", 5.0, "Plenty of exercise", "Had a great day here with the kids (11 & 14) and didn't leave till dark. Plenty of things to see and do to keep you entertained. Because the zoo is so large and hilly, you'll need your best walking shoes on."], ["Reviewed 6 days ago", 5.0, "Absolutely lives up to the reputation", "I went to the zoo after a conference because I really enjoy going to zoos across the country.\nI have to say, I was beyond excited to go because I have heard that the San Diego zoo is one of the best in the world and quite possibly the country. I was NOT disappointed.\nGet there when it opens at 9am. I arrived at 9:15 and people were pouring into the arrival gates. There were no lines whatsoever but you could tell it was going to be crowded. The 54 dollar admission may seem steep but this truly is a bucket list adventure. The park is HUGE. I took the bus tour at arrival which is a 30 minute slow ride around the park and the driver narrates where you are and ways to get around the zoo. It goes past all the popular exhibits and he/she will narrate a little about the animals. It was helpful to get your bearings before you start on your adventure.\nI have been to the national zoo and well as the Bronx Zoo- all very large with a lot of exhibits. The San Diego zoo allows you to get a lot closer to the animals than any other large zoo I have been to. Obviously you can touch any animals but you can see them really up close and many pictures came out so clear.\nThe Pandas were definitely the favorite exhibit and there were about 50 people on line to see them. The line moves quickly because they are in two exhibits and people are respectful of those waiting behind them in line. There is a koala exhibit that is spectacular. You will need to go to Australia to see more. They just built the exhibit and it was a delight to watch these creatures move about. The animals are always out and about even if it rains. The climate is perfect for them. A hippo baby was out with its mama as well as a newborn giraffe. The skyfari is included with admission and it is a cable car which takes you from one side of the park to the other. Helpful!\nIf you have little ones, strollers are permitted and you will need them. Adults get tired quickly here and I can only imagine kids.\nThere are animal showings and feedings throughout the day. The zoo map mentions this but it’s kind of vague as to where and when. I lucked out to be in the right place and I caught an animal showing with a large African owl. It was literally 5 feet away from me on the keepers arm. It was so informative and the children thought it was amazing. I saw a feeding in the arctic fox exhibit.\nEvery zoo volunteer was so helpful and friendly as well. The grounds were a little confusing because there are lots of paths not marked. The zoo map is helpful but definitely make sure you ask for help before you walk a mile out of the way. :)\nI did not do any add on features. I called in advance to inquire about some of the add ons but for the cost I decided to pass. I observed a child inside one of the exhibits with a camera crew and I believe it was one of the special excursions you could do. She seemed thrilled!\nPark food is really reasonable but most families packed snacks. Souvenirs are also not out of control expensive. You will definitely want something to remind you of the trip. Rain ponchos are 4 dollars if you need one on the spot. I did!\nThe zoo also has a safari park which is about 30 mins north of San Diego. Definitely a return trip item.\nOverall, I spent almost the whole day at the zoo and I was very pleased!\nShow less"], ["Reviewed 6 days ago", 5.0, "Fun day with the animals", "A well rum zoo with animals you won't see elsewhere. Junior high school age kids did enjoy, just wear good walking shoes as it is hilly."], ["Reviewed 6 days ago", 5.0, "Great viewing of the Pandas", "We spent 5 hours looking around the zoo, the displays are excellent and it is easy to see the animals. The bus and commentary were also very helpful. We enjoyed the themed areas as it added to the experience"], ["Reviewed 6 days ago", 3.0, "San Diego zoo", "What a disappointment we saw one panda sleeping the other was inside the skywriter was close down there were other exhibits that did not have the animals as advertise also they advertised a kangaroo and there was no kangaroos. Very confusing trying to get around no staff to help you get around and even if you ask the staff they weren’t very friendly\nShow less"], ["Reviewed 6 days ago", 5.0, "Beautiful!", "There's a reason this zoo is so popular. It's huge and it's fantastic! I hadn't been in about 15 years and don't really remember it, so it was great to go back for a visit. We decided to do the bus tour first, which was included in our ticket price and lasted about 35 minutes. There's also bus stops around the zoo that you can use if you don't want to walk so much. We had several hours and I think we saw about 3/4 of the zoo, so you can definitely spend a whole day here. The food we had was good also! I would recommend buying tickets online somewhere first because the ticket lines were huge. We didn't bring a car but parking is free, which is a nice plus!\nShow less"], ["Reviewed 6 days ago", 5.0, "Expansive and Impressive", "Our family of three (including a 2 year old) spent a full weekday, approx 6 hours, seeing nearly every inch of this amazing zoo. Here's what we discovered:\n\n*it is a very large zoo and maps are provided. There are also lots of volunteers around to help guide you and answer questions.\n\n*there is a lot of hilly terrain to walk up and down; so having the proper footwear is important. if walking isn't your idea of a good time, you can take a tour bus around the zoo or hop onto a Kangaroo bus, which has 4 stops throughout the zoo. another good way to travel is via the sky tram that gives you a great bird-eye view of the park.\n\n*the grounds are beautiful, and it's incredible to think of all the work that goes into maintaining this place. They offer behind-the-scenes tours too, so that you can really see the inner workings (you'll want to plan in advance to enjoy these).\n\n*There are lots of food choices from the typical carnival snacks, i.e. nachos, pretzels, popcorn to more sit-down options. We stopped at the Sabre-Tooth Grill, located near the elephants, and enjoyed some delicious food that is locally-sourced. We also brought in some of our own snacks, primarily so that our toddler wouldn't have a hunger melt-down.\n\n*parking is free and the lot fills up quickly. Be sure to take note of which aisle you parked in so that you can easily find your vehicle again.\n\n*there's so much to see that it can feel overhwhelming, but don't forget to just stop every once in a while and soak in the surroundings. You can always purchase the tickets that allow you to visit multiple days, if you have time to do so.\n\nOverall, it's a beautiful zoo and there's something for everyone. So be sure to give yourself enough time to really enjoy it.\n\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic Time!", "Bought a two day pass.\nWe got to see every animal in the park. The weather was fantastic. Everyone who works there and volunteers there are friendly and helpful. We did the VIP tour on day two and I highly recommend it. We got a private tour and learned a lot about the animals. We were able to see a tiger up close, feed Galapagos turtles, Giraffes and Okapi. Our guide Staci was wonderful. We had a nice sit down lunch at Alberts too. Love the San Diego Zoo. They really care about the animals and the park is really clean too!\nShow less"], ["Reviewed 1 week ago", 4.0, "geat place for families", "the zoo has an amazing array of wildlife and is in a perfect setting. I have had year passes and it is a great place to go with both friend s and family."], ["Reviewed 1 week ago", 4.0, "AMAZING", "The zoo is wonderful. We spent between 3 and 4 hours there. I would have given it 5 stars, but as others have said, the map that is provided is hard to follow. We had to double back a few times, which was tough because the zoo is quite large. You need comfy shoes and be prepared to walk up come fairly big hills. They do offer a AAA discount, which is easier than Groupon.\nShow less"], ["Reviewed 1 week ago", 3.0, "Felt obliged to visit but not sure about zoos !", "Given this was a recommend excursion, we thought we would visit - we struggled with the limited space some of the animals had, compared to in the wild, but consoled ourselves with the conservation efforts of the zoo - well thought out landscaped areas and the bus trip was helpful tip at the outset for orentation - cafes were busy and expressive and food mediocre.\nShow less"], ["Reviewed 1 week ago", 5.0, "So many animals!", "I visited the San Diego Zoo while traveling alone on business. It was a great place to kill some time without feeling out of place because I was alone. They have so many beautiful animals. I got to see pandas, elephants, penguins, polar bears, and even a baby hippo! I highly recommend a visit to this zoo - whether alone or with companions!\nShow less"], ["Reviewed 1 week ago", 5.0, "Get Ready to Hike!", "Our first trip to San Diego and we knew that the zoo was on our short list of \"must do's\" and we were right! Thankfully we were warned about all of the walking we'd be doing because we were prepared with comfy shoes and water bottles! We opted to do the Discovery Cart tour and that was a nice break from the walking. The zoo was second to none, in my opinion, when it comes to the variety of animals and the atmosphere. We arrived early (before 9) and stayed until nearly 4:30 so I recommend making sure you have the good portion of the day if you are going to take your time to see most everything.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great zoo, better laid out for animals than people", "This zoo has some really fantastic settings for its animals. The gorillas are in a spectacular open area the roam. Seems many of the habitat setups, while wonderful for the animals, make getting around the zoo and observing them more difficult especially with younger children. But better to error on that side than the other.\nShow less"], ["Reviewed 1 week ago", 5.0, "Spent 4 hours there", "Great zoo! Do the free double decker bus tour! It got bed a nice overview. Then go see your favorites."], ["Reviewed 1 week ago", 5.0, "Beatiful environment- animals and plants", "This is an amazing place. They have just added new areas too so if you were there in the past, go again to see the new areas. The horticulture is as wonderful as the variety of animals....I love the cats, elephants and and many animals I have never seen. It is a bit expensive, but if you are a local buy a membership and visit often. It takes a full day or 2 to see the whole zoo.\nShow less"], ["Reviewed 1 week ago", 5.0, "The Best Zoo in the USA", "Purchased a one day pass and spent 6 hours at the San Diego Zoo. But even 6 hours was not enough to explore the whole zoo. We saw 2 pandas, a group of gorillas, orangutans, Amur leopards, snow leopards, mountain lions, camels and a whole lot more. We took the skytaxi and travel on a bus tour.\nShow less"], ["Reviewed 1 week ago", 3.0, "Great Zoo... for the people", "The zoo itself was lovely. Beautiful gardens. Spacious walkways. Lovely scenery. It was very large with huge variety, something quite surprising for a Zoo in such a large city. The food was reasonably priced and it was kept clean. A zoo for the people.\n\nFor the animals ? Debatable. Some enclosures were fantastic and seemed to be very well spaced, and suitable to the animals requirements. Others, not so much. I couldn’t bare to look at the poor Polar bear walking through dirt with a few small piles of ‘snow’ scarcely piled on the dirt . He looked hot and tired. The same goes for the 6 giraffes in an enclosure not much bigger than a average size back garden.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great variety of critters", "If you enjoy zoos you don't want to miss this one. Whatever your favorite animal(s), you can probably find one here. You could probably spend several days here and still not see all the animals. In spite of going on a busy Sunday we were still able to wander through without feeling overly crowded. Some exhibits (the pandas for example) had queues so we gave them a pass.\n\nAt this visit a number of the animals were looking after new babies, including the hippo. It was fun being able to observe the hippo family from an underwater viewing spot. A number of the apes and baboons were also looking after youngsters.\n\nIn spite of it being busy there was no problem finding a spot for a bite to eat. If I had one complaint it would be with the provided map, which proved somewhat hard to follow.\nShow less"], ["Reviewed 1 week ago", 5.0, "Winter break in San Diego", "Great Zoo. You must see San Diego Zoo. Many options available for viewing the Zoo. We used the bus tour. And the Skyfari, a gondola sky ride from one end to the other. Great exhibits, good food, very clean grounds."], ["Reviewed 1 week ago", 5.0, "Fabulous for families!!", "This is a must do in San Diego. Take an entire day!! It is so enjoyable!! My opinion is that it is the best zoo in the world!!!"], ["Reviewed 1 week ago", 5.0, "World class Zoo", "The highlight of our visit was definitely the orangutang exhibit and the elephants. We waited about 35 min to see the pandas which felt long. We dined at the rooftop cafe which had lots of options for my large group.\nI was with a group of 6 work colleagues and were tired after 3 hours, can’t imagine how families with small children get through the entire zoo.\n\nTip: at the airport and conference center there are 5$ off coupons. One of my friends used her student ID to get 6$ off the day pass.\nShow less"], ["Reviewed 1 week ago", 5.0, "First Time Here", "We got this attraction as part of our GOLA pass. It was so lovely seeing all the cute animals. Grounds were very well kept. I appreciated the staff member told me to get rid of my straw and lid to keep the animals safe. Also a bonus being able to walk around the Zoo with a beer at 10am on a hot day.\nShow less"], ["Reviewed 1 week ago", 4.0, "Awesome Zoo", "First of all, we attempted to see the zoo in one day. Almost impossible. We rode the guided tour bus (1/2 hour tour). I wouldn't recommend it. It's hard to see the animals from the bus. While we didn't do it, I wished we would have booked one of the experiences. The children got restless walking around for 4+hours (ages 8 - 10). The pandas were asleep. Find out what time the keepers will feed them when you arrive and plan accordingly. What made the zoo so amazing were the guides at many of the animal areas. They told you about the species and were really informative. The Koala exhibit was great! Go there first. They feed them at around 9:30.\nShow less"], ["Reviewed 1 week ago", 5.0, "A don't miss attraction!", "Wonderful day at the zoo. So much to see. Pick your favorites before you start. Beautiful habitats. Very clean. Informative staff and volunteers added to the enjoyment."], ["Reviewed 1 week ago", 3.0, "Always a zoo", "If you don’t understand, this is one of the best zoos in the country. Diverse animals and excellent staff. That being said, some overt flaws.\n\nReally like the aerial tram. Bus tour ok.\n\nPanda area is obnoxiously packed and decided to leave after waiting 30 minutes and moving 15 minutes.\n\nLarge layout and hilly terrain make it challenging to navigate.\n\nIf I lived in SD, I would be a member and visit pieces regularly. As a one time visitor, feel like our day here was simply not worth it with our very young girls.\n\nMaybe the safari park will change my view in the future.\nShow less"], ["Reviewed 1 week ago", 5.0, "Family visit", "The zoo is a great place to visit. Summer nights has a lot of activities and shows to see. The kids will love the bus ride. Be sure to take the Kanagroo bus so you can get off and on at the different stops and not have to do too much walking.\nShow less"], ["Reviewed 1 week ago", 5.0, "The World Famous San Diego Zoo", "This is a wonderful place for locals and visitors as well. There are $5 discounts located at the visitor's centers, the airport and some hotels. The hop on hop off bus allows you to get to some of animals that are farther out, stay as long as you want and hop back on. Lots of different types of food and drink.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best Zoo in America", "We have been wanting to see this world famous zoo for many years. Finally, we got to experience a full day with all the animals, reptiles, birds, etc. and many other visitors. We started with the bus tour first, and we would recommend that for everyone going to the zoo for the first time. The driver - guide was very entertaining and provided tips for traversing the zoo efficiently and in a manner to see the animals when they were a little more active. It takes a full day to get around the zoo and you will walk at least three miles. Make sure you ride the cable car. It will give you a different perspective of the layout of the different parts of the zoo. It was a nice special day and a must see gem in San Diego. This zoo rocks!\nShow less"], ["Reviewed 1 week ago", 3.0, "Enclosures a bit small.", "Firstly for a major attraction and international guests maybe offer wifi as we couldnt contact our ride back to the city or book uber.\nWas an ok experience except many enclosures are baron and small. For the animals we were able to see many looked bored which i would be too if in a small pen all my life. Left the zoo feeling sad for the animals.\nShow less"], ["Reviewed 1 week ago", 4.0, "One of the Best I've Seen", "This is a whole day project what we did at the start was take the main tour bus the zoo provides to get our bearings of the place then we dismounted and hit the main exhibits we were interested in. This place is HUGE make sure you have a good pair of walking shoes and make use of all the rides that the Zoo allows with you ticket admission. I saw animals that no other Zoo has and the fact that San Diego is in it to try and establish these animals back in the wild is a bonus.\nShow less"], ["Reviewed 1 week ago", 5.0, "Highlight of the trip", "We had been wanting to visit the zoo for years but hadn't made it to San Diego. Recently we made it!\nWe purchased tickets online and bundled with another attraction to offset the admission price. Parking was free and a large lot at opening time in the morning. They had a small opening ceremony with a macaw release and flyover. When the gates opened everyone headed off in different directions.\nWe had a fabulous day with no crowds in the middle of the week. No lines, we saw all the exhibits and rode the skyfari twice. There were people in red shirts located all around to answer questions and point you in the right direction. It is large and some exhibits are off on their own. Get a map at the entrance and follow signs.\nThere are many options for snacks, drinks and meals. We kept refilling our water but stopped for ice cream in the afternoon. A number of nice gift shops.\nThere are free kangaroo buses that you can ride between sections of the zoo. We took the free zoo tour bus later in the day and enjoyed that also.\nWe really got our money's worth, spending almost the entire day and loved every bit of it. Fabulous habitats for the animals and we saw many eating or playing.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing!", "A must do while in SanDiego. We took 4 kids from 8-15 and they all loved it. The scenery is beautiful and such a great collection of animals. We live in Columbus, so have a great zoo to compare this too and still loved every minute of it! The bus ride and the air tram was an extra special bonus included with admission.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best Zoo great conservation", "Great zoo with so many different species of animals which seemed to be very well looked after .In much larger environments than many zoos we have been too. Great conservation and give you a good understanding of our impact in these beautiful animals.\nWould recommend and great value.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wonderful experience", "Walking through the San Diego Zoo was like doing an educational nature walk. First and foremost, the enclosures looked comfortable for the animals and very humane. All the animals looked \"happy\". Of course the animals are spectacular to see. The layout of the zoo is such that visitors can walk as if doing a long hike. It didn't seem like we needed to constantly check our map or figure out where we were. We just kept walking and following the path. There were facilities and eating places at decent intervals so we were comfortable all the time. We spent about 5 hours at the zoo without stopping for a full lunch and really enjoyed the day.\nShow less"], ["Reviewed 1 week ago", 5.0, "Best zoo out there", "Love this zoo! Of course there are the pandas and my review could stop there. But the architecture and the whole layout and design of the zoo is just sets it apart from any other zoo out there."], ["Reviewed 1 week ago", 4.0, "Hop on the bus", "The double decker bus takes you through the zoo in about 30 minutes. You can then go spend more time at the areas that you’re most interested in. The gorilla exhibit was a hi-light of the zoo, but some zoo staff were standing in the front corner showing the gorillas a book and pictures on an iPad. The staff member was very tall and made it hard to get good pictures of the gorillas because he was right in the front of the glass where the gorilla was sitting. We heard people complaining about this. The staff members should have clothes on that identify them as zoo staff or zoo volunteers.\nShow less"], ["Reviewed 1 week ago", 5.0, "ANY age....pls go!", "Worth every dollar you spend..... The zoo is amazing, fun, interesting and very well planned. Great explanation. We learned a lot. There is a SkyGondola you cannot miss"], ["Reviewed 1 week ago", 5.0, "Great day in a beautiful zoo", "Had a wonderful time at the San Diego Zoo. Overall the zoo is very clean and the staff super friendly and helpful. The exhibits and variety of beautiful animals was amazing. Loved having docents and park experts to educate guests at exhibits. Great for folks of all ages. Be sure to take the bus tour -great overview of the park.\nShow less"], ["Reviewed 1 week ago", 4.0, "Grand Day at the Zoo", "Bring your walking shoes. The San Diego Zoo is vast! There are so many exhibits it is hard to keep track. Luckily there are maps everywhere to help you. I would definitely tell you to take the gondola across the park and to make sure you see the aviaries. It was so much fun to get up close and personal to the tropical birds. I have loved being able to see the various enclosures. I would suggest bring some water bottles and snacks to carry around with you if you get peckish easily.\nShow less"], ["Reviewed 1 week ago", 4.0, "Our first visit in more than thirty years", "My wife and I hadn’t been to the zoo in over thirty years so we decided to visit. It was a perfect sunny day. We enjoyed it. It was great seeing all the different animals. They do bee to improve the lines situation for the tour buses. It was quite disorganized.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wonderful exhibits", "The zoo is well planned and laid out to mimic the animals natural habitats. We were able to easily view most animals even though this particular day was pretty crowded. Be sure to take the bus tour early in the day. It gives a nice overview. Plus, you may want to go to the Panda exhibit early as well. When we arrived after lunchtime, the line was very long. We purchased the combination ticket for the Zoo and Safari Park and saved. Food is pricey but you can take in your own.\nShow less"], ["Reviewed 1 week ago", 5.0, "Easy to navigate and a great day to spend with some amazing animals.", "I've always heard this was the best zoo and it was pretty awesome although I've only been to a handful of zoos so I don't have much to compare it to. The exhibits looked realistic and amazing, more importantly, the animals seemed happy and comfortable.\nI felt like I was in the jungle in the avairy and it was a magical place to relax in. It was a beautiful experience to look into the eyes of a gorilla and to appreciate the similarities in their hands.\nI loved the gondola ride to the far end of the park and if I were to return, I would start with this and work my way down the hill to the African exhibits and save the pandas for last since there is a strangely crowded line to view them which seemed mostly jammed by strollers that folks aren't able to move around to keep the crowd moving.\nWe took the bus tour around the park and somehow still ended up walking about 5 miles that day. What a great way to spend the day and learn about these amazing animals!\nShow less"], ["Reviewed 1 week ago", 5.0, "Really Nice Zoo!", "This place is huge! Recommended for anyone. We took the bus ride around the park first. Then we started walking. They do have on and off buses and an overhead tram ride. Animals where out which was nice since the temps were in the high 60's.\nShow less"], ["Reviewed 1 week ago", 4.0, "Sunday visit", "A full house on Sunday! But the guides kept everyone moving. We took the bus and although it passed all the important stops, those on the wrong side of the bus couldn’t see the animals and some of the cages were blocked by sightseers. The map provided to visitors was so so. The wonderful hilly terrain wasn’t referenced. Still, once on the ground and asking lots of questions brought us in contact with a superb setting of animals from around the world. Plan on a minimum of 3 hours to enjoy just part of the showings.\nShow less"], ["Reviewed 1 week ago", 5.0, "Almost natural", "San Diego zoo is quite the place. It has evolved into a natural setting for the animals kept there. It is amazing to see the natural habit of the adorable koalas nestled in the tree poles (it was a cold, damp, day when we visited). The pandas are delightful as are the elephants One visitor was showing a gorilla a movie from his device and the animal put his hand up on the glass as if he wanted it but remained their mesmerized by what he/she was watching. To see these animals interact is almost heartbreaking to think they are not in their native home but each has a story and they are certainly well cared for in the zoo as opposed to being hunted by poachers in the wild\n\nWorth the trip to see the animals\nShow less"], ["Reviewed 1 week ago", 5.0, "The Best 🐘 🦒 🐅 🦍", "What a fantastic facility , the place is huge and covers just about every species on the planet . Enclosures are massive and the animals all appear to be healthy and happy. Walks between exhibits have some superb plant life. Highly recommend 🐯"], ["Reviewed 1 week ago", 5.0, "Beautiful day and modest crowds on friday", "With a teen we cover a park quickly. We saw everything of interest in 5 hrs including 2 snack and meal stops. Seeing animals about 80% of the time was related to starting at 10 am and low 70s temperature. The pandas are great but I don't love that they make you get a photo taken. I'll pursue that if I want it thank you. The polar bears were putting on a show! Great place to get some exercise. Wat only to survive while in the park. It is typical junk food. Buy one refillable drink early and refill for $1 all day long.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic", "The Zoo is a amazing. it is easy get around. We had a great time, get ready to do some fun walking. The staff was very helpful."], ["Reviewed 1 week ago", 3.0, "Visit San Diego", "Very huge Zoo.. good that theres a walkalator going up after roaming all around the zoo which is going deeper down. Theres also elevator so it helps. Well maintained."], ["Reviewed 2 weeks ago", 5.0, "ZOO!!!", "Lions and pandas and hippos!! Oh my. Outstanding collection. Make sure you wear the MOST comfortable shoes. There is so much to see."], ["Reviewed 2 weeks ago", 5.0, "Amazing Zoo", "Came here with my 4 & 14 year old sons. We all loved it. Amazing array of animals and plants. Great exhibits. Sky ride and bus tours were also a fun time. Lots of great photo ops and displays. So glad we had the opportunity to get to experience this zoo\nShow less"], ["Reviewed 2 weeks ago", 5.0, "First time back in 22 years", "Last time here, had 4 screaming toddlers, and we lasted one hour and left. This time, just my fiance and I, and we had a great time. We did all the extras as well, including the shows and guided tour. We liked the raised walkways, and found it to be very clean and organized. The staff was extremely helpful, and did not find kids with attitude working the park.\nHighly recommend for couples and families.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful zoo", "Lots of animals to see, great exhibits - a little pricey for tickets. Would be nice if they had a family discount rate (There were 7 of us). The Kangaroo bus is a great way to get around the zoo. Had a fabulous time."], ["Reviewed 2 weeks ago", 3.0, "Ok zoo -- very hyped for the experience", "I am from the midwest and was a little disappointed in the zoo experience. It's very caged feeling. The Omaha Zoo is far better, in my opinion."], ["Reviewed 2 weeks ago", 5.0, "Outstanding - great day out at SD Zoo", "Having visited Singapore Zoo on a number of occasions we were aware of the reputation of SD Zoo. The two seem to jostle for ‘number one’ spot (if there is such a thing for zoos).\n\nHaving now visited SD Zoo I can say they are both magnificent in their own way. The most important thing is that it seems clear the welfare of the animals is paramount. And that the staff live their jobs - they made our visit all the more memorable. We had a truly fantastic day. Although we went on a relatively quiet midweek day I think the place will happily accommodate larger weekend numbers of visitors with no problems. Plenty of space for visitors. 10/10 for me. Thank you.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Day at the zoo", "Very well laid out zoo with an amazing variety of plants and animals on display! Most of which were asleep unfortunately! Recommend the day pass so that you can take guided bus tour and skyfari aerial tram."], ["Reviewed 2 weeks ago", 5.0, "Amazing ZOO with a new corner to explore during every visit", "I have visited San Diego ZOO multiple times, both alone, and with my family of 3 kids during past few years. There was always a new discovery, new path and new experience available, mostly as a surprise when finding a turn we have missed the last time. I really appreciate it is not an \"amusement park\" with more souvenir stands then amusements. The best is when there is a time to just stand still and observe the animals.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing way to spend a day!", "Went with our kids. Great staff and great facilities. Lots to do and see. Recommend the bus ride to begin with to get the lay of the land."], ["Reviewed 2 weeks ago", 4.0, "Nice zoo", "They do have pretty strict regulations around the place. My son went to go pet a outdoor bird as any child would and they were extremely vehmenr towards us. Other than that one incident its was a great experiance!"], ["Reviewed 2 weeks ago", 5.0, "Make a plan to get the most our of your visit", "Yes, it's pricey to get in, and yes, it's crowded, but you can see animals here you won't see any other zoo in the US. We only had a day, and not even a full one at that, so we made a plan to catch the animals we were most excited about - the pandas, the koalas, the big cats, and the reptile house (my daughter's choice, not mine!). One thing to keep in mind, it is VERY hilly. As in, the zoo is positioned over a ravine and half the exhibits are on top and the other half are on the bottom. I'm amazed there aren't daily run-away-stroller incidents. Make use of the skytran and the kangaroo hop on/hop off bus or you'll wear yourself out. And there's plenty of beer and cocktails around the park for weary parents!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Zoo I've Ever Visited", "Beautiful, clean, zoo with absolutely amazing animals and habitats. This is a don't-miss attraction. But, it is VERY expensive. Staff and volunteers were very friendly and knowledgeable. Zoo food was meh. The zoo also also runs a Safari Park outside of San Diego and you can get a combo ticket. The safari park was also excellent. Can't say enough good things about this zoo!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So fun!", "The San Diego Zoo was so much fun to explore with my husband & one-year old baby. We enjoyed walking all day long, six miles! Make sure you wear comfy shoes. It was easier for us to bring our own stroller & it fits virtually everywhere in the park. If you didn’t bring a stroller, the zoo rents them to you for convenience. We also enjoyed bringing our own food in which was no hassle at all & saved money for our family but all the food there smelled delicious!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great place to spend a pretty day!", "Really great zoo. The environment is so authentic. You could spend a whole day or two going through, depending on your pace and your interest in the various animals. It is a lot of walking for us old folks, but made easier by the bus ride through the park and the aerial tram to take you from one area to another. They also have a trolley type thingy that will carry you from one part of the zoo to another. We hadn't been to a zoo in a long time, but are really glad we went.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "The ZOO", "Very nice experience, a lot of exotic animals.the weather was very good, and we stayed at the park for three hours, a bit pricey, but we enjoyed ourselves"], ["Reviewed 2 weeks ago", 2.0, "Overrated - Where's the Animals?", "First time ever at the San Diego Zoo I had heard so many great things about it, one of the best zoos in the world. I was very disappointed. Most of the cages were empty, and we were fortunate just to see an animal sleeping. The map was extremely difficult to follow, and the flow of the exhibits was all over the place. The zoo had a very large variety of every type of species in the World, however they were very difficult to find and it seemed like the majority of the cages were empty. I did enjoy the Panda, Koala, and Polar Bear Exhibits.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "It’s all happening", "One of the best zoos in the country. The exhibits are beautiful and very natural. They must be taking good care of the animals because they were all very active which made the visit a lot of fun. I saw several endangered species!\nMy only disappointment was with one of the cafes. They promised me a gluten free meal but it was so heavily contaminated I became very ill.\nThe walkways are wide and smooth and easily accommodate wheelchairs and strollers. There were lots of restrooms and they were really clean.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "What a zoo!", "The San Diego zoo is one of the best no doubt about it. The size is amazing and the variety of animals is impressive. Not to mention they have pandas. The kids will get tired so bring a stroller. The facilities are well maintained and I do like the layout of the zoo. If I lived here I would go more often. Worth visiting if you are on vacation and love animals.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "San Diego Zoo a Must", "Visited on a 70 degree Friday and the zoo was everything that we’d always heard about. The narrated bus trip around the zoo at the beginning of the visit is a must. Helped acclimate to the zoo."], ["Reviewed 2 weeks ago", 5.0, "So Much to See for All Ages", "We spent a day wandering through this amazing zoo looking at a wide range of animals and enjoying tremendous flowers and vegetation.\n\nWe started the day with a free bus tour of the zoo which really helps you stay oriented.\n\nFood and drink was pretty expensive but it was really nice that they would refill water bottles purchased on site.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "One of the Best Zoo's In CA", "This zoo has gone from good to great with all of the renovations. The cageless enclosures are such a welcome. There is a wide variety of animals and will take most of a whole day to see the whole zoo. Compared to the LA Zoo, its awesome.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful Zoo", "I dislike zoos on principle, but I do understand they help with research and breeding programs to help keep certain species from extenction. This is a large well run zoo with some animal species I had not seen before. The habitat is beautiful but very hilly. Plan on walking up and down ...a lot! It is sometimes difficult to figure out where or which way one needs to go to find specific animals. I wish the maps indicated whether we needed to go up or down the hill. There were many volunteers stationed around to help and to tell us more about the animals. All of the staff and volunteers wre amazing. Wonderful place for children (and adults) to see, learn about and appreciate our precious wildlife.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Really pleasant experience at the zoo!", "We had a fantastic experience here and were there from 9am-9pm, and barely saw everything. That being said, we LOVE zoos and really take it all in. We read all the information signs, watch the zookeeper experiences, watch some of the entertainment, etc. We got a Groupon, which brought down the price considerably. The zoo got much busier as the day went on. There were so many animals to see, and things to do. One relatively big part of the zoo was under construction but wasn't clearly marked as such. Lots of walking at this zoo. Take the bus tour in the morning before the lines get long, and see the zoo in its entirety. After that, then spend the rest of the day walking to all the exhibits, and seeing them in depth. One of the best zoos we have been too. We bring our own food and drinks in to enjoy so we don't have to purchase overly priced items there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great day time trip", "This was one of the first things we did on our trip. It was a very nice spot. If you are into animals, this zoo has thousands of varieties. You can walk around the park. You can also take a double decker bus. Which was cool. You can also take a sky car over the zoo. For us this zoo had many animals that are zoo by our house does not have. The zoo also has great places and options to eat. Themed by the areas you are in. Very neat. We ate at a couple locations and the portions were very large we shared each time. Also if you get the souvenir glass, you get free refills that whole day and if you come back it is only a dollar any other day. Good deal. Worth it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent day, sore feet", "This zoo is absolutely amazing. It is a huge park with so many things to see and places to wander that it is easy to get turn around.\nAbsolutely take the bus tour through the park before starting any other adventure. It helps you get an idea of where to go and how to plan your day.\nA hop on hop off bus also runs throughout the day that can save your poor feet. There were babies for the giraffe and hippos. The gorillas also had young. As this is a preservation and research facility/zoo I felt good about visiting and supporting it.\nMy girlfriend loved it beyond words. Only downside was our feet hurt a lot after 9 hours of walking and standing. But it was so worth it.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Over priced and over-rated", "The zoo was what you expect from a zoo but the map is confusing and it was hard to get to the exhibits we wanted. More signs are needed."], ["Reviewed 2 weeks ago", 5.0, "A zoo can be more than a zoo", "Starting the day with a bus tour of the park, riding in the lower section of the double decker bus, enabled us to figure where we wanted to go to see for a leisurely time. It was a warm day and I suggest having cool water with you. There is a restaurant near the top elevation of the zoo which is great. Make a day of it at the zoo and the animals will love you for paying them some attention.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow!", "There's just so much to see. After they finished the new Africa Rocks exhibit its really difficult to see everything at the zoo in 1 day now."], ["Reviewed 2 weeks ago", 4.0, "Good zoo!!", "We loved the zoo but we were disappointed that we didn't get to see some of the animals we wanted to see. There isn't enough time to do what you want in one day. Some animals were displaying \"repetitive\" behavior such as the polar bear he was pushing himself off the rock touching the same spots over and over he almost looked like a mechanical bear. While the female bear acted like a normal bear. A raccoon was pacing back and forth in his cage(stopping at the same spots), a leopard was also pacing back and forth over and over, and a male gorilla was back on to the glass watching the other gorilla and ever 10-15 seconds he would look at his hand. The food was a bit overpriced as well.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So many baby animals!", "So a zoo is a zoo, except that this one, for the most part, has animals that are active and as interested in us as we are them. My memory of visiting zoos in the past is peering around a pen, cage, or tank, trying to find the well-camouflaged animal. That was an issue with relatively few animals, and the number of young animals, from monkeys, to panda, to hippo, to giraffe was unparalleled. Obviously these animals are pretty content to be here.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A day at the zoo", "What a fantastic zoo. We loved everything about it. We had one person in a wheelchair and the “pusher” was admitted free. Most of the property is very handicapped accessible. A must-do is the bus tour of the zoo. Do the bus tour early to get a good overview of all the available attractions.\nFood and beverage options are plentiful and reasonably priced. The birds, reptiles, and animals are well cared-for and are, generally, easily viewed.\nVisiting the San Diego Zoo and Balboa Park are highly recommend for families and people of all ages.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "I Love this Zoo", "We have been to this zoo many times and it always has impressed me. It is so clean and offers such a variety of animals and information. We purchased the zoo pass with the bus tour and found that to be so worth the extra money. We also purchased the sky cab, it was so awesome to be so high up and see all around Balboa Park. The restaurants are knowledgeable on Celiac disease and how to make sure my food was not cross contaminated with gluten. The staff were friendly and helpful when we needed assistance or had questions. There is a lot of walking and hills so wear good shoes.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Overwhelmingly large; similar to most zoos", "You can't see this all in one day, and honestly, I was a little disappointed. It is a great zoo, world renowned, but not many hands on experiences and feels a little dated. Strollers are a must with small children and you can't believe the amount of hills in this place. If you like zoos, this one you have to check out. But there are much more exciting things to do in San Diego than go to the zoo.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "More animal activity than I have ever seen at a zoo", "The polar bears were enthusiastically play-fighting. The hippo was frolicking around his pool. The tapirs were nuzzling and playing in their pool, The otter was searching for the snacks a keeper had tossed about his habitat. Even the koalas were clambering about their trees, eating eucalyptus.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Large business group gathering and dinner at the zoo, worked out great!", "Our large business group spent an afternoon and evening with dinner at the zoo.\n\nThe zoo had prepared and ran a treasure hunt type event for us. Causing our numerous teams to scramble across this expansive zoo, with time pressure, and the need to find answers to questions, tied to clues on where to find them. Wow, we went everywhere, and fast!\n\nThen we still had time to check out the zoo on our own. As a zoo, this is the best I’ve ever visited. Great and incredibly diverse exhibits. Lots of animals here that I hadn’t seen before. And typically in nice expansive setups.\n\nOur dinner was a buffet type setup, but they handled our large group easily and efficiently. Before dinner there were some zookeepers bringing out various animals for us to learn about and see up close.\n\nWas a great event! Enjoyed by everyone.\n\nEnjoy\nShow less"], ["Reviewed 2 weeks ago", 4.0, "So Much to See", "Love the attention to and focus on saving animals from extinction and environmentally conscious policies like biodegradable silverware. Definitely recommend taking the 35 minute overview bus to get a sense of what to see. Our guide Nicki was so enthusiastic and knowledgeable! It was a joy to hear the screams of delight from the children on board when we’d see the elephants or monkeys or really just about any animal. It would be helpful to have better signage in Balboa Park from the trolley to the zoo. We wandered a bit to find the entrance. We really enjoyed seeing the koalas, flamingos, giraffes, and kangaroos.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful Zoo", "Great zoo in a lovely setting. The enclosures seem large and the animals seem happy. The planting around the zoo is beautifully done. Parking is free but I thought ticket price was rather expensive. On balance though worth the money."], ["Reviewed 2 weeks ago", 5.0, "Go early in the morning", "We got to the park when it opened on a weekday and it was PACKED!\n1. Head to the bus tour, which is free if you buy a day pass (but extra if you have an annual pass). The bus toor takes approximately 35 min and gives you a great overview of what there is.\n2. See the Tasmanian Devil and the Koalas\n3. Sky Tram\n4. Reptiles\n5. Squeeze in the animal show if you can\n\nWe were exhausted after our half day here. The food isn't terrible but we were hungry and wanted to go to Little Italy so we left when our stomachs started rumbling.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fantastic Zoo", "Spent an entire day at the San Diego Zoo and loved every minute of it! Not just for kids. My husband and I were in San Diego for a convention and our trip to the zoo was one of the highlights of our trip. It’s obvious the animals are well cared for. The staff was friendly and passionate about what they do. Well worth the admission price. We arrived an hour after the zoo opened and wished we had arrived sooner because we were rushing to get everything in as the closing time approached. Will definitely return if we’re in the area again!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best vacation ever.", "Don't wait until you are 60 to visit this fantastic zoo. It's world-class. It's huge and has the best transportation throughout the park."], ["Reviewed 2 weeks ago", 5.0, "So much variety!", "Wow! This zoo is jam packed! So many animals to see and sectioned together well. Although we did get a bit lost at times and tried our best to see every inch of the place - allow yourself the full day to do so, it’d be a shame to miss anything. Hot tips would be to go to see your bigger animals around 12-1pm as this is feeding time. We found it was difficult to view them otherwise because they were sleeping. Wear comfy shoes because there’s lots of walking & hills! Must see would be the gorillas, pandas, lions & elephants! There were a few monkeys with babies which were ADORABLE!! Staff were all very helpful & the landscaping has been so well thought out and cared for. Don’t forget to do the skyfari & just allow yourself the time to explore the park - great for ALL ages!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "You want animals? Step right up!", "Worth every penny. You could walk a lot here so bring supportive shoes and stay hydrated! There are some hills inside, but there are two bus systems and a sky-ride gondola, which costs extra depending on your ticket type. Plan to incorporate these transportation options to conserve energy. The animals and varied, spectacular and mostly very easy to spot. Top 3 attraction for San Diego easily, especially if you have children.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful zoo", "The San Diego zoo is definitely a must see! Do plan to spend the entire day and wear comfortable shoes! The safari bus is a nice way to see the lay of the land and a little bit behind the scenes."], ["Reviewed 2 weeks ago", 5.0, "Great Zoo", "Visited here for the third time while in town. Very hilly so be prepared to walk that being said they have it all. Was excited to see the Tasmanian Devlis. So cool this was a first for me. Koalas are cute great exhibit. Enjoyed it overall. Great food and shops. Pricey to get in but worth the visit\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing zoo - covers 100 acres", "Great zoo, many exhibits, trams and skylights available. From polar bears to camels, they have it all."], ["Reviewed 2 weeks ago", 4.0, "Mother-daughter", "We went on a Thursday, it's was not empty; very clean, (especially recalling my last zoo experience elsewhere) great for kids and adults. We took the Kangaroo bus (my cousin is 8 months pregnant); due to time we only visited the right side of the zoo.\n\nThere are two pandas, Bai Yun (white cloud) born in 1991 in China, and her little girl Xiso Liwu (little gift) was born in 2012 at the SD Zoo. The mom-daughter sleep most of time, as most pandas do.\n\nFree parking.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great zoo for kids and adults", "Had a great time with family and 2 year old daughter there.lots to see. The tour bus wait was a little longer. So if you get there in earlier morning right after they open( 9:am), try to take the tour bus first to avoid the wait. Panda area gets a little crowded too. Other than that, it’s very easy walking and see all kinds animals.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice zoo, Fun. Hills are steep.", "We had a nice day and excellent work out at this zoo. I had big expectations but was not overly impressed. I have seen much nicer views in the aspect of the size of the animal enclosures.\n\nThe hills were massive and gave the zoo a special atmosphere which was pleasing but if you have issues with your physical ability it may be more than you want to take on until the elevator project is completed\nShow less"], ["Reviewed 3 weeks ago", 5.0, "best zoo ever", "our cruise canceled our tour due to lack of interest so we caught a cab (saved $60 by doing so !)\nlarge zoo but very hilly in many areas avoid purchasing at main gate as prices are cheaper inside - we paid double for water at the entrance! this is not right\nShow less"], ["Reviewed 3 weeks ago", 2.0, "san diego zoo", "We visited the zoo yesterday to see the more than 3500 animals and the park. Where were all the animals? The park is landscaped beautifully but is very confusing to get around. A large number of exhibits were closed for improvements. Exhibits that were open were lacking for animals. Also the costs were high, such as a soda was $7 and with a special cup $12. It wasn't very crowded either with people or animals. once again, the park was landscaped very nicely but was a little disappointing.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great time at the zoo", "I went with my brother, his wife and my nephew. It was fun and enjoyable for all four of us. I loved the variety of animals and how things were organized into places of the world."], ["Reviewed 3 weeks ago", 5.0, "Amazing Zoo We Loved It!!!!!", "We went today 2/7/2018 a Wednesday. It’s obviously off season and it was great!!!! Only a few hundred people at the zoo today. No large crowds anywhere. This is a very large zoo with a large selection of animals. We really appreciated how nice all the exhibits were. If your going to walk be prepared to do a lot of up and downhill walking. Nothing to strenuous but there are many hills and stairs. If I lived in the area I would definitely have purchased a season pass.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best zoo in the United States", "Beautiful grounds, great staffs. Awesome volunteers. Active animals. Definitely a five star. Very highly recommend it"], ["Reviewed 3 weeks ago", 5.0, "What a great place", "We have wanted to go here for years and finally made it.\nIt's expensive but worth it.\nThe entire property is beautiful and so well taken care of.\nWe started by taking the tram tour and it's a good way to get the lay of the land and see animals. Our driver and guide was Lee and she was fabulous. Great knowledge, sense of humor and sincerely expressed views regarding conservation and sustainability.\nThe new Africa exhibit is large and impressive. The lemur exhibit is phenomenal.\nGood food choices, lots of rest rooms and friendly volunteers everywhere. Just look for the red shirts and you're all set.\nTruly a world class zoo and a great day.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "One of the best Zoos around", "This is a great zoo and in my opinion one of the best I have ever been to in the States. Typically zoos are geared towards kids, and Does not disappoint. I do have to say that my teens still love going to the San Diego Zoo even if it is just for a nice walk in the park. The animals are well taken care of and you can get some great exercise by walking to seeing everything. You can also get around using the parks buses to get from area to area. There are several different sections or areas of the park and so the park is well organized depending on what animals you want to see.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Environmental friendly zoo", "Really enjoy enjoyed all the great changes the zoo has done in 25 years. It felt like a concrete parking lot last time I was here. Today so glad to see all the improvements.\nWish the GIFT SHOPS would learn that selling T-shirts for $35 doesn't encourage sales.\nSame with food $5.49 for single ice cream cone. So I left without eating or buying anything. Their loss.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful Zoo", "The San Diego Zoo is world renowned and now I know why. It isn't a really large zoo but they utilize every square foot efficiently and it is a maze of up and down trails that wind though the exhibits and beautiful foliage. We started out day by adding the Early Morning with Pandas and we are so glad we did. It allowed us to get into the zoo before the opening and we were taken to the back of the zoo to see the pandas for their first feeding of the day. As a result they were actively eating and moving about. The tour also takes you to other areas of the zoo for some behind the scenes looks, our guide was fabulous and the two hour tour flew bye.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "New Favorite Zoo", "I have been to A LOT of zoos, and this is my new favorite! They really do have a little bit of everything. The place is so big that it didn't feel over crowded, even with the large amount of people there. I would suggest starting off the day taking the bus tour. This allows you to get your bearing of the grounds and establish a \"game plan.\" Plus, you are provided with a lot of interesting facts along the way. The tickets are a little more expensive than the average zoo, but I feel the price is worth the experience. That money also goes to some wonderful conservation efforts.\n\nThe only downfall of the day, the Chinese restaurant, by the Panda Exhibit was not very good. However, my personal preferences may at fault here. I still give this place 5 stars!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Disappointingly average", "We came to San Diego specifically for the zoo which is rated as such a high attraction. Although it was pleasant, it was not distinguishable. The layout was less than desirable although the on-off bus was helpful. I thought the price, at $54 a person, would prove to be worth it. It was not. The map of the zoo was very confusing, not at all helpful. There was so much on the map that it was frustrating to find specifics. Not a single Bear, other than the polar bear, was in a viewable area. They were all comfortably snoozing behind giant rocks—great for the animals but disappointing to guests. The zoo was well maintained and the animals all appeared to be healthy. I did not expect the flamingos to be the highlight of my visit to a supposed world class zoo.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Still awesome after all these years.", "The last time I was here was 53 years ago and this place still is fantastic. The animal exhibits are very interesting and all the plant life throughout the zoo makes it feel like a huge garden. Well worth the price."], ["Reviewed 3 weeks ago", 5.0, "World class in every sense", "World famous for its reputation for animal conservation and unique in its creation of realistic habitats for its collection, I couldn't wait to pay the zoo a visit. The aerial ride gives you a sense of the unusual geographical location of the zoo in Balboa Park but up and down existing canyons and valleys and hills. The layout allows you to take a leisurely walk and see most of the collection in a couple of hours. Loved the gorillas at lunch, a surprisingly active pair of pandas, a swimming polar bear and some stunning flamingos were the highlights. It has to be at the top of the list for visitors to San Diego.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must go!", "We are long time members and still there is always something new to see or experience. Africa Rocks is amazing and a really nice addition."], ["Reviewed 3 weeks ago", 5.0, "Awesome!", "The Zoo is world renowned and simply a “must see” on your to do list. Facilities for the animals are very good and their areas are well cared. There was a bit of a wait for the Sky Tram, but the views are worth the wait. Concessions are pricey, but proceeds go towards the operation of the Zoo, their international programs and of course the animals.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "one of the worlds best zoos, hands down", "Been here a half dozen times over 50 years and its always a treat. Went on a Saturday in Feb and it was crowded, but not as crowded during some other visits that were later in the year. Temperatures were 75 and very comfortable. Recommend going in the winter months when its n to raining since this is the rainy season. It's quite warm in the other seasons, but certainly doable. Saw some new exhibits this time. Took the 45 min tram door that gives you and overview and good for those who can't walk the steep paths easily. It is wheel chair accessible, but avoid the steeper sections. Take the Gondola to get to the far side of the zoo and walk back toward the entrance to reduce the walking. This is a very big zoo. Plenty of places to eat at moderate cost. Entry fee was $54 for adults, but there are a lot of add on tours you can do and significant cost. Parking is at the zoo entrance and free.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice family trip", "I took the fam to the Zoo for a special treat. The park was beautiful and we couldn't have asked for a better day! I usually do not go to places like this as I have a hard time seeing animals in captivation. That being said, all the animals seemed healthy and well treated. I took off a star because one of the big cats seemed really stressed and one of the elephants seemed so sad and it broke my heart. My kids and hubby truly enjoyed themselves though,\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Impressing zoo", "This is really a zoo were they take good care of animals and vegetation. It is very large and easy to get lost. We spend one afternoon which is sufficient for us."], ["Reviewed 3 weeks ago", 5.0, "Best Day of the Trip!", "I can't say enough about this Zoo. Their care of the animals and conservation efforts/promotions are second to none. My sister and I did the early morning cat tour, and we were able to see and experience some behind-the-scenes areas and speak with some of the keepers. After the tour, we spent the rest of the day at the Zoo (could have easily spent 2 days). The new Africa Rocks exhibits are great, as are all the others.My favorite were the Koalas, but i thoroughly enjoyed the entire day. If you want to see everything, get there early and plan on staying all day. There is a \"kangaroo bus\" that you can hop on and off around the park, but wear comfortable shoes!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Really cool zoo!", "The San Diego Zoo is so cool. They have pretty much every animal you can imagine, and you could spot all the animals. I highly suggest starting out the day on the tour bus, which is included in the ticket, because you will be able to see most of the animals, then choose which ones to explore up close. The koalas were pretty active in the morning and so fun to see. The zoo is huge, so choose which exhibits you want to see at the beginning. I would love to go back and explore again!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "KIDS AT HEART", "Feels like I have traveled the world. I saw animals from Asia to Polar region. Kids would love it and so is a place for your family but take note sometimes they dont have electricity , probably due to construction that was going on that time.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great zoo experience for all", "The San Diego Zoo is beautiful!\n\nMany of the exhibits have been redone over the past few years to include many species that live together in the wild. The best way to start your day is with a bus tour which gives a great overview. The bus is a double decker with the top being open so be sure to have sunscreen if it is a nice sunny day. The lower level is a great place to leave your stroller or mobility aid should you decide not to sit on the lower level. For the best view of the animals be sure to get an early start. The exhibits make it difficult to see the animals as the day becomes later as they are sleeping. The Tiger River exhibit is great but needs to be viewed early or the tigers are very difficult to spot. Be sure to stop by the Orangatan exhibit. The are delightful and will sit right up against the glass to interact, especially with children! There is also a great Children's zoo section with sheep and goats that the children can pet. The terrain in the zoo is quite hilly so anyone with mobility issues should use the transportation service provided by the zoo which will pick up and drop off at certain stops in the zoo.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Stressed animals", "I know San Diego Zoo is world renowned and they are doing a great job with most of there animals. But some of there animals were showing signs of stress I.e pacing and repetitive actions.\n\nZoos have a tuff job caring for there animals. In many cases saving animals from the brink of destruction. Personally I feel old city zoos with limited space for there animals needs to move to a space that lets there animals live as they would in the wild\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The best Zoo", "It was the best zoo I ever visit because it joins African, Artic and Forest animals on the same place. The koala was amazing as well."], ["Reviewed 3 weeks ago", 5.0, "Iconic and world-renowned Zoo", "There is not one single foot of space in this zoo that I would not recommend. The new children's zoo is a must if you have little ones. Truly, this is known as a one-of-a-kid attraction- if you are in San Diego, put this on your MUST SEE list.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best zoo ever", "I live in San Diego and never tire of visiting our zoo. We are always finding ways to improve the habitats and the viewing experience. There is a new bridge connecting to the elephants and a wonderful area with African penguins, baboons, birds, and lemurs. I have been on safari in Africa and I still love to see the animals at The zoo.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A MUST FOR ALL PEOPLE IN SAN DIEGO", "The San Diego Zoo is great for everyone, including adults without kids. If you are new to the zoo or have not seen it in a long time, I would suggest starting with the bus tour. Then don't miss things like the monkeys, apes and the bird aviaries. (The bus doesn't go to those spots).\n\nIf you have a full day, that is best. If not, try when it's not too hot so the animals are more active. I'm partial to the monkeys but everyone has a favorite.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fantastic Experience", "This is a zoo beyond parallel, the flow is very natural from exhibit to exhibit. There has been a fantastic effort by the designers to provide the animals a decent amount of space to wander, which makes some of the exhibits very expansive. Easily the best zoo that we had even been too. Be prepared for a lot of walking, or jump on the kangaroo bus to hop around. Lots of interaction for kids too.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great zoo", "Very well mantained and organized zoo, you get too see a large number of species, from polar bears to hippos. It is a must if you are in SD.\nI would recommend bring your own food as its very expensive inside and bring comfy shoes, you will walk around 9k steps.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Get up close to all your furry friends!", "We had a blast! Loved the Panda’s, Baby Hippo and the beautiful Polar Bears!\nYes it’s a little pricey, but we were able to score a coupon online. Definitely take the Dubles Bus tour ride first, then you can walk around to the animals that you didn’t see or want to see again. Have fun!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "One of the best zoos in the country", "You really need all day to explore every exhibit, and even then, you won't have enough time. Get there right at 9 and head to the baboons to watch them being released from their indoor space to hunt for treats. Get to the polar bears by noon for an informative talk while the bears are fed treats to bring them up close for better viewing. Don't bother buying items at the outer shops and then lugging them around - most of them are for sale at the shops as you exit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow - Amazing", "This zoo has been on my list of things to do for a while! So glad I made it out to San Diego again.\n\nI recommend you start with the bus guided tour. Takes you on a zoo over view.\n\nThen they have kangaroo busses (hop in hop off) that stop at 4 different locations.\n\nThey also have a a skyway cable car system that transports visitors from one end to the other.\n\nAll three transportations, bus, kangaroo bus, and skyway are included in cost.\n\nMany animals and beautiful facilities.\nMy top recommendations would be:\nPandas\nElephants\nAviary\nSeals\nShow less"], ["Reviewed 3 weeks ago", 5.0, "My grandson meets the animals at the San Diego Zoo", "Had a nice time and the animals were awake and feeding. Mornings are great! Loved the open air roads and exhibits moved quickly. Lots of eating places too and had gluten food available."], ["Reviewed 3 weeks ago", 5.0, "Fun for all ages", "Love this zoo. We brought our teenage daughter and she was thoroughly entertained. Lots of walking so wear comfortable shoes and bring sunscreen. I recommend walking versus taking the many buses available because it is much more intimate and you can get better views of the animals.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing Zoo- Great Family attraction!", "This Zoo is one of the most amazing animal attractions in the world. Excellent modern eco-friendly enclosures and habitat imitating surroundings form the animals. Outstanding Program for husbandry of endangered species and committed to education and preservation.They have a sister park a few miles nort, where animals are roaming is open areas.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The best zoo in the US", "San Diego Zoo by far is the best zoo I visited. The people are friendly and helpful. There is a lot of care involved with the animals and it is really noticeable. They clearly ensure the message is conservation and care of animals"], ["Reviewed 3 weeks ago", 4.0, "Well set out", "My wife & I had a nice time. Very well set out. Lots of animals. Being a little biased I must say Taronga zoo is better."], ["Reviewed 3 weeks ago", 5.0, "Clean. Well set up. Best zoo bar none", "I had not been for a few years. Really neat clean and well run. $$ but worth it. Plan for most of day Use kangaroo bus and tram to save on walking"], ["Reviewed 3 weeks ago", 5.0, "Amazing", "We had the Panda experience when we visited, and can highly recommend doing it, it was fantastic, we got to spend so much time watching them having breakfast before anyone else entered the zoo, it was a truly wonderful experience, afterwards we had a guided tour around the rest of the zoo which was also great, the guide was very informative, it’s well worth the money.\nSeen so many different animals, and they all have great enclosures.\nLoved it.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Expensive but it funds the animals", "$54 adult admission. Includes the tram and bus. Sit on the right side of the bus for the best animal exhibit views. Narrator/driver was informative and funny.\n\nWe had a $5 discount coupon from some tourist display at the hotel. Active duty military are free!\n\nTram wasn’t worth the wait. Have to get off after one way. Could only see the gorillas. Other that it’s trees and ugly building roofs.\n\nZoo is great. Nice exhibits. Hundreds of species to see.\n\nWhy can’t they charge $10-12 for the zoo photos?! They wanted $37 for 2 photos taken before we boarded the bus. No one bought one. Complete waste to print all of them. Charge less you’ll sell more!!!! Dumb administration.\n\nAlso bring a backpack with bottled drinks. A soda or beer will set you back almost $6. Better off getting a souvenir tee or hat if “you want to feel that your money went to a good cause” at least you would get something decent for the money.\n\nOverall this is a great zoo.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best zoo I’ve ever seen", "We loved our trip to the zoo. It was everything we had imagined and more. Take the bus tour when you first get there for a great overview then wander around at your leisure. If I lived locally I would be back all the time! Even the food was good which is unusual for any American attraction!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "This would be one of the best zoos.", "Great place, well set out and so much to see and do. Has a bus that takes you around and can hop on hop off. Easily spend a whole day there and loved the gondola ride over the treetops. Very clean and well kept."], ["Reviewed 3 weeks ago", 5.0, "Best zoo ever", "I've been to a lot of zoos and was really looking forward to coming to the \"The best zoo in the world\" and it did not disappoint. The exhibits are able to bring the animals really close and they all seemed pretty content to be so well taken care of. The volunteers or workers stationed near some of the more popular exhibits were very knowledgeable and ready to explain the zoo's practices in conservation. I was amazed at the gorillas, big cats, elephants and many others that were hanging out at the glass or in front of fencing right up close. The pandas were by far not the most exciting exhibit. Tip-ride the sky ride to the back of the park and see the pandas early. They really get crowded and the viewing area is very narrow so strollers, wheel chairs really cause road blocks. The flamingos at the entrance are a hoot and very entertaining. The polor bears were great fun too. Tip-Food, drinks etc was really expensive in the park. Bring snacks and water bottles. They also have a great selection of birds from around the world. Tip-ride go early. We didn't do the safari park because it is in another location and we didn't have that much time to go to a second location which is 45 minutes away but it was also highly recommended. Tons of moms and kids in the park. Lucky you to live so close.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great zoo, but confusing", "I don't think there is a straight road or walk in the place, so it is easy to get turned around, and the signs and map are little help. On the plus side, every zoo worker we encountered was pleasant, friendly, and helpful. Great way to spend a day.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place to spend the day", "I’ve heard great things about the San Diego zoo and finally got the chance to go. It’s huge! So much to see. Staff is very friendly and helpful. And if you get pooped from walking around you can take one of those sky rails back. We did that and I still made 13,000+ steps.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Amazing", "Amazing zoo, so many different variety of things to see. The lay out is amazing, with the hills and landscape. One of the best zoos we have ever visited. Have fun"], ["Reviewed 3 weeks ago", 5.0, "Only place to see panda in United States.", "Wonderful trip we had while visited San Diego Zoo.\nFriendly place for kids, great weather for family trip.\nIt is a lot nicer than Disney World in many ways. You don't feel exhaust, plan it well. Cable cars provided a great view from above ground.\nEasy parking, easy to navigate and stroller friendly for parents with young children.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great Zoo!", "We enjoyed our visit to the zoo. Great variety of animals, and the way they have carefully planned out the flow was really good. It was a lot of walking, sometimes up hill but they provide lots of benches to rest on. This grandma appreciated that.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always fun!", "One of our family's favorite places in San Diego. Bus transportation for those who don't want to or can't walk the canyons. Exhibits are well-designed for the animals (I worked at the Phoenix Zoo, so I can tell!)"], ["Reviewed 4 weeks ago", 4.0, "Expansive Zoo with Lot of Animals", "This is a very expansive zoo with almost all varieties of animals. I would suggest you take the guided bus tour to find out which areas are your priority and then take the hop-on hop-off Kangaroo Express bus to move around the park. The terrain has steep ups and down hills, so be prepared for that.\nI would go to this zoo only if you are in the area and would not visit just for this.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Don't miss this one", "What a beautiful place! We really enjoyed the bus tour and got to see a lot more this way. Vegetation is absolutely beautiful and the animals are so well cared for obviously."], ["Reviewed 4 weeks ago", 5.0, "Great Zoo", "This is a beautiful, clean, amazing zoo. Slightly hard to navigate as it has many depths to it. My advise is to pack your own food and drinks as a single bottle of soda was around $5. Also, I would get to the Panda exhibit early as the lines get long. If you have a chance to watch the Hippo presentation, you will get a great site inside the mouth of a hippo. Great fun!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fantastic Zoo! Do Not Miss!", "The San Diego Zoo is by far the best zoo my family and I have visited! Gorgeous grounds, animals from around the world, great tours, and plenty of food options. The learning experience was priceless for my kids!\n\nDefinitely a must-see when traveling to San Diego. Keep in mind the zoo is quite large and can get hot on some days. We paced ourselves and found shady spots and it was an extremely enjoyable day!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Maps and flamingos at the front. Make a choice after admiring them!", "There San Diego Zoo really does have an activity for every age no matter the people you chose to go with there is always a fun time for everyone and it's a place everyone can find a favorite attraction. Pick up a map at the front and plan your trip online to catch feeding times, the last time we went we were lucky enough to see a rhino being fed. A keeper was explaining facts about the special and endangered rhino and we got to watch it eat, a different encounter than most! It happened to drizzle at the end of our trip and we found out there are ponchos available also at the front.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The Best.", "I cannot believe how wonderful this place is. It is like a city of animals that we get to visit. I never once felt sad like I have at other zoos where the animals are caged up. The animals, birds, fish are in there own habitats. They are taken care of so well. There are miles and miles of things to see. There is even a sky ride over the zoo. We spent just about the whole day there and did not see it all. If you go to San Diego, this is a must see.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Awesome", "Beautiful ZOO. I bought 1 day pass- it includes a bus tour and air trail. The bus tour takes you around 3/4 of the zoo but it is better to walk around. So take a kangaroo bus to save your legs. The kangaroo bus has 4 hop on/off stops. But does not cover the whole zoo. If you want to see all you have to use your legs. Good selection of food, gift stores. Just a must see stop while visiting San Diego.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Family Fun spot!", "Excellent location and the layout of the zoo was very easy to navigate. Wonderful exhibits and of course, the animals were awesome. Loved the photo ops!"], ["Reviewed 4 weeks ago", 4.0, "Worth a full day out", "I am generally not a big fan of zoos but San Diego for the most part stands out with its focus on education and the conservation efforts the zoo implements. Some exhibits like the Amur leopard and some of the bird exhibits seemed a bit cramped but generally most were spacious and the animals looked healthy, well fed and content. Gift shops have lots of choice and food is plentiful though expensive and mediocre in quality. It does get crowded through the day so I would come early and plan your walk to cover as much ground before afternoon. The skyride was really great as well, plan your tour so you end up at the opposite side of the zoo and take the skyride back to the entrance. Well worth the money and the effort.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great but you need at least 5 hours to see everything!", "Great zoo. Have a look at the map before you go and plan on a route that you will take if you are planning on walking. Be prepared to have to double back and probably also get lost a few times. It's not an easy walk but there is a bus available for less mobile guests. Try to go in the morning when the animals are awake and active. They seem to be mostly asleep in the afternoon until close, which is disappointing since you dont get to really see the animals when they are asleep.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great zoo, nightmare parking.", "Parking lot was a nightmare on a holiday. Save your sanity and park over way over by the Balboa Park and take a nice walk. Once you get over the admission price and step inside it really is a fantastic zoo. We only spent a few hours here, but you could easily spend all day here. Get in the panda line first as it tends to be the longest.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always awesome", "Great place for a nice walk. Good educational signs and events. You can spend the whole day and children won’t get bored. The panda viewing is bot really worth the waiting."], ["Reviewed 4 weeks ago", 4.0, "Beautiful facility", "This is a beautiful facility, and they clearly work hard to provide healthy enclosures for the animals. I did see one tiger and one polar bear that seemed to be displaying repetitive behaviors. I assume this could be related to stress, but I’m certainly no expert in that area. I imagine it’s difficult to provide stimulation for predators since they don’t get to hunt for their meals in the same way they would in the wild. The employees I interacted with were all knowledgeable and friendly, and seemed to care a great deal for the animals.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Classic zoo. Take the bus tour on the top level.", "Definitely start with the bus tour on the top level to get an overview of the zoo. Also they have a great sky ride. This is one of the best zoos in the world."], ["Reviewed 4 weeks ago", 5.0, "So much fun, not enough time", "We stayed all day opening to closing and still couldn't see everything. Wish we had had another day to explore the park. Will have to come back soon. Kids loved the little orangutan and baby koala."], ["Reviewed 4 weeks ago", 5.0, "fantastic", "this place was a last minute decision and was worth every cent. I would suggest using the kangaroo bus because this place is big and hilly"], ["Reviewed 4 weeks ago", 3.0, "More like an animal themed park...", "With an annual membership for the Zoo/Safari parks for 20 years, we visit the parks quite often and are more and more disappointed by their increasing focus on making money not only through a steep increase in admission prices, but also through concessions, pushy photo stands and extracurricular activities. First time visitors appear to be impressed by the lush appearance and expansive grounds of the Zoo, but seem to forget that a Zoo should allow observing wild animals that cannot be easily seen otherwise. Not here, where the emphasis is on the layout of the exhibits, the long walks (read: hikes) between them, and the maze of souvenir shops and food stations with incredibly high price and quite poor food/merchandise quality. Animals are a rather rare sight, especially the more exotic ones, with many being off-exhibit or “temporarily” inside their housings most of the time. Even where usually there is a lot to see, like monkey exhibits, there are lately only 2-3 lethargic individuals in the enclosure. Of course, you can see giant turtles or flamingos any time... Compared to other Zoos across the US or the world, I would probably not spend the money on this one.\nHighly advertised, the newest exhibit at the Zoo is Africa Rocks, another: lots of walking, little to see experience. It has a beautifully designed layout, even including a waterfall, but again, the goal is to see animals! If you are lucky, and it is not too early, too late, too hot, too cold (you got the idea!) you may have a chance to see a bunch of baboons and down the road some penguins and sharks. In addition, we were able to see a sleeping leopard, but nothing else during a couple of visits at very different times of the day; some of the enclosures even had a clear sign that animals were absent.\nDefinitely, the San Diego Zoo is a much less attractive destination than years ago.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fantastic zoo", "An amazing zoo but so big. We have been there twice and still have not seen everything. take some time before you start to look at the map and plot out your route. We took the double decker bus at the start which allowed us to see some of the displays so we did not have to walk to them. The skylark is a good way to get from one side to the other and the kangaroo bus is also helpful. Food pricey so if you can take a picnic lunch with you.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "As good as advertised!", "We got there early and went straight down the middle, through the monkey and chimpanzee habitats and to the Arctic area. It was definitely the way to go as we did not run into crowds until midway through the morning. I would also recommend hitting the sky buckets from the arctic area. No line at all!\n\nThe animals got much less active in the afternoon, so see the ones you want to see in action in the morning.\n\nThe beer choices change with the areas, really pretty clever and they have good selections. Alberts was ok, but a bit overpriced (though I can’t compare it to the rest of the food options there, so it may be on par with the rest of the zoo!). Be sure to make a reservation if you want to go.\n\nThe tortoises were awesome! The zoo staff was very friendly and full of information and fun facts. I think they may have been misinformed on what momma panda has produced the most baby pandas in America (7 from ATL), but still very impressive!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing zoo", "The San Diego Zoo is wonderful. So many animals I've never even heard of. Interesting section regarding extinct animals also"], ["Reviewed 4 weeks ago", 5.0, "One of the Best.......", "The San Diego Zoo is one of the best in the world and you will know why when you see it. Plan on at least a half a day to see it all."], ["Reviewed 4 weeks ago", 5.0, "Bucket List Zoo", "I went Friday by myself to the zoo and I was really blown away. I have never seems such a place. The whole thing is an experience, even just walking between exhibits. It is very hard to use maps/ markings to navigate the zoo, it was easier and less frustrating to just wander. It took like 3-4 hours to walk around and see everything (by myself) I enjoyed the inclines and hiking of it. I would not have wanted to be pushing a stroller all day and I would worry about people with limited mobility or wheelchairs. I would worry about families with small children. It is a lot of incline walking. They have rentals for scooters but it did not seem like a safe place to navigate using a scooter (I saw two different elderly struggling with navigating the inclines in scooters). After I had covered the park on foot, I think took a ride on the double decker tour bus. It was a great way to end the day and rest my legs. This would be good for those with limited mobility. The 4 D movies are Kids cartoon shorts, so not worth adding to your ticket or unless traveling with children. I hoped maybe they would be zoo or wild animal related. The sky tram was not open on my visit, disappointing since that fee is included in ticket purchase. I enjoyed the gift selection. All and all a great visit for adults and families with older children (9-10 ish) who can navigate. Parking is easy. Zoo gets more crowded later in day, go early for smaller crowds.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Best Zoo I have ever visited", "I have been to a number of zoos in my time but this was hands down the best, the kids loved it.. Be prepared to do a lot of walking though as this place is huge, stay hydrated too..Can’t recommend enough!!"], ["Reviewed 4 weeks ago", 5.0, "Worth the $$$ and WOW", "The San Diego zoo is not cheap. Don't come under any illusions that you aren't going to shell out some big bucks. But the zoo is, and I've been to most notable zoos around the US, the most exceptionally beautiful and creatively laid out zoo I've ever seen. The new Africa Rocks exhibit is truly astonishing (sharks and penguins outside! A honey badger!). There are more aviaries and bird varieties than you can find anywhere. The reptiles not only have their own house (typical) they have their own outdoor trail (atypical!). The Hills make it a great walking zoo and give you a chance to see exhibits from different levels. But, little children and seniors could tucker out easily- rely more on the bus and trams if needed.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Best zoo!", "I've heard a lot of people say great things about this zoo. This was the first stop on our southern California road trip. Getting to the zoo was fairly easy and parking was pretty easy as well. We mad it to the zoo before 10 am and there was still plenty of parking, we did go on a Thursday though, so not sure if the made a difference, but it was summer time. I believe the parking was free because I don't remember paying for parking. I'm glad I pre-bought our tickets online before we started our trip because the ticket booth lines were ridiculously long! Since we had our tickets we went straight to the entrance and started our zoo adventure. The zoo is pretty well laid out so you just keep walking the path and keep seeing the animals. I was very surprised at how close some of the animals were. It was the first time I had seen the giraffes up close, without having to do one of the feeding things. I think the elephants were my favorite! A lot of zoos don't even have elephants any more! The zoo just kept going and going. I think we ended up spending 7-8 hours at the zoo! And we didn't even see everything! I packed plenty of snacks and water for our day and we ate at one of the cafes in the zoo. The pricing wasn't too horrible. The food was fine, nothing fancy, but it was filling and kept us going. It was a pretty hot day and I probably got 2 or 3 of the frozen lemonades the later half of the day. It was a great cool down, since it was frozen it took us a while to eat it and we just kept walking with it! The petting zoo was fun and our 3 year old loved it! There's also a fun little kid play ground. Overall our family of 5, grandma, mom, dad, 11 year old son and 3 year old daughter loved this zoo! We had a great day! If you're visiting San Diego and thinking that you will do the zoo and visit Balboa Park and the surrounding areas in 1 day, you are wrong, I certainly was! The zoo will take up 1 day maybe even 2 if you have time. Plan accordingly.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "First visit", "Clean zoo. What ever you do, do not bike up there. It took us 1 hr from the convention center. Zoo closes at 5 pm. In order to get everything for tour money get there early."], ["Reviewed 4 weeks ago", 5.0, "San Diego Zoo - THE BEST!", "This is without a doubt the most amazing zoo I have ever been too! I have been twice when I have been in San Diego visiting family and still feel like I somehow missed some exhibits - although even if I knew I saw everything...I would still go back to SDZ every visit! I enjoyed the layout of the park, and everyone (locals) are always mentioning how the SDZ is constantly adding and changing exhibits. The staff is extremely kind and helpful too!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great zoo!", "We recently took our two children ages 13 and 15 to the San Diego Zoo. We spent a wonderful day and enjoyed ourselves thoroughly. We especially loved seeing the polar bears, the Panda and a baby giraffe."]]}}