{"San Francisco Bay": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "San Francisco Bay", "url": "/Attraction_Review-g60713-d106745-Reviews-San_Francisco_Bay-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/22/a8/b9/san-francisco-bay-san.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "6822"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Beautiful", "There is plenty to do around the bay as it is very touristy. But the view of the bay and San Francisco landscape is breath taking. Bring your camera and selfie stick. You'll need it!"], ["Reviewed 2 days ago", 2.0, "dirty water", "good place for relaxation but this place has very dirty water. good view , quite and fresh sea air and if you are not of usa, it is cold area at night."], ["Reviewed 3 days ago", 4.0, "Can't miss it!", "San Francisco is a beautiful city and the bay is a great backdrop for all of it. You can see it from any number of locations inland, and see it up close while wandering the Embarcadero. One particular good view of the Bay was from the back of the Ferry building.\nShow less"], ["Reviewed 1 week ago", 4.0, "The Bay in SFO is Gorgeous", "You really can't miss it from anywhere in SFO. When traveling, it is a must see. Highly recommended. Try Fisherman's Wharf, Pier 39."], ["Reviewed 1 week ago", 5.0, "The view from any of the water front restaurants!", "From Coit tom the ball park and anywhere you stop you have to enjoy the view! If there is something near the perfect day of a bloody mary and sea food while watching the boats on the bay I haven't seen it yet!"], ["Reviewed 1 week ago", 4.0, "When in SF....and all that!", "We had five days in SF. We came down to the Bay to look out on the Golden Gate Bridge etc. as we were doing all the touristy things we could. It's a beautiful, scenic area and of course houses Pier 39, Fisherman's Wharf etc. and you can see the Ferry's etc. to and from Alcatraz. There are birds to watch, plus it's a great place to people watch. Take a packed lunch in the warmer weather, find somewhere to sit, and just 'watch'...\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful", "Beautiful from the air or the ground, this is one of the places you need to see in your lifetime. I have seen it from both, it's very peaceful. Have walked around some parts and it is well worth it."], ["Reviewed 1 week ago", 5.0, "Beautiful view", "Great place to walk around and enjoy the beautiful views of the bay. Also fun to people watch. The seals are often preached on the docks as well."], ["Reviewed 1 week ago", 5.0, "San Francisco Bay has the most famous places in the city: Pier 39, Fisherman's Wharf, Lombard Street, Golden Gate Bridge", "San Francisco Bay has everything one looks for: Restaurant, Shopping Malls, Iconic Places like Pier 39 including Sea Lions, Fisherman's Wharf, Alcatraz Island, nearby Lombard Street, Victorian Houses and the Golden Gate Bridge. It is a lovely place to be. We had a chance to reach Bay Area by car, then travel on foot, first to Pier 39, Sea Lions area, looking across the Bay waters to Alcatraz Island and then to Golden Gate Bridge and walking the whole length of it both ways and looking at the bay, both in the evening with San Francisco city skyline as the background and in the night shimmering lights of the city. Bay is beautiful with sea, islands, hills and massive city of San Francisco. Because of lack of sufficient time we missed out on certain places we wanted to be but thought of coming back again one day.\nBeautiful experience of being at San Francisco Bay.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Buzzing place", "You can find everything you need here, gift shops, restaurants and street entertainment. Even the famous Seals make an entrance, it has a very happy atmosphere and gets very busy."], ["Reviewed 2 weeks ago", 5.0, "What A Pretty Place", "We took a cruise on the bay this summer and we were stunned by the sheer beauty of the water. It was such a calm and serene experience. Also so many great sights all around."], ["Reviewed 2 weeks ago", 5.0, "Northern California Gem", "Take a ferry ride, cross a bridge, walk out on a pier, find a restaurant with a view, walk or bike on one of the many trails...Lots of ways to see and enjoy the Bay. Different at different times of year, different weather, always a joy.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A great place", "What a lovely place to walk and enjoy the view. Fantastic views across the bay and lots happening on the water. A great visit and can't wait to come back"], ["Reviewed 2 weeks ago", 5.0, "Red and White Bay Cruise", "Unfortunately it was a rainy foggy afternoon when we went on the cruise. The price was reasonable and the beat was clean. We sailed under the Golden Gate Bridge and around Alcatraz Island. The audio tour was clear and helpful. I’d recommend this to anyone."], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "What a great place not only to talk a walk along the pier and see Sanfrann Bay but there is so much to see and do !!"], ["Reviewed 2 weeks ago", 5.0, "stayed at the Zephyr Hotel on Beach Street overlooking Fisherman's Wharf", "We could see Alcatraz from our window, as well as the Golden Gate Bridge, and Pier 39, great time, easy to do all the fun things in San Francisco!!"], ["Reviewed 2 weeks ago", 5.0, "Pier 39", "Awesome place. We spent hours here. Great restaurants of all kinds. Be sure to visit the Sea Lions. They are very entertaining."], ["Reviewed 3 weeks ago", 5.0, "Its Amazing ...", "...........HAS GOT TO BE SEEN with blue skies ... good company of my husband ... had an amazing trip to San Fran Small Car Big tours in a Minicooper has made it for us get in touch with Reed if you want to see San Fran\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Touristy but fun", "This is the typical renovated fishing district. That doesn't mean it is a bad thing. There are numerous spots to get real food in addition to the tourist name brands."], ["Reviewed 3 weeks ago", 5.0, "Summer Holliday 2018", "The Pier area, The Fisherman’s Warf and cable train you have everything just in front of you. Same with the shuttle boat to Alcatraz and view to Golden Gate Bridge you are at the center of all other tourist attractions in San Francisco. Lots of shops and good restaurants in walking distance.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Lovely place", "A beautiful place for walking.You should visit it.You can taste authentic sea food but you have to be careful not to go at a tourist restaurant.You can also see sea lions sunbathing!!!Worth visit!"], ["Reviewed 3 weeks ago", 4.0, "Loved the Seals!", "A must stop when in San Francisco. Lots to see and do, but our favorite was watching the seals and Boudin Bakery."], ["Reviewed 3 weeks ago", 5.0, "Fun place to see", "We returned to San Francisco Bay in November, 2017. San Francisco is our favorite US city! So much to see.....ton's of fresh seafood restaurants. fun shops and great people watching. Even though we are in San Francisco for business each year, we look forward to all the Bay has to offer and look forward to coming back each year.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Bay", "I took a cruise from pier 39 to see the golden gate bridge and around the famous Alcatraz island. There are a couple of tour companies here where you can book to get around."], ["Reviewed 4 weeks ago", 3.0, "Good wak .. but THE tourist trap", "Lots of interesting stores but super expensive ... Go see the sea lions basking in the sun at the end of the pier"], ["Reviewed 4 weeks ago", 5.0, "Plenty to do and see", "This is a nice area to walk around and check out all the shops, cafes and gift shops. Good places to eat and buy bits and pieces."], ["Reviewed 4 weeks ago", 4.0, "Nice touristic place", "It's a nice place to walk around, souvenir shopping or eating. The negative part is that parking can be a challenge!"], ["Reviewed 4 weeks ago", 5.0, "Great view", "Walking along the bay was very nice, traveled on it going over to Alcatraz Island for a tour, and went across it while traveling over the Golden Gate Bridge"], ["Reviewed 5 weeks ago", 5.0, "Great experience and ambiance", "Great place to shop and eat, many different types of food that suits all pallets. The shops are nice to walk around and look in. Take a bay cruise, pick up the ferry to Alcatraz just to name a few. Easy to walk around and get up into the city. Take the cable car up and down the hills, visit Lombard Street, the crookedest street, view the bay from the top of Lombard Street. Worth a visit and stay. Will certainly return again.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Fisherman's Warf Chanded little over past 20 years", "OK, many shops have changed, but the character is still a freindly toursity atmosphere, although the homeless population has grown. No lack of restaurants and mostly kept clean. Aquarium on pier 39 is small, but nice. Just stroll and relax. Probably my 30th time to visit.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Lots to do", "This is a very touristy area but it was also a lot of fun. Be prepared for crowds and bring a jacket for the wind! There a lot of tourist shops, places to eat, and cafes to check out. There are street performers, lunchtime shows, You can take a tour of Alcatraz from here, watch the seals etc.\nYou do have to pay for parking anywhere near here if you drive down.\nShow less"], ["Reviewed January 22, 2018", 4.0, "I Am A Tourist", "My wife drug me to Fisherman's wharf to see the sea lions. They are a must see while there. The rest of Pier 39 was a tourist trap and so I became a tourist. I did enjoy the shops and uniqueness of some of the \"Only in San Fransisco\" places.\nIt has something for everyone here.\nShow less"], ["Reviewed January 21, 2018", 5.0, "If you do nothing while in SA stop at the Bay", "It is the best spot for food shopping and sea lion entertainment. Most of the tours pick up from here or stop by here. The vive was awesome with live entertainment, museums, a view to Alcatraz and well more food. From fancy restaurants to food trucks they have it all.\nShow less"], ["Reviewed January 21, 2018", 5.0, "San Francisco Bay", "We visited in Fisherman's wharf and in Pier 39, area. everything here is really atrractive! the sealions in pier 39 make an outstanding opportunity to see such a crowded oppulation of these interesting animals. Near by the wonderful Bay Aquarium with plenty of extremely intersting sea bay inhabitants. Excellent for children as well. Walking between the pier 39 and toward fisherman's wharf, taking a one hour sail in the bay up to the golden bridge , and then finish visit in Boudin large restaurant with a tasty loaf of bread full with a good soup -all was very pleasant.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great City to tour with my Mum", "My mum and I had a wonderful 3 night stop over in San Francisco when visiting friends in California and then Arizona. We stayed at the Seaside Inn on Lombard Street which was extremely central and more than adequate for our needs.\n\nWe were able to walk along the beach to towards the golden gate bridge a different vantage point. We took the 48 hour open top tour bus and had great insightful information about the city. Our favourite bus tour was the open top night tour when you get a completely different appreciation of the city, the lights are amazing.\n\nOur day trip to Alcatraz was awesome and so was the clam chowder that followed on pier 39 on our return.\n\nThere are so many things to see and do, making San Francisco one of my favourite cities to visit as long as you don't need to drive!!!\n\nAll in all a great bank of memories made with my mum that will stay with me forever!\nShow less"], ["Reviewed January 19, 2018", 4.0, "Great views", "Nice, quiet bay to cycle along. Kept really clean and has great views. Would recommend waking or cycling along."], ["Reviewed January 18, 2018", 5.0, "Market day", "Everywhere in the world I just love the markets and this was one of them..\n\nYou just can’t make up your mind what to eat as there’s so much been offered.\n\nThe little stores offer everything from shoes to food, coffee, cakes, cheeses and much more.\n\nI particularly love the fruit stores.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Great place to walk about. I was there in the winter and got to see seals fighting for spots on the peer", "Great stores, eateries, and during the winter you can watch the seals and walruses fight for the best spots on the peer. It is a great spot to spend an afternoon."], ["Reviewed January 11, 2018", 5.0, "US Holiday", "This was lovely to walk down and experience all the shops and restaurants, plenty of choices. We ate at lovely Mexican place, would recommend a visit to the Bay."], ["Reviewed January 10, 2018", 4.0, "A beautiful but busy bay", "San Fransisco Bay is a great place to go for a walk, go shopping or to eat out. There are heaps of places around here such as the Piers. My only complaint that it is super busy and full of tourists, but what else could you expect?\nShow less"], ["Reviewed January 6, 2018", 5.0, "Lovely trip", "Beautiful setting and views across the bay highly recommended for anyone to see it simply is stunning a must for everyone"], ["Reviewed January 4, 2018", 5.0, "Grab a ferry!", "I traveled by ferry from Sausalito to the San Fran Pier and back again, and it was absolutely amazing. I highly recommend a trip across the bay if you can afford the time. You will get a unique view of the city and some great shots of the Golden Gate Bridge.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Iconic", "A must visit in San Fran. Easy to get to, great vibe and also where the Alcatraz tour will begin - so come down early for a look!"], ["Reviewed January 3, 2018", 5.0, "Beautiful water views, saw the sea lions at Pier 39", "We toured Fisherman's Wharf and walked down to all the piers. It was a beautiful area, packed with tourists but beautiful just the same."], ["Reviewed January 3, 2018", 5.0, "Great Famiy Visit!", "Love this bay and taking a boat tour. Wear a jacket it's always cold here. Lot's of street entertainers that are gifted."], ["Reviewed January 1, 2018", 4.0, "Touristy but a good place with many attractions", "As many other reviewers have stated, the Bay is jampacked with tourists and those who make their livelihoods off of them. Ton of tourist traps, but many of the good attractions require you to come here to take advantage of them.\n\nDuring my two visits, however, I've always enjoyed walking around the piers and the wharf before 9 a.m. with a cup of coffee, looking at the seals and taking in the strong sea air before everyone descends upon the waterfront. In that sense, the Bay and its various spots makes for a nice attraction unto itself and a fine way to warm oneself up for a day of touring and sightseeing.\nShow less"], ["Reviewed January 1, 2018", 5.0, "What is not to like?", "Love this place. Lots of overpriced shopping and food, don't miss the sea lions on Pier 39 and the free entertainment along the walkway in the form of mimes and other performers. Super cheap souvenir shops along the street, not on Pier 39. All bay tours are recommended, worth it, you will see alot and learn a lot.\nShow less"], ["Reviewed January 1, 2018", 3.0, "Don't believe the fog will lift!", "The fog didn't lift despite predictions by the ticket agent so we had a one hour ride in the clouds - with a brief view of the Golden Gate Bridge directly above us! Of course we should have known - but we politely asked for a refund and were given one! Still - no one wants to waste an hour while on vacation - so don't get on a ferry unless you can see the fog is lifting!\nShow less"], ["Reviewed December 31, 2017", 3.0, "Fresh Air", "The Pier is lovely! Fresh air and lots to see on a long stretch. Unfortunately nothing opens aside from the farmers market on a Saturday before 11am. It was really odd. Luckily we were there very early and experienced a ferry cruise and walked around quite a bit. After 3pm there was so many people at Pier 39. The customer service is terrible at the restaurants and the food is overpriced for quality and service...it’s a tourist spot for sure. The best thing was the bay cruise. The water was choppy and the air was cold and it was beautiful out there!\nShow less"], ["Reviewed December 31, 2017", 5.0, "One of a kind!", "So beautiful. Try to view it from Pier 39 or any of the peers on the San Francisco side. Most days are sunny and beautiful and you will never be able to get this beautiful city out of your mind."], ["Reviewed December 31, 2017", 5.0, "Great atmosphere", "Such a fun atmosphere, so many street performers and awesome places to eat. The only down side is the number of homeless in San Francisco. So much mental illness."], ["Reviewed December 30, 2017", 4.0, "Get there EARLY!", "I'll be honest, not my favorite place but it is a must see. It is so crowded with people but really great in the morning before everything opens up. You have to go and see the seals and the view of the bay. If you aren't a big shopper and eater then take the advise and go early morning.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Ferry to Sausalito See the harbour and lovely town", "I decided to see the harbour by visiting Sausalito a town across the harbour near the Golden Gate bridge. This was cheaper than other options and you get good views of the city; bridges and Alcatraz and then the bonus of exploring the almost Mediterranean town of Sausalito. I had beautiful weather and you could stand on the deck for tremendous views. I went on both ferry companies. The Blue and Gold was slower but had a full open deck on top for better views.\nShow less"], ["Reviewed December 26, 2017", 5.0, "San Francisco Bay", "Visited the San Francisco bay with my family, we spent almost half a day there walking and exploring the piers. The view was great, weather was good, and there are so many attractions there to enjoy! From watching buskers perform along the road, to watching the sea lions laze and sun themselves to all the delicious food at Pier 39. Very enjoyable experience!\nShow less"], ["Reviewed December 26, 2017", 4.0, "Lots of Tourists at the bay", "We went for a walk from Union Square to the bay. Lots of tourists and street performers. You can pick up boat rides on the bay. The fish shacks have been upgraded and were popular. We walked back on Columbus and walked through North Beach area. Lots of Italian places open!\nShow less"], ["Reviewed December 25, 2017", 5.0, "A lot to love", "OK, so let's see: AT&T Park, The Ferry Building, Fisherman's Wharf, Sailboat watching, Bay Bridge, Golden Gate Bridge, Alcatraz, Angel Island, Sausalito, Tiburon, Marin Headlands, VIEWS, excellent Bayside restaurants, kayaking. If you can't have fun here, or something you find interesting.....well..... you're already gone."], ["Reviewed December 18, 2017", 5.0, "Christmassy!", "When we arrived in November, everything was being set up for Christmas so there was a huge Christmas tree and lots of festive things going on around Pier 37. We went for a boat trip around the bay which sailed under the Golden Gate Bridge and that was amazing. Highly recommend\nShow less"], ["Reviewed December 16, 2017", 5.0, "Gorgeous", "Absolutely stunning at sunset. The iconic Golden Gate Bridge is beautiful and really glows under the light of the setting sun."], ["Reviewed December 15, 2017", 5.0, "A must visit", "So much to do, so much to see. Over two days, we visited the Bay area twice, taking in the commercialised, (but don't let that put you off), Pier 39, strolled from there along to the old Ferry Building, with its massive choice of independent food, (local pie shop yey!), & retail outlets & Saturday market, walked over the Golden Gate Bridge, and took a whale-watching trip.\nReally, you could chill out in the Bay area for 2 or 3 days, and still not see or do everything.\nUnmissable. Such fun. (Watch out for pickpockets though - my phone was stolen on a packed tram near Pier 39.)\nShow less"], ["Reviewed December 10, 2017", 4.0, "Another Human Trap but Entertainment Packed", "There are many ways to get around, from a bike rental, mini cars equipped with GPS or by foot. There is much to see to be entertained from souvenir shops, foods, small stalls for artwork, arts and crafts or just simply watch the passersby. The latter is an interesting entertainment as you see the characters of the city goers jogging barely nude or dressed in fashion like outfits. The city's entertainment is boundless as we watched groups dressed in Santa and everyone was happy and smiling. They were oblivious to worries and their energy and smiles spread across everyone's face. There were jugglers, acrobatics, drumbeats and more. The pier has is long and though you walk, you will forget the physical exhaustion as you are occupied watching everything around you. Here, you can see the view of Alcatraz and walk all the way to Pier 39 for more shopping. TA is asking if this is associated with nature. If you consider a waterfront with much commercial development around as nature, then so be it.\nShow less"], ["Reviewed December 8, 2017", 5.0, "Boat ride to the bridge along Alcatraz", "We fid the bay boat ride as part of our fays pass activities. Takes you to the bridge and to passing Alcatraz on the way back. You will be able to see much but not the Harbour Bay Bridge closely."], ["Reviewed December 8, 2017", 5.0, "Fun place!", "They have nice souvenir shops, food shops and a few restaurants. It's a nice, clean place to stop by and do the tourist thing."], ["Reviewed December 6, 2017", 4.0, "Dad's 60th Birthday", "We visited here as part of a trip around America. We stayed nearby and ate down at the bay a few times. It's a lovely tranquil place. It was very sunny but there was always a bitterly cold wind so I advise wrapping up with a jacket if you are walking about. Lovely place to see.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Beautiful Bay", "The Bay was spectacular. Watching all of the boats was amazing. I enjoyed walking around to all of the shops. It's very pretty."], ["Reviewed December 6, 2017", 5.0, "Fun !!!", "Along with all the great food you can see the Sea Lions! They are so humorous! Great location to visit."], ["Reviewed November 29, 2017", 5.0, "Just wonderful!", "I love this town... so much history, so much to do. And people are courteous and friendly ... not just the tourists. Good public transportation and nice hotels and good food"], ["Reviewed November 29, 2017", 5.0, "An Absolute Must", "When you visit San Francisco you have to take a boat ride and see it from the water. The San Francisco Bay is breathtaking. 2 beautiful majestic bridges, an amazing skyline and Alcatraz in the middle of it all. If you don't want to take a tour you can take the ferry across to Sausalito and return for $20. Well worth it. We did it twice. Once daytime and once nighttime. Both were beautiful! Highly recommend.\nShow less"], ["Reviewed November 29, 2017", 5.0, "we love spending time here", "There is a free maritime museum, it's really affordable for families to see the historic ships (adults are $10, kids 15 and under are free), it's a quick walk all around between the museum and Pier 39, and you can even walk to the fort and Golden Gate bridge. There is a lot of shopping, sort of outdoor mall-ish. We enjoy spending time in San Francisco, and stay by the bay every time.\nShow less"], ["Reviewed November 29, 2017", 4.0, "Crowded with Tourist", "This place is a tourist magnet, but still, a fun place to take a stroll especially if you want to see the resident sea lions."], ["Reviewed November 27, 2017", 5.0, "Lots to sightsee", "So much to see and do. Most of it free if you research the sights\nDinner in s restaurant about $40pp. Parking $30-65 daily. See the free museums, National Historis Parks, the sea lions wild on Pier 39 in the water. Cable Car ride right next to the Argonaut Hotel hayride. Three parks there as well.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Beautiful bay full of attractions", "The bay is full of tourist attractions\n\nWe visited the bay via the the Alcratraz Tour and also sailing with Adventure Cat.\n\nWe also saw if from afar via Lombard Street (crooked street).\n\nThe bay is full of so many lovely tourist sights like Alcatraz Island, the famous Golden Gate Bridge, the seals at Pier 39,Fisherman's Wharf and the beautiful seaside village of Sausalito and a lot more.\n\nA must when visiting San Francisco.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Twilight Cruise", "Cruise was amazing. Great view. Very romantic and great sight seeing at night. View was beautiful and definitely one to remember."], ["Reviewed November 25, 2017", 5.0, "The Wharf", "This place is buzzing. So much to see and do. We were there whilst they were preparing for Thanksgiving. You could spend hours down there just exploring, shopping or eating. I totally loved it down there."], ["Reviewed November 23, 2017", 5.0, "Great area for walking, shopping, and eating!", "This is a great area for strolling, shopping, and eating! There is so much to do! Fun times with family! Great place when traveling!"], ["Reviewed November 23, 2017", 5.0, "Most Beautiful Bay in the World", "The San Francisco Bay is the most romantic bay in the world. It is world renowned and we attract visitors from every country on earth. San Francisco Bay is a dream come true. While locals take it for granted, people from outside San Francisco envy us. We are truly blessed to live in the beautiful state of California with all its natural beauty and nature and wonderful people.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Great visit", "Spent the whole day at Fisherman's wharf going over the difference piers. The bay was stunning and plenty of things to do and see around the area. The seals at pier 39 being quite entertaining. There are plenty of places to eat and have a drink. A great place to spend the day.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Great area to visit", "We were here for dinner and wandered around. Good vibe in the evening, and plenty to take in. Nothing particularly spectacular, just a nice area to visit. We should have organised more time to wander around."], ["Reviewed November 18, 2017", 4.0, "Crazy busy", "A must see but it's crazy. Chaos if you drive up there. I'd recommend a tour or cable car. So many people around but the best view and the houses are gorgeous."], ["Reviewed November 18, 2017", 5.0, "Beautiful from any angle", "Take the ride to alcatraz, or a tour boat around the bay, view it from all over the city, from a restaurant at fisherman's wharf, or from a drive across the Golden Gate Bridge."], ["Reviewed November 15, 2017", 3.0, "I was expecting more", "There was a lot of homeless people and garbage on the street.we had a good time but from what I saw from movies I thought it would be cleaner."], ["Reviewed November 14, 2017", 4.0, "Sea the Lions", "The Bay area is a mecca of touristy shops and restaurants and if we're honest we'll admit that is what we want. It has a great vibe and views of Alcatraz, and you can't come to Frisco and not - just like the sea lions, spend time \"sitting on the dock of the Bay, wasting time\".\nShow less"], ["Reviewed November 14, 2017", 4.0, "Interesting Tourist Area", "Fun Place to See and Walk around. Pretty place with lots of shops, bars, and restaurants. Beautiful views on a beautiful day. Spoiled by the homeless and filth. Glad I saw it, but sad what it is becoming."], ["Reviewed November 13, 2017", 5.0, "Beautiful! BUT Bring a Jacket", "The SF Bay is a beautiful sight to see. There are so many photos you can take and the air is so fresh.\n\nTraveler Tip: Bring a windbreaker/windproof jacket. SF has a breeze that can blow right through your clothes. If you are cold, you won't enjoy yourself as much.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Gorgeous", "We were lucky enough to stay in a hotel with stellar views of the bay. We could see the fog creeping over the Golden Gate Bridge, the sparkling expanse of the Bay Bridge, Alcatraz, the lights of Sausalito, and of course the San Francisco skyline. Just beautiful.\nShow less"], ["Reviewed November 12, 2017", 5.0, "BEAUTIFUL BAY VIEWS!", "We took the ferry over from Tiburon and enjoyed bay views of both bridges and the city. Traveling into the city through the bay is the way to go for sure! There are many different cities you can take a ferry from to the city. The public transportation in the city is easy to learn and not dealing with a car and parking is wonderful!!!\nShow less"], ["Reviewed November 11, 2017", 5.0, "A little cool but nice day!", "Due to a flight cancellation, we stayed in SFO for 24 hrs. We had a great day and we decided to get an Uber to come downtown. It was a great view right at sunset. Must see while in town. Great venues and lots of places to eat.\nShow less"], ["Reviewed November 11, 2017", 4.0, "One of the world’s great natural harbours.", "Only Sydney harbour comes close in sheer size and dramatic scale (Cape Town ain’t bad either). The setting is breathtaking and is one of the major reasons why, in my mind San Francisco is the number 1 City in the USA as a tourist destination. The bay is huge and one could spend a long time exploring it- both from natural beauty to industry past and present.\nThere are boats out but these are relatively pricey. There are significant currents and the water is cold. There are places you can swim if you want but Sydney harbour is a far better bet!\nShow less"], ["Reviewed November 10, 2017", 4.0, "Around the Bay, Lots to See!", "The bay itself is a nice body of water. All around it are lots of places to go! Alcatraz Island can be seen and visited. Pier 39 is a tourist site. The Golden Gate Bridge is lovely from various views. Don't miss seeing the Bay if you are near the Bay Area!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Too much fun", "The experience itself is fun. The atmosphere is alive here most of the time. Take time to sit and have lunch and soak up the surrounds of the bay. The shops around are touristy although fun."], ["Reviewed November 9, 2017", 5.0, "So much to do!", "We spend a couple of hours on a leisurely stroll from the Bay Bridge to Fisherman's Wharf.\nWe saw lots of birds as well as sea lions and otters along the way.\nThere were many restaurants and shops as well as places to simply sit and take in the scenery.\nWe took a boat tour around the Golden Gate Bridge and Alcatraz which departed near pier 39.\nShow less"], ["Reviewed November 9, 2017", 5.0, "San Francisco Bay", "As a visitor to San Francisco the first thing You need to pack is a warm jacket!! Or warm clothing!! Surprisingly how cold it feels by the Bay Area. If you plan to take a boat ride or a cruise to Alcatraz etc you will definitely need something warm to keep the chill off! Wear comfortable shoes as San Francisco is very hilly!! Or alternatively buy a cable car hop on and off ticket to get to various attractions. Prices vary depending what you want to do. San Francisco Bay is a great attraction lots of things to keep you busy if you are visiting for a day, weekend or a week. There are also out of the city tours which take you to wine country or closer to land's end.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Beautiful Bay Area", "One must visit this beautiful SFO bay area to see the shopping outlets, dining areas, restaurants, beautiful monuments & ferries. Its heavily crowded."], ["Reviewed November 8, 2017", 4.0, "A lovely area", "We stayed at Fisherman's Wharf and really enjoyed the Bay area from land and sea. Great views, great food, fun attractions and fascinating bits of history."], ["Reviewed November 6, 2017", 5.0, "Beauty by the Bay", "What an amazing city. It truly is the most beautiful city in the world. To walk across the Golden Gate Bridge is breathtaking. There are so many many places to see and explore. Everyone should experience this wonderful city at least once in their lifetime."], ["Reviewed November 6, 2017", 5.0, "Golden Gate Bridge", "A must see in SF, wonderful views of the city, the bay area, recommended to walk through the bridge."], ["Reviewed November 2, 2017", 5.0, "Stroll by the water", "It was busy when we were there but still not hard to get around and enjoy, The sea lions are a total blast --so many of them basking on the docks, it's unreal, If you like strolling, water and wildlife you won't be disappointed"], ["Reviewed October 29, 2017", 4.0, "Great area", "Spent a few hours wondering the area and very much enjoyed the atmosphere all around. There are so many shops and restaurants all over to choose from. A great way to spend a Saturday."], ["Reviewed October 29, 2017", 4.0, "The Bay is the defining characteristic of the area", "Seeing San Francisco and the surrounding areas from the waters of the Bay is a must. The Bay defines the area."], ["Reviewed October 26, 2017", 5.0, "Great fun", "The bat area is huge and has plenty of shops and restaurants, it takes a bit of time to walk round it all but is very tourist friendly."], ["Reviewed October 25, 2017", 4.0, "Wonderful area of San Fran", "We totally enjoyed all San Francisco Bay had to offer. There is a lot of things to do and explore here. The restaurants are plentiful. Most of them advertise their menu and prices at their front door, which is really appreciated. The shops were fun to stroll through. We were fortunate to be there when they had the farmers market. It was the biggest and best farmers market that we had ever been to. We loved listening to the buskers; they have some seriously good talent. The washrooms were easy to find and were free. Many other cities now charge to use their restrooms. We totally believe that a visit to San Fran cannot be considered complete until you have walked along San Francisco Bay.\nShow less"], ["Reviewed October 24, 2017", 5.0, "If you ever visit SF Adventure Cat is a must outing on the Bay!", "Off Pier 39, it is the best and most Unique way to experience the SF BAY- sailing on a large a Catamaran! And, if the time of the year is right you may even catch a close view of two or three whales frolicking inside the GG Bridge. It is the best value too, less than <$50. for ninety minute ride seeing all the attractions up close. And if like most tourists just in case you forgot your winter jackets at home, not to worry, they'll loan you a beautiful HH parka for the duration to keep you toasty warm. I have used it every time I have been on the tour and last two times were lucky to spot the whales, almost too close for comfort.\nShow less"], ["Reviewed October 24, 2017", 4.0, "Lots to do", "Mincing along the waterfront or a few drinks in a bar can punctuate your trips to souvenir shops for tacky magnets and stuff. Loved it."], ["Reviewed October 24, 2017", 5.0, "Just like the movies", "The bay is breathtaking and I recommend a trip to pier 39 to see the seals and sea lions. It does smell a bit but they are so much fun to watch. There are shops and restaurants close by and I had to pinch myself to know I was there is it's a place I had always wanted to visit. You can see for miles in a clear day and even if it's not it's still great. You can people watch, eat, drink, shop and hang out for as long as you like. There is so much to see and lots going on. Weekends get very busy but all part of the lifestyle.\nShow less"], ["Reviewed October 24, 2017", 3.0, "Expensive and too many street livers", "Great city but spoilt by cost and street livers. They are everywhere! Don't use City elevators at Bart stations as these are just used as toilets! Disgusting! Car parking costs a joke at 50usd a day upwards! Use Uber and Bart."], ["Reviewed October 23, 2017", 4.0, "Lovely bay area", "So much happening in this bay area. The bay has beautiful views out to the bridge. Quite a few activities happening here."], ["Reviewed October 23, 2017", 5.0, "A beautiful place to walk", "The bay is nice to walk along. The best place is Fisherman Wharf and the Ferry building. You can also see the golden gate bridge."], ["Reviewed October 18, 2017", 5.0, "What makes San Francisco San Francisco", "Without the bay the city just wouldn't be the same.\nIt creates a huge playground for the city.\nThe ferries do a good job giving access to parts of the bay and much is accessible by car.\nEntry is really via the vibrant 'odd' piers along Embarcadero from the Market to Fisherman's Wharf.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Largest Pacific Estuary in the Americas", "San Francisco Bay is the largest Pacific Estuary in the Americas, and stretches 48-60 miles north/south and 3-12 miles east/west. San Francisco, Oakland, Palo Alto, Berkeley, Richmond and Marin County all border along the bay. There are numerous opportunities to experience the bay, boating, fishing, wildlife viewing, touring. You could spend years exploring all the area around the bay. Alcatraz, Angel Island, Marin County towns of Sausalito and Tiburon, Oakland, Berkeley, the Presidio and the Golden Gate National Parklands that run from San Francisco provides countless\nShow less"], ["Reviewed October 18, 2017", 5.0, "Lovely Day in San Francisco Bay", "Enjoyed the walk on Fisherman's Wharf, and boat ride around the bay was again beautiful. Quite expensive for souvenirs."], ["Reviewed October 17, 2017", 5.0, "A beautiful view of the bay", "The bay is beautiful from every angle. We looked at it from every side and it was all very scenic and relaxing to view.Our hotel had a bay view and it was wonderful to wake up every day looking at the water."], ["Reviewed October 17, 2017", 5.0, "farmers market on the pier", "There was everything from the garden you can imagine. We were waiting for the ferry when we looked around at all the different tables."], ["Reviewed October 16, 2017", 5.0, "pier 39", "awesome place . tons of restaurants,stores,touristy stores . fishermans warf,seafood . wild sea lions swimming"], ["Reviewed October 16, 2017", 5.0, "Beautiful place to stroll", "So much going on in the bay area, lots of lively action, shopping, food, and fun! Definite must see!"], ["Reviewed October 14, 2017", 5.0, "So beautiful", "I love the bay. Either driving around it or sailing in it is a great experience. The views are unbeatable. If you are taking a boat and find a restaurant just remember not all docks are for the restaurants. As a matter of fact most are private so make sure you check before you dock. Sail around Alcatraz island better yet take a tour. If you are driving around they do have scenic out looks you and stop at and take photos and they do not change for parking. If you stop in town be prepared to pay for parking. I suggest down loading the meter app and pay for parking and renew it all from your phone. So much so see and enjoy.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Wonderful Entertaining Walk down the Bay", "I love to walk around the San Francisco Bay. There is so much to see and do. There is shopping, lots of good restaurants. You can see the sea lions lazily sunning themselves in the Bay. There are a lot of colorful people hanging out on the Bay to entertain.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Worth your time", "We spent a day there since the warf is connected. You can view the Harbor Seals from the walkway. Lots of shops and restaurants. Plan on at least several hours"], ["Reviewed October 12, 2017", 4.0, "Wonderful Day", "Plenty to see as you walk along. Lots of stores and restaurants for you to choose from. Wasn’t very crowded when we were there. Plenty of places to sit back and enjoy the weather or people watch."], ["Reviewed October 12, 2017", 4.0, "Seals...", "Lovely place a must to explore. U could quite easily spend a couple of days exploring all of the pier it's got so many lovely shops restaurants, things to do like the aquarium( they have otters!) The ferry's to alcatraz are in this area and the bay cruises as well. A must is the seals they smell but u get used to it and they are so funny to watch .Also the Crab House is a great place to eat crab - mine was lovely. Also the servers are very helpful and will help u decide what's best for ur table if u all want crab ! But the menu does have other things beside crab!!!\nShow less"], ["Reviewed October 11, 2017", 4.0, "San Fran Trip", "After planning for 4 years, we made a west coast trip a priority this year and we were not disappointed. Food was amazing, fun to watch all the seals and to walk Pier 39"], ["Reviewed October 9, 2017", 5.0, "Beautiful", "Nice area to visit, a lot of people, great area for pictures, boat tours reasonably priced. Some restaurants have outdoor seating. You can enjoy a walk on the pier, and see Alcatraz from the pier. If you're in the area, it's a \"must see \"area."], ["Reviewed October 9, 2017", 1.0, "Over Priced", "We went during fleet week it was so crowded and the bathrooms were disgusting will NEVER go again during that time, everything was way overpriced."], ["Reviewed October 9, 2017", 5.0, "always cool", "Did not tour thru downtown San Francisco this time but around the outskirts from across the Golden Gate Bridge and Sausalito Murray Circle for a different perspective. Just never get tired of the views and history."], ["Reviewed October 8, 2017", 5.0, "lots of shoping", "This is a place where you want good shoes. Lots of walking but lots to see. eat, drink. and shop. Quite a bit if history as well if you look out for the placards."], ["Reviewed October 8, 2017", 5.0, "A Great Day at the SF Bay", "Driving up from San Jose we were in San Francisco for fun. The bay is a highlight and it was beautiful and clear so the bay was blue. Alcatraz Island looked appealing there in the middle of the bay. We didn't take the boat out, though, because we didn't have that much time. Instead, we drove across the Golden Gate Bridge and looked at both coasts (San Francisco and Marin), spotted some ships and sail boats in the water, and studied the newest skyscraper, among many, on the SF side. Later, when we drove back from Marin, we went along the Presidio (now a national park) and through Golden Gate Park. We only saw a portion of the bay but there's so much to see on the surrounding land - the natural beauty, the neighborhoods, the marinas, etc. - that you can't see all that the bay has in one day. I've driven around the entire perimeter and just doing that took a couple of hours, mainly because of uneven access, i.e., the variety of roads and highways that circle the bay. It's better to explore one portion and enjoy the time getting to know the land and sea marks that make up SF Bay.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Beautiful!", "SF Bay is well worth seeing! A beautiful place/sight! Best bet is to take is to take the Chucky's Pride Tour/Boat to see the Bay plus it takes you to/under the Golden Gate Bridge! 15$ per person and it's well worth it! Ask for Roger!"], ["Reviewed October 6, 2017", 5.0, "Fantastic Experience", "Did a Bay Cruise with 'Red and White Cruises' from Pier 43 & 1/2 (Fisherman's Wharf). This took us under the Golden Gate Bridge and back.\nThe information supplied on the tour was very interesting and there are so many great photo opportunities to be had.\nWould definitely recommend taking this tour.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Loving it", "We spent most of the day around the bay, or having it as a starting point to visit everything in SF. Lots of attractions here, lots of restaurants and shops and parking around here is pretty expensive with deal for 1 day parking up to 45 dollars per day due to demand. Conning scheme, methinks.\nShow less"], ["Reviewed October 3, 2017", 5.0, "lovely day", "went on a bay cruise to golden gate bridge and alcatraz island, went and saw the sealions on fishermans wharf and called at bubba gumps, back to civic centre on cable car , what could be better"], ["Reviewed October 3, 2017", 5.0, "The city by the bay", "If one comes to S F you should consider weather, time of year and what you can do via public transportation.\n\nBest months in the city are Sept through Nov since the coldest time is during July and August. Bring a jacket, sweater/sweatshirt and long pants.\n\nIn the Summer/Fall we have local street fairs and baseball so keep this in mind. Consider getting a 1, 3 or 7 day City Pass to use on the bus, Metro and/or Cable Car. The City Pass can be purchased by the Powell St Cable Car turn table or the SF Cable Car Museum. Worth it to have for a visit in the city.\n\nS F offers so much to see and do. There are activities to keep in mind for kids - Golden Gate Park, S F Zoo, the Exploratorium, California Academy of Science just to name a few.\n\nDo your homework before coming so you can enjoy the City by the Bay!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Always bring romantic nostalgia", "Unlike most other City by the bay, San Francisco Bay brings you romantic nostalgia regardless how many times you visit and how often you come by. Get on a sail-boat (either commercially operated, or renting a sail boat and sailing on your own) on SF Bay on a sunnym breezy day will give you an exhilarating experience that will last you a life-time. In addition to varied city experiences, you can ride a ferry to the Angel Island to view its history richer than the \"Ellis Island of NY\", hike up to the top of Mt. Livermore, or also visit Alcatraz Island to view former prison cell of \"Al Capone\". All these experiences make San Francisco Bay the most \"nostalgia\" filled city by the bay.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Sea lions at Pier 39, great seafood, scenery of the Golden Gate bridge and Bay bridge.", "Loved the San Francisco Bay area. The wharf area felt very safe, great views and seafood. Took the ferry to Sausalito from the Wharf; did the Alcatraz Tour from the Wharf area. It is fun to just wander around the Wharf area - I would advise doing it earlier in the day - less tourists.\n\nShow less"], ["Reviewed October 1, 2017", 5.0, "Best part of my trip", "I was doing a downtown tour with my hop on hop off bus, and decided to hop off since Exploratorium and made it to Pier 39. It was the best part of my trip since there is so much to see... and if the weather is good, it's probably the best walk you'll get in the city. Eat, see, visit, take photos, sit down and contemplate. It's worth it in all circumstances.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Beautiful part of the city.", "Great shops and choices of restaurant. Lovely to watch the seals, pelicans and other wildlife. Can be very busy at pier 39 but still great to walk around. Be aware that San Francisco seems to high high number of homeless or people with mental health issues, they don't tend to bother people though. You can do the Alcatraz trip and whale/dolphin watching from here.\nShow less"], ["Reviewed September 29, 2017", 4.0, "A beautiful scenic place.", "The bay is a beautiful area and alive with activity lots to see and do take a boat trip to Alcatraz relax and watch the sea lions sit have a beer some food and people watch"], ["Reviewed September 29, 2017", 5.0, "Wonderful way to experience San Francisco", "Parking in San Francisco is a nightmare, so if you can find a space, it might be best to park and then walk, ride the bus, or take Ubers around town. Fisherman's Wharf and Pier 39 provide great views of the bay and Alcatraz. You can purchase fresh seafood (i.e. shrimp cocktail, lobster, boiled crabs) from 1 of the seafood stands. There are street performers and artists that add some San Fran flavor. You can see the Sea Lions resting on the floating docks at Pier 39. Don't miss the shops, entertainment, restaurants, and food stands inside of Pier 39. You can't see all that is available from the outside. Chinatown is a quick bike or rickshaw ride away! There are also many ferry boats and tours available for Alcatraz and surrounding area.\nShow less"], ["Reviewed September 25, 2017", 5.0, "BEautiful", "We spent a wonderful morning wandering around the Bay and it truly is a beautiful place to spend some time."], ["Reviewed September 24, 2017", 3.0, "Beautiful", "Wonderful views and scenery. A must do . San Francisco offers the best in scenary and transportation. We go here everytime we visit"], ["Reviewed September 24, 2017", 4.0, "We Stayed Near the Bay so enjoyed many walks", "The bay area is very busy but bursting with life, including many artists playing wonderful music on the sidewalks and others selling paintings or making balloon toys for children etc.. Unfortunately there a quite a few homeless asking for donations for their weed, there words not mine, and beer. Some of these were in a very serious state. However they were not intimidating and just added to the atmosphere of this wonderful place.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Nice Day Out!", "Came here during our first day in San Francisco and was a perfect day for it. A lot of shopping and food."], ["Reviewed September 23, 2017", 4.0, "The smells of fresh baked bread and the salt air of the wharf area are heavenly.", "Walk along the wharf and shop, eat, drink and be merry. The food aroma is all around you stop by and check it out if you are San Francisco."], ["Reviewed September 23, 2017", 5.0, "Most tourist visited area", "This is one of the most attractive place in SF, If you visit SF then you don't miss it there are lots of souvenir shops around this area. Most beautiful and picturesque area. You will find lot of places familiar because of photos you have seen earlier. There are lots of restaurants, some are pricey.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Beautiful Area with stunning views", "It's a beautiful area filled with tourists and buzzing with various entertaining options, bars and restaurants and gift shops, An aquarium, pier for boat tours, all are here.. Must visit when in SF."], ["Reviewed September 21, 2017", 4.0, "interesting, but not as relaxing as I expected", "I actually expected a kind of paseo along the bay with restaurants at the water etc.\n\nThat was not really the case. Restaurants and shops were one street behind it. But it is still nice for a walk.\n\nAnd it is the point of departure for many things you want to do/see in San Francisco: Alcatraz, Golden Gate Brigde ...\nShow less"], ["Reviewed September 20, 2017", 5.0, "Take a cruise on the bay", "Pier 39 offers a great shopping a food experience for the whole family. Sea lions lay on the pontoons at the end of the pier. A great experience is to take a cruise with the Bleu and Yellow Cruise company. It takes in the Golden Gate Bridge and around Alcatraz with excellent photography opportunities.\nAll forms of seafood are available with Clam Chowder a favourite.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Stopped awhile for photos", "We walked around a few hours and the day was beautiful. It is a lovely photo spot.the people were in the water .. some were swimming.. wading and just sitting by the small beach. We were near Fisherman's Wharf. Great place to walk."], ["Reviewed September 18, 2017", 5.0, "Take A Cruise on the SF Bay", "One of the best ways to view the San Francisco Bay is to take a cruise tour of the SF Bay. My hubby and I took the 90 minute Bridge 2 Bridge Tour on the Red and White Fleet on a Sunday afternoon @ 2:15pm. Loved this non-crowded tour of the Bay. Passengers listen to headsets during the duration of the tour (16 languages are offered on headsets for travelers from foreign countries). One cruises on the Golden Gate Bridge, under the Bay Bridge, around Alcatraz Island, and one also has great views of San Francisco itself while aboard the Red and White Fleet.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Four nights - enough for us, excellent place to visit", "So we had four nights it was Just enough, but only just. We don't do any shopping, so if you want all that garbage add another day, I've individualised the places we visited, but San Francisco is excellent, well worth a visit. We stayed near union square great for shopping, we'd probably stay in fisherman's wharf next time. The buses are great, trams are crammed, but a must to tick off the list. Do the golden gate park, bridge, palace of art, Lombard street, Alcatraz & Angel island. And walk lots, beach lots. - I've done separate reviews of the places in SF we visited, ate, stayed etc please see my other reviews. - questions welcome.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Pretty", "Very pretty but extremely \"touristy\" so really commercialised. Worth seeing but not a lot if time needed here."], ["Reviewed September 16, 2017", 4.0, "Great area", "There is everything: nature, landscape, food, shopping!! It's nice to walk around, buy souvenirs, eat an ice-cream or juste to have a drink 😎"], ["Reviewed September 15, 2017", 5.0, "Omnipresent is the Bay", "The Bay figures strongly in the whole region since it is so large. The streets of San Francisco offer many walking options and different views of the Bay in all its moods and then the Golden Gate and Bay Bridges offer yet more in terms of views and vistas. It makes San Francisco a very maritime city with attractions in their own right such as Fishermans Wharf, Ghiradelli Square and the Ferry Building all part of the harbour scene. So, San Francisco would not exist the same way without the Bay, along with Oakland and San Jose. The Embarcadero is worth a long walk to take it all in. Beyond Ghiradelli Square there is the aquatic park and Bayside parks so, there is something for everyone, especially those who enjoy walking and exploring.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Great views", "We liked how almost everywhere you were around the piers you could see the bay. With the fog and nice temps. we had a great time."], ["Reviewed September 14, 2017", 5.0, "Just do lovely, interesting and refreshing", "I love to walk around the bay watching all the boats and yachts going by. You can sit on the small beach or on the grass in the park watching those brave enough to swim in the harbour or you can walk to the end of the municipal pier and take in the fabulous views from the Golden Gate Bridge back towards the Bay Bridge. It's a refreshing way to idle some time away particularly when the sun is out. You can ride a bike or walk all along the coastline to the bridge if you like too.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Beautiful Bay", "San Francisco Bay is a shallow estuary in northern California surrounded by cities of San Francisco ,Oakland and San Jose.San Francisco city grew on the shore of this bay.World famous golden gate bridge, two other bridges connect the far flung areas opposite the city of Sanfrancisco. Trade and commerce with east Asian countries used to take place from this area earlier.The existing piers and fisherman's wharf on the sea shore at San Francisco bear testimony to this activities.Now the bay adjacent to this city has been converted to a tourists paradise ,tourist entertainment place . Thosands visit golden gate , pier 39 ,fisherman's wharf and other adjoining areas .Boating in the bay is very enjoyable ,pleasant .We enjoyed our stay and visit to this bay area very much.Worth visiting area.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Just love the people watching", "Was in the area for only 48 hours and I just love this city. The people are so friendly, warm, and welcoming. The farmers markets are to die for, be careful you don't spoil your lunch/dinner plans."], ["Reviewed September 13, 2017", 3.0, "Sea lions best thing", "Really San Francisco would do well to empty their garbage cans more and invest in a street sweeper. It's pretty dirty. I love the sea lions. Restaurants have good food. It gets very crowded and honestly to me it is like a boardwalk. Sausilito across the bay is much cleaner and more upscale.\nShow less"], ["Reviewed September 13, 2017", 5.0, "The Bay ... with Karl the fog, this is San Francisco", "So many little hidden places to just sit and relax along the shore. the Bay is what forms the soul of the area, and gets in the way of good traffic planning. But, it is nice to just stop and find a spot and enjoy it. It is what keeps the area cool in the summer and warm in the winter. When it is very hot to the east, over the hills The Bay and Karl the fog keep you nice and cool in the summer.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Busy but wonderful...", "A great and busy place with all types of activities. Where comfortable clothing and shoes as it seemed we walked alot."], ["Reviewed September 11, 2017", 5.0, "A hub for most tourist attractions", "The San Francisco Bay is a must see as it offer a lot of tourist attractions. Its place from where one can take a cruise of bay or see Alcatraz and the Golden Gate bridge. The Ghirardelli Square is also few minutes from here. There is a small beach and a lot souvenir shops and restaurants, There are people performing on the streets.One can see Aquarium of bay at Pier 39. Its one of the most happening place of SF\nShow less"], ["Reviewed September 11, 2017", 4.0, "For what it is - it's pretty fun", "First things first - realize that Fisherman's Warf is a tourist trap and be okay with that! We didn't spend too much time here since we wanted to obviously explore SF and not get trapped here spending insane amounts of money but we got a great lunch at Boudin's - the sourdough bread bowls are worth it. We picked up some souvenirs for family back home - this was great since there were multiple shops lined up here and it made it easy to find something for everyone on our respective lists in 1 trip so we could spend the rest of our time actually exploring the city. We got some cookies at Mrs. Fields because they don't have them back home anymore and they are delicious! :) And then - the main reason for us coming down to the Bay was to see those Sea Lions!! We had the most fun watching them and I honestly could have spent the whole afternoon giggling at their antics. It was quite crowded on a Saturday afternoon though so we headed out when we ran out of breathing room but going on a less busy day and hanging out there to watch them would have been a great way to spend a few hours in my opinion. Yes, this place is full of gimmicks - there was even a magic show going on in the middle of the plaza when we were going through but it was a fun little experience and the food was good and it was super great to get all the souvenir shopping out of the way in 1 shot and the Sea Lions were definitely a highlight of our trip.\n\nSo I say go - but just know when to leave.\nShow less"], ["Reviewed September 10, 2017", 3.0, "Busy, loud, fun experience for first few days", "Taking transit down there is an experience. Recommend the hop on and off bus to see everything if you can when you get there. Take the bay cruise too to enjoy the view & fresh smell of the water. Bit of walk from one pier to another, try the segway tour or the street cars.\n\nToo many people packed in this pier, lots of tourist shops, beware of impulse shopping. Plan what you want to see so you don't get lost or spend too much time in one area. Parking is atrocious so is food, bring your snacks and water.\nShow less"], ["Reviewed September 10, 2017", 4.0, "My home", "I grew up next to the bay, I fell asleep to the sound of fog horns (to hear them listen to the intro to \"song for your ancesters\" off the Steve Miller album Sailor)."], ["Reviewed September 8, 2017", 5.0, "Many different things to see", "So many things to see and do at San Francisco Bay. Have a ferry ride to Alcatraz or under Golden Gate Bridge. Walk around the piers and look at all the interesting shops or sample some of the local delicacies. Take a bicycle ride, or the Muni for faster access. Visit the Exploratorium or Aquarium to learn more about the Bay.\nShow less"], ["Reviewed September 8, 2017", 4.0, "The tourist trap of San Francisco", "San Francisco Bay is a must see when you are in San Francisco. From this place you can see Alcatraz and the Golden Gate bridge. There is a small beach and a lot of touristic attractions. Several souvenir shops and restaurants, On Pier 39 you can see the seals who are laying down in the sun and fight for each place. The area is very touristic and lot \"kitsch\" is offered. But, it is absolutely a nice place that you should not miss.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Beautiful promenade", "If you are in San Francisco and you have few hours spare don't miss the Bay. You need to walk over there so be sure you have a good pair of shoes. While there you can visit the aquarium and be wit your foot on the ocean. A beautiful view of ship that usually is at few meters from the shore it is goddess for pictures. While approaching lunch time don't miss the prawn and crab soup served inside the bread. What for the seagulls while eating ... they are hungry too... sometime approaching you in a very aggressive manner. Then a chocolate at Girardelli square it's a great ending story for the day. Enjoy San Francisco. ...\nShow less"], ["Reviewed September 6, 2017", 5.0, "Beautiful", "The San Francisco Bay is absolutely gorgeous on a clear day. We tend to go in March/April or October when it is not foggy. It is a day drive for us, so we have the flexibility to watch weather. We like to park near the Ferry Building and stroll past Ghiradelli Square. It is a beautiful walk with many many opportunities to enjoy the Bay.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Interesting place to walk", "It is fun just to walk around this whole area. Pretty views of the water, plus shops and restaurants."], ["Reviewed September 6, 2017", 5.0, "Simply the best Bay on the planet! Sail the Bay; Take the Ferry across the Bay; cross Bay bridges weekly, cross", "Few bodies of water exhibit the variety of conditions as the San Francisco Bay! Sail, Kayak, Powerboat, Paddle Board, Kite Surf, Foil & so many options in what is the most scenic bay anywhere!\n\nCharter boats, kayaks, swim, if you dare, fish, kite & the possibilities are endless. From glassy, smooth to swells & winds to satisfy the most discerning, San Francisco Bay is a destination \"resort\" free to experience for all!\nShow less"], ["Reviewed September 6, 2017", 4.0, "A San Fran Must Do!", "So much to see and do. Fun stores, museums and lots of food options. It's fun to check out the seals and of water life up close."], ["Reviewed September 6, 2017", 5.0, "Best way to visit san francisco is from east bay", "The best way to visit san francisco for a visitor is by ferry from east bay oakland jack london square. The parking at ferry building parking structure at jack london square is free with validation on ferry and the ferry ride is beautiful. Make sure you park in the right building and validate the parking ticket on the machine at ferry entrance. The ferry leaves oakland port and goes under the bay bridge and goes to san francisco ferry building and then to fisherman's wharf. You get some amazing views and is highly recommended. Try and sit on the open air top and you will have an unforgettable journey as well as amazing pictures!!\nShow less"], ["Reviewed September 6, 2017", 5.0, "San Francisco - A European City", "Having lived in Europe and the USA, I can honestly say that San Francisco is the only city in the USA that feels like a lot of European cities. You can easily walk throughout the town and there are several things to do and see along the way. Every now and then I pretend I'm a tourist and travel down to Pier 39 or I go to North Beach and do a pub crawl to hang out with the locals.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Fun city, fun place", "Walk along the bay, enjoy the shops, the city, the hustle and bustle of the city. The bay was smokey when we visited recently, from wild fires. The city was hot and hazy and still every bit as fun."], ["Reviewed September 3, 2017", 5.0, "Busy place", "Loved walking along all the piers and eating at pier 39 and fishermans wharf. The areas have lots of eating places and shops and good photo opportunities of the bay bridge and Alcatraz island"], ["Reviewed September 3, 2017", 4.0, "Enjoyable", "The bay is very beautiful and there are many things to do here. Shops and eateries can easily be found. Walking along the shore and enjoying the scenery is my favorite."], ["Reviewed September 2, 2017", 5.0, "Lots to see", "There is lots to see and lots of walking. However there are plenty of benches or outside seating at restaurants to have a break and a drink."], ["Reviewed September 2, 2017", 5.0, "San Francisco Bay during summer", "I thought the month of July (Summer) in San Francisco, you will enjoy the summer outfit. People are in jacket and scarf."], ["Reviewed September 1, 2017", 5.0, "initforfivehours", "Left on the Warrior Poet from the San Francisco pier, went all around Alcatraz, over to Marin county waters. Nice day till about 5:00 PM. Got choppy, but smooth before that. The Bay is big enough to get into trouble if you're not careful. We had a blast, caught many fish.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Nice for walking and buying souvinirs", "This is the place to be in San Francisco if you want to have a nice walk (in the bay area) and buy some cool souvenirs and have some cool shops. It can be crowded but the area is really vibrant and there are a lot of cool shops and bars.\nShow less"], ["Reviewed August 31, 2017", 5.0, "To visit it constantly", "San Francisco Bay is one of that places that you never get bored when visiting it. There are always lots of options to do, and if not, just walking and enjoying the views and people walking is more than enough to mess around."], ["Reviewed August 30, 2017", 5.0, "Just as you see on photos", "Its a must when in S.Francisco ! Spent a couple of hours strolling in the area - very pleasant. Had lunch in one of the many restaurants. It was fairly good."], ["Reviewed August 30, 2017", 4.0, "Something for everyone", "The whole bay (Fisherman's wharf) area has a lot to offer. Lot's of shops, restaurants, tours. All you want. Great ambiance and a great contrast with the down town area."], ["Reviewed August 28, 2017", 5.0, "Stunning and pleasant", "I saw the bay many times in my visit. It's beautiful. There is a view of it from everywhere in the city, and a view of everywhere in the city from it. It's really a Don't Miss."], ["Reviewed August 28, 2017", 5.0, "Great place to visit", "History is this place middle name, views across to Alcatraz island and great sea lion pics can be taken!"], ["Reviewed August 28, 2017", 5.0, "Great vibe", "The sea lions basking is just one of the beautiful things to see here. Shops and restaurants galore. Lots of photo ops. Kids and families will love this place."], ["Reviewed August 27, 2017", 5.0, "Beautiful San Francisco Bay", "We love to go for walks, picnics, and more and regularly visit places around San Francisco Bay. This time we went for a scenic walk and drive."], ["Reviewed August 27, 2017", 5.0, "Love the views", "Perhaps one of the most picturesque places in the country. Walking is nice but s boat ride is even better. Lovely way to spend an afternoon. Lovely tourist oriented location."], ["Reviewed August 27, 2017", 5.0, "Beautiful!", "I absolutely love this bay, and it so incredible. There is so much to see both on land, as well as gazing into the water- bridges, boats...."], ["Reviewed August 27, 2017", 5.0, "Sea Lions", "Could spend all day every day here, from the great food, cars, people, theres tons to do. Bring money!!"], ["Reviewed August 26, 2017", 5.0, "The best bay", "Resembles the history and the diversity in San Francesco bay which is a memorable walk with lots of shops and dinners around you and you have a chance to visit Alcatraz jail by day or night with the chance to experience being an inmate in a prison were you can't see your finger tip in middle of the day.\nEnjoy\nShow less"], ["Reviewed August 26, 2017", 5.0, "Beautiful area", "Everyone was enjoying themselves. Some walking, laying out on the beach, reading a book and a few were even enjoying an afternoon swim."], ["Reviewed August 22, 2017", 5.0, "Scenic and interesting.", "San Francisco Bay is the area along the bay including many attractions. Must see area in the city. We took the tram to get there and walked to many of the attractions."], ["Reviewed August 22, 2017", 4.0, "Good!", "We got here quite early when the shops were still closed and it wasn't very busy which was slightly eray but once the place got busy it was a lovely place to be."], ["Reviewed August 21, 2017", 4.0, "Game ball!", "While visiting San F, I asked my son if he would like to go to a baseball game. No fans of either team that played that day, but walk the stadium, learn and enjoy. If traveling with kids under 12, you have plenty of activities for the kids.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Gorgeous to stroll and look out", "It is very nice to stroll along the bay and look out to the bridge and to Alcatraz Island. From the farmer's market to the Embarcadero to the Fisherman's Wharf, there is lots to do, much to buy and lots of choices for lunch and snacks. Very crowded at times.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Almost a park attraction", "Nice place to hangout, have a drink or dinner and even make shopping and see sealions having a sun bath."], ["Reviewed August 17, 2017", 5.0, "Take the walk/bike around", "The bay is an all encompassing area really. From The city round to the bridge there is so much to do and see, whatever takes your fancy.\n\nThe ferry building, the Alcatraz Terminal, Pier 39, the sea lions, Fishermans Wharf, the swimming club (we sat and watched the open water swimmers), through the marina area and some of the weird houses worth millions, across the park to the bridge is just a wonderful environment and all round the water of the SF bay.\n\nOn sea, get out there, there are no shortage of ways to enjoy the water, be that a boat hire, a trip on the ferry or a dinner cruise. Lots of ways of enjoying the bay.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Enjoy the views", "You will enjoy the water views, not only of San Francisco and Marin, but also of Angel Island, the Golden Gate Bridge, and the Bay Bridge, and the sea life and sail boats. Many good restaurants are nearby wherever you choose to go."], ["Reviewed August 16, 2017", 4.0, "Nice place to kill a few hours", "Has various lunch options. Lots of office lunch crowd inside at lunch hour. But a good visit. There are food stalls outside and some farmers selling fruits etc as well."], ["Reviewed August 15, 2017", 3.0, "Nice place to take a walk and see the sights", "The bay is a nice place to get familiar with all the things to do around San Francisco. Good starting point if you want to take a boat ride to see some of the sights and a better view of the Golden Gate Bridge."], ["Reviewed August 14, 2017", 5.0, "Tons of things to do !", "Fun area with shops, restaurants, and other fun attractions on both sides of the bay. Take a SF Bay cruise for great views of the SF skyline, Alcatraz, and the Golden Gate Bridge. You can go whale watching, or tour a submarine, or just chill out by the bay and watch the activity. Lots of crowds, particularly in the summer, so best to go early in the day.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Fun", "Cruising around the bay in any of the numerous ferries is a great way to see the San Francisco skyline and other attractions."]]}}