{"San Francisco Bay Bridge": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "San Francisco Bay Bridge", "url": "/Attraction_Review-g60713-d156622-Reviews-San_Francisco_Bay_Bridge-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/1d/bf/c1/cisco.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1570"}, "address": {"@type": "PostalAddress", "streetAddress": "Highway 80 West", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94105", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Beautiful at night", "I can't count the number of times I have been to San Francisco on business and someone in our group asks \"is that the Golden Gate Bridge\"? No it's not, but it is quite lovely in its own right and is beautifully lit at night. It is frequent that one of our group will want to get out of the car to grab a photo of this bridge on the skyline. Part of the San Francisco experience.\nShow less"], ["Reviewed 4 days ago", 4.0, "Best way to treasure island!", "The Bay Bridge looks similar to the Golden Gate but is grayish, without the pinkish hue. There is a great view of it from the top of Lombard street. We rode a bus over the bridge to get to Treasure Island on a weekend when there was not much traffic so ride was great. Most of the time we saw the bridge it looked plenty congested.\nShow less"], ["Reviewed 5 days ago", 5.0, "Another beautiful bridge", "This bridge may not be the icon that comes to mind when you think of SanFrancisco, but it sure stands out at night. It’s so well lit, it’s does a little light show in the evening. We were able to see it from the boat going to/from Alcatraz Very nice\nShow less"], ["Reviewed 6 days ago", 5.0, "Take a stroll on Embarcadero", "Get dropped off by the At&t Park and just keep walking up by the river. The Bay Bridge was outstanding. Theres a few great restaurants up a bit with amazing views of the bridge. Go inside and order a glass of wine and marvel in the beauty of what you're looking at to your right. Wine and bridge view is perfections.\nShow less"], ["Reviewed 1 week ago", 4.0, "It's a Big Bridge - New Span Open", "This bridge is often mistaken for the Golden Gate Bridge although I am not sure why. This multi lane artery carries a lot of traffic, has several different bridges and even a tunnel. But driver beware during rush hours."], ["Reviewed 1 week ago", 5.0, "Iconic", "Another one of the must-sees in the United States. Absolutely beautiful from the air or the ground, and stunning at night. We have seen it from an airplane and have driven across it too."], ["Reviewed 1 week ago", 5.0, "Gorgeous bridge at night", "The Bay Bridge is a gateway to San Francisco and Oakland. The best view is on the upper deck going towards San Francisco. You pass the Eastern span, Treasure Island tunnel and a beautiful right view of the San Francisco skyline. It's too bad there's no pedestrian lane like the Golden Gate Bridge to enjoy the view. You need to be stuck in traffic to see but most drivers are commuters. The night lights makes the bridge a showstopper.\nShow less"], ["Reviewed 1 week ago", 5.0, "Take a boat and get under this bridge", "Launched in 1939 as part of the Golden Gate International Exposition, our Golden Gate Bay Cruise has been a highlight of any visit to San Francisco for nearly 80 years. Cruise along San Francisco’s breathtaking waterfront, under the majestic Golden Gate Bridge, and loop closely around notorious Alcatraz Island. On our Golden Gate Bay Cruise you’ll discover the city’s colorful history and world famous landmarks with personal headphone audio in 16 languages. During the Golden Gate Bay Cruise, you may also experience up-close wildlife encounters including seagulls, pelicans, and sea lions. At times, you may see even harbor porpoises and whales, so be alert!\n\nDeparting from the heart of historic Fisherman’s Wharf at Pier 43½, cruise alonside the San Francisco’s remarkable cityscape and view the lively neighborhood of North Beach, the famous swimming clubs of Aquatic Park, the historic vessels moored at Hyde Street Pier, the San Francisco Maritime National Park, and numerous other exciting sights along the way.\n\nAs you head west towards the Golden Gate Bridge, you’ll view Fort Mason and the Marina District, which was damaged in the 1989 Loma Prieta earthquake. Next, take in views of Crissy Field and the lush hillsides of the Presidio – both former Army installations – that are now part of the Golden Gate National Recreation Area. Don’t miss incredible photo opportunities while cruising directly under the massive 4,200-foot long, 746-foot high span of the Golden Gate Bridge.\n\nAs you head back into the Bay, travel past the wildlife reserves of the Marin Headlands and the legendary town of Sausalito, which was once home to the late-1960’s Flower Generation. With Angel Island State Park to your left, you’ll slowly cruise around (and up-close to) the infamous Alcatraz Island. On your way back to Fisherman’s Wharf, you’ll see the San Francisco-Oakland Bay Bridge, and Coit Tower in the distance.\n\nAfter a full-hour of exciting sights on Red and White Fleet’s Golden Gate Bay Cruise, the barking sea lions over at nearby Pier 39 will welcome you back as you approach Pier 43½. Here, you can visit two National Historic Landmarks, the WWII submarine USS Pampanito and merchant marine vessel SS Jeremiah O’Brien.\n\nDetails on our Golden Gate Cruise Bay Cruise:\n\nAvailable on board is a full bar with drinks and snacks (at reasonable prices).\nCruises Depart from Pier 43 ½, Fisherman’s Wharf.\nThere are 8-18 daily departures from Pier 43½ starting at 10:00am (and as early as 9:15am in the Summer months).\nPlease arrive at least 30 minutes prior to departure. Boarding on first-come, first-serve basis. Your ticket is valid for any departure time within 365 days from date of purchase.\nThe Golden Gate Bay Cruise departures between 1:10pm and 3:45pm tend to be visited by tour groups. For a more peaceful experience, we recommend hopping on earlier or later cruises, or try our Bridge 2 Bridge Cruise in the afternoon hours\nPricing:\nAdult: $32.00\nYouth: $22.00\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A San Francisco Landmark", "If you are driving into San Francisco and you have a chance to take this bridge I would highly recommend it. It is interesting to see how this bridge compares to the old style bridges that have spanned the waterways in the past. And yes, if you are an engineer you will appreciate the design.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Incredible Views", "Although it took 45 minutes to get through traffic to pay the toll on a Saturday afternoon, driving across the Bay Bridge was amazing. The architecture of this bridge is breath taking and it was fascinating driving across. I would definitely wait another 45 minutes in traffic to do this again sometime.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A nice Drive across", "We had a nice drive across the bridge coming from Oakland to San Francisco, full traffic jam at the Oakland end by the toll booths, once on the bridge it was much less congested and a rather nice drive back into the city. I believe the toll was $7.50 which seemed a little high to me but I’m not used to paying tolls.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "2,40,000 Vehicles cross its 10 lanes everyday. The Best view of the Bridge I had was from Berkeley Room.", "While in San Francisco for the first time, in January this year, we drove on this beautiful Bay Bridge to reach Berkeley. I had a chance to cross this bridge a few more times and had the fabulous view of the Bay and the Port from it.\nThough it is good to take photographs while travelling on the Bridge but the Best view of the Bridge I had was from my room in Berkeley. It was lovely to photograph it many times.\nThe Bay Bridge is officially known as the San Francisco -Oakland Bay Bridge. The bridge connects San Francisco Bay and Oakland, 240,000 vehicles a day pass over the bridge on one of the ten lanes designated for vehicles. There is also a cycle and pedestrian lane.\nThe bridge initially carried trains on the lower deck but once the Key System Transit line was closed it was converted to vehicles, thus doubling the capacity for cars and lorries.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Must see.", "Take the hop on hop off bus tour. It brings you across the bridge where you can get off and take photos. It is one of the best ways to experience San Fransisco."], ["Reviewed 3 weeks ago", 5.0, "Spectacular Engineering", "The Bay Bridge San Francisco Two Oakland , I first travelled over this bridge in 1980 and couldn't believe my eyes at the views from the bridge over the Bay Area .Originally constructed in 1936 it stood proud over the Bay Area of San Francisco untill a few years ago when age started to take its toll on the old girl. So in 2013 the new Bay Bridge road from the water s beside the original and what a spectacle it proved to be on the skyline. At a cost of some $650 Billion the widest bridge in California has built in earthquake shock resistance this is a fantastic credit to the designers and the sState of California. If you want a really great view of the new Bridge go to The Embarcadero in the evening and wonder at the beautiful sight, all lit up against the night sky .\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautifully lit up", "Best is to see it on a cruise at night, it was so beautiful all lit up, lights dancing along the wires. It was almost magical."], ["Reviewed 3 weeks ago", 3.0, "Beautiful to See From a Distance; Often Clogged with Traffic", "This bridge was entirely replaced a few years. To make it \"earthquake proof.\" For me, that's not a big advantage. The big disadvantage is too few lanes of traffic. It can take 90 minutes to get onto and across the bridge from the SF side--and the alternatives are unappealing.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The new Bay Bridge is a great place to bike", "Take your bike from Ikea in Emeryville and go on the west bound bike path up to Treasure Island. Beautiful views all along this beautiful new bridge gleaming in the sunlight. You will see the bike lane signs just at one end of Ikea if you look for them. Its up hill gently all the way but well worth the effort.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Entrance to the City", "We drove up from Truckee and as we entered the city crossed the bridge. It is a toll so have your $5 ready."], ["Reviewed 4 weeks ago", 5.0, "Beautiful Re-Design", "Part of the bridge was recently re-built to meet earthquake safety standards and the re-design is stunning, especially at night. For me it's a workhorse getting me across the Bay, often clogged with traffic."], ["Reviewed 4 weeks ago", 5.0, "Beautiful at night", "We were told about the dancing lights,that happened at night on the bridge,so we decided to take a look at it.It was really nice.The cars lights reflecting,does make it look very pretty"], ["Reviewed 4 weeks ago", 5.0, "Sweeping Views", "Despite the traffic on Hgy 80, I always enjoy the sweeping views of the bay while going over this bridge. Two tips are that the there are only 1or 2 pay stations that take only cash and watch carefully for your correct exit a you can get lost on 1 way streets after exiting.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Bustling with traffic, albeit often at slow speed due to traffic volume", "We viewed the bridge first as part of a boat tour of the bay area and then drove over it during the late afternoon rush hour. Although it was the world’s longest bridge at the time it opened in 1936, today it does not rank in the list of the world’s top 25 largest bridges. The world’s longest today is China’s 102.4 mile Danyang–Kunshan Grand Bridge, which is a viaduct on the Beijing–Shanghai High-Speed Railway.\n\nBuilt over the 1933 to 1936 period, this double-decker toll bridge carried nine million vehicles in its first year of operations. Today it carries 11 times the amount of traffic and has huge traffic jams during rush hour times. It has a total length of 4.46 miles. Of its two main spans, the west is 1.95 miles, and the east 1.93 miles, both excluding approaches. Today, it is a series of bridges which includes a single deck eastern section.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "World famous landmark", "While on a tour in the famous VW bus, we made the trip across the bridge & had a magnificent view of the bay & Alcatraz Island."], ["Reviewed January 22, 2018", 5.0, "Busket List Trip", "You might or might not know that visiting San Francisco and the wharf area should be a bucket list trip. There is truly an endless amount of things & places to see, do and eat. Wow, what fun!"], ["Reviewed January 11, 2018", 4.0, "Much better than anticipated", "For transportaion it does an excellent job but as an asthetic piece of architecture it holds its own. In the evening the bridge is lite up with amazing lights that give a sense of magnitude / movement that can be very arresting. Shame that the Golden Gate takes all the glory.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Amazing", "Drove there during the night and it's amazing, I'm afraid of heights and bridges but since it was night I just made sure not to look to the sides, just took the amazing pictures of this amazing structure."], ["Reviewed January 7, 2018", 5.0, "Amazing view", "I love the golden gate but the bay bridge is something special also.To drive across at night with the light show The views from the warf looking over at Alcatraz and the hill are incredible."], ["Reviewed January 3, 2018", 5.0, "beautiful views", "Took a tour bus over the bridge on a foggy day. It was summer time but apparently it is foggy often there. Still a beautiful sight to see the cables of the bridge and even in the fog it was breathtaking. I do recommend a jacket as it was in the 60's and windy even in the summer. I also took a boat ride under the bridge and it was a fantastic view that way as well.\nShow less"], ["Reviewed December 31, 2017", 5.0, "We drove over it!", "You see from lots of points but driving over it is amazing. We came from Berkeley and drove into the San Francisco fog....great memory."], ["Reviewed December 30, 2017", 4.0, "See it at Sunrise", "I love the golden gate but the bay bridge is something special also. The views from the warf and the hill are incredible. I have attached two of my favorites."], ["Reviewed December 29, 2017", 5.0, "One should see in the night", "A very long bridge, bigger than golden gate bridge. Night lights are worth seeing. A great tourist attraction."], ["Reviewed December 27, 2017", 4.0, "Nice, practical, but not iconic.", "The Bay Bridge between San Francisco and Oakland is a nice bridge and very useful and important to both cities, but it's not nearly as iconic or internationally recognized as the Golden Gate Bridge which the city is known for. Handles huge amounts of traffic and does so very well.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Best view of San Francisco", "Love driving over this bridge into to city as it affords one of the best views of down town San Francisco. The new section is beautiful and one of the widest bridges if not THE widest in the world at present. The old section opened in 1936 is a double decker suspension bridge with the top level going into the city giving you that wonderful view\nShow less"], ["Reviewed December 21, 2017", 5.0, "DA BRIDGE", "The Bay Bridge is my friend..My way of getting to work and home everyday. Depending what time I leave for work (3:30am) the traffic is smooth(actually No traffic)..Sometimes I do hit traffic after work because there are careless drivers and accidents do happen. I don't mind traffic..I listen to music and enjoy the wait...On the bridge you do see lots of crazy things. But again I LOVE DA BRIDGE...just hope and wish they can find a better solution to avoid so much traffic\nShow less"], ["Reviewed December 16, 2017", 5.0, "Night Lights", "During the day, the iconic Golden Gate Bridge gets all the attention, but at night, the Bay Bridge rules supreme as it's lit up like a Xmas tree.\n\nThe Bay Bridge is technically the more impressive engineering feat as it's two levels and is substantially longer than the Golden Gate, but has always played second fiddle in terms of popularity with tourists (probably the colouration or lack thereof makes it less memorable/iconic?)\nShow less"], ["Reviewed December 12, 2017", 5.0, "beautifully lit at night", "We dined at the Waterfront Restaurant and saw the sunset Then the lights come on the Bay bridge Beautiful individual patterning, flows along the length of the bridge"], ["Reviewed December 12, 2017", 4.0, "A beautiful bridge by day or night", "The weather is often beautiful in San Francisco, particularly this December and the Bay Bridge with its shimmering led light show at night is spectacular."], ["Reviewed December 11, 2017", 1.0, "Not fun to drive", "Beautiful, but avoid driving this if possible. Crowded and slow and no fun - find a way to take BART or another option"], ["Reviewed December 10, 2017", 5.0, "New and improved.", "The bay bridge is like the middle child of the family. It is neglected and not given much love from its citizens due to the grandeur of the Golden Gate bridge. Not any longer. The new and dazzling lights of the Bay Bridge has given its sister bridge a run for her money. It is now open to pedestrians, bikers and canines with great views of the bay. No sibling rivalry here. These two magnificent bridges has made The City even more alluring.\nShow less"], ["Reviewed December 9, 2017", 4.0, "Beautiful...", "Just a beautiful bridge to behold, during day and especially at night. Due to normal traffic which is heavy, your passengers should have many attempts to gaze all over the Bay Area as your cross the bridge."], ["Reviewed December 2, 2017", 5.0, "I feel sorry for this bridge, overshadowed by the Golden Gate Bridge", "We drove over this bridge on arrival in SF and I thought it was excellent! To me both this and GG bridge are the same, both huge, awesome bridges."], ["Reviewed December 1, 2017", 5.0, "Beautiful Bridge", "A beautiful bridge over the bay connecting the Bay Area to San Francisco. The sights from this bridge are breath taking."], ["Reviewed November 29, 2017", 4.0, "connect from East bay to the city with great views", "Wonderful bridge connecting downtown San Francisco with the east bay arrive directly in Emeryville once you cross the bridge passing Treasure Island with greater views of Alcatraz and the City. Once in Emeryville theres lots of shops and a short hop to Berkeley and Gourmet Ghetto\nShow less"], ["Reviewed November 27, 2017", 4.0, "Similar looking to the Golden Gate Bridge", "The San Francisco–Oakland Bay Bridge (known as the Bay Bridge) and is the direct route between San Francisco and Oakland.\n\nIt’s not dissimilar looking to the Golden Gate Bridge but is silver in colour rather than red like the Golden Gate.\n\nFor this reason it has never achieved the popularity of the Golden Gate Bridge which is known worldwide\nShow less"], ["Reviewed November 23, 2017", 5.0, "A must see while in San Fran", "Great views and a cool place to jog or drive! They charge when you come back into San Francisco, but not on the way out."], ["Reviewed November 22, 2017", 5.0, "Cool Light Show", "We viewed this bridge for the first time after the sun set from the Ferry Building Marketplace. At first glance we thought there was some malfunctioning of the bridge lights, but then we gazed at it for a while to see the light show! VERY COOL!\nShow less"], ["Reviewed November 18, 2017", 3.0, "Scenic, graceful.....", ".....but if you have time to see only one bridge closeup head for the Golden Gate Bridge. Nice views as you drive across."], ["Reviewed November 17, 2017", 4.0, "Amazing bridge for views and sunrise", "Like most people, you are conscious of the traffic and at times, try and avoid the bridge / road. But the views are spectacular and worth the effort."], ["Reviewed November 10, 2017", 5.0, "Fantastic bridge for sunrise photography", "The Bay Bridge is an amazing bridge, especially if you enjoy sunrise photography. Its proximity to Union Square allows you to get there on foot early in the day when the streets are almost completely empty and enjoy the city in a different sense. The Embarcadero part of San Francisco is just by the water where you can see people jogging or walking their dogs. The bridge leads to Treasure Island if you want to watch the amazing San Francisco sunset with the skyline in the foreground. I was here several times and took lots of photos, of which I'm enclosing one so you can have an idea what the view is like around sunrise time from the Embarcadero side.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Some days good/some days awfull", "You just have to take your chances some days. Every once in awhile you get lucky and find a great traffic pattern. Night time can be beautiful with spectacular views though! Overall, it's a must see no matter what the traffic is giving you!"], ["Reviewed November 8, 2017", 5.0, "Monumental Bridge of SFO", "Its a must for every traveller to visit this bridge to understand how advanced SFO was in last century as the bridge is more than 100 yrs old & still strong & well maintained. Its always full with people."], ["Reviewed November 8, 2017", 4.0, "spectacular entry / exit to SF", "Toll-free leaving the city. Best not remember the partial collapse in an earthquake in twentiet century. Spectacular views, but not for the driver (US lane discipline! and road surface)"], ["Reviewed November 2, 2017", 4.0, "Beautiful", "It's a postcard picture in the evening. There are light outlining it and it's beautiful. Many people use bikes to go across but you can take a boat under as well. Or just view it from the pier in San Fran. Love walking the pier here.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Beauty at night", "We crossed the bay.bridge on our night tour on the tour bus. What a thrill. She's just as impressive as the Golden Gate. At night she is lit up with strings of lights that put on a subtle show. Get on the top of a tour bus and experience the height and fresh air as you speed across her, Thrilling\nShow less"], ["Reviewed October 27, 2017", 4.0, "Beautiful Views & Bridge", "The views of the bay and city are very nice crossing this bridge. Traffic coming from the Oakland side into the city can be brutal and bottleneck at the toll area so be prepared for potential delays any time of day. My favorite is to see the bridge at night. It is so beautifully lit at night and worth a trip over to observe. A work of art\nShow less"], ["Reviewed October 24, 2017", 5.0, "Breathtaking. A must do;", "Every angle is a post card. We were luck enough to have clear days. Visited both the North and South viewing points."], ["Reviewed October 23, 2017", 3.0, "Cousin to GG", "It is not red bit it is just as or nearly as nice as the GG bridge. On the ferry terminal wharf end, it spa still quite a long ways. We drove on it entering SF."], ["Reviewed October 23, 2017", 5.0, "Worth a crossing", "Do it once just to say you crossed the bridge. Traffic can be brutal. You get a great view of the city."], ["Reviewed October 23, 2017", 5.0, "For the best experience ride a bike over the bridge!!", "We road bikes over the bridge and it is the best way to see the bridge. It's faster than walking, but you get the same experience plus the added advantage of seeing more of the marina area as well. For best experience take bikes across the bridge to Sacilito (sp??)and take ferry back to SF.\nShow less"], ["Reviewed October 21, 2017", 3.0, "Bridge Connecting San Francisco to Oakland-East Bay.", "The Bay Bridge s actually comprised of two bridges connected by Treasure Island. The Bay Bridge (all grey) is a four-towers suspension bridge from SF to Treasure Island is the old section that have thousands of LED lights that light up at night showing various movements (seen from a distance). No bicycling or pedestrians allowed. In contrast the second newer section with the one tower (all white) is also a suspension bride going from Oakland to Treasure Island. for now you can cycle or walk from the Oakland side almost to Treasure Island and back again. They have not yet allowed going all the way to Treasure Island.\nThis is a serious commuter thoroughfare during peak hours and is a traffic nightmare in the morning going into SF and in the evenings going both ways.\nAlternatives are to going further south and cross the San Mateo Bridge or north across the Golden Gate Bridge then across the Richmond Bridge.\nThis is a bridge to be used. People use it. Complaining about it gets you nowhere. Plan accordingly. And get yourself a Fastrak.\nShow less"], ["Reviewed October 21, 2017", 4.0, "Complex of bridges linking San Francisco to the East Bay", "Opened in 1936 six months before the Golden Gate Bridge, the San Francisco Bay Bridge is actually a complex of bridges linking San Francisco, Yerba Buena Island and the East Bay. Built originally with two layers with automobiles on the upper and commuter trains and trucks on the lower, during the massive earthquake in October 1989, the upper deck on the eastern span collapsed onto the lower deck. The Eastern span has been reengineered and reconstructed since and at the toll plaza on the eastern side, the bridge is the widest bridge in the world. With the reconstruction, beautiful animated lighting has been added to the span so the nighttime views of the bridge are worth seeing. Variable toll pricing is in effect depending on congestion and car pool status.\nShow less"], ["Reviewed October 20, 2017", 3.0, "Must see at night!", "While the Golden Gate gets all the attention this bridge is stunning at night and very beautiful during the day too."], ["Reviewed October 17, 2017", 4.0, "Beautiful view at night.", "This bridge was lighted beautifully at night and we could easily see it from our hotel. Just as impressive as the Golden gate just not as famous."], ["Reviewed October 17, 2017", 4.0, "beautiful at night", "it's a bridge. What more is there to say? At night, however, LED lights move in patterns up and down the bridge in a lovely display."], ["Reviewed October 16, 2017", 4.0, "nice bridge", "bridge that separates oakland from san francisco . the bridge is actually really cool and kind of looks similar to the golden gate bridge"], ["Reviewed October 16, 2017", 5.0, "must see at night", "we did the gray line hop on and off night tour and they took us to treasure island where the views of the bay bridge lit up at night was breath taking and we had a full moon also so romantic"], ["Reviewed October 9, 2017", 5.0, "everyone needs this view", "Iconic stop for the whole world for sure , never get tired of seeing or crossing this landmark. stopped at the park for the first time and love all the nationalities surrounding us."], ["Reviewed October 9, 2017", 5.0, "Huge", "I love the views when driving over this bridge. It itself is amazing to look at. The traffic across is always overwhelming to me, but my native friends don't bat an eye."], ["Reviewed October 8, 2017", 5.0, "What a View", "Not exactly a tourist spot, but certainly fun to cross. You are in awe of how they build this beautiful bridge."], ["Reviewed October 6, 2017", 4.0, "Looks fantastic", "It's a fantastic drive and is the connection between Oakland and San Francisco and it's also very pretty to drive by and night. Every day i drove past the lighting was different and very beautiful"], ["Reviewed October 4, 2017", 5.0, "Another great bridge", "We took a day tour to visit this bridge and Golden gate bridge. Both bridges are equally amazing, although I would suspect this bridge is actually busier with people who work in the city. A great structure, as recognisable as the other great bridge."], ["Reviewed October 3, 2017", 4.0, "A drive through the Bay Bridge at San Francisco", "We traveled through the Bay Bridge on our way to and back from Berkeley and Oakland . A busy bridge any time you travel , this bridge offers good connectivity with the city and suburban area . Good view of the bay on both sides .\nShow less"], ["Reviewed October 3, 2017", 5.0, "Golden Gate Bridge expierience", "Mesmerizing site, looking at the city from above, seeing Alkatraz. The grandeur of this bridge and the history was humbling to say the least. It was a tad bit windy the day we were there which rendered a challenge walking. A must see for sure."], ["Reviewed October 2, 2017", 3.0, "Its a Bridge", "Okay the engineering feat must have been awesome but there are pretty bridges in the world tower bridge to name one"], ["Reviewed October 2, 2017", 5.0, "The new Bay Bridge", "Viewing the Bay Bridge the evening that the LED lights were first displayed, I found the sight delicious and inspiring. The Bay Bridge has become for me another wonderful icon of San Francisco with its harp like cables and flutes marching along as they create lights. Here is my poem dedicated tot the new Bay Bridge.\nI have seen this often; the lights were off for a year but came back on and are beautiful.\n\nLight Emitting Diode Towers of Villareal\n\nSunday’s moon\nIn San Francisco\nWaning crescent\nOf bent sliver\nHides aloft in silent envy\nFar above the lighted towers\nOf Villareal\nTowers of light\nIndependent sparkling moments\nSequenced separately\nFind design\nLike chords of music\nFloating flocking\nClimbing upwards\nSwimming diving\nJumping over radiant ferries\nChugging through the shining\nWaters of the bay\nUnderneath a sequined bridge\nWhere above wheeled motors ride\nFollowing their destinations\nShadowed clouds disintegrate\nIn shattered animated jewels\nSpinning brightly in white light\nDancing past the hiding crescent\nOf the moon\nOn Sunday night\nShow less"], ["Reviewed October 2, 2017", 5.0, "Bay Bridge", "Try and go on a cruise around the bay when this bridge is lit up. It's lovely to see and sail around."], ["Reviewed October 2, 2017", 5.0, "Tourist must.", "This lovely bridge is best experienced at night with all its thousands of LED lights which switch on and off creating patterns."], ["Reviewed September 30, 2017", 2.0, "Too packed with traffic ....", "..... but a cool drive if you are patient. Just stay away at rush hour .... which can be ALL day! OH....and watch out for the motorcycles flying passed you between lanes!!"], ["Reviewed September 24, 2017", 5.0, "A View of the Bridge", "Didn't really take much notice of this last year as we were visiting the Golden Gate Bridge, had a walk down this year and it's huge and when it is lit up at night the lights change so worth a look."], ["Reviewed September 24, 2017", 4.0, "Beautiful to watch at night from the Ferry Building", "The lights on the Bay Bridge are fabulous. They undulate and wave and are quite fun to watch from the promenade near the Ferry Building."], ["Reviewed September 24, 2017", 4.0, "LOOONG Connecting bridge", "This is another bridge which connects San Francisco to Oakland. This is very long for a walk. You go by vehicle there is a toll for it. Sometimes it will get crowded and you had to wait long. Lighting at the bridge is nice in the night.\nShow less"], ["Reviewed September 22, 2017", 3.0, "To Oakland", "This bridge gets you to Oakland. You can see more of the ocean/bay from it than when you are on the Golden Gate Bridge."], ["Reviewed September 20, 2017", 5.0, "Great Light Show", "Driving across this long bridge you have a wonderful view of the city, the bay and the treasure island. More interesting is the LED light show at night."], ["Reviewed September 18, 2017", 5.0, "Excellent views of San Francisco, Treasure Island, & Oakland", "My husband and I took a cruise on the Red and White Fleet Bridge 2 Bridge Cruise and sailed under the Bay Bridge. This was a fabulous way to see the Bay Bridge. We've also driven over the Bay Bridge numerous times as well."], ["Reviewed September 17, 2017", 3.0, "Not the end destination", "I would not consider the Bay Bridge a destination like the Golden Gate... and I don't think people can walk across it like you could on the Golden Gate. The East Bay side had some additional tall white structures for lighting that I don't remember seeing before. Traffic moved quickly on a Saturday. Toll is $5 per cars.\nShow less"], ["Reviewed September 16, 2017", 4.0, "Exciting night tour", "Although we were uncomfortable (cold and windy) this night tour was exciting. We crossed the bridge twice and it was thrilling. The light display was great. Would do it again, but dress with heavier clothing and a face mask. We rose on the top of a double decker.\nShow less"], ["Reviewed September 14, 2017", 4.0, "Beautiful view of City from Bay Bridge", "Our bus tour included a ride over and back on Bay Bridge. We got out at Treasure Island. The view of San Francisco was so very lovely! We did the other bridge, of course, but this one had a view unlike the other!"], ["Reviewed September 13, 2017", 4.0, "Romantic bridge", "This bridge was more intriguing to us than the Golden Gate. The eye catching light show is simply mesmerizing. We hadn't heard anything about this bridge prior to our arrival but noticed it our first night in town and made a point to see it every chance we got.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A True Beauty", "Drive slowly so you can see the Bay in its splendor and admire the people walking or biking the bridge!"], ["Reviewed September 13, 2017", 5.0, "Another bridge in San Francisco", "Touring the city we travelled again on another bridge. Our friends called it the White Bridge. Again another great sight as the fog rolls in."], ["Reviewed September 12, 2017", 4.0, "Interesting Architecture", "We were able to see both, very different, sections of this bridge while on a boat tour of the harbor. One of the sections is very traditional, while the other is of a very contemporary, suspension design."], ["Reviewed September 12, 2017", 4.0, "Go for the bridge to bridge cruise", "The Red Fleet 90 mn bridge to bridge cruise offers the possibility to discover and enjoy from a very close perspective the two main emblematic bridges of SF. It is a pleasant journey."], ["Reviewed September 12, 2017", 5.0, "Mesmerizing Light Show", "We stayed in a hotel off the Embarcadero that faced the bay and the Bay Bridge. Watching the lights on the Bay Bridge dance at night was one of the highlights of our trip - I must have spent a good hour just watching them. I secretly wanted to go across, without actually having a destination in mind, and while driving us back to our hotel, my nephew accidentally made a wrong turn and I got my wish! Don't confuse this bridge with the Golden Gate Bridge, which, in comparison, is almost ho-hum. This bridge is a double-decker! Marvelous feat of engineering!\nShow less"], ["Reviewed September 10, 2017", 4.0, "The \"other\" Bridge", "The other bridge into San Francisco, and the access to Yerba Buena/treasure island. Rebuilt section that was damaged in the 1989 Loma Prieta Earthquake"], ["Reviewed September 10, 2017", 3.0, "Treasure Island on the Night Bus Tour", "The stop at Treasure Island was part of theNight Bus Tour. It was a freezing cold night and not many of those on board were suitably clothed. It would have been improved if the guide had advised that a warm drink could have been purchased from the nearby cafe. Instead a few people spent the time taking photos and a significant number took the time to have a smoke. The length of the stop was unknown so people's attention was honed on photos and smoking. The timing was excellent as we were able to take photos of the Golden Gate Bridge with fog coming down and the new, uncompleted tower block in the city peeping through the fog. The Bay Bridge was also close for photos. Treasure Island itself really wasn't much - just the views from that location.\nShow less"], ["Reviewed September 8, 2017", 5.0, "New Bike Trail to Treasure Island", "So so impressed with how the did the Bay Bridge Bike Trail. My cycling group to the bridge over to TI yesterday and wow. The trail was clean, no road debris, unlike the Dumbarton bridge. You are more separated from traffic which is extremely nice. It was an overall great experience.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Must see at night!", "This is a great bridge where you can get nice views of the harbor and of SF. In my opinion ....it is prettiest at night!"], ["Reviewed September 6, 2017", 4.0, "Love the lights at night", "When I lived in the Bay Area, I drove this bridge frequently. Visiting many years later, we stayed in SF near the Embarcadero, had a terrace that faced the Bay Bridge and the Ferry Building. I loved the light display each night."], ["Reviewed September 4, 2017", 4.0, "Great walk, but getting too crowded", "My husband and I have walked the Golden Gate bridge many times over the past 47 years. The first time was on our honeymoon; the most recent time was just this past week with 3 nieces, who were seeing it for the first time. The walkway has become far more crowded with bicyclists, runners, people with dogs, and a variety of other obstacles to go around. I have always enjoyed this walk, but this time it became more of an obstacle course. Also, to our dismay, they are putting high fencing around the view lookout areas at the towers to keep idiots from committing suicide. Therefore, I have downgraded the review from what was excellent in the past, to just barely very good this time. At least we did find a place to park in the lot, so that was good.\nShow less"], ["Reviewed September 3, 2017", 4.0, "A beautiful spot if you time it right!", "My husband and I often enjoy waking early and walking before places become crowded, In this case, we wanted to see the Bay Bridge from Fisherman's Wharf and arrived for sunrise and it did not disappoint. We walked all the way to the right when facing the Ferry Building. We also went back late at night to the same spot to see the Bay Bridge in lights. A nice way to walk and see San Francisco.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Amazingly long", "This bridge appears to go on for ever. Very busy traffic. The design is very clever. It was interesting to travel over the Bay."], ["Reviewed September 2, 2017", 4.0, "It's another bridge...", "...and just as impressive as the golden gate, in its own way. I found the double decker option for the cars fascinating, the bridge itself spanning the bay just as gracefully as it's bigger sibling. It's great to try and get a shot of both of them- you need to use a panorama setting to do it, and even then it's mighty tricky due to fog, haze, distance, and annoying people who walk in front of you mid-pan. Still, it's good yo appreciate engineering successes.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Gorgeous!", "Make sure not to miss this bridge. It is slightly older than the Golden Gate Bridge, and very pretty. You can't walk across it, and it's not painted international orange, bit definitely worth a drive!"], ["Reviewed August 27, 2017", 5.0, "Sight to see at night!", "We took the night tour over the bay bridge. What an experience! The weather was great and the view was breathe taken. Nice vibe and a good tour for a first date."], ["Reviewed August 24, 2017", 5.0, "Updated Bay Bridge", "It's long and newly updated. We went two times as we enjoy going on it with the ocean on both sides of the bridge. Hats off to the engineers and people who built this bridge on water for people like us to appreciate and go on it.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Best views are after dark.", "The whole bridge lights up at night. You have to watch for a while to see all the different light combinations but it is very well done."], ["Reviewed August 20, 2017", 1.0, "Complete chaos!!!", "Driving to SF while visiting should come across this bridge (staying east of the bay). It was chaos entering the bridge from the east side, lanes changing and cars were about to Pumb into each other,just a nightmare to drive there."], ["Reviewed August 20, 2017", 5.0, "amazing views", "you cant go to san francisco and not walk on the bridge. walking across the views are amazing - though it was a bit windy lots of people had bikes/segways to go across which would of been good - pity we didnt know this"], ["Reviewed August 17, 2017", 3.0, "Took Red bus tour to Golden Gate Bridge", "From afar, the Golden Gate bridge is a wonderful structure to gaze at, but up close it's in urgent need of repair. Rusted, red paint flakes feeling off, flakes on the road and walkway, cracks in the road as you go across. And extreme wind during the day!\nShow less"], ["Reviewed August 14, 2017", 4.0, "Beautiful bridge", "This bridge is beautiful and lit up at night. It certainly should not be overlooked by the Golden Gate Bridge"], ["Reviewed August 9, 2017", 5.0, "Much Better at Night", "Everyone knows about the Golden Gate Bridge,but the lighted Bay Bridge is slowly becoming more of a San Francisco memory.The way it is lighted at night is a beautiful sight.Traveling across it during the day is another story.We ventured to Oakland twice and were stuck in ridiculous traffic jams that wasted valuable time and soured the day.Many spots to get great views at night.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Great entrance to SF.", "The bridge itself isn't that impressive, but coming to SF by car it makes a great portal with a great view of downtown SF. Right after the end of the bridge, make a right turn and you are downtown..."], ["Reviewed August 8, 2017", 5.0, "Impressive", "Impressive bridge, but it's not for pedestrians nor bicycles... I just saw it from walking along the Bay side."], ["Reviewed August 6, 2017", 5.0, "Gob smacking views from beneath the Bay Bridge", "Our San Francisco bay cruise took us beneath the Bay Bridge for fabulous, gob smacking views of the engineering feats that have gone into this structure. Just as enthralling to us as the Golden Gate Bridge. Well worth taking the bay cruise for this view."], ["Reviewed August 5, 2017", 3.0, "Very crowded bridge", "We drove into SF on Friday evening and the traffic was terrible. The bridge itself was nice as well as the view from it. Try to find the best time to use the bridge."], ["Reviewed August 2, 2017", 5.0, "great bridge", "Because of its location it is almost more of a landmark than the famous sister. We enjoyed it and when crossing it with the car or going underneath with the boat, we took some great great shots! And there is no fog- unlike at the Golden Gate Bridge.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Cool experience to drive across it!", "We enjoyed driving across, especially after we had been on a boat tour that told the history and some interesting facts about the bridge."], ["Reviewed July 30, 2017", 5.0, "Great views driving into the city", "The Bay Bridge offers a pretty breathtaking view of San Francisco when driving in from Oakland. The traffic on the bridge during rush house can be brutal. It's $6 during peak hours to cross into SF, but the bridge itself is very impressive and has some overwhelming view points of the city.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Better than Golden Gate", "This bridge is very underrated. It offers much better views than the Golden Gate Bridge and it is actually longer."], ["Reviewed July 26, 2017", 5.0, "Birthday present vacations", "if you want to have a great time its a must go place, awesome views, the hop on hop off bus will tour you around San Francisco, highly recommend"], ["Reviewed July 25, 2017", 4.0, "Love the lights", "The San Francisco Bay Bridge is very important to drivers who travel by car and bus to get to and from the East Bay, Oakland, Alameda and other towns and cities across the bay waters. The toll to cross the bridge is expensive and keeps rising in cost.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Historic and Beautiful!", "My grandfather moved to San Francisco in the 1930s to participate in the construction of this beautiful landmark. Visit it, and read about this amazing feat of engineering!"], ["Reviewed July 15, 2017", 5.0, "BBB: Bike the Bridge of the Bay", "If you want to feel that you really caught the vibe of the Bay area, rent a bike and ride across the Golden Gate. The views are amazing, the rush of traffic along side of the bike path on the bridge is exhilarating and the view of the converging waters below is breath-taking. Just do it! Just remember to take water and drink up during your ride. You can ferry back to the Wharf area and relax.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Better than Golden gate at night", "Very few people know this, but Bay bridge in SF has an awesome view at night near \"Epic steak house\" on the SF Trail"], ["Reviewed July 9, 2017", 4.0, "Beautiful at night", "A pretty bridge and easy to drive across. Many riders and NO walkers. Watch it from Pier 1 through 39"], ["Reviewed July 7, 2017", 5.0, "check for fog before you go.", "Very foggy in June. Go early in the morning. The walk across is easy, so you don't really need a bike unless you are going to Sausalito. You can catch ubers and lyft on the other side of the bridge too. They just can't enter the parking area.\nShow less"], ["Reviewed July 6, 2017", 5.0, "very interesting to see", "We liked seeing this famous land mark and listening to what the tour guide told us. How is was built and what is was made out of. Don't miss it."], ["Reviewed July 2, 2017", 4.0, "Beautifully \"remodeled\" bridge that connects SF to the East Bay", "I like the \"modern\" look to this bridge......although, I still remember Dustin Hoffman driving ( the wrong way) on it in the movie, \"The Graduate\"."], ["Reviewed July 2, 2017", 4.0, "Night view is the best", "The night light show is completely worth the view. Drive across in the day to go to the East Bay but make sure you find a spot along the San Francisco bay front to watch the night time light show. One of my favorite spots to watch the bay bridge is at Hard Water Whiskey Bar on Pier 3.\nShow less"], ["Reviewed July 2, 2017", 4.0, "Nice bridge", "The Bay Bridge is great to see not only close up but from afar. The second half is better than the first half from the San Francisco side. Great picture taking."], ["Reviewed June 29, 2017", 5.0, "traffic", "avoid the traffic and get on the freeway before 9am or after 7pm no toll fee which is good if you get stuck in traffic have something to for kids to do"], ["Reviewed June 27, 2017", 3.0, "It's just a bridge.", "While i understand this bridge is also iconic to locals, from a touristic point of view, this bridge was so much underwhelming when compared to its stunning brother - the Golden Gate bridge."], ["Reviewed June 23, 2017", 5.0, "Very long bridge", "This bridge very long and not as nice as the Golden Gate but nonetheless amazing architecture and good views."], ["Reviewed June 23, 2017", 3.0, "just a bridge", "Locals cherish this bridge, perhaps because of it's convenience in mobility but I see nothing remarkable. Traversed it both ways. Nothing special from a tourists perspective."], ["Reviewed June 21, 2017", 4.0, "Don't even have to get close to admire", "The Bay Bridge is pretty to look at in itself, but they've put in a light based art installation and that just adds to it at dusk and at night. The installation was meant to be temporary but the people of the city liked it so much they made it permanent and even had to have special light bulbs designed to withstand the corrosive sea air! You can get good views of the bridge from around Pier 17.\nShow less"], ["Reviewed June 21, 2017", 3.0, "Nice view and photo opportunity !!", "When you are down by the piers it is worthwhile walking the extra distance down to pier 1 and to get a photo of the bridge. It is on par with the Golden Gate in my opinion. Only difference is that it's silver and not red.\nShow less"], ["Reviewed June 21, 2017", 5.0, "SO MUCH TO SEE", "The bay bridge is mostly brand new now as of 2017 , loved seeing and driving across the Bay Bridge . but remember this is the bay area , so drive very carefully especially if this is your 1st time across ."], ["Reviewed June 21, 2017", 4.0, "Beautiful Bridge and lights up at night!!!", "We drove across the Bay Bridge to San Francisco during the day and it is beautiful. A marvel! We drove on the top over and saw the big ships and Treasure Island.. The light show at night was beautiful. Great photo! We drove back on the bottom section of the bridge at night. Very cool experience. The kids liked it as well.\nShow less"], ["Reviewed June 17, 2017", 4.0, "Really nice light show", "The Bay bridge doesn't get the press that the Golden Gate does, but it's a solid piece of engineering. It doesn't seem like much to look at during the day but at night it's lit up with 'moving' lights. The show is really nice."], ["Reviewed June 17, 2017", 4.0, "Good views", "Traffic was heavy on the bridge on Saturday around 5pm Five dollar toll (cash or their local pay system) Scenic views (catch a glimpse of golden rate, treasure island, and Alcatraz)"], ["Reviewed June 17, 2017", 4.0, "Watch the bridge at night", "While not as famous as the Golden Gate Bridge - watching the amazing lights at night which adorne the bridge, is well worth stopping and admiring. Truly an awesome spectacle."], ["Reviewed June 15, 2017", 4.0, "Lovely view.", "What a picturesque view. Certainly worth a ride to be able to appreciate the beauty of the view. Go. You won't regret it."], ["Reviewed June 14, 2017", 5.0, "Beautiful at night", "Went to see the bridge at night when it was lit up. Absolutely beautiful and a must see when your in San Francisco"], ["Reviewed June 13, 2017", 5.0, "Night Time View", "The light show that is displayed on the bridge is worth setting up some time to go see. Along with the other aspects of a spanning bridge structure, this made it special."], ["Reviewed June 12, 2017", 4.0, "places to see in San Francisco", "This particular bridge combines the old and the new. Traveling from San Francisco to the East Bay, one goes through the old bridge and after Treasurer Island, the new bridge is worth driving through and marvel at what a modern bridge should be."], ["Reviewed June 10, 2017", 5.0, "Kids were inpressed", "We traveled in both directions of this bridge during our time in the city. The kids got a kick out of it. They thought it was pretty cool to drive on the bottom section and liked the views of all the boats from the top half. Not as pretty as the Golden Gate Bridge but still interesting.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Beautiful at Night", "We drove across this bridge a couple of times on our trip. If you don't get a chance to go across, check it out a night, there is quite a light show."], ["Reviewed June 6, 2017", 4.0, "Bay Bridge", "The bridge conceived as the longest bridge of the world,way back in gold Rush days.Though many were sceptic about its completion ,it was opened in 1936.It is now one of the longest spans in the US.It connects SFO and Oakland bay.The newly constructed east span is the worlds widest bridge.\nShow less"], ["Reviewed June 5, 2017", 3.0, "Only if you have to", "The bay bridge is neat, but not the iconic Golden Gate. I would not cross it just to say I did, however, you can take this route to get to Napa Valley. If you start early, you can visit a few wineries then double back on HWY101 and maybe see Mir Wood, or stop by Sausalito for Ice Cream on your way back across the Golden Gate. Nice day trip.\n\nMost of the time I was there, Traffic on the Bay Bridge and HWY 80 was packed. This is not the way I want to relax on Vacation.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Bay Bridge during Friday rush-hour", "Hair raising adventure traveling Bay Bridge from SF to Oakland on a Friday during rush-hour. Getting on the bridge in the city was a challenge, but once on the way, traffic moved well. Views are limited by the bridge architecture."], ["Reviewed June 5, 2017", 5.0, "Riding over this on the top of double decker bus at night is a thrill!", "As the title suggests, my friends and I did the City NIght Tour on the Red Bus. Even though it was in the middle od May, it was freezing. I bought a knit hat before the trip, and I later bought a blanket from the bus company for $10. It was the best $10 that I spent. This was thrilling and rather daring for me! I think this was my favorite experience of San Francisco! Do it on the top level of the bus!\nShow less"], ["Reviewed June 4, 2017", 4.0, "Great Views of San Francisco", "Our tour bus took us to the north end of the bridge (east side). Incredible jams on weekday mornings and evenings. be sure to avoid during these times. This was my first trip to San Francisco and the was the most breathtaking view"], ["Reviewed June 2, 2017", 4.0, "Good for photographs", "You can take some very good photographs of the bridge from the land. Crossing it by car isn't particularly exciting, more a necessity."], ["Reviewed June 1, 2017", 5.0, "Magnificent!", "This is a very impressive structure. It is impressive. An engineering masterpiece. You can't miss when driving in on the highway from the airport."], ["Reviewed May 30, 2017", 4.0, "Great Views of San Francisco", "We took a tour bus at night to get pictures of the San Francisco skyline and it was a great view especially from Treasure Island on the other side!"], ["Reviewed May 29, 2017", 5.0, "Magnificent site", "Our tour bus took us to the north end of the bridge (east side). Great views, restrooms were descent. There's a lower walkway where you can walk under the bridge to get to the west side. Must take a jacket as it seems to be very windy.\nShow less"], ["Reviewed May 28, 2017", 4.0, "Looks amazing at night...", "this place looks so beautiful at night... the entire bridge is lit up and it is visible from very far... during the day it is a normal bridge but at night, the real beauty of it shows up..."], ["Reviewed May 24, 2017", 5.0, "beautiful at night all lit up", "This is so beautiful at night all lit up....daytime is impressive too...but at night it's a sight to see"], ["Reviewed May 23, 2017", 4.0, "Longest bridge and correspondingly long traffic jams", "Incredible jams on weekday mornings and evenings. be sure to avoid during these times. Pretty nice bridge at night when lit up."], ["Reviewed May 20, 2017", 4.0, "Scenic span!", "Reconstructed after collapsing in 1988 earthquake, the Bay Bridge has always played second fiddle to the Golden Gate...the span from SF to Oakland past Treasure Island is nice, but not spectacular except fot the views of America's most scenic city, San Francisco"], ["Reviewed May 20, 2017", 5.0, "Double Decker Bus to Bay Bridge", "Riding across the Bay Bridge on the top of the double decker bus tour was very thrilling and windy, Hold on to your belongings -- but the view are so worth it."], ["Reviewed May 19, 2017", 3.0, "Just a Bridge", "The new section is nice, but from someone who crosses the great George Washington Bridge regularly its just a bridge"], ["Reviewed May 16, 2017", 3.0, "great sight entering san fran", "Be prepared for high volume traffic. at least you had the beautiful sight of seeing the city of san fran"], ["Reviewed May 15, 2017", 5.0, "I wonder why I'm reviewing this...", "It's the Wandering Yank here. I have driven across this bridge 1000's of times since I moved to California in the 1970's. I worked in SF, visited friends there, gone sightseeing there and passed through on the way to the airport. Definitely a love-hate relationship.\n\nLove? The views on beautiful days, of the Bay of course, but also Alcatraz, the Golden Gate Bridge, cruise ships in summer, the container ships at Oakland, and the skyline.\n\nHate? I spent an hour in the toll plaza this morning....\n\nOh well, it's still quite a monument to engineering skills, and you get a dramatic view of the Bay as well.\n\n2 thumbs up!\nShow less"], ["Reviewed May 15, 2017", 5.0, "Breathtaking", "This was my first trip to San Francisco and the was the most breathtaking view. The size is overwhelming and seeing this beautiful feat of engineering is an absolute must see and experience."], ["Reviewed May 14, 2017", 5.0, "Nice bridge, pretty at night", "A longer and nicer bridge than golden gate. Worth a trip across. Much prettier at night than golden gate too. George Lucus got some of his ideas for Star Wars driving daily across this bridge."], ["Reviewed May 13, 2017", 4.0, "Staying in SF a few days", "Well, the bay bridge gets you from A to B......lots of traffic...easy to access and looks great either from a distance or to actually drive through.....worth doing if you are around the area and of course want to get to the other side for whatever reason...!!\nShow less"], ["Reviewed May 11, 2017", 4.0, "Cool bridge.", "It's a very cool bridge right across the harbor. There are great views on both sides. And if you cross it near rush hour you get the pleasure of spending a lot of time on it."], ["Reviewed May 9, 2017", 5.0, "Ooh so cool", "We zoomed by on the lit bay bridge to treasure island was a surreal experience felt really nice and the lighting is a treat to the eyes beeeeaautiful"], ["Reviewed May 9, 2017", 5.0, "Impressive!", "No one really speaks about the Bay Bridge but honestly this is an impressive piece of engineering. I believe I took more photos of this bridge than the Golden Gate itself."], ["Reviewed May 5, 2017", 5.0, "Not just another bride.", "Hold onto your had and take an open bus trip across the bridge. Beautiful views. At night watch the fog role in!"], ["Reviewed May 2, 2017", 5.0, "A Must See", "Get the full experience by walking over the bridge. Great views of the bridge from one of the bay cruises as well as from look outs throughout the city."], ["Reviewed April 30, 2017", 3.0, "Great view but long drive", "I had to drive into the city and needed to cross the Bay Bridge. It was an excellent view of the surrounding area but the drive across took about 40 minutes to cross."], ["Reviewed April 26, 2017", 4.0, "Cycle to the San Francisco Golden Gate bridge", "You can actually rent a bike at any of the the rental shop at 39 pier. Cost only $8/hr or $30 full day. They provide you with lock and helmet. They give you a map and advisory on the route, like where are the steep...More"], ["Reviewed April 25, 2017", 4.0, "The other Bridge", "The bay bridge is a very long bridge which stretches from the main land over the bay into San Francisco, and it has a lovely view of the bay. It has a one way toll which is paid coming into the city of San Francisco...More"], ["Reviewed April 25, 2017", 4.0, "Got to see this.", "This is free to cross on foot or bike, 3 miles to walk across there and back the bridge is huge even by todays standards. Served well by public transport (bus) and there is free parking too. Cafe and gift shop next to where the...More"], ["Reviewed April 23, 2017", 5.0, "A Must See", "Iconic San Francisco. A must see for the tourist visiting the city. A real piece of American history. We parked on the west side of the bridge where there was plenty of free parking and walked over. We walked up and out on the bridge...More"], ["Reviewed April 22, 2017", 5.0, "beautiful bridge", "If your are in san francisco this is a must see. I enjoyed this bridge just as much as the golden gate bridge."], ["Reviewed April 22, 2017", 5.0, "SFBB", "AWESOME!AWESOME!AWESOME! An absolute must, if you travel to SF!!!! Again, used Hop Off/ Hop On Bus...really good value...and you can get off the bus, to pick up a trolley to Sausilito!"], ["Reviewed April 20, 2017", 5.0, "Awesome view", "We went for a drive on the Bay Bridge.. It's beautiful view from here. Also the view of the bridge from the pier is quite impressive"]]}}