{"Santa Monica State Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Monica State Beach", "url": "/Attraction_Review-g33052-d117412-Reviews-Santa_Monica_State_Beach-Santa_Monica_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/2d/48/5c/santa-monica-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5983"}, "address": {"@type": "PostalAddress", "streetAddress": "Ocean Ave at Colorado Ave", "addressLocality": "Santa Monica", "addressRegion": "California", "postalCode": "90401", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Beautiful and clean", "Great beach to walk along, do your work out, or yoga or running or enjoy the sun and ocean. Surfing for the dare devils, in short something for everyone."], ["Reviewed 5 days ago", 4.0, "Aussies at the beach.", "Winter was a terrible time to visit! The wind was quite ferocious the day we went. Took the train which was easy to navigate. Was able to get some pictures but limited by wind."], ["Reviewed 6 days ago", 5.0, "Beautiful sandy beach", "The beach at Santa Monica is wide and clean. Is so large that you can enjoy plenty of space and romantic walks at the sunset."], ["Reviewed 1 week ago", 5.0, "\"Nice walk around the beach\"", "This was a very relaxing morning walking around the beach, also observing how other people were enjoying the beach and exercising."], ["Reviewed 1 week ago", 5.0, "Nice beach!", "The beach was a great Cali beach. With lots of sand for all! Not to crowed when we went and were able to enjoy the sunset!"], ["Reviewed 1 week ago", 5.0, "Its the spot", "Ocean Ave has a little strip, scenes shot here from the Amazon Studios Goliath featuring Billy Bob Thornton. Its popular"], ["Reviewed 1 week ago", 5.0, "Sunset", "+ great place to watch the sunset + plenty of parking available at low rates + clean bathrooms + well maintained broad walks + plenty of police presence so it feels safe"], ["Reviewed 1 week ago", 5.0, "Amazing sunset", "Room on this beach for everybody! Loved it. The sunset is incredible. Great spot for a romantic evening picnic."], ["Reviewed 1 week ago", 4.0, "A Must Visit when in Los Angeles", "This is the beach that’s quintessential California! Just go and put up with the traffic. It’s where the beach surfers hang out and is laid back California!"], ["Reviewed 1 week ago", 3.0, "Ok beach", "The beach at Santa Monica is a good sandy beach but nothing special. The fair ground on the pier is ok for under 10s but not worth it for over kids."], ["Reviewed 2 weeks ago", 5.0, "Decent beach", "Together with Venice Beach a must : very easy to reach by metro (take the Express light-Blue line to Santa Monica Downtown and enjoy!)"], ["Reviewed 2 weeks ago", 4.0, "The LA Beach", "A visit to LA cannot be complete without spending g some time at the beach.\nWether you want to Swim, surf or bike or volleyball there’s all sorts of activities goi g on, try your hand at outdoor chess or even beachside gymnastics, Santa Monica\nis a haven for those seeking an active, outdoors vacation.\n\nOr wait until the evening to see a beautiful sunset!\n\nA great place to unwind!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Beach", "Lovely Beach with loads of activities to do or just have a amazing walk. Well worth it if you are in the area"], ["Reviewed 2 weeks ago", 4.0, "Lovely public beach", "Lovely beach with palm tress, boardwalk, pavement and outdoor sport facilities. Lots of cafeteria and restaurant around. Only parking is the problem."], ["Reviewed 2 weeks ago", 5.0, "Very clean", "This is a long clean beach and pleasant to be on for a stroll along the Ocean. There are waste bins near the shore and life guards on duty."], ["Reviewed 2 weeks ago", 5.0, "Stunning Views", "A lovely beach in the beautiful City of Santa Monica. It has been a longtime since I came to enjoy some quiet time at Santa Monica State Beach. My nephew wanted to hang out at the beach before we went to dinner down the street.\n\nAll around Santa Monica State Beach is nice place. Would I come back. Maybe. At this time I feel more safety has to be addressed. For all the people who come to Santa Monica State Beach.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Large and beautiful", "Not very crowded when we were there. The mountains were a gorgeously a backdrop. Parking was $10 and we didn't have to walk far to get to the beach."], ["Reviewed 2 weeks ago", 5.0, "Birthday for hubby", "Santa Monica is a Beautiful, friendly city with gardens and beach access everywhere. We thoroughly enjoyed our visit and highly recommend this city. The city tourism ambassadors are a nice touch to for helpful advice."], ["Reviewed 2 weeks ago", 4.0, "85 degrees on the beach in January when there's snow on the ground at home!", "Santa Monica Beach is a great place to walk, to take your shoes off and revel in having your feet in the sand, or to sunbathe. Swimming may be ok, too, I don't know. Ambient temperature is mild in January, but the water is very cold! There were people sunbathing, or taking advantage of the warm, clear day to walk on the beach, or wade ankle deep in the water. There is a wooden walk about halfway down, and a shower to rinse the sand from your feet or the ocean from your hair.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Beach", "Santa Monica Beach is beautiful! It’s quite a large beach, so it didn’t feel crowded! Lots of activities along the beach. Great place to see the sunset."], ["Reviewed 2 weeks ago", 5.0, "This is a beautiful place", "This is a beautiful beach they have allot of beautiful birds and sad yes lots of it Lol the ocean is beautiful"], ["Reviewed 3 weeks ago", 5.0, "Lovely spot", "Beautiful spot and beach. Much nicer than Venice beach. Recommend hiring a bike and riding the path."], ["Reviewed 3 weeks ago", 3.0, "Mixed reviews", "Was so glad to see the water and walk on the beach but seeing all the homeless people and druggies was sad. Certainly detracted from what we expected to be a nice outing."], ["Reviewed 3 weeks ago", 5.0, "great for biking, walking and running", "I love it here! Wonderful beach walking and biking and beautiful views. Wide walking and biking paths -Lots of places to stop and enjoy a beer (or coffee/sandwich)"], ["Reviewed 3 weeks ago", 4.0, "A day in Santa Monica", "Nice day . Visiting from NYS so loved the sound of the surf, the sand and the sunshine. Loved the variety of music venders along the pier. Take a camera for selfies."], ["Reviewed 3 weeks ago", 3.0, "It’s a beach", "This is a classic old-school beach were pretty ladies are walking around in bikinis and dudes are walking around and swim trunks and people go swimming and some people go surfing."], ["Reviewed 3 weeks ago", 4.0, "Different from the beaches in Sydney, but it has a special charm.", "Different from the beaches in Sydney, but it has a special charm. A lot more interesting things to see and that's just the different personalities along the beach."], ["Reviewed 3 weeks ago", 5.0, "very Charming", "this beach is perfect for a good lounge, and a quick dip in the clear waters, the perfect sot for photographers"], ["Reviewed 4 weeks ago", 3.0, "Can't help but picture syringes;", "Smells likes piss and surrounded by panhandlers. Tourist trap almost by definition, travel away from the city."], ["Reviewed 4 weeks ago", 1.0, "Meth Addicts and Mentally Ill Homeless EVERYWHERE!", "Can't walk the streets or beaches without being accosted. My friend actually got punched in the head by some crazy homeless guy while we were walking down the street. She called the cops and all they said was \"where is he now?\" Didn't even make an effort to find and arrest him. Everywhere we went there was someone crazy screaming at invisible people. The beautiful park overlooking the beach is just row after row of passed out drunks and addicts. The promenade and tourist areas smell like vomit and urine. If you are looking for the So Cal experience, try going further up to Malibu. Avoid Santa Monica if you have family or you want to walk around.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "So gross", "Stayed at a hotel near the beach and went for a walk each morning. So much ocean/beach trash!!! Despite having recycling and trash cans on the flippin beach, which totally ruins the views, the beach still has trash everywhere. There are also a fair amount of homeless people who call this beach and the surrounding parks home. So what does this mean for you? Get set for people yelling things at you, asking you for money, and possibly following you. Sound like a great way to make friends? Visit santa monica beach!!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "lovely", "lovely place, a bit higher standard than venice beach broadwalk which is 15 mins away, it is really recommended to go there and enjoy. parking is 5$. they have a small park with some rollcoaster"], ["Reviewed 4 weeks ago", 4.0, "An Iconic, Lovely Beach That Suffers from Severe Overcrowding", "The Santa Monica Beach is one of the most iconic in the US, thanks to the Santa Monica Pier and its world-famous Pacific Park seaside amusement park. It's a lovely beach: large and spacious with great views up and down the coast and buildings that don't rise above several stories high (thanks to the oppressive California Coastal Commission). The breeze from the Santa Ana Winds always feels good and there are plenty of lifeguards on duty with a regular police presence, so safety isn't an issue. The beach is pretty clean from what I've seen on the days I've visited, there are free outdoor showers for washing off salt/sand (but no bathhouses that I've seen), and there's plenty of places to eat/use the restrooms at the Santa Monica Pier. It's a great place to kill an afternoon!\n\nMy biggest gripe, however, is how busy the Santa Monica Beach can get. Seeing as how it IS such an iconic beach, you will find it far more busy and crowded than other beaches, including neighboring beaches located just down the coast a little way. On a typical day, it's busy but not overly packed, but if you go on a peak day, you can find yourself having to pack in uncomfortably close to other beach-goers...or giving up because there's just no place to stake out for your group for the day. Keep that in mind if you're thinking about going on a Saturday in July! You may find yourself having better luck at Venice, Leo Carrillo, El Matador, Malibu or Manhattan Beaches (as just a few examples) instead. In addition, parking can be difficult to find on busier days too. There are city run beach/pier parking lots, but they fill up quickly. In the 4 times I've been there, I've never used the city lots for parking; I've always had to park in one of the seaside hotel underground parking garages (for $20+) because the city lots were full and traffic was at absolute gridlock.\n\nIf you've never been there, you need to go. I chuckle each time I visit, because Santa Monica Beach is the beach that was modeled for the video game \"Grand Theft Auto V,\" and everything--including the Santa Monica Pier, surrounding buildings and even the lifeguard shacks--is modeled down to the most minute detail that you can see in real life when you visit the Santa Monica Beach. (If only I could land a 747 on the beach in real life like I have in the game!) :)\n\nMust see and highly recommended!\nShow less"], ["Reviewed January 24, 2018", 4.0, "It's Nice", "It was clean considering the overall LA standard\nWe had lunch at an Italian little pub, we walked and it was nice, it is part of LA Staple to visit Santa Monica, it was cold for us since we live in Miami and it was way colder throughout the whole trip\nShow less"], ["Reviewed January 23, 2018", 4.0, "Beautiful !", "Nice beach, very clean,can spend all day with lots of fun. Love the atmosphere. Highly recommend. Love to watch appeal."], ["Reviewed January 22, 2018", 4.0, "Great", "Beach is extremely clean with a lovely atmosphere! Lots to do along the pier too, would highly recommend spending the day here!"], ["Reviewed January 22, 2018", 5.0, "Beautiful", "SM Beach is enormous, with lots of clean sand, lifeguards, and ample parking. We were there in January, and only a few hardy souls were braving the cold water. The views of the pier and nearby mountains are spectacular."], ["Reviewed January 22, 2018", 4.0, "An expansive beach with worldwide people watching appeal", "Whether you walk the boardwalk, stroll the pier or trek the huge beach, you will appreciate this scene and the variety of humanity coming from everywhere to \"do their thing\" or just hang out in the forever sunshine."], ["Reviewed January 22, 2018", 2.0, "Way too crowded", "Absolutely crowded, and on a Saturday afternoon, uncomfortably so. With whiffs of marijuana scent caught here and there. We stayed only 15 minutes. There are plenty of other beaches a few minutes' drive away- Redondo, Manhattan, etc."], ["Reviewed January 21, 2018", 5.0, "Best beach", "Whether it's a great view, a great tan or a great swim, this is as good as it gets. And wear your best because everyone else will be."], ["Reviewed January 21, 2018", 5.0, "Santa Monica Beach Rocks!", "I have been going to Santa Monica Beach my whole life. It’s definitely a tourist heaven but the locals come here quite often as well. The Santa Monica pier has many things for the whole family to do. At the north end of the beach is the Annenberg pool and they have really nice facilities. Definitely do not miss the Marion Davies house as it is a historic landmark at the north end of Santa Monica Beach.\nThere is a lot of history in this building. Marion Davies was the girlfriend of William Randolph Hearst.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful sand", "Even though it’s not summer it’s still a beautiful walk especially off the pier. The rides are not far but the surf is really nice too. What a beautiful place to visit."], ["Reviewed January 21, 2018", 3.0, "So many tourists", "So many tourist, however they were all relaxing & chilling - This made the trip way more pleasant than expected"], ["Reviewed January 20, 2018", 4.0, "Huge beach", "This is a nice wide beach and seems well-kept. We spent some time here on a weekend day and there were many people out on the beach and even some in the water despite air temps in the low 60s."], ["Reviewed January 20, 2018", 5.0, "What a Beach", "We all know that Australians tend to think we have the best beaches but no matter where you come from you have to admit this is one hell of a beach. For a start, in true US style its huge, too big for some I know. But I liked that. You can be in a big crowd right beside the water or sit alone in 100 square meters of sand and pretend to be lost in the desert. There is so much to do; people watch, play volleyball, swim, bike, relax or gaze at that fabulous pier. They have live concerts some nights too. I loved it. In fact I enjoy Santa Monica all up. Lots of activity, great weather (I did go in summer) and friendly people. Not for those seeking a wilderness experience but great for sun and fun. Super close to hotels and restaurants too. A 5 star place for me.\nShow less"], ["Reviewed January 20, 2018", 4.0, "SM Beach", "Excellent to walk or bike. Absolutely beautiful. I would not swim in the water though it not really clean."], ["Reviewed January 19, 2018", 4.0, "Pleasantly surprised", "Having been told by our cab driver \"not to waste our time\" coming her we decided to go anyway! Really pleased that we did, nice beach, good walkway, nice views and a fab atmosphere - a lovely way to spend a sunny January day in LA\nShow less"], ["Reviewed January 19, 2018", 4.0, "Vast and clean", "The first time I visited this beach was more than 20 years ago. Coming from an inland state, I was impressed by how big the ocean is. This time, we visited in the morning with relatively fewer people. I found that, compared with 20+ years ago, this beach was so clean! The tidal waves washed the sand beach and made it glitter under the sun. I was fascinated by this view.\n\nAlso, parking in the pier parking lot was easy and cheap.\n\nThe only downside is that the view is not as picturesque as some beaches in California central coast, due to lack of surrounding mountain.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Great Family Fun!", "This is a good place to bring your family for a day at the beach. Plenty of activities and fun for all ages."], ["Reviewed January 16, 2018", 5.0, "Santa Monica Beach", "Great beach to visit. Looks awesome during sunset and night. had taken great pictures under night light."], ["Reviewed January 16, 2018", 5.0, "Watching the sunset on a beach never gets old", "Although it was a cool December evening we still took off our shoes and walked in the beach. Visiting from Canada it wasn’t that bad and I’m sure we looked the classic tourist. Beach was very clean and met some great people including a couple that had just got engaged....literally she was still crying.... next time we will make some more time to explore further down but we had a good walk around and saw some of the local sites. Definitely more homeless people up in the park north of the pier but didn’t seem to be an issue on the beach it self.\nShow less"], ["Reviewed January 16, 2018", 4.0, "I enjoy coming to this beach", "I've never had a bad experience coming to the beach at Santa Monica. I like the walk to Venice Beach, I enjoy watching the classes for surfers, and the abundance of places to eat and shop at the Promenade. I've never had a big problem parking and so overall think it is a good place for new visitors to CA. Parking meters give you up to 5 hours, so no worries there.\nShow less"], ["Reviewed January 15, 2018", 5.0, "A short January visit", "The weather was not good for a beach time. But we did have good time enjoying the sand and the waves - till knee height. Clean and beautiful, good for sport, relax or walking."], ["Reviewed January 15, 2018", 5.0, "Big beautiful beach", "The beach itself was deserted mid week in January but comes alive at the weekend.\nMiles and miles of groomed sand. Kept very clean.\nI loved the cycle and walk ways, which are clearly very popular with locals and tourists. Shame to see so many homeless people on Venice Beach.\nWe rented bikes and Bird scooters to get the best out of it. Both were great fun.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Sand,Sun, Space", "Beautiful sand as far as the eye can see.\nCleaned daily, there's room for everyone.\nToilet blocks at regular intervals, which are very clean and spacious.\nLots of volleyball courts and exercise equipment, the cycling route and walking route is well planned.\nThere are a number of cafes dotted along, a relaxing place to sit in a deck chair and watch the world go by.\nSadly the homeless seemed to be moved along by the police every morning, perhaps this is a sign that more shelters are needed in Santa Monica. We watched them going through the bins, so sad.\nDon't just move these poor people on, give them permanent shelter, such wealth and poverty together is heartbreaking.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Breathtaking", "This is a beautiful beach with breathtaking views! I would definitely recommend relaxing here when headed to Santa Monica. The beach is huge so there is plenty of room to relax and enjoy the waves."], ["Reviewed January 12, 2018", 4.0, "OK but definitely lots of homeless that make you feel unsafe.", "We spent 2 weeks in Santa Monica from Christmas through the 1st week of January. It is nice but as the other reviewer stated, there is LOTS of homeless. Even while eating on a patio of a nice restaurant with the kids a person came up and asked if I would buy him a piece of pizza. It wouldn’t be that bad but a lot of these people look strung out on drugs. The kids wanted to move more inside so we did. The City is beautiful and we did the BIRD scooters which was fun and we went on the outer limits of the city with them which was very nice and could eat outside with no problem. We did a lot, the boardwalk, Santa Monica Stairs, Venice Beach (even more homeless there), and traveled the LA area and parks. It was nice. We saw it but probably won’t go back.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Amazingly well kept", "The beach was cleaned and groomed every day, even when it rained!! which it doesn't very often in CA. No dogs are allowed on the beach but there's plenty of path ways to walk them near to the ocean. You do have a lot of homeless in the area but they tend to leave you alone if you leave them alone,you have washroom facilities at regular spacing along the ocean front and lots of choices of cafes and restaurants where you can sit and just take in the view.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Wonderful beach...lovely to see so many aspects of Southern California. THE MOST SPECTACULAR SUNSETS!", "Always something to see and do and the best sunsets anywhere! Walk to Venice, do the Pier or walk to downtown. Rent a bike, skates or just walk....you will have a lasting memory. Some super places to eat and/or drink. An oasis!"], ["Reviewed January 8, 2018", 5.0, "Best stretch of the coast", "The views are the best here Parking is convenient Volleyball courts Bikes for rent The pier Food Bathrooms are clean!"], ["Reviewed January 7, 2018", 5.0, "Wide swooping urban beach", "Walk early in the morning, watch the surfers, plunge in....head down to Venice and take in all the beach people getting going, setting up their wares."], ["Reviewed January 7, 2018", 4.0, "Iconic", "This is maybe the most famous and historic beach of South California. It's worth to go at least once in your life. But is not as used to ve. Very crowded. Not great food. Typical tourist attraction. There are much better beaches for fun, dating or swimming .\nShow less"], ["Reviewed January 6, 2018", 5.0, "One of Several very nice Beaches", "Starting at Redondo, then Hermosa, then Manhattan, then El Segundo, then Venice, finally Santa Monica beach are all clean, stretch about 20 miles total. The nice part about San Mo is the pier amusement Park and downtown 3rd Street Promenade make for a complete visit. Plenty to do along the way using the Strand. Walkers, runners, skaters, bikers all on at the same time, but nit that crowded. Sun will be shinning 330 days a year...\nShow less"], ["Reviewed January 6, 2018", 5.0, "Run or cycle santa monica", "I visited family in Santa Monica. Their house was just off the Ocean Park Boulevard and only a few blocks from the beach. Once you reach the beach turn right (west). If you go left you will be in Venice - a rough area. The beach is well maintained. The sand is raked everyday and the litter is collected. There are toilets about every half mile. There are drinking fountains and showers as you come off the beach. There are also swings for the children and volley ball nets.\n\nThere is a paved running/cycle path that is well marked and is parallel to the beach. The cycle path ends at about at 5- miles and the running/walking path ends at about 6-miles. There is a staircase on your right just after running past the Santa Monica Pier. The staircase leads to the Palisades Park - you can run about three miles west with scenic views of the beach from the cliffs - well worth it!\nShow less"], ["Reviewed January 4, 2018", 3.0, "Average beach - go at low tide to see sea creatures under pier.", "I've been here many times. It is a nice beach, but gets way too crowded in the Summer. And Like all California beaches, the water is too cold in the winder. I recommend going at low tide to see star fish and sea urchins under the pier.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Miles of sandy beach", "We visited sonata Monica beach on a very warm friday in december. We arrived early & it was lovely & quiet. By the time we had walked along to Venice Beach, in land to Abbot Kinney blvd, then back to the beach again, it was very busy! Lots of pedestrians, joggers, cyclists. You can hire electric scooters, skateboards - every mode of transport!\nIt's great for people watching. The number of homeless was quite overwhelming though.\nkeep an eye on belongings when wandering around.\nStunning beach though & well worth a wander up to Muscle beach to watch the fitties working out.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Clean, sunny, got the basics right", "I have seen beaches with clearer and dreamy waters, in places every one dreams about (Copacabana beach for instance) but so dirty that the whole picture was messed up. Here the beach is clean, the weather is nice and you have a lots of things to do nearby. Got the basics right and it’s the most important\nShow less"], ["Reviewed January 3, 2018", 4.0, "One of the nicest beaches I've been to", "Was the last stop of a great California vacation before heading to the airport....and I'm glad we came here.....weather was perfect and we enjoyed the sounds and sights."], ["Reviewed January 3, 2018", 5.0, "Holiday", "While on holiday in Santa Monica we visited the beach area a number of times. It has miles of walkways along the beach which is kept very clean and has plenty of eateries and seating along the way."], ["Reviewed January 2, 2018", 5.0, "Wonderful to enjoy for walks", "I loved it in December, what a wonderful spot to walk around and enjoy the weather! I recommend it especially for couples and people with children. Very nice."], ["Reviewed January 1, 2018", 5.0, "There is a place for..", "A place to walk, a place to bike and a place to use the skateboards.\n\nIf you want to walk, pls try not to walk on the bike lane. So many visitors ignore the signs of bike lane. This no care attitude is a danger to the pedestrian and to the bikers.\n\nThe view of the beach is majestic.. but we got a bit stressed with the bikers screaming at the people who are walking in the bike lane.\n\nSo many things you can do in the beach. Run. Play. Rest. Sing. Read. Whatever it is, have fun and observe the rules:)\nShow less"], ["Reviewed December 30, 2017", 5.0, "Great views of the Pacific", "Amazing views from the famous pier--definitely recommend riding the ferris wheel at sunset. You won't be disappointed!"], ["Reviewed December 30, 2017", 4.0, "Great beach to chill out", "Great beach to chill out- good eating options besides thrill seeking and kids friendly games - plenty of options to relax and enjoy the time at the beach plus watch the sunset..........beautiful"], ["Reviewed December 30, 2017", 4.0, "Beautiful but foggy", "Came in the morning at around 10am, not crowded at all, but quite foggy! You can take some amazing pictures here with all the palm trees though! Worth a visit... Not too far from Hollywood anyway!"], ["Reviewed December 30, 2017", 4.0, "LA Trip", "Huge Huge Huge Beach... Awesome view awesome location and very convenient. Santa Monica is of the important attraction in LA."], ["Reviewed December 30, 2017", 3.0, "much nicer than venice beach", "Good if you want to go and play on the beach or in the ocean. Good promenade if you just want to stroll. Gets quite crowded on weekend afternoons but not unpleasantly so unlike some others"], ["Reviewed December 29, 2017", 3.0, "Nice beach, but to many homeless people and drugs", "The beach was nice, but there are homeless people everywhere. In the morning it looks like a plane crash scene with bodies scattered everywhere. Some of them doing hard drugs and freebasing heroin. The pier is something everyone should visit if they are in the area.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Beautiful Long White Sandy Beach", "Fabulous long white sandy beach with cycle path. So much space. Fabulous for people watching! You can cycle for miles. There are also lots of sets of outdoor exercise/gym equipment. Great waves for surfers."], ["Reviewed December 26, 2017", 5.0, "Lovely beach", "Lovely beach, always busy with lot of people, the nearby Santa Monica Pier add more beauty. Sunsets here are stunning."], ["Reviewed December 26, 2017", 3.0, "Muscle beach still attracting the posing folk!", "50 years on the beautiful bodies are still being honed and displayed. This has an Anything Goes feel, quite a few homeless too parked on available benches. Saw the Santa Monica pier nearby, apparently packed at the weekend."], ["Reviewed December 25, 2017", 4.0, "no inline skating", "Tried to rent inline skating but turns out in SM beach you can only rent those vintage 4 wheels, 2 lines roller skate. It's very cool but I could not use them."], ["Reviewed December 25, 2017", 4.0, "It’s a big city beach", "The beach provides access to the ocean in what seemed to be a clean and friendly environment. The views from the beach are phenomenal with the mountain backdrop to the North."], ["Reviewed December 24, 2017", 5.0, "Winter jumping in the waves strangely attractive to teenagers", "I thought we were going to try the carousel and rollercoaster but Pacific waves after hot chocolate at the Coffee Bean on the pier kept the boys busy for several hours."], ["Reviewed December 23, 2017", 5.0, "Everything I have dreamed of in a beach!", "Growing up in the '70's, I had a vision of what a beach is supposed to be like. Lots of people, lots of white sand, amusement rides, ice cream, board walk, shopping and big waves. Santa Monica beach did not disappoint!\nEven Muscle Beach, a place I only existed in movies, truly does exist.\nWe rented bicycles and rode along the beach path. There is so much to see and do. Swimming in the ocean was a thrill! A must do attraction when in southern California!\nShow less"], ["Reviewed December 23, 2017", 4.0, "Love the beach!", "We love visiting Santa Monica Beach! Muscle beach is so fun and we love watching all sorts of people attempting the obstacles! The quality of the sand by the walk/bike paths is quite filthy. This is to be expected with the traffic it gets with all sorts of people and animals about.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Lovely clean beach", "Lovely clean beach with great views. Little sad though with all the homeless living underneath the Pier"], ["Reviewed December 22, 2017", 5.0, "Lovely Beach", "A wonderful beach with the Santa Monica pier as a backdrop. Great for walking,meditation or just enjoying nature at its best"], ["Reviewed December 21, 2017", 5.0, "the beach", "This is really the great wonderful BEACH in the world. beautiful people lovely surf great food and the pier love to be at the BEACH"], ["Reviewed December 21, 2017", 4.0, "Sunset to watch", "Rent a bike,walk on the beach and good street music. Love the sunset. Great to spend a day with family."], ["Reviewed December 21, 2017", 5.0, "My fav place in LA", "I love beaches and Santa Monica beach is no exception. There is something for everyone from fun, frolic to food."], ["Reviewed December 19, 2017", 5.0, "Great wide beach! The sand is very fine they do grate the beach everyday!", "We always go off the boardwalk to find your favorite place on the beach! This beach overlooks the Santa Monica pier and original muscle beach! Great for beach cruising or just wave watching! You can people watch too! Plenty of room for everyone! Many lifeguard stations spread along! Perfect sunset views always!\nShow less"], ["Reviewed December 19, 2017", 5.0, "Nice vacation", "Little crowned on weekend and at night/beach very beautiful /too many peoples at night.I will be back again only on day time."], ["Reviewed December 17, 2017", 5.0, "Beautiful beach", "This beach is a must to see. We didn't swim though. It's clean and safe. No problem with parking. Many things to do there. Also in this place is a boardwalk. You can read reviews about santa monica pier to find out more."], ["Reviewed December 15, 2017", 4.0, "Really Nice Beach", "A really lovely place to spend an afternoon or evening. The beach is very crowded but has a lovely energy and vibe. Try to head to the pier at some stsge as it has lots of performance artists and loads of vendors hawking popcorn, ice cream, hot dogs etc.\nWe loved walking on the beach in the evening as the sun began to set. The crowds had largely dissipated by that stage so there was a lot more room, yet enough folks were left to create a nice communal vibe.\nLos Angeles wasn't really my cup of tea, I much preferred Santa Monica. There are so many brilliant cafes, bars and restaurants near the seafront to while away your time.\nShow less"], ["Reviewed December 14, 2017", 3.0, "Just a beach and not much more", "Was a clear sunny day. Cold wind though. Water quality not bad. Small waves and easy to swim in. Plenty of people dipping their toes in the water. Easy to get to. Plenty of parking. Summertime would be a insane.\nNot much else to day really. Its a beach.\nShow less"], ["Reviewed December 14, 2017", 5.0, "So peaceful and big", "We just walked up and down the beach for a couple of hours and loved it! Venice Beach is just to this one and you walk right into it."], ["Reviewed December 12, 2017", 5.0, "TURKEY DAY FAMILY REUNION", "I hosted a 3-day, 45 person family reunion at SHORE HOTEL and couldn't have been more pleased. Starting with Florina & Paulina (mgrs) to Michael Contis (F&B asst.mgr) to Raul at the bar and Carlos & Edwin our wait staff for the weekend and several others on hand, the staff were so courteous, helpful and considerate of our special occasion. The Green Room was set up to accommodate our group for the 2 meals a day we had at the hotel, the food was delicious, choices varied, and bountiful!! The location is perfect for young and old--across the street from the iconic Santa Monica Pier and a most beautiful beach with paved walking and bicycle paths that go for miles. Out the back door is the Third Street Promenade with wonderful shopping and street people entertaining along the way. The accommodations worked for young and old---everybody got a big laugh from the picture window between the shower and bedroom area. We all had a really super time at Shore.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Sand forever!", "Huge beach! Great views and a fabulous boardwalk along the waterfront if the sand between your toes isn't your thing. Definitely worth some photos and a swim when in Santa Monica!"], ["Reviewed December 11, 2017", 4.0, "Wonderful sunset and great atmosphere", "We drove our rented car there at around 4pm and took a stroll on the beach first before parking up nearer to the pier with a parking fee of $7 dollars. At 5pm, We decided to get dinner at the first original Bubba Gump restaurant since we have already parked up. Before that we sat at the pier end & took in the stunning views of the sun slowing sinking beneath the horizon. The weather was great with accompanying buskers who provided sweet music to go with the views. While enjoying the view, we saw a few dolphins or seals swam past. The Pacific Park is nothing to shout about, a very dated one and there was hardly any patrons, but you cannot deny the fact that the park did add much colour to this pier.\nShow less"], ["Reviewed December 10, 2017", 4.0, "Pretty cool", "One of those must do's in LA- the end of the Route 66 highway.\nWe stayed in Santa Monica so the beach was a 5 min walk away, its pretty lively during the day at the pier with tourist and locals enjoying the beach. Personally being from Australia the beach was nothing special but the overall vibe was good. We also walked down the boardwalk- you are able to walk all the way to Venice Beach from here but warning its far.\nI notice that you could also hire bikes to ride along the beach as an activity.\nShow less"], ["Reviewed December 8, 2017", 5.0, "miles and miles of sand", "I was there the weekend before Thanksgiving, so the beach was empty, quiet and very relaxing. Spent hours laying in the sun, just me and the seagulls. I tried to be reasonably close to the other 4-5 people on the beach; from time to time some homeless/crazy people came by and since i was alone i felt safer that way\nShow less"], ["Reviewed December 6, 2017", 4.0, "It goes on and on,wide open spaced beach.", "There were no crowded areas here,plenty of space for ball games,great place to swim,traditional pier,even fishing if you wanted,bikes to hire,resteraunts."], ["Reviewed December 5, 2017", 5.0, "Great sunset!", "Was too cold to swim this time of year as expected but perfect for watching the sunset on the beach with a pizza and glass of wine!"], ["Reviewed November 28, 2017", 4.0, "A nice sandy beach, overall", "This a 3-1/2-mile long beach, with white, fairly clean sand. It can get a bit crowded in summer, but it's not too bad most of the year. There are also places to buy food and drinks right on the beach."], ["Reviewed November 27, 2017", 4.0, "Nice Beach, lots of stuff to see including bums", "Nice Beach, great boardwalk, lots of things to see. Like everywhere that caters to the homeless, you have bums there, and that is a turn off for me. But its still very nice"], ["Reviewed November 27, 2017", 4.0, "Mesmerizing, a must-go tourist attraction", "Ever played GTA V? I have and I really loved the place, its so much fun in game and it was more fun visiting it in person. Ample parking space, clean beach and so many food options and souvenirs to choose from. Simply mesmerizing."], ["Reviewed November 26, 2017", 4.0, "Nice but not quiet", "Great beach and view but had to deal with a lot of homeless folks and people hawking food, umbrellas, toys, and whatever else... hard to relax on the beach. Also, my wife has a pretty awesome bikini body, and has shown it off at beaches around the world, but felt very uncomfortable here by all the guys (and girls!!) gawking at her....\nShow less"], ["Reviewed November 25, 2017", 5.0, "Beautiful!", "An amazing way to spend a day with your family with beautiful beaches, cycling options , delicious food trucks and loads of shopping options with numerous restro bars !"], ["Reviewed November 24, 2017", 4.0, "Beautiful beach with a lot of fun", "We came down to LA from rainy and chilly Seattle, and Santa Monica Beach didn't turn us down. Parking was much easier than a lot of other city beaches, and there was full of music, food, coffee, and relaxing people. Never too crowded, but still plenty of people.\nShow less"], ["Reviewed November 24, 2017", 1.0, "Dirty, homeless people, felt unsafe.", "We visited early in the morning at sunrise to get some photos of the pier. Genuinely felt unsafe, i was worried waling on the sand that there might be needles/glass/debris. There was rubbish all on the beach as well as bins which were an eyesore.\n\nwouldnt bother again.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Beautiful beach. Must Visit!!", "We went there on Thanksgiving day, so parking wasn't really a problem. Got right near to Pier. The beach is pretty big and has lots of open showers and rest rooms where you can change. The beach waters are pretty clean with good waves to play with and good views around with lot of palm trees. The play and work out area with lots of bars. Swings and swing bars are fun for both adults (better for fit people) and kids. My kids aged 8 & 10 and both of us had a great time. Spent around 3 hours\nShow less"], ["Reviewed November 23, 2017", 5.0, "Pretty!", "I could just sit her for hours! It’s so amazing! Go on the Ferris wheel and get a view from a higher spot! It’s awesome"], ["Reviewed November 23, 2017", 4.0, "A clean, family friendly beach", "I was there at midday on a Tuesday for a few hours to soak up some of the 29 degree Celsius November weather. A lovely beach. Lots of room, clean and tidy, life guards on duty, family friendly and with amenities close by on the pier. The only thing that distracted from the peace were the screaming kids on the rides on the pier - it is possible to block this out. Great beach to see the sunset!\nShow less"], ["Reviewed November 21, 2017", 5.0, "Beautiful", "Went there early on a Saturday morning, was great. Full of locals walking their dogs, jogging or cycling, was a nice vibe. Walked from Venice Beach to Santa Monica Pier and back which was a long walk but worth it."], ["Reviewed November 18, 2017", 5.0, "Sand and Ocean - what more could you want?", "I loved this beach. The pier gives you a nostalgic, old-timey feel, with tasty seafood and an old amusement park. The beach is very wide/deep, with soft white sand. We walked from the pier to Venice Beach with our feet in the water, and back along the boardwalk. Loved every second of it.\nShow less"], ["Reviewed November 16, 2017", 5.0, "BEAUTIFULLY GROOMED - Absolutely HUGE - STRETCHES as far as the eye can see", "As an Aussie from Melbourne, always thought we had the best beaches - not so anymore. We were here in the Autumn month of October, beaches were not populated, so what we saw were amazing, clean, vast, well groomed shorelines, truly awesome.\n\nWe were also very impressed by the amount of Life Saver stations, placed strategically apart, close to the water's edge.\n\nVery impressive and it is clearly evident why this would be such a popular seaside destination in the summer months.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Must See while in Cali", "This is a must see destination while in Cali. Ride the rides and enjoy the food and play a few games."], ["Reviewed November 16, 2017", 1.0, "Dirty, Feels Unsafe, Homeless Problem", "I can only describe the beach and pier as a total dump.\n\nThe place is overrun with beggars and vagrants. The whole vibe is ruined when you see someone spaced out smoking crack on the street.\n\nThe homeless are like seagulls. If you feed one, you get bombarded by hundreds.\nThat’s is what’s happening here.\nYes it’s unfortunate, yes that sounds harsh. But the city needs to move these people on as its doing irreparable damage to a wonderful place.\n\nNot all all suitable for families.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Can't Wait To Return!!!", "I am back in the big state of Kansas right now after being on the beach in October and can't wait to get back to my Santa Monica beach! I got my boogie board, fins, and wet suit awaiting me at my apartment. This beach is the best and especially at night when all the lights come on at the pier!!!\nShow less"], ["Reviewed November 12, 2017", 4.0, "Gorgeous", "This was my first west coast beach to visit and I have to say: I wasn't disappointed. The mountains in the background blew my mind and both my friend and I just sat there for hours taking and soaking it all in. I never understood the hype of California: overcrowded, overpriced, bad drivers- but now I can totally understand why people love it here:)\nAlso, wasn't too crowded for a Saturday and the temperature reached 68 and sunnny - perfect :)\nShow less"], ["Reviewed November 11, 2017", 5.0, "Beautiful", "Beautiful white sandy beach. Blue sea. Plenty of lifeguards on duty during busy periods. A nice view of the city from the beach"], ["Reviewed November 11, 2017", 5.0, "California dream", "One of the most famous beaches in LA.t has been filmed many times and Forest Gump run here , when running on the East side of USA. Have a walk in the pier, swim at the ocean and of course surf. Good selection of restaurants, bars and hotels. One of the nicest areas of LA.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great place for a walk....very enjoyable morning walk location", "We went for a morning walk along the beach and it was awesome. The paths accommodate both bikes, walkers and runners. It was amazing and most enjoyable - and a great way to start your day. There were some good places to get water and sit down....overall a great day....you should go there for a walk.\nShow less"], ["Reviewed November 9, 2017", 4.0, "NICE HUGE BEACH", "This was just a quick visit as i wanted to see as much as i could of Los Angeles.\nNice huge beach with the Santa Monica Pier.\nGlad i came to see and to see what it was like, but a shame i could not explore more.\nA must see visit so glad i did.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Massive Beach", "A great massive beach for the whole family and is easily accessible via car or public transport. There is so much room I cannot imagine the beach ever being full. It is also next to the famous pier where you can also buy food and drink or go to the toilet. The only downside is there is a bit of a bit of a drop off into the water from the beach but it is still good for a paddle\nShow less"], ["Reviewed November 8, 2017", 5.0, "Beautiful beach for a day out or afternoon stroll.", "I live here in Santa Monica so I'm biased. I go to the beach at least once a week. It's a great place for a day out with friends. Bring your umbrella or a tent and a cooler. If you skip the cooler, there are various snack bars along the beach as well as people walking around selling fruit, water, and even umbrellas. There are also multiple bathroom stops along the boardwalk for families. If you're used to the caribbean beaches, though, this probably isn't your cup of tea. The beach is much longer, the water is much colder and the water isn't crystal clear.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great beach with nearby food, shops and public transportation", "There aren't too many \"bad\" beaches in the Los Angeles area; the coastline offers broad vistas and long, wide beaches with fine sand. What sets Santa Monica Beach apart is its proximity to lots of food and shopping options in downtown Santa Monica and on the Pier -- and now also the beach's unique accessibility via the city's new light rail Metro system, with the Expo line terminating just a short walk from Santa Monica Pier and the beach. This is huge, since beach parking costs have always been a downside of the area.\n\nThe beach is clean and spacious and almost never very crowded. The water is usually colder than east coast beaches (south of Cape Cod), and one needs to be mindful of sudden drops in the sea floor and significant riptides that can take an inexperienced swimmer by surprise. It seems that fewer people here go into the water than where I grew up in New England, but the beach itself is most enjoyable and well-maintained.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Great fun....Best People Watching", "Grab (or rent) your bike, rollerblades, or just plain sneakers and get out here! Don't forget your camera. You will be entertained no matter which direction you turn. Then walk over to third street promenade or Main Street for dinner. A great day awaits!"], ["Reviewed November 7, 2017", 3.0, "A beautiful afternoon on the Beach", "It’s an average beach. There is the pier and there are things to do, but as far as cleanliness and beauty there are nicer places to go."], ["Reviewed November 7, 2017", 5.0, "Very beautiful beach", "Very very clean and beautiful beach and lot of activities are all around, best time to visit is before sunset."], ["Reviewed November 6, 2017", 4.0, "Beautiful.", "This was lovely, it wasn’t too busy, relatively clean sand and sea. Only annoying part was the guy selling water, as he was shaking parasols too which blew sand everywhere!!"], ["Reviewed November 6, 2017", 3.0, "A lot of homelessness", "Unfortunately a lot of homeless people consider this beach as a place to sleep at night so it is dangerous to stay here late."], ["Reviewed November 4, 2017", 4.0, "Huge beach", "Lovely beach ,loads of space to walk but a good walk from the Metro to get there ,not much to do other than the peir"], ["Reviewed November 4, 2017", 4.0, "Must see in santa Monica", "This is a superb beach. The pier divides beach in Venice Beach also called muscle beach and Santa Monica Beach. It is a nice beach, clean, baywatch, facilities, parking near beach"], ["Reviewed November 2, 2017", 5.0, "The route 66 ends...", "Always good to be there.. many people many attractions.. Good clean ocean air.. watching fishing people and long beaches.. Be there and watch sunset.."], ["Reviewed November 1, 2017", 3.0, "Okay..", "It was a bit cloudy this day, so I didn't get to see it's full beauty. There was a huge homeless population but the beach was pretty chill."], ["Reviewed October 31, 2017", 5.0, "Walk bath surf", "You can walk it south and get to venice beach in like 40 minutes or go north to find more quiet places. Almost anywhere you can go surfing and waves are perfect to try it for your 1st time... just dont swim far away"], ["Reviewed October 31, 2017", 2.0, "This beach has gone downhill....", "The water was brown and full of seaweed/kelp. The water smelled and it was terribly crowded and I couldn't believe that people were actually swimming in the smelly, brown water. The beach itself was nice and clean, the pier was nice and touristy and a great place to people watch, but the water was icky. You can actually see the brown water in my pictures. Last time I was here, many, many years ago, I put my feet in the Pacific here....I wouldn't stick a toe in the water now until it gets cleaned up and stops smelling so foul. Blech!\nShow less"], ["Reviewed October 30, 2017", 5.0, "No dogs! Very unfortunate...", "Don’t try to take your dog on the beach - you will get a ticket. As dog friendly as most places are - Malibu and Santa Monica are not. There is a great bark park in Calabasas."], ["Reviewed October 29, 2017", 5.0, "Nice night time visit.", "Pier night walk in very nice , good food and they have a Coffee Bean. Easy to park with a good amount of fun. Good for about 2 to 3 hours"], ["Reviewed October 29, 2017", 4.0, "Cool beach!", "Nice place to be during the day, it is really active and you can do plenty of stuff. Walking around, going to restaurants, bars even for a ride in the amusement park. There are lots of performers to. The only bad thing is that as soon as the dark goes down this place becomes extremely unsafe.\nShow less"], ["Reviewed October 28, 2017", 4.0, "Beautiful beach", "Great view of the beach from the Santa Monica Pier. A good place to visit while in Santa Monica! But it is a busy beach and area"], ["Reviewed October 28, 2017", 4.0, "Great beach - be early for easy parking", "A great beach with nice waves and life guards. The restrooms where pretty ok as well. LIttle tricky to park if you come during the day. BEst is to park on the streets above the beach, much easier when you should leave. A bit of jam getting out of the larger Parking lots\nShow less"], ["Reviewed October 27, 2017", 2.0, "Pretty from afar", "Great place to walk the pier or watch the sunset from one of the many hotels or restaurants, but not the beach you want to lay out at or being the family. The homeless population is quite high in this area and many were camped out on the beach or the park. We were walking down at 10:30am to walk and get some sun, we passed many aggressive homeless people and even saw one standing up peeing on the beach. After that, we didn't stay long. Was a little concerned about what else might be in the sand.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Nice", "Really pretty beach the boardwalk is really nice also. Cost $12 to park your car. I wish they had some numbers or sign so you could tell where your car is when you return it fills up quite fast"], ["Reviewed October 26, 2017", 4.0, "Ultimate SoCal experience", "What says SoCal better than a day in Santa Monica? The beach and the boardwalk are a fun way to spend an afternoon and soak in the Pacific breezes and California sunshine."], ["Reviewed October 26, 2017", 5.0, "Iconic and wonderful beach", "Like taking part of an episode of 'Baywatch'! Iconic beach, and its popularity is understandable: he swim itself is great, the sand is just like beach sand is supposed to be, and the ambiance of the place with the pier nearby is both bustling and laid back. Take a stroll (or grab a bike) from Santa Monica Beach to Venice Beach: Amazing!\nShow less"], ["Reviewed October 25, 2017", 5.0, "Wide beautiful clean beach", "We hung out on the beach for a couple of days while visiting the area. There's a long boardwalk to walk or bike ride. Also visit the original muscle beach - we just watched the muscles. Santa Monica pier is right there. Lots of volley ball courts, surfing. We actually walked from Santa Monica south all the way to Venice Beach. Fun day.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Sand was amazing", "Sand was perfect. Nice walk way from Santa Monica Pier to beach. It was a little cooler at the beach/ocean than I expected."], ["Reviewed October 25, 2017", 5.0, "Clean", "Very clean, lots of people and lots of volleyball nets to play on. Great views and very close to the city and the pier. Would visit again and stay longer on the beach if weather was perfect."], ["Reviewed October 24, 2017", 4.0, "The sand is so soft!", "Santa Monica beach... is miles of beautiful sand. We stopped by here while shopping at 3rd St Promenade.\n\nAs we walked along the beach, the closer we got to the pier, the stinkier it was. It smelled like rotting fish. The sand was soft and seemed to go on forever. You could see a haze in the air (smog) and there were riptide warnings, so we didn’t go into the water.\n\nThe public bathrooms were disgusting. I came across one stall that had diarrhea explosion. It was all over the wall and toilet. There’s no toilet paper or soap in these washrooms and I don’t think they get cleaned very often.\n\nThere’s an aquarium under the pier, restaurants, vendors and even a solar powered Ferris wheel. There are lots of things to do down at the beach and pier.\nShow less"], ["Reviewed October 24, 2017", 4.0, "Nice beach", "Nice beach - just walked on beach though - water was rough. The Santa Monica pier is next to it, so there is a lot to do in the area."], ["Reviewed October 24, 2017", 4.0, "Beautiful to walk first thing in the morning", "Despite its depth this is a wonderful beach and a walk looking out to the Pacific makes any vacation."], ["Reviewed October 23, 2017", 4.0, "A world Class beach", "One of the world's most beautifu; beaches, just a few miles from downtown Los angeles. Parking is a hastle."], ["Reviewed October 23, 2017", 5.0, "Lovely place", "Visited the beach with my husband as a stop point for the hop on hop off tour.. very lovely place with dining and activities"], ["Reviewed October 23, 2017", 5.0, "Fantastic", "One of the most gorgeous places I have ever been You can walk and enjoy the breezy weather Very nice and safe"], ["Reviewed October 23, 2017", 5.0, "Great", "Even though the water isn’t always perfect and clean - the white sand beach is gorgeous.\nRelax and take some time out on the sand, it’s easy to find a spot around no one else.\nThere’s plenty of people watching too!\nIt’s a perfect Californian backdrop. Sunset is perfection.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Really cool place", "This place is so not what I was expecting; $5 bus ride for the whole family from west Hollywood which took about 15 mins.\n\nMy kids loved it here. They were on the play equipment if that's what you call it. Monkey bars, climbing ropes, these rope swingy things for ages.\n\nWe also rode along the beach in rental bikes which was heaps of fun, seen a lot of stacks..\n\nPeople selling $1 drinks of water or soft drinks come riding past on skateboards or bikes which was handy.\n\nThis place is people watching at its absolute best, loved it.\n\nThe beach is massive, I have never seen so much beach sand in one place.\n\nCan't wait to go back\nShow less"], ["Reviewed October 23, 2017", 4.0, "California's best beach", "It was the start of winter when I was here so it was more for looking than doing anything. It's still my favourite beach in California, a long beach with so much appeal. Great for walking at any time"], ["Reviewed October 22, 2017", 4.0, "Great beach", "Nice sand, nice sea. Lots of people having a fun time. Nice interesting walk from Santa Monica pier to Venice beach."], ["Reviewed October 21, 2017", 5.0, "The bets beaxh", "Soft sand and happy vibes\nThe beach is extremely long and wide has plenty of space\n\nSea is warm but has a algae smell\nFriendly atmosphere with locals do not be put off by the hippies and druggies they are happy and when left alone harmless\nShow less"], ["Reviewed October 20, 2017", 4.0, "Relaxing beach", "A nice view to just relax and enjoy the moment. The beachfront was fairly clean, but there were many seagulls in the area. Overall, the experience was enjoyable."], ["Reviewed October 20, 2017", 4.0, "Best Beach in California", "This beach is very clean, huge and has every amenity available. I live one block from the beach and enjoy a breeze, sunshine and temperatures between 65 and 75 every day!"], ["Reviewed October 20, 2017", 5.0, "Friendly life guards", "So nice to visit. We didn’t swim although people were swimming. It’s a great atmosphere. Worth a visit"], ["Reviewed October 19, 2017", 4.0, "Plenty of people, huge waves", "Plenty of parking Nice clean public beach Full of people Huge waves Conveniently located right next to the famous Sta Monica Pier Amusement Park"], ["Reviewed October 19, 2017", 5.0, "Great clean beach", "Visited the beach in September when it was quiet, the beach felt clean and safe. There is a car park nearby but the Metro station is about a 15 min walk. With amazing views and the pier I would go back again."], ["Reviewed October 19, 2017", 5.0, "Beautiful clean beach.", "A beautiful, clean beach which we walked on every day. We even saw dolphins and sea lions playing in the waves near to the shore."], ["Reviewed October 18, 2017", 1.0, "Not impressed", "I was excited to take my children to the Pacific Ocean for their first time. The beach was filthy and had a terrible smell. There were many homeless people who had set up camp as well. Maybe this is the norm for the area, but I won’t be back.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Lovely", "Lovely beach, not as busy as expected. Very relaxing. The sunset here is amazing. A must visit if in Santa Monica."], ["Reviewed October 18, 2017", 4.0, "California Classic", "Santa Monica is a must. Walking the pier and third street promenade close by are all bonuses of coming to this beach. It does get cold during winter and spring, but summer and fall are usually perfect beach weather. The sand is endless is seems as if it goes on for miles.\nShow less"], ["Reviewed October 17, 2017", 5.0, "The end of Route 66 !", "Lovely beach well worth a visit stunning views with loads of history, pier was cool with lots to do if you had kids with you."], ["Reviewed October 17, 2017", 3.0, "Gorgeous place but upsetting", "The last stop on our road trip was LA and I wanted to get my feet in the Pacific Ocean before going home. The beach is beautiful, soft white sand, blue sea what's not to love?\nApart from the amount of poor folk who've fallen on tough times sleeping there.\nFurther down they were building a set for pirates of the carribean, pretty cool.\nShow less"], ["Reviewed October 17, 2017", 4.0, "a massive beach with great sand but strong waves!", "the power of the pacific ocean here is immense so be careful with small children. the amenities of the pier are great and there is various wash places to get the sand off before leaving. recommend being close to the pier."], ["Reviewed October 16, 2017", 5.0, "Loved the beach and the place", "A wonderful beach, clean, wide and never filled. I enjoyed one of Cali's sunny days on the beach, water was clean and great as well. and you can walk/ rent a bike and enjoy the lovely boardwalk of Santa Monica with the marvelous gift shops and restaurants that provide international cuisines.\nShow less"], ["Reviewed October 16, 2017", 5.0, "What an Expanse of Sand......", "This is definitely a beach of merit. A massive expanse of sand that appears to be cleaned daily.\n\nEven on a very hot weekend and with thousands flocking there, it was never packed as it is massive.\n\nSurf looks benign enough but some surfers were out nearer Venice Beach which has bigger breakers.\n\nSea wasn’t crystal clear but plenty in there.\n\nMust see and must visit if coming to Santa Monica.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Amazing", "Plenty of parking..metered .. clean bathrooms..huge clean beach.. food.. family friendly.. bike riders."], ["Reviewed October 16, 2017", 5.0, "Miles and miles...", "Of pristine beaches. Bathrooms and food are available. Plenty of volley ball nets. Parking is plentiful, but there’s a fee. It varies by day/season."], ["Reviewed October 16, 2017", 5.0, "Beautiful bay", "Very clean, pet friendly, lots of seagulls, close to the pier,aquarium,visitor center and downtown, beautiful!"], ["Reviewed October 16, 2017", 5.0, "Love the beach", "I just love walking along the boardwalk at Santa Monica. It I.S great to people watch (while dodging the bikes) and watching the show offs on Muscle Beach. The sand I.S so clean and soft and the lifeguard huts remind me of Baywatch!!"], ["Reviewed October 15, 2017", 5.0, "Lovely place", "Lovely clean beach which is not filled with a lot of people. I like that kind of beach. It has just the right amount of people."], ["Reviewed October 14, 2017", 4.0, "Nice walk on the pier", "Could park just next to the pier. Nice beach. Had a good stroll out to the end of the pier. Had me a burger and Coke. Lots of commerce and people from around the World."], ["Reviewed October 13, 2017", 3.0, "Interesting place", "I have mixed feelings about this place. Being from Australia and spoilt when it comes to beautiful beaches, the actual beach/ocean is nothing special and certainly not worth the time. The real attraction of this place is all of the activity going on around it. Ranging from all of the muscle-beach type workout areas, to the locals getting together and providing street performances/music/dancing etc. The real contrast to Australia was that the place was fairly quiet and boring during the morning and then came to life in the afternoon.\n\nThe reason for visiting is to experience the culture, nothing like what we have back home. We stayed near the Santa Monica Pier, which is another reason to come here.\nShow less"], ["Reviewed October 12, 2017", 3.0, "Go with an open mind", "Santa Monica beach is a nice beach but not one of the best places to visit, if your short on time and can visit 2 beaches come here because of the pier, it is fun and close to the beach. However the Beach itself is somewhat dirty, the sand is not the greatest but it works out well if your in a pinch for time.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Huge beach and calm winds", "We had a wonderful afternoon on this beach over the Columbus Day holiday. It was very quiet and peaceful. We are not locals, but we assume it is much busier during the summer months."], ["Reviewed October 12, 2017", 3.0, "Decent Beach", "Santa Monica Beach is cool and picturesque from afar, but it’s not the best “beach” it’s kind of dirty and suffers from an abundance of homeless. I enjoy hanging out around this beach more than actually treating it like a traditional beach where you lay in the sand and go in the water.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Beautiful sandy beach", "We were very impressed with our visit to the wide sandy beach at Santa Monica. The beach has lifeguards and lots of areas for games like beach volleyball. The rear of the beach has a promendae for pedestrians and a second path for cyclists. There are plenty of restrooms and beach cafes.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Spacious Flat beach and site of the original muscle beach", "Great beach with footpath and separate cycle path which is ideal to explore the beach. The beach is the site of the original muscle beach and we were able to watch some impressive acrobatic workouts during our walk."], ["Reviewed October 11, 2017", 4.0, "beach", "very well kept beach lots of room on the beach, not on holiday weekends tho. Lots of shops near the beach."], ["Reviewed October 11, 2017", 5.0, "Best walk in the world !", "We love Santa Monica Beach ! You can walk, run, bike, skate for miles. It’s quite amazing the beach is so wide - it’s a good hike to the water . Lots of activity - great for people watching. Sadly also many homeless. A must do on any trip to LA.\nShow less"], ["Reviewed October 11, 2017", 3.0, "Cool beach visit!", "My nieces loved this place. The other beaches we went to were more Sandy in the water than this one, which was good. The waves were perfect, not to strong for the smaller niece, and okay to go out further a little more. We went from 330-645 and it was nice, a little chilly but the sun warmed you up. The water was pretty cold at first. When we were leaving the beach, I did step on a piece of glass that was buried in the sand, it didn't break the skin but it could have been a lot worse if it did, or if my nieces would have stepped on it. So reminder: don't bring any glass objects onto the beach!!!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great beach", "This is a clean beach that has a lot of activities for people to do.very clean and active. Food , gifts and ride for people to keep you entertained."], ["Reviewed October 10, 2017", 5.0, "Best on a Sunday morning", "Santa Monica is a beautiful white sand beach that has a bicycle path, volleyball nets and plenty of space to lay out without any overcrowding. The pathway at street level, which runs along the beach, is popular with joggers."], ["Reviewed October 10, 2017", 4.0, "Ferris wheel", "One of California most recognized beaches ! Great way to spend a day. Lots of restaurants nearby, hotels on the beach, and shops walking distance. Busy beach,but fun!"], ["Reviewed October 10, 2017", 4.0, "Big beach !", "If you’re in LA for just a day or two then you have to visit. Huge beach, lots of people, lots to see and plenty of parking mid-week."], ["Reviewed October 10, 2017", 4.0, "Great beach, relax or have some fun.", "Lovely beach to relax on for a few hours. The sea is great, but generally a bit cold. There is lots to do if you get bored soaking up the rays, cycle/skate trails etc. If you're having a picnic watch out for the seagulls, they aren't backwards in coming forwards!\nShow less"], ["Reviewed October 9, 2017", 4.0, "Lovely beach", "Great beach in LA, with a pier and pretty coastal views. Some nice restaurants nearby. Quite nice weather still in October time."], ["Reviewed October 9, 2017", 4.0, "Just the tonic after a transatlantic trip", "Beautiful sand , great weather and an excellent restaurant at the beach Just disappointed that I did not spend more time on the beach Next time"], ["Reviewed October 8, 2017", 3.0, "Relax", "This is a lovely warm and clean stretch if golden sand... be prepared to see the most extraordinary reconstructed bodies, people, faces it's all here! Have an open mind and enjoy the absolute Entertainment value!"], ["Reviewed October 8, 2017", 4.0, "Leisure", "Nice beach , the only draw back was the number of homeless that sleep on the beach which made me feel unsafe to walk at night"], ["Reviewed October 8, 2017", 5.0, "Sunrise at Santa Monica ... Pure ecstasy!", "The first time when I visited the US, one of my friends back home suggested to pay a visit to Santa Monica, when I go to LA. I had the experience of unclean beaches (empty disposable water bottles, food packets, other plastic waste) in the past back home and hence I was not very much interested. Once, I checked into the hotel, the room had this brochures with all tourist spots nearby and this was one of them\n\nI decided to give it a try. I'm glad that I had taken the best decision. Santa Monica is a delight. And being a solo indian girl, I realized that it is very safe too! Sunrise at Santa Monica is beyond words. A must see, for everyone who visit California. You could even pedal a cycle. A very clean white sandy beach with an extremely beautiful sea! You could get food, water and everything else. Public transport is available to reach.\nShow less"]]}}