{"Santa Cruz Beach Boardwalk": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Cruz Beach Boardwalk", "url": "/Attraction_Review-g33048-d156830-Reviews-Santa_Cruz_Beach_Boardwalk-Santa_Cruz_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/70/f5/a5/the-boardwalk-s-giant.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2970"}, "address": {"@type": "PostalAddress", "streetAddress": "400 Beach St", "addressLocality": "Santa Cruz", "addressRegion": "California", "postalCode": "95060-5416", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Wonderful evening walk", "After checking in, this was the closest we could walk down to explore a bit.we had lunch at the wharf.lots of entertainment places for kids as well as good eating joints."], ["Reviewed 3 days ago", 4.0, "Beyond your wildest dreams--or nightmares", "A child's dream! So much to see and do--if you are into rides. Place was mostly closed when we were there, but I would hate to be there in the summertime when it is running full tilt. Be advised that the bathrooms don't open till 11:00. The ocean view is phenomenal!\nShow less"], ["Reviewed 5 days ago", 5.0, "it is fun for the young and the old", "today is the same day for the clam chowder cook off so it was super crowded. My friend from Australia wanted to ride the Giant dipper. So, we did. The young kids screamed their heads off but I had a blast. The roller coaster is considered one of the best; it did not disappoint. Try to get there early because the lines can get very long. Do not wear a hat ; you may not have a hat after the ride.\nthis a great place for people watching. If you are hungry, you have to pay for over-priced food.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun for the kids", "Took my grandkids in December they had indoor ice skating and the kids totally enjoyed it at the boardwalk and then we went and walked the beach I could not believe it it was sunny. My grandkids totally enjoyed it they already want to go back\nShow less"], ["Reviewed 1 week ago", 5.0, "What a blast", "Took my family on vacation before school started back up. It was amazing. The lines were not as long as expected and it was endless fun for 12 hours straight. Will be returning soon."], ["Reviewed 2 weeks ago", 5.0, "A lovely walk", "Recommend this as a highlight. The fair grounds as a backdrop make this a special experience for all especially on twilight."], ["Reviewed 2 weeks ago", 3.0, "Not much open in Feb on a Friday, the weekend is the time to visit in the winter for more to do", "Only a couple places were open on Friday afternoon in Feb , it was unseasonably warm so it was nice to walk the boardwalk and down to the end of the pier. One food place was open and we had some surprisingly good ceviche and a beer in the sun at Ideal bar and Grill. I tried a cocktail and they asked to double it for 2.00 more, no prices posted on the menu so it cost as much as the appetizer. Not a big surprise on the price in a tourist plae but it wasn't very good either would skip next time.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very fun!", "I took my five sons there at the end of summer - it wasn't very busy on a weekday in August as we got there early in the day. The weather was perfect and we found a lot to do. I would recommend going one time to look around before you commit to purchasing an all day ticket.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Saw pictures now I've seen it in person", "The boardwalk at Santa Cruz is a nice stroll and you got the ocean there to see also yes they do have amusement park with many rides but myself I just enjoyed the scenery"], ["Reviewed 3 weeks ago", 4.0, "Great - even in the winter!", "Most of the place was closed because it was winter, but they had decorated Christmas trees, Santa, Ice Skating, some food vendors, arcade ... GREAT PLACE for Family FUN!!! We were pleasantly surprised!!"], ["Reviewed 3 weeks ago", 5.0, "Just a fun area to spend the day...", "This area is really relaxing and fun to walk around. Lots of things to see. Beach is no comparable to the carribbean but for the west coast, it is not too bad."], ["Reviewed January 22, 2018", 5.0, "So much fun for all ages!", "We had a blast, us(the parents) and 2, 13 year old girls, for a birthday weekend. Be sure to buy a yearly pass, as it pays for itself in one trip...because in the coupon book you get with the year pass you get a free entry-so we all 4 got in basically for the price of 4 tickets but would up with 2 year passes and a ton of coupons!! We had so much fun!!!!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great energy - Lot to do!", "The boardwalk is a great family friendly place to go and also great for couples, friends and/or large groups. We spent time at the boardwalk and then walked down the pier to have dinner and see the sea lions! There was a concert happening while we were there too which while we didn't attend, was great to hear in the background.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun time", "We went on a Saturday afternoon. We took our 3 kids ages 8-12. There was something for everyone. The Big Dipper was a favorite. There is also nothing better the corn dogs on the boardwalk while playing games and winning stuffed animals. The sound of roller coasters and arcade games always makes me happy. A bit pricey but fun. It’s so fun at night too. Bring a jacket it gets cold.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Santa Cruz Beach", "Great beach. Please try and visit towards sunset and get great view during day light and splendid view under lights. Parking is a bit problem during weekends and holidays. Don't miss the train ride."], ["Reviewed January 15, 2018", 3.0, "Big Dipper", "Our hotel was right across the street so we figured we’d take a look. We rode the Big / Giant Dipper. A lot of rides were closed because it was January. You could mainly eat and shop your way through.\nProbably cooler in the summer and with little kids.\nThe Giant Dipper was good.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Timeless", "Lots of fabulous memories of this boardwalk from my teenage years came bubbling back to the surface as I walked the beach, watched the surfers, experienced a wedding proposal, took photos of families, and listened to the happily screaming teens on the roller coaster. Not much has changed which is a good thing. There were people building sand castles and having picnics. The pier provides a nice walk, although it smelled like urine. There are definitely more homeless people around, some sleeping on the beach. Nevertheless, the smell of the sea, the sounds of the sea lions , the circling sea birds, and the crashing waves makes a beach walk thoroughly invigorating.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Amazing place!", "We are first time visitors and were simply amazed. This place is like a large year round county fair carnival area. This cool place has a section suitable for kids, teenagers & adults!! The food sections are good but definitely a bit pricey as many typical amusement parks, but totally worth it.\nShow less"], ["Reviewed January 6, 2018", 5.0, "The original iconic Beach Boardwalk", "A very old beach boardwalk hangout you definitely must visit.\nMake sure to take a ride on the oldest wooden roller coaster in California, the Giant Dipper, built in 1924. It still creaks, and I can't tell you the surprise you will encounter at the beginning the ride. Just do it!!!\nShow less"], ["Reviewed January 4, 2018", 4.0, "this is a great place to just have fun!", "all kinds of rides -food booths arcades and has free music in the summer on fridats- it's right on the Beach so I say just go there and have a great time"], ["Reviewed January 1, 2018", 5.0, "Fun place", "This was a fun place to visit and hang out as a family- lots of family friendly games and rides. Will be back!"], ["Reviewed January 1, 2018", 2.0, "Boring place at New Year Eve", "Almost all games and shops were closed by 6pm while left many tourists wondered around for nothing. The holiday light train we took started at 5pm and ended at 6pm. There were more lights outside of train than inside. Nothing was offered in entertainment in the train that costed $120 for our family with two young children. They distributed some paper horns and paper hats to a few selected passengers but not all. Our kid luckily got one to share between them. I got yelled at by asking for another one on the train. You could find them selling as 8 per dollar in dollar store. Poorly managed train and place. Don't recommend it at all. It is a shame that this kind of spam and rip off happened at this wonder public Beach location.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Always a good time", "Prices are okay, maybe a little steep, but beach is incredible, Boardwalk has a lot to offer, and it’s always a good time for all ages"], ["Reviewed December 31, 2017", 4.0, "Stopped by late", "Was pretty at night, but being 6pm some attractions were starting to close. The ice skating looked very nice."], ["Reviewed December 25, 2017", 5.0, "Trashy fun", "Classic beach board walk with the rides, games and cheap food but it works great here. Nice big sandy beach"], ["Reviewed December 21, 2017", 5.0, "Stayed at the Comfort Inn", "This was a very nice hotel and I would stay here again it's close to the boardwalk it seems very firmly oriented the office was very nice and I would definitely stay here again"], ["Reviewed December 21, 2017", 4.0, "Santa Cruz Boardwalk", "Fair-Food and more... rides, games, beach...Creepy animatronic clown. It can be a bit dirty from time to time depending on people."], ["Reviewed December 21, 2017", 5.0, "Highly recommended even if just for people watching", "How can you beat an arcade (complete with old school games), roller coasters, a view of the ocean and all the junkfood your heart could desire? The people watching is the best--it doesn't cost anything to just walk around the boardwalk which makes for interacting with a wonderful slice of humanity!\nShow less"], ["Reviewed December 18, 2017", 5.0, "Nice boardwalk with lots of fun places and eateries.", "Spend very nice evenings there with weekend live performances. A lot of awesome playful rides and nice places to eat and just sit and relax. The beach is nice and kept clean all the time. And some places to shop as well."], ["Reviewed December 11, 2017", 3.0, "Fun, but don't go at night.", "The boardwalk is fun and if you are a fan of \"The Lost Boys\" movie from 1987, it's a piece of movie history as a lot of the movie was filmed on the boardwalk and around Santa Cruz. The only thing I would advise is to go during the night, not at night. At night, the beach area is fairly covered with homeless people and there's quite a bit of crime in the area so as long as you go during the day, you should be fine. All in all, it's a lot of fun. Food, games etc...it's a great time.\nShow less"], ["Reviewed December 9, 2017", 4.0, "Fun place", "Most everything was closed for winter but still enjoyed walking the boardwalk. The ice rink was open and the kids loved it."], ["Reviewed December 8, 2017", 4.0, "Fun Family Vacation", "Another fun time on the Boardwalk. Great rides, fun games, and yummy food. You can't go wrong with a mini amusement park located alongside a beautiful ocean. Just remember to bring a sweatshirt with you for the evening. It does get chilly once the sun goes down. The only con: the price. Try and find a good deal online or at Costco.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Best Boardwalk...period", "The Santa Cruz Beach Boardwalk is consistently voted Best Boardwalk. It offers everything you could want. A great roller coaster and all the usual amusement rides,\nas well as a two story arcade with a mini-golf course. Plenty of food and even some healthy-ish options. Bar options are across the street, but there is beer on the boardwalk. Parking is $15 for all day. The beach is perfect and the wharf is right there. Hard to beat if you love the beach. Great for family, couples or just to go for a walk and people watch\nShow less"], ["Reviewed December 6, 2017", 5.0, "Nice amusement park", "We enjoyed the beach and view, not many vendors were present. The food was fresh and good. Some rides were available, I guess due to the time of the month,many rides were closed. The shops were nice, will come back to visit."], ["Reviewed December 6, 2017", 5.0, "Great old fashion fun", "Boardwalk fun and games enough junk food to make the biggest foody say enough. Stick around for the evening concerts on the beach. Mini golf, rides and yes more food!"], ["Reviewed December 6, 2017", 4.0, "Beach Boardwalk", "Rides shops food you shouldn't eat and the ocean. Great for a visit but in 110 degree heat you don't want to move to far so just sit on the beach."], ["Reviewed December 4, 2017", 4.0, "Winter Visit, more empty than expected", "So, I did read online that only a few rides were open in the winter. Unfortunately, I went on a weekend that was a really odd weekend. As the holiday on ice had just started, the main attraction was a very small covered rink they have next to the beach, that is covered with a canopy and the view directly to the beach is covered.\n\nOnly the (maybe) handful of rides were in operation. Most of the rides and stalls were closed, in guessing to minimize people and trash throughout the park. It is much longer with much more vendors and rides than expected (and especially compared to San Diego). The Big Dipper wasn't running and the main reason I went. So, in the winter, be sure to call ahead to check for rides if specific ones are desired (as posted in website). Arcade was open.\n\nWalking distance to the wharf was delightful, enjoying the view of the beach.\n\nDuring the summer, I can imagine how insanely busy this place gets.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Permanent Carnival", "A last day activity for me before heading back to Sydney. A Wet and Windy Sunday and the place was pretty quiet. Free entry but many of the activities were quite expensive - still a number of pressed penny machines here though for those interested in that particular keepsake. For Sydney siders it reminded me of Luna Park!\n2081\nShow less"], ["Reviewed November 29, 2017", 3.0, "Historic Boardwalk", "It was cute, very old and historic. I would assume lots of people during high season, we were there in November. Great for kids."], ["Reviewed November 28, 2017", 5.0, "Something for All Ages", "I was pleasantly surprised by the Boardwalk. This one was very clean, family friendly and entertaining for all ages.\n\nThe Boardwalk parking lot is conveniently located just in front of the entrance. You actually could park there or somewhere else and then enjoy the Boardwalk just walking around or visiting the gorgeous beach without any additional cost. You can just walk in without having to purchase any tickets for entrance. However, if you want to participate in the many rides and attractions, you will need to decide which ticket offer is best for you. Do not just buy the most expensive thing as you may want to walk around first and see what you want to do. You can always go a la carte. We were with teenagers who did buy a wrist band for a reasonable amount of rides with no attractions and that worked out well.\n\nFor others, you can enjoy the many food options available. One regret I have is not getting a big soft pretzel. There also are benches for those who are getting tired. Restrooms are fairly clean considering the volume of people.\n\nThe beach is totally amazing. It is really the prettiest beach that I saw while in the area. It is very wide, clean and not too crowded on a weekday.\n\nShow less"], ["Reviewed November 24, 2017", 4.0, "Old school awesome.", "Free to visit, but plan to spend some time so you can get the most outta a all you can ride bracelet. Standard carnival games...Was there mid-Nov on a Sunday, and it was nice and crowded, not too much, but enough to make it fun. the Giant Dipper is an awesome old \"woodie\", rough, not smooth, fast and feels like your arms should get torn off if you try to keep them up. I loved it. Haunted castle ride, total cheese and pretty much good for kids, but again, old school and fun. Would love to go back when I had more time.\n\nAlso, a lot of the beginning of \"Lost Boys\" was filmed here...and since I am an an \"80s baby, made it even more cool than I already thought it was.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Relaxing", "Good relaxing day at the beach. It’s nice getaway place for food, fun, lay down enjoying the sunshine, swimming or surfing. We will be back."], ["Reviewed November 22, 2017", 4.0, "October, 2017", "The entertainment value - for up to 3-4 hours is truly great! We are grand parents and enjoy bringing down our grand kids. There is entertainment for all. My wife and I enjoy the carousel ride."], ["Reviewed November 22, 2017", 5.0, "Old fashioned boardwalk", "Old fashioned boardwalk that provides a real ocean park experience. Nothing phony or made up. The roller coaster continues to entertain and the other rides are fun. Cotton candy. Burnt sugar. Just an amusing experience."], ["Reviewed November 17, 2017", 4.0, "FUN", "My son and I loved the boardwalk. Went on a Saturday, bought passes, and went on lots of rides, played games, and had a great time. Only complaint was how crowded it was. But what an amazing view from the top of the log ride."], ["Reviewed November 9, 2017", 2.0, "Santa Cruz Beach Boardwalk and Santa Cruz Pier not what it once was.", "I have loved coming here for many years. This time in a little of the off season and sadly you can really see that age is setting in. Many of the attractions were shut down with little in tourists, but it was good for a morning walk. From the boardwalk to the sand to the pier it really is showing that the city and the boardwalk company is not keeping up with the maintenance. Wear and tear seems to showing up every part of this once great area. I know lots of work should be done during the winter and hope to see that happen come spring.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Visit the Boardwalk Year-Round", "A visit to the SC Boardwalk is almost a step back in time, like a small Coney Island back in the day. Ride the 100+ year-old Loof carousel, grabbing the brass rings to throw in the clown's mouth to light him up. Haunted House, good-enough roller coaster, chow down on great cotton candy. If you time it right, you'll be there for special events: Annual Chili or clam Chowder cookoffs, and free concerts by big-name rock bands right there on the beach. Wet winters don't allow for the big fun, but watch for clear weather and you'll have no crowds to contend with.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Free to visit, but thew kids will want to spend some time and money.", "My grand daughter only has one mode when visiting, and that would be hours of rides, with the roller coasters being her favorites. It is free to enter and walk around. Friday nights have free concerts with (former) big name entertainers, and those events are packed, as you can imagine. I grew up here, but the old school rides are interesting, if you have not been exposed to them.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful beach", "Great for family and friends to visit. Pacific ave has Starbucks and Santa cruz coffee house ,petes coffee. There are a variety of places to visit. Coin operated games for kids when the boardwalk is open you can spend the day enjoying the rides or just sitting and watching sea otters in the ocean .\nShow less"], ["Reviewed November 8, 2017", 2.0, "Disappointed", "I am sure it can be better but it was dead when we were there. Nothing happening, most stuff closed up. It is off season but I expected more."], ["Reviewed November 5, 2017", 4.0, "Classic beach boardwalk", "One of the old time beach front classic boardwalks. Hot dogs and frozen drinks. Wooden roller coaster. What's there not to like about it?"], ["Reviewed November 4, 2017", 5.0, "Had a fun day at the boardwalk with small kids!", "We went on a family trip and spent Saturday at the boardwalk. We went in September and the weather was beautiful. It wasn't very crowded and we never had to wait for the rides. They are only open on the weekends after Sept 1 so we thought it might be busier. We bought the wristbands and they gave us a season pass for one of them. My kids must have gone on every ride at least 10 times. I was worried that there would be a limited number of rides for 3 year olds but they had a great selection. My husband and I were able to leave the boys with the rest of the family and ride some of the larger rides too. Really a great and memorable day.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Nostalgic return to childhood home", "I love this place and what even makes it better is I have not seen it in 10 years. They have thrown a lot of money into restoration and cleanup of the Santa Cruz Beach Boardwalk. It looks terrific! I also noticed that the ticket prices have stayed very low compared to other establishments. You can get a wristband for two days for 42 bucks. I would definitely take your children there or a date or by yourself to walk down memory lane or have a great day at the beach with an old-fashioned Boardwalk!\nShow less"], ["Reviewed October 31, 2017", 5.0, "A Great Weekend Getaway Vacation", "If you love eating carnival foods, riding exciting but not over the top rides, and drinking beer right by the beach, then this is the place for you. The Beach Boardwalk has been a family favorite for over 35+ years and we continue to come now with our children. Trust me when I say you won't regret your visit here...just review the calendar to obtain hours of operation.\n\nFYI: Jason Aldean's \"A Little More Summertime\" Video was filmed here.\nShow less"], ["Reviewed October 30, 2017", 4.0, "A GREAT PLACE TO RE-VISIT AGAIN AND AGAIN", "Joined my Son and family on a foggy Santa Cruz day to visit this quintessential fun zone! We make it back here every few years and re-visit favorite rides and discover new shops and rides. Such a great location along the beach. We have seen it all cleaned up over the years and the parking is much improved. If you are going on a lot of rides, the all day wrist bands are the best bet as each ride costs at least $5 so the Boardwalk Card spends fast. Of course, you can get the season passes, but we do not come that often. My opinion is the \"carnie\" games would make more money if they would lower their prices. There is a great two level arcade on the north end- the multi-lplayer air hockey on the second floor is a blast! Most healthy eats are at the far south end near the kiddie area where you can get wraps and bowls and fresh fruit, but otherwise it is deep fried nirvana through-out. One family owns all the beach wear shops throughout, so if you see something you like and it is not in your size, check out one of their other four shops. Boardwalk opens up at 11 a.m., but Google to see times as they change during the year.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Always a vacation!", "Although closed except for weekends now, the magic of the Boardwalk and beach is always there. And on weekends, wonderful people watching, fun food and rides."], ["Reviewed October 24, 2017", 4.0, "Fun for families! Great beach location - love the rides.", "Can be a little chilly in off-season and sunny and pleasant in the summer. Lots of different rides for all ages. My almost 10 year old is a true thrill seeker and loved the Giant Dipper (you cannot pay me enough to get on those things! - but he loves them). Also, check out the bowling alley across the street.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Mr", "Great place lots to do and many hotels in walking distance to beach amusement park game room restaurants walf not to far from down town you can walk there"], ["Reviewed October 23, 2017", 5.0, "lots of seals and birds on this walk", "get up close to seals on a raft towards the end of the pier .lots of good eating places at the start of the pier and along the sea front"], ["Reviewed October 23, 2017", 4.0, "Great atmosphere", "We visited on a sunny Sunday afternoon. The atmosphere was great, and it felt much more wholesome than the typical British fairground that we are used to. Two points worth noting: the height restrictions are quite strict on a lot of the rides so if you have young kids they might end up not being able to go on a few of the rides. Also not cheap, most rides were $4-5 each. But was an enjoyable visit and a great example of an all American seaside resort.\nShow less"], ["Reviewed October 22, 2017", 3.0, "It’s ok not that special", "It’s been years since I’ve been to the boardwalk. It’s different when you go in your early 20’s and then go as an adult in your 40’s. I feel the rides are like the local fairs but you get to experience the beach and cooler weather. Wait time for rides can get long when it gets crowded. Parking is $15 so get your moneys worth at the boardwalk. If you have motion sickness it will suck with the combination of the sea air coming in. For the price of rides I think your better off going to Great America or Six Flags in Vallejo. More attractions for around the same price.\nShow less"], ["Reviewed October 22, 2017", 5.0, "A trip back in time", "A well kept boardwalk with plenty of amusements and food outlets. Took a ride on the legendary wooden rollercoaster. An enjoyable time spent here. All the fun of the fair!"], ["Reviewed October 21, 2017", 4.0, "Fun, lots of exciting energy.", "The boardwalk is a great place to take the family. There’s shopping, food, an arcade and amusement type rides at the end of the boardwalk."], ["Reviewed October 20, 2017", 4.0, "Lovely on sunset", "Beautiful walk on a sunset with many restaurants, gulls and seals with the surrounding occean view.."], ["Reviewed October 19, 2017", 2.0, "Under contruction", "It may not be anymore but a lot of it was under construction and we were not able to have any fun. I hope next time we go will be open for business!"], ["Reviewed October 19, 2017", 4.0, "Great, traditional boardwalk with lots of fun and games.", "Always enjoy walking this boardwalk, especially love the indoor gaming in pavilion...the roller coaster is a classic, and any fan must go on this one!"], ["Reviewed October 19, 2017", 5.0, "Great bicycle lane", "Great view over the ocean, the cliffs and surfers. A great bicycle lane or path for jogging and walking."], ["Reviewed October 17, 2017", 4.0, "Take a nice long walk", "Even though it was off season (after Labor Day), many restaurants dot this pier, so there are many choices. The beach is lovely."], ["Reviewed October 17, 2017", 3.0, "Closed weekdays", "Stopped to take a stroll along the boardwalk on a Thursday afternoon. Beautiful sunny warm day last week yet few shops or restaurants were even open. The amusement rides are apparently closed now except for weekends. Disappointing."], ["Reviewed October 16, 2017", 5.0, "Fun...", "Plan to eat at the Wharf, as that is where he seafood really is. However, the Boardwalk itself provides great shops and plenty to do (to include visit the OCEAN!). It’s a cute place with something for everyone. The family enjoyed shopping, eating, and playing in the ocean and sand.\n\nWe plan to come back often as we don’t live too awfully far north of SC. Well worth the crazy traffic to drive here!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Lots of fun !", "The boardwalk is much different from \"back in the day\" in that it is cleaner with plenty of foodstuffs to sample (warning: may not be too healthy!) and more rides. It has somewhat of a carnival atmosphere with all the chances given to try one's luck at the many booth attractions. There's also a large video game building in the middle of it all. There is a gondola to view both the beach and the boardwalk, and designated areas and netting for volleyball. There are also many rides to enjoy, and of course the beach to walk and swim. The crowds seem to be pretty family oriented: a lot of tourists out to enjoy themselves. For anyone not familiar with Santa Cruz, the waters are not like Southern California; they are a bit rougher in areas, but provide for some awesome surf. Wetsuits recommended most of the year for surfers.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Pretty but Junkies about!", "Lovely all the lights but a lot of junkies clearly well under the influence and homeless a shame as area itself is nice and the lights at night so pretty"], ["Reviewed October 12, 2017", 4.0, "Pure Nostalgia", "What a gorgeous place to go and see in this world. It’s got old world charisma and that classic beach relaxed atmosphere. I’ll always love this place because it transports me into a magical place and time in this world."], ["Reviewed October 11, 2017", 4.0, "Great rides on the beach", "Since the closure of Fort Ord several years ago,the Boardwalk has become a great place for families and kids of all ages. Rides are fantastic and the views are not to be missed."], ["Reviewed October 10, 2017", 5.0, "Amusement Park on the Beach", "Santa Cruz Beach Boardwalk is one of the last Beach Boardwalk's with an amusement park. Featuring rides, fair food and arcade for kids and adults. This classic destination is one of the best family places to visit in Santa Cruz"], ["Reviewed October 9, 2017", 5.0, "Always a nostalgic choice", "We’ve been coming here for 19 years....great vibes, great beach. Everyone should check it out at least once"], ["Reviewed October 9, 2017", 5.0, "Went to purposely ride the roller coaster", "Good amusement park right on the beach front. Varied rides and attractions. It is a historic location for those with an interest beyond the rides. Wonderful old rail road engine parks at the back whilst those on a trip down from the Rail road museum enjoy their time in Santa Cruz. I went just to ride the Giant Dipper -not to be missed. Surrounding area with old railway bridge over the river to one side and wharf to the other is great to explore.\nShow less"], ["Reviewed October 7, 2017", 5.0, "A Great Find", "Our stay in Santa Cruz was quite an impromptu one as we wanted to find a place close to San Francisco. ( we were heading there the following day) We found a hotel close to the amusement park and spent the afternoon looking around this place. My husband and kids, 11 and 9 absolutely loved the atmosphere and variety of rides. Our favourite would have to be the big dipper. Good old fashioned fun! We spent some time in the arcade both that afternoon and again in the evening. The games were very reasonably priced. We had such a wonderful time here and it was one of the highlights for our kids. They talk about it more than Disneyland. We also loved the variety of restaurants on the pier and of course the seals. We would definitely recommend this place to anyone driving along the coast.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Get a season pass!", "A season pass is the best deal. If you go twice, you've paid for it in full. It comes with tons of coupons and free stuff as well including a guest pass."], ["Reviewed October 3, 2017", 4.0, "Lots to see and do", "What a fun place! We just walked through but so much to see and do. It was pretty crowded but we were there on a Saturday."], ["Reviewed October 2, 2017", 4.0, "So much fun everytime", "My family loves our trips to the boardwalk. It's our favorite get away. It can get VERY crowded but that's ok. I feel safe here and everyone seems nice."], ["Reviewed October 2, 2017", 4.0, "Fun", "Fun- especially for a younger crowd. A bit noisy, but that's what it's supposed to be. Gets a little chilly at night, but that goes with the area."], ["Reviewed October 2, 2017", 3.0, "OK if you like lots of people", "It is good for kids. Not really for adults. Rather go to the beach in front of it. Rides aren't all that great."], ["Reviewed October 2, 2017", 5.0, "Boardwalk and Pier", "The boardwalk stretches along the waterfront and golden sands. Plentiful parking close by the boardwalk offers a mix of rides, an arcade, shops and eateries. Just along from the boardwalk is the 1/2 mile pier where you can find gift and souvenir shops, restaurants and bars. Sealions can be seen ( and heard ) relaxing under the pier. A most relaxing area for an evening stroll.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Great for kids", "We had a 17 year old with it, and they loved it. Felt safe leaving them there with their friends. Nice and clean."], ["Reviewed September 30, 2017", 5.0, "One of a kind", "Great place to hangout... It's one of the oldest sea-side wharf built with great views, eateries around. Had a lazy, nice, long walk in sun for couple of hours."], ["Reviewed September 29, 2017", 2.0, "Too Crowded", "It is hard to enjoy the boardwalk with crowds combined with the heat. The rides are overall ok. I used to enjoy the place when I was a teenager but not so much now."], ["Reviewed September 28, 2017", 5.0, "Stroll the Boardwalk", "The Santa Cruz Beach Boardwalk was a nice stroll along the California coast. Beautiful views and nice shops and restaurants. Also plenty of rides for those who enjoy those kind of things."], ["Reviewed September 27, 2017", 5.0, "Great fun & Classic rides", "Visiting Santa Cruz was an unplanned part of our trip but it's somewhere I would certainly visit again. The rides can be pricey if bought individually but a wristband was 30 dollars for unlimited rides and we made full use of it. The surrounding beaches and the pier/wharf is worth a look too all round great day.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Visit with Friends", "Visited friends in Santa Cruz during our trip, visited the boardwalk for first afternoon of our visit and had lunch there, it was great and good value for money. We also visited the art and wine festival in Capitola which was great and the ultimate treat whale watching.\nShow less"], ["Reviewed September 23, 2017", 4.0, "Santa Cruz Beach Boardwalk", "The boardwalk was a good one-time get away while in the Monterey Bay area. A great place for people watching."], ["Reviewed September 22, 2017", 5.0, "Sea lions and sunsets gallor.", "Good restaurants with happy hour offers. The sea lions are beautifuland you can loose a few hours watching them playing and trying to jump on to the joists to sunbath.\nThe sunsets were beautiful and the place seems really well maintained. It was relaxed and beautiful. You have to go.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Birthday fun", "My husband and I went with our daughter our grandchildren and one of her friends for a my oldest granddaughters 13th birthday. My daughter had purchased wristbands for all of the kids so that they could go on all the rides that their hearts desired.\nWe were able to let the kids go off and do their thing there on the boardwalk while we walked over to the Santa Cruz Pier for some adult time.\nWe had a good time going though the shops, watching a beach volleyball tournament. We bought clam chowder at the Dolphin at the end of tje pier.\nI think they have the best seafood and chowder.\n\nWith everybody having connection via cell phones we didn't have to worry about the kids we called and checked on them and they all just had a great time. It's a great place to be able to do that with your older teenage kids that way.\nMy granddaughter had wanted to go just to the beach for her birthday but was surprised with the trip over to Santa Cruz Beach Boardwalk.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Family day full of adventure", "The Santa Cruz Beach Boardwalk is by far one of our favorite theme parks to go to! It does help that we are locals and my three teens work at Marini's on the Beach! Stop by and get some delicious candy apple and famous Taffy and cotton candy enjoy!\nShow less"], ["Reviewed September 19, 2017", 5.0, "Went back in time.", "The Santa Cruz Boardwalk is a step back in time. I first visited 50 years ago and many of the attractions and food booths are just as I remembered. Loved taking my Grandkids to experience the things I did when I was their age. The old wooden roller coaster, the carousel, the corn dogs, etc....\nShow less"], ["Reviewed September 17, 2017", 2.0, "Old and tired", "There is some updating going on but it has changed little in 50 years. Kids may like it but those over 20 might find it boring."], ["Reviewed September 16, 2017", 5.0, "Still excited", "The Giant Dipper itself is worth to visit this place. It's the best roller coaster we ever tried. Beach is clean and nice place to stay."], ["Reviewed September 16, 2017", 3.0, "Nope", "Anyone who spent their childhoods here in the 1970s thru 2000 has to be just sick about how expensive it is now.\n\nNever paid for parking. Now it is $15 flat fee. Rides average from $5 to $7 per ride! Food? Wow! How do families afford it? We have certainly had inflation over the years, but the costs of this attraction seems to me to have far surpassed inflation! A family of four visiting the boardwalk had better be ready to fork over $300+ with parking, rides, and food for the day. Maybe this is normal now. But for us old timers this is shocking!\nShow less"], ["Reviewed September 15, 2017", 3.0, "Mostly an amusement park with a beach", "Good place for young people to have a fun afternoon. Loud, garish place. Free to walk the Boardwalk and enjoy the beach."], ["Reviewed September 14, 2017", 5.0, "Fun fun fun.", "In the summer the amusement park is open and provides lots of opportunities for fun. Even when it is closed the beach and boardwalk area provide a fabulous place to walk. There are lots of shops across the street, too, and plenty of places to eat.\nShow less"], ["Reviewed September 13, 2017", 3.0, "Just like Wally World - it was closed when I got there", "Visited boardwalk to find all shops and attractions were closed for the season. There were 2-3 souvenir shops open and a few snack shops.\n\nOk it was a Friday. but still... it was closed up... and I felt like Clark Griswald... make sure to call or check on line before you make the trip during non summer season.\n\nEverything looks old and run down - I hope they maintain the rides well - because 1970's technology was the new stuff here. I'm sure they are all classic rides - but think they could invest in some updated features.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Pacific Ocean Paradise", "Park on Swanton Drive near Natural Bridges State Park and begin your 5 mile round trip walk along West Cliff Drive. Lots of beautiful ocean view homes, wildlife (dolphins, sea otters, whales, cormorants) will appear. Very crowded on the weekends so go mid-week. Turn around at The Boardwalk but stop in for a drink at Aquarius Bar in the Dream Inn. Stop by Steamers Lane to see the surfers tackle the waves.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Exciting place to visit!", "Me and my friends agree that this place is better than Santa Monica. Lots of rides and games to play, awesome snack booths! Beautiful beach! A bit crowded, but it's worth it!"], ["Reviewed September 8, 2017", 4.0, "Still a great time!", "I can remember coming here as a teenager, and now I get to bring my own teenager here to visit! It was Labor Day Weekend so it was a bit crowded, but still as fun as EVER! The food seems a lot pricer than I remember, but its amusement park food prices, so what do you expect? You can bring a cooler if you want though.\n\nWe stayed up the street so it was easier to just get an Uber/Lyft than it was to try to park and was just about the same price ($7) I would highly recommend that to anyone coming to visit! Even if it just for the day, we will find free parking then Uber in.\n\nOverall great time!\nShow less"], ["Reviewed September 8, 2017", 4.0, "Crowded but a nice place to spend a day at", "We went here during labor day weekend (Sunday) and let me tell you the place was crowded! We got dropped off by family and they were stuck in traffic for hours! Impossible to get in and/or out of the streets near the board walk. If you park far away and avoid driving you should be fine, everything was crowded but the lines for food and activities moved fast. This was my first time visiting and I had a great time: shopping, good food, drinks, rides, beach, they've got it all :)\nShow less"], ["Reviewed September 8, 2017", 4.0, "Decent rides for an operation of this size", "This is the goto tourist attraction in Santa Cruz. It's no Great America but, for its size, it has some pretty good rides. The Giant Dipper roller coaster is a classic."], ["Reviewed September 7, 2017", 5.0, "A nice revisit on a quiet day", "Last visited in December 2016.\nReturned on a weekday in September.\nMost of the boardwalk is closed but the crazy golf remains open and is pretty good fun.\nWeather was lovely and to be honest it was just good to see the boardwalk a little quieter\nLove this place\nShow less"], ["Reviewed September 7, 2017", 5.0, "SUMMERS LAST STAND", "Our family (myself, wife, adult son and 8th grader grand daughter) took a mid-week summer \"closeout\" trek to enjoy beach, the Boardwalk and the Attractions before school started. For 2017, there are two new rides. Both are just inside the Main entrance next to the Undertow. The Shockwave has outward facing, four-seat disks that spin and rock back and forth as it travels the length of the ride. I'll give it a 3.7 out of 5. It will put a smile on your face.\n\nThe Tyhoon has two opposing spinning arms that rock the riders back an forth until the arms finally go over the top each direction a couple times. As the arms start to \"wind down\", you get a brief upside down hangtime (twice) before the end of the ride. It gets a 4.5 out of 5 for the grin you have when you get off the ride.\n\nThe Boardwalk has made several improvements around the Park. Not an improvement, but fun, if you have time to kill be sure to play round of golf. Make sure you do this when it cool, because there is not a lot of air movement when you play the holes on the \"upper deck.\"\n\nThe wooden Roller-coaster is always a blast.\n\nRemember the Boardwalk and beach are free. You only pay for the \"Amusement,\" (rides and games, food, parking and memorabilia).\n\nPS If you can, buy the Two Person pass at Costco. You will save yourself some money.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Perfect Young Family Venue", "This trip was for my granddaughter's 9th birthday and she had a blast. So glad my son and daughter-in-law were there to go on the rides with her, too. I only went on a couple of low key attractions but it was fun watching. There was a band playing on the beach in the late afternoon. We managed to stay from 10:30 a.m. to 7:30 p.m. It was a lovely summer day and night as well as the fact it felt safe.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Less crowded and more fun", "Timing a trip to visit the Boardwalk after most of the kids have gone back to school but everything is still open and the summer sun is shining is just the best. We even found street parking available. There are old favorites like the Big Dipper and new attractions. There is a variety of food available. And the arcade is nothing but fun! We visited a small Magic Shop which was new to us. A great afternoon at the Santa Cruz Beach Boardwalk.\nShow less"], ["Reviewed September 6, 2017", 3.0, "Crowded!", "We were there labor day weekend in 95 degree heat - VERY crowded. For families with kids and lots of stamina it seemed to be fun but we were hot and there were just too many people! For a classic boardwalk experience with rides and endless junk food this is a great spot. Not my thing but clearly many people were enjoying it.\n\nI have never seen a beach as crowded as the stretch that runs alongside the boardwalk. Wow. Ocean was beautiful though once we found a stretch of beach with fewer people.\nShow less"], ["Reviewed September 3, 2017", 4.0, "Fun Place for a couple of hours", "Santa Cruz beach boardwalk is a great place to walk around and ride a couple of rides. The crowd can be a bit rough around the edges. I would not want to spend more than a couple hours here."], ["Reviewed September 3, 2017", 5.0, "Summer Fun!", "This is definitely home to a lot of childhood summer memories. You drive up and spend the day riding the old school rides and eating sinful theme park food or you lay out on the beach (or both!). My husband and I hadn't been in many years until today when we were in town for lunch.\n\nA lot of the rides and food stands have been revamped (new paint or some new themeing in some cases) and I thought everything looked much improved. All the old favorites are still there like The Haunted Castle or the deep fried dessert stand. It is a great way to spend a classic California summer day and very easy to pull off if you come on a slow day like we did today. No lines for anything and parking was a breeze at the lots right across from the park.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Loved our walk down the Boardwalk", "WE loved our walk down the board walk. We were surprised how clean it was. Easy access to the beach. Lots of things to do and lots of food."], ["Reviewed August 31, 2017", 4.0, "Great fun", "Went on an off day a Monday only open 12 to 5 but still good fun. Went late in the day but had fun. Not all rides were open but ok. Have a video arcade miniature golf and bowling in the area. Can become expensive but was fun.\nShow less"], ["Reviewed August 31, 2017", 4.0, "fun spot", "Boardwalk has something for all ages. Its clean and well run. We were there on a Thurs in late August, so lines were short, crowd was thin. Santa Cruz is kinda run down, we got out of there once the kids had enuff rides"], ["Reviewed August 31, 2017", 5.0, "Fun in the sun", "I went to this beach with friends. It's a carnival atmosphere with rides and games for kids of all ages. Pricey so bring cash and credit- they don't take American Express. Live band playing on the broadwalk. Definitely fun for all."], ["Reviewed August 31, 2017", 5.0, "Typically old style USA", "This is a great place to enjoy the rides and stalls taking the kids it is a theme park by the sea and during the day the beach is fun"], ["Reviewed August 30, 2017", 5.0, "Great Family Fun", "OMG, if your looking for a place for the family to spend the day then this is the place, great rides, shops and most of all food, treats you name it they have it, I know going here with your family each person would find a something to do or love.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Nice evening, well maintained", "Just touching the beach you can find Santa Cruz Beach Boardwalk, a pleasant place to walk, have fun, thrill, and eat some snack or dine.\n\nIt's very well maintained, with lots of options for shopping, eat, and attractions to have fun.\n\nParking just crossing the street (fee).\nShow less"], ["Reviewed August 29, 2017", 4.0, "So fun!", "The boardwalk was super cool and right on the beach. They had a variety of rides and even deep fried Twinkies! The only bummer was that the arcade no longer took tokens and you didnt win \"tickets\". It was all done electronically on a card, wheres the fun in that?!. The rides were also accessed through the same card so don't feel like you have to spend all your money at the arcade! A lesson we learned later.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Good fun", "Been to many boardwalks and this was one of the better ones Didn't rip you off, clean and lots of staff"], ["Reviewed August 28, 2017", 4.0, "\"Always fun to walk om the boardwalk\"", "It was not very crowded when we were there. Since we had a dog with us we were quite limited. You can't go into many places with a dog. We did enjoy sitting on a bench watching the Volleyball players and looking at the ocean."], ["Reviewed August 28, 2017", 5.0, "Good, clean, fun", "The shops and rides looked well maintained and everything was kept clean and nice, including the bathrooms. Like most boardwalks with rides, food and stores, it is costly but coffee and clothes/souvenirs were in line with other shops in the street and the pier. I had a pleasant time walking along. I don't do rides and games but the patrons looked happy.\n\nI had an excellent time at the boardwalk beach free concert Friday night. The crowd had fun yet was courteous. The area was laid out in first come pick your spot on the sand with blanket or low back chair. An area in front of the stage was roped off for dancing. The Gin Blossoms played two sets with a break in between and as always put in a good show. The dead interpretor was even rocking out.\n\nIf you are in Santa Cruz on a Friday night in the summer, I highly recommend the free concert following your day on the beach and boardwalk.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Very nice for families! Crowded though", "The boardwalk is very nice and there are plenty of snack Booths with amazing varieties. It is better for families with children for the rides and the general atmosphere. It is so crowded in the weekends though and so hot.\n\nOverall: nice walk and sea lions\n\nP.s.: the wharf is so close, just few minutes walk and has plenty of sea lions to see.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Best for last", "A must go on the final day of California vacation destination! Fun for everyone! Very clean beach. You will find something everyone likes in games, beach, rides, food, out souvenirs!"], ["Reviewed August 28, 2017", 5.0, "Great beach front park", "My son had seen the amusement park on YouTube and begged to go. So while we are out here we went. I was pleasantly shocked. It is a marvel of engineering. The park has been built in multi levels to maximize the space. It contains a great mix of new and old rides.the Giant Dipper is s classic old coaster while the Undertow is s modern take on the wild mouse style of the past. The park has a sky lift that offers amazing beach views. The Space Race bumper cars are amazing and should be st every park! The have every type of carnival food you can imagine and so many games to steal you money you could go broke!\nShow less"], ["Reviewed August 27, 2017", 3.0, "For families with children", "The boardwalk is really an amusement park for children. The kids seemed to be having fun. On a weekend with good weather, both the boardwalk and the beach were far too crowded for a relaxed time."], ["Reviewed August 26, 2017", 5.0, "Go in the middle of a week", "The boardwalk is crowded, but we didn't come for the rides. Kids wanted to get into the ocean! Then we went to the wharf were we saw sea lions and sea otters. On the way back we stopped to have an ice cream which was the perfect ending of the long day!\nShow less"], ["Reviewed August 26, 2017", 4.0, "fun times", "This boardwalk has a lot to offer. If you enjoy rides then you will be happy here. Fun arcade and plenty of rides for a screaming good time. I would have given this just a bit more but frankly the beach smell of decaying seaweed. (clean that up) There are pretty views and a river walk. The warf has a variety of shops and eats. Go explore and enjoy. Friday nights have bands that play on the beach, don't miss that.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Beautiful by night", "All the attractions light up and the place is a sea of people. Lots of great rides and food. Entry is free, but if you want to do the rides you've got to pay. A nice distraction and an awesome view from the end of the pier.\nShow less"], ["Reviewed August 24, 2017", 5.0, "Family Fun visit", "Went to the boardwalk yesterday. It's always beautiful there. First when you get to the parking lot of cost $15 to park. We always go on Pepsi day or retro day. If you bring a can of Pepsi you can get in for at 5 for $15 a person. And retro days you can get in for a dollar fifty a ride and a lot of the food is a dollar fifty. With a large family this is a good idea. The kids had a blast. There's a nice younger kid area for ones that are not as tall. There are some rides that are 48 inches and above. Even a few rides that are 50 and above inches and above. But every time we go here with our family at the kids love it.Tends to be busier in the summer. Off-season it's not as busy and you can get more rides in. The weekends get kind of busy.The season passes are good deal if you plan on going back a lot. We did that a couple years in a row but not this time.\nShow less"], ["Reviewed August 23, 2017", 3.0, "Fun", "Went to the boardwalk they were having a concert that night Pablo Cruz played it was pretty good also rode a couple of the rides and it was fun"], ["Reviewed August 23, 2017", 4.0, "Create great memories", "I've been coming here for decades and it's awesome. Brought my Grandson this time and had a ball. The rides are fun, the food is overpriced but still good. Fun arcade with everything from laser tag to air hockey. Great beach as well."], ["Reviewed August 22, 2017", 5.0, "Go in the morning when it's not so busy!", "The rides open at 10. Get there at around 9:30 when it's not so crowded with tourists, and you can get first in line for the rides, but most food options aren't open yet, but at least it's not crowded. It's free to go on the boardwalk but you pay for the rides. Rides cost somewhere between $4-$7 each. The more kiddie rides cost $4, while the more advanced rides like the Giant Dipper cost $7. You can also get all day passes and season passes. The Giant Dipper was my favorite ride, although it is a wooden roller coaster, but it's not so noisy. :)\nShow less"], ["Reviewed August 22, 2017", 5.0, "Great value and fantastic fun", "No hesitation in awarding 5*. Great rides and fun for two adults and two children aged 11 and 9. We paid $39 per ticket for 4 of us so about £120. For that you get all day access to the rides, which are really great fun. You can go on hair-raising / stomach churning rides or more sedate / younger child-friendly rides. You can also do a sort of pay as you go approach, but the cost per ride is quite high and wouldn't work well for an all day approach. That would work if you just fancied a couple of hours and a go on a ride or two only.\n\nFood is on the pricey side, but not horrendous. It's generally typical USA fare, but there are slightly healthier options if you look hard enough. Suggest having a good breakfast at your hotel before you go down and then a single meal and treat while you are there.\n\nIt is a full-on assault on the senses but for the inner child in you it is hard to beat.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Great Fun!", "Fun to walk and people watch even if you don't go on any rides! Still makes you feel like a kid again!"], ["Reviewed August 21, 2017", 5.0, "Concerts on the beach", "This review if for live music by boardwalk. I'd like to command the city for providing free live entreatment for locals and tourists. What a great way to distress on Friday nights! After a long week of work and responsibilities, it's so nice to sit down, grab a couple of sandwiches, relax and listen to great bands. Thanks!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Amazing day", "I loved Santa Cruz. We were visiting a friend in San Francisco, and she suggested we go. We road along the scenic route and stopped to get some jam at a local farm. Once we arrived, the weather was warm and the sun was shining. We started at the beach and put our feet in the water. Then after a quick change, I bought passes to the boardwalk. Despite the fact that I don't like roller coasters, I still found things to do. My son and friend road everything there was to ride multiple times. I felt like a little kid. All of us had a blast.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Expensive, but a fun day for kids", "We rode down on the Roaring Camp train, and spent several hours around the boardwalk before our ride home. It is very interesting to see the refurbished parts of the old boardwalk (like the Laughing Sal and the gorgeous Carousel). You can get a great meal out on the pier.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Great", "Walked around the boardwalk, rode a few rides and spent most our time people watching. Great afternoon/evening activity"], ["Reviewed August 19, 2017", 5.0, "Wooden Rollercoaster still the best!", "The wooden rollercoaster for my opinion is still the best attraction at the boardwalk and beats all the rides down hands beat despite being the oldest! If you only do one ride at the boardwalk then make sure it is this one as it is easily the best by a county mile!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Fun Amuseument Park - Santa Cruz Beach Boardwalk", "We did a repeat visit to Santa Cruz Beach Boardwalk, Its a fun amusement park The historic roller coasters are so fun to ride The carousel is super fun too. I like the arial ride and water rides They also have a train ride. There are others.\n\nThey have snack bars, miniature golf, arcades, shops, and more.\n\nThe setting on the Pacific Ocean is so fun.\n\nIts a very popular amusement park, During the summer its open 7 days, but after Labor Day, its best to check when the park is open. its often just the week-ends\nShow less"], ["Reviewed August 19, 2017", 5.0, "Fun, fun fun!", "Enjoy a day of great rides, carnival food, and right on the beach if you want a quick dip. Great place for kids, families and teens."], ["Reviewed August 19, 2017", 5.0, "Old style amusement park!", "I actually loved this place for the atmosphere. Went on the Big Dipper rollercoaster, fantastic!!! Overall a good family experience, suits all ages!"], ["Reviewed August 19, 2017", 4.0, "\"Went for Gin Blossoms Concert & More\"", "I don't often go to the Santa Cruz Beach Boardwalk but did go yesterday and had a great time! I found a friend who was brave enough to do the harrowing drive over winding Hgwy 17 (esp. scary at night!). My main motivation was to see the free summer concert of the great group-The Gin Blossoms. I'd missed them previously 2 years in a row when friends cancelled at the last minute and had waited for over 4 years to get this chance again. It's very generous of the Boardwalk to sponsor these free events and such a fun place and pretty setting too. ( Thank You!). I was horrified when lead singer Robin Wilson announced he'd woken up that morning and lost his voice! I'd waited years for this moment and now this?! But he \"soldiered on\" and wasn't so bad. I was disappointed that my favorite song-\"29\" wasn't sung and only really knew & enjoyed 5 of the 10 songs in their 50 minute set-they have so many great ones, but not time to do all. But I was so grateful I got to go and appreciative of the free concert & efforts of Mr. Wilson & the band. It is so cool to be at the beach & see the ocean and have all sorts of (mostly expensive, but expected) food and snacks to choose from. There are gift & souvenir shops and of course the rides (I didn't go on them this time) and the nice beach, so really something for everyone. It definitely is a good place for families as well as others, and despite the crowds, lines weren't so long. The bathrooms are well maintained-thank you!- and we chose to park in the big lot right across the street-$15 flat rate-not so bad for our 4 hours , I guess, though online it said the fee was $6-12.. You do need to know your way around or have GPS since there are many one way streets and some detours so our written directions from home didn't help us going & leaving there. I didn't realize it'd be so breezy & chilly since it was so hot where I came from, so bring a light jacket for the evening. All in all, a GREAT TIME and I plan to go back (if I can find another brave soul to drive!).\nShow less"], ["Reviewed August 19, 2017", 5.0, "Something for all ages!", "Lots of fun rides for all ages! I love that not everyone has to pay admission, rather pay per ride or an unlimited bracelet. It's great for young kids too, lots of kiddie rides and it totally wears them out ;)"], ["Reviewed August 19, 2017", 3.0, "Great Atmosphere but Expensive", "Visited with family of 5 (incl 2 teenagers and 1 aged 9). Great atmosphere, Pablo Cruise were on stage. Good selection of rides however very expensive, wrist bands were available however we only wanted to ride Big Dipper @ $7 per person."], ["Reviewed August 18, 2017", 5.0, "So much fun!", "What a west coast treat! So much to do! Rides, games, miniature golf, great food and boy what a roller coaster! It was very clean and well maintain and the cool pacific breeze blowing on you as you spin around on the ferrous wheel us an experience in itself! Easy parking to the park! We had a blast! Tip: 2 tickets for $70 with $30 in park credit was an incredible bargain! Trust me you will want to play the games in the humongous arcade rooms or a match of mini golf!\nShow less"], ["Reviewed August 18, 2017", 5.0, "Family Trip", "I've grown up going to the Boardwalk and still go with my kids. It's something the entire family enjoys. I love the retro night with $1.50 rides after 5pm. The kids could ride everything they wanted and loved the rides all lit up."], ["Reviewed August 17, 2017", 5.0, "Cool place", "What a great place, only $15 per person for unlimited rides at the amusement park. Quirky little shops, lots of food options and superb for people watching, especially the volley ball players."], ["Reviewed August 17, 2017", 4.0, "Not our cup of tea", "This board way is very attractive with all sorts of attractions for the young at heart - games, rides, etc., but we just enjoyed a walk and see. There is so much more to see in Santa Cruz, so we moved on."], ["Reviewed August 17, 2017", 2.0, "Very touristy", "We were visiting from the east coast and very used to the beach boardwalks. This was not really different. It was pretty clean however. Typical boardwalk snacks and concessions and games with cheap prizes."], ["Reviewed August 16, 2017", 5.0, "Epic Destinations", "It was a sunny Saturday not much traffic getting to the beach area. Parking was easy enough. So much to do. The boardwalk is bustling with people, games and rides. Be sure to bring your appetite they've got everything. Cotton candy, corndogs, ice cream, garlic fries and so much more.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Kids paradise", "Had excellent time in arcades here - lots of choice for kids and adults alike. We loved the Big Dipper rollercoaster, rides very busy in July but all surprisingly well organised"], ["Reviewed August 15, 2017", 3.0, "Just ok", "While it is amazing views along the boardwalk it is a bit of a novelty, very overrated amusement rides and chock full of tourists. Santa Cruz is actually a very nice town, make the time to spend some time downtown in the main street which is full of nice shops and eateries.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Family fun and beautiful beach view.", "We went for my daughter's birthday fun day on rides and entertainment. On wed and Thurs bring a Pepsi can and get in for 15 plus tax after five."], ["Reviewed August 13, 2017", 3.0, "Worth One Look", "We detoured as we had heard such a lot about the Santa Cruz Beach Broadwalk but it did not live up to the hype. It is just a fun fair at the end of the day - which happens to be next to the beach. The rides are expensive and the staff are not overly friendly.\n\nGlad we went but will not be rushing back. Probably not our thing.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Nice place to spend a day with kids", "You can choose to build sand castle, wade in the water, or enjoy the rides at the amusement park (or all of the above).\n\nTips:\n1. it can get cold as the wind is chilly. Bring a sweater, just in case.\n2. If you drive there, stay away from the vicinity of the pier and the boardwalk on weekends; too much traffic and you will get stuck easily. There are plenty of free street parking on side/residential streets about a half mile (10 min walk away).\nShow less"], ["Reviewed August 11, 2017", 4.0, "Good walk", "Nice little walk down the boardwalk, very touristy with lots of little stores to look in. Great views."], ["Reviewed August 11, 2017", 3.0, "crazy to do go here", "always wanted to visit santa cruise. just to walk around and watch people enjoy themselves. it free to enter. rides are expensive. food is expensive. those small little gifts that states you visit santa cruise boardwalk are expensive. bring a heavy wallet. parking nearby cost $15. don't go on the weekend during the summer months. very crowded and getting out of their is a traffic nightmare. its not your average Disneyland or knots. the kiddies well enjoy it but you will tire out real fast. just crazy to visit this place on the weekend\nShow less"], ["Reviewed August 10, 2017", 1.0, "Don't take any valuables", "Ok for the kids to have a bit of fun. Food gross and some v.dodgy characters on the prowl. Beach ok, beware of glass and other sharp things. Lots of litter."], ["Reviewed August 10, 2017", 3.0, "just okay, but the beach and pier were awesome", "thought my boys would really love this place but it just ended up being too crowded, a pain to park, run of the mill carnival food, and too many lines, but the beach was fun, they joined a volley ball game, and we had fun on the pier watching the sea lions and found a nice place to eat that was not crowded\nShow less"], ["Reviewed August 10, 2017", 5.0, "Great place!", "The Boardwalk is a lot of fun!! And a lot of carnival type food and tons of games. Just like the pier area at California Adventures! If you want relaxing also? The beach is just that! You should also check the schedule for upcoming events. Totally recommend\nShow less"], ["Reviewed August 9, 2017", 4.0, "Beach + Carnival in one", "Only in Santa Cruz for a few days. Decided to hit the beach and the boardwalk after dinner. Could not find on-street parking so used one of the lots for $15. Beach was amazing. Very clean. The kids could have stood there and been pummeled by waves all night. Boardwalk was really fun but the rides are definitely expensive. We said they could pick one and the only one they were both big enough to ride on alone was the pirate ship. The pirate ship requires 5 tickets per rider with each ticket costing $1. If you plan on being there a while and you have pre-teens/teens who love rides then definitely look into the different wristband packages. You'll save yourself a lot of money.\n\nWe had already eaten dinner so we only shared a caramel apple. Did not look too closely at food costs but would not be surprised if it was expensive. Honestly though, even going to the local fair in NH, a fried dough is like $6. It's insane.\n\nHave been to other boardwalk amusement areas in other states I have lived in and I have to say the Santa Cruz Boardwalk is really nice. It's super clean and the people are friendly and they have somehow managed to remove all the scuzziness you may find elsewhere without losing the character and fun. There were a lot of families with kids of all ages having fun and it was just a really nice atmosphere. (They were also showing free family movies on the beach that evening.)\nShow less"], ["Reviewed August 9, 2017", 5.0, "Great stop during the pacific coast trip", "Boardwalk was fun and not too crowded. Parking was easy and very close to the entrance. It's an enjoyable afternoon for the family, especially with younger kids."], ["Reviewed August 8, 2017", 5.0, "Really fun and interesting", "Our family had a blast. Rode a few rides and walked out on the beach. Reminds me of our state fair. So many different kinds of food. Go at 11am and avoid the crowds."], ["Reviewed August 8, 2017", 4.0, "Lots of fun rides for many ages", "We went to go on the rides with teenagers and a 10 year old. Everyone enjoyed a different rides. There were several rides we all enjoyed. Two teens enjoyed the new ride in the photo. It was a hot day and very crowded, but lines were not longer than 15-20 minutes. We stayed about an hour. We had to park a long way away and take the bus to get to the boardwalk since the lots were full and no on street parking nearby. Cleanliness was typical of most fairgrounds: not great.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Tweets were in heaven!", "Stopped here for the day with my tween sons. They had a blast. We got there early on a weekday so enjoyed short lines. Everything was very clean. The rides seemed in great shape, and there were many great options for food. Tweets hope to return. Everyone should ride a wooden roller coaster. Real Americana!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Family day out", "This park offers so many things to do both for children and adults, or you can simple spend a lovely day by the beach if you don't fancy all the rides. The food selection is brilliant and they cater to lots of different types of dietary requirements. A fun filled day all round\nShow less"], ["Reviewed August 7, 2017", 3.0, "Over Priced Food", "I grew up in New Jersey not far from the world famous ocean cities, Seaside Height & Atlantic City, so this is not the same boardwalk I'm used to (I should say it's not fair to compare Santa Cruz to those boardwalks).\nAnyway, after we checked into our motel (not far from the boardwalk), my sons and I decided to walk there... took us may be 10mins.. (oh btw, check out my review on the motel we stayed in at ---\"Oceangate Inn\").\nThe weather was overcast and temp was in the low 60's (in July?). The rides and food were very expensive!!! We paid whopping $9 for one little funnel cake, no topping... what!? I understand they have to make money but $9 ? Highway robbery... oil they used to cook the funnel cake was so dark, it was disgusting, I don't think they change oil everyday.\nI don't want to say anything negative about the place and scare people away (please don't get me wrong if you don't mind paying overpriced food and rides you are going to enjoy the boardwalk). But expect to bring a lot of money.\nShow less"], ["Reviewed August 7, 2017", 2.0, "Good for a family with kids under 13", "My kids are 18 and 21. This is a place for people with young children. Not a lot to do for adults. Rides and arcades. People on beach had a mix of vagrants."], ["Reviewed August 6, 2017", 4.0, "Fun Whole-Day Activity", "A trip to the boardwalk is a fun activity if you'll be there all day. They offer all day passes as well as tickets individually for the rides. The Day Pass is a good value, but I would not recommend buying tickets individually, since they can cost a lot with a large group.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Family Fun", "I love the Santa Cruz Beach Boardwalk. It has something for children of all ages. As a “grey bear” I enjoy the nostalgia of the 100+ year old carousel and the wood-structure Giant Dipper roller coaster. The Boardwalk periodically adds something new (thrill rides) while maintaining the old. It’s a great location at the Main Beach and a fun getaway for the entire family.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Old fashioned carnival with the gorgeous Pacific Ocean as a backdrop", "We visited the Boardwalk on a beautiful sunny afternoon in August. It was crowded, but not overwhelming. Parking is at a premium. There's no entrance fee, but you pay to ride the attractions. You can either buy tickets for an individual ride or get a day-long pass. My kids really wanted to try the 90-year-old wooden coaster, the Great Dipper, so we just did that. The amusement area is clean and safe, not seedy. Lots to see! Just beyond the rides lies the beach and the ocean, so the setting is unbeatable.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Really good though crowded- much bigger than expected", "I had always had an impression that this was gang infested and gross. But, we went over the weekend of the Bay to Breakers and were pleasantly surprised- clean, lots of variety of rides and eateries. Was really nice. We got a card as opposed to the all you can ride wristband. Each ride costs from $4 to $7- kind of steep but study the list of rides to see if the wristband is worth it for you. The Giant Dipper is a classic and they have a lot of other great rides. Be sure to check out the entire park- it goes way down to the south and there are multiple levels. Tons of good food (well not good for you)- including Dole Whips (a la Disneyland), and the potato that they stretch out and fry (forget what it's called). A really nice place to go for the day. Tip: with a family with kids go early to avoid the crowds and not hit the evening crowds which are a bit rougher.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Birthday fun on the boardwalk", "Although the parking was a bit challenging with the number of others visiting this attraction, we were able to walk in and enjoy reasonable wait times for rides. There were a variety of snacks/meals available. The beach was in decent condition too. A fun day for a variety of ages. The pier is not far but driving to it may be best. Lots of restaurant selections offered.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Fun carnival atmosphere", "No charge to get in, so you pay only if you ride or play games. It was a fun carnival atmosphere that was clean. Beach is right there, which is great. It gets crowded!"], ["Reviewed August 3, 2017", 4.0, "Rides and fun at the beach", "Great entertainment for kids and adults alike. The boardwalk offers something for everyone. Roller coasters and rides for all ages right on a great beach. It is very busy so get there earl to beat the crowds and traffic. Lots of activities are available on the beach from volleyball, buggy boarding, kayaking, paddle boarding or just reading a book. Not a place to go if you are looking to escape the crowds.\nShow less"], ["Reviewed August 2, 2017", 4.0, "A nice afternoon", "We spent a half day in Santa Cruz on our road trip Nice walk around on the boardwalk and test some games, have an ice cream, looking at all the people having nice family day A little bit expensive if you want to take a ride only on a few amusements and not buy a day pass\nShow less"], ["Reviewed August 2, 2017", 5.0, "Very Impressed with Santa Cruz Boardwalk", "I was very impressed with how nice the boardwalk / amusement ride area of Santa Cruz is. We went there to let our children ride the rides for several hours on a Friday afternoon in June. It was not too crowded, although clearly popular, so the ride lines were not too long. All of the rides appeared to be well maintained, and the ride operators were friendly and professional. There were a lot of families, all with the same intention, to have a good time and be courteous to everyone else. My baseline for comparison are the East Coast beach boardwalks which at times can be offensive, cheap, dirty, and dangerous (not usually, but sometimes) - and maybe this one can be also, but it did not feel that way during our visit. I did not think the prices were out of line either. Our children had a fun time, and so did we. Great family place.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Boardwalk at Santa Cruz good for young children", "If you want a decent place to go that's not too busy....boardwalk at Santa Cruz is decent. Rides are not comparable to a major theme park, however decent for young children. A little pricy....best value if you're spending the whole day is $37 all day pass. If you only plan to spend a few hours buy the $50 card....especially if you have 2 kids....this will get them on a about 5 rides each. Food is all junk food....no healthy options.\nShow less"], ["Reviewed July 31, 2017", 4.0, "See the Seals", "Lovely to walk along The Boardwalk and see the seals so used to humans that they totally ignore them. They carry on squabbling and living with no regard whatsoever to their human spectators."], ["Reviewed July 31, 2017", 3.0, "Nice but expensive !", "Like any boardwalk type of activity everything here is overpriced ! You can better priced restaurants a block or two into the city."], ["Reviewed July 30, 2017", 3.0, "Must see for tourists.", "Look, it's the boardwalk. So you gotta go. But it's in a ratty part of town, the beach is dirty, there is a bit of gang activity. That being said, we still go for the free summer concerts and our kids get the summer passes."], ["Reviewed July 30, 2017", 4.0, "Fun on the Beach and Board Walk", "Fun time with the family enjoyed the beach and many of the rides. I felt it was very affordable for families."], ["Reviewed July 29, 2017", 5.0, "Classic fun", "You will love it. I grew up going to it and coming back holds that same \"pacific/California beach\" feel. I compare this to the east coast boardwalks and Santa Cruz is better and I didn't see one \"riff raff\" like you do other places. Very family friendly.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Family fun!", "We always have a great time at the Boardwalk when visiting SAnta Cruz. If you are in town at least twice go for the season pass - it gets one free day pass long with it - so we split up season passes and free passes among our family and come out ahead of the Costco deal. We enjoy showing up right at opening before the crowds. Much better than the bigger amusement parks as you can do it all in a day and have views of the ocean while on the rides!\nShow less"], ["Reviewed July 27, 2017", 5.0, "fun boardwalk, amusement park", "it was too chilly to go the the beach the day we were hear. We bought the teens ride all day passes and they had a blast. The rides are more old-fashioned but they loved it. We had fun playing games and hanging out."], ["Reviewed July 27, 2017", 5.0, "loved it", "thought the Boardwalk was great fun, only a few minutes from my hotel and ideal for people of any age"], ["Reviewed July 26, 2017", 4.0, "Huge boardwalk with fun for kids of all ages", "The boardwalk is adrenaline fueled fun, but is expensive with long lines in some cases and unhealthy food. Would be nice to have some better food choices and sit down restaurant."], ["Reviewed July 26, 2017", 5.0, "Nice place to spend an afternoon", "Had a great time here with the kids. Enjoyed the beachfront, rides and variety of Boardwalk food. It was fairly crowded once the evening set in and we were surprised how chilly it was for July. Overall a good time!"], ["Reviewed July 26, 2017", 5.0, "FUN!", "If you like thrilling rides, this is a great choice with options for all age groups! Lots of shops and great beach watching as well."], ["Reviewed July 23, 2017", 3.0, "Typical Boardwalk", "There are many rides, arcade games, and fast food. Lots of beach shops. The beach behind boardwalk is flat with white sand and water is pretty calm. Boardwalk itself is not that long and crowded. Parking can be difficult, Public lot across street from parking lot is $15, which seems high to me\nShow less"], ["Reviewed July 23, 2017", 5.0, "Superb evening", "Fantastic evening on the boardwalk with my American family and friends. Awesome experience. Loved the old wooden rollercoaster coaster..."], ["Reviewed July 23, 2017", 5.0, "Lots of fun", "We weren't sure what to expect due to the mixed reviews but we had a ball. The unlimited wrist band was good value, we were able to ride the attractions as much as we liked. The restrooms were clean as was the boardwalk. The bands playing on the Friday night created a good atmosphere. We went around 4pm and stayed until 10.30 with our 6 year old. Definitely recommend it.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Bring a lot of money", "I guess there is a way to do the Santa Cruz Boardwalk on the inexpensive side but I didn’t find one. It costs $15 to park for starters. Then if you want to ride any rides, an all-day pass will set you back $36.95 + tax or a wristband that allows you rides and attraction combo for $48.95 + tax. You can get a card where you buy points but each ride costs between $5-7 dollars. Then food is very expensive too. We had a turkey leg for $13 and a corn dog for $8. Yes, it is all fun, and the food wasn’t bad and the Boardwalk is world famous, but it will cost you so be prepared if you have a large family.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Awesome", "An awesome place in Santa cruz, the beach boardwalk is simply great, it is quite big, so lively and busy when we went there. the rides are simply awesome and most are suitable for the whole family. Don't miss this place..."], ["Reviewed July 22, 2017", 5.0, "Up on the Boardwalk", "Was so happy to be back in Santa Cruz the boardwalk was as fun as ever with some new ride upgrades especially to the haunted castle ride which is my sons favorite."], ["Reviewed July 21, 2017", 5.0, "Childhood Memories Abound", "I loved it. My daughter LOVED it. Everyone around seemed to love it. Fun, fun, fun was had by all. GO!"]]}}