{"Santa Barbara County Courthouse": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Barbara County Courthouse", "url": "/Attraction_Review-g33045-d104224-Reviews-Santa_Barbara_County_Courthouse-Santa_Barbara_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/3a/20/94/santa-barbara-courthouse.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2541"}, "address": {"@type": "PostalAddress", "streetAddress": "1100 Anacapa St", "addressLocality": "Santa Barbara", "addressRegion": "California", "postalCode": "93101-2099", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "A MUST FOR TRAVELERS TO VISIT", "If you love the architecture and ocean breezes of SB, you must visit the Courthouse. You will ascend stairs that will take you to the top of the building where you will have 360 degree views of this enchanting town, see all of the beautiful red roof tops and of course, the ocean. Bring your camera because it's breathtaking. After you've enjoyed the view from the top, go inside the courthouse and see the beautiful murals and amazing architecture. It's a special treat and all for free.\nShow less"], ["Reviewed 4 days ago", 5.0, "Fantastic opportunity to see the inside of the courthouse and learn about its history.", "We took one of the free tours run by the court house and were very impressed by the knowledge and enthusiasm of the guide. The inside of the court house is beautiful-such a pleasant surprise and learning about its history increased our appreciation. Definitely a recommendation when in Santa Barbara\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful wedding location", "We got married in the Mural Room, which was just gorgeous. The whole courthouse and the surrounding grounds are truly lovely."], ["Reviewed 1 week ago", 5.0, "Beautiful arcitecture", "We visited on a Sunday in February. Not very crowded. Wow. If I worked for the court system, this is where I would want to work. The works of art, flooring and tile work and decorations were amazing. The bell tower gave a spectacular view of all around Santa Barbara. And it was free!!\nShow less"], ["Reviewed 1 week ago", 4.0, "Great View of the City", "The courthouse is worth a visit. The grounds are beautiful and the architecture is interesting with beautiful artwork and color. The tower has 360 degree views of the city."], ["Reviewed 2 weeks ago", 5.0, "Surprised!", "We were walking around old town, and actually were looking for “PSYCH” locations. While we never found the police station we discovered the courthouse. This was a beautiful building. And the grounds were great. We were here around sunset so the lighting was perfect. If you are in SB. Don’t miss this place.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great views!", "Great 360 degree views of Santa Barbara. Lots of local history and character. TILE IS BEAUTIFUL!!!! And you may even catch a wedding on your visit which occur with regular frequency in the sunken garden behind the courthouse."], ["Reviewed 2 weeks ago", 5.0, "Go For The Decor", "Outside it's fairly traditional mission-style architecture but inside it's something else. The courtroom is pretty spectacular and the bell tower offers fine views over the city and environment."], ["Reviewed 3 weeks ago", 5.0, "Beautiful architecture and tilework.", "Great views from the top, but when the tour groups come in, it is far too crowded and you will get smacked with a selfish stick. The building itself is worth exploring. It's a working court house. Look for all the different types of tile work.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Good view from top", "The interior of the building, built in the late 1920's, is beautiful. There is an elevator to the tower."], ["Reviewed 3 weeks ago", 5.0, "Great place to visit", "Spent a while here enjoying the architecture. Beautiful city, enjoy the diversity. Love Santa Barbara!"], ["Reviewed 3 weeks ago", 5.0, "Marriage Licenses & More", "Grew up in SB - spent many a day hanging out in the gardens - climbing the clock tower for a stunning view of SB. Got my marriage license here in 2004. Have attended events in my life here from Fiesta dancers, concerts and movies in the summer. It really brings SB together and worth a visit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great History.", "You need to spend at least a few hours taking in all the History, and especially the Clockl Room, and Roof top view."], ["Reviewed 3 weeks ago", 5.0, "One of the most beautiful courthouses in the State.", "Looks like an old California mission. A far cry from the traditional.\"box\" buildings in Los Angeles or Ventura County. Take a few minutes and climb the stairs of the clock tower. Nice views."], ["Reviewed 3 weeks ago", 5.0, "Best View", "If you would like to see the whole city in one shot, the courthouse offers the best 360 view of the area, especially if it's sunny with clear sky. It's a nice free activity that the family can enjoy together.\nThe building itself is beautiful with huge murals inside the main courtroom. A must see in Santa Barbara.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Definitely worth visiting", "Amazing 360 degree view from the top of the tower. Beautiful view in every direction. The inside is also very nice with intricate and interesting tiles and design"], ["Reviewed 3 weeks ago", 5.0, "Fantastic View", "It was a little hard to find, but stroll around the Courthouse and grounds, and learn some of the history. The view from the top is unbeatable. And the price is right."], ["Reviewed 3 weeks ago", 5.0, "Great View!", "You can’t beat the gorgeous 360 degree views from the clocktower. Definitely bring your camera! The Spanish/Mediterranean style courthouse is beautiful as well. Take a walk through it to appreciate the architectural details. This is a must-see landmark."], ["Reviewed 4 weeks ago", 5.0, "A Historic Structure", "Touring the Santa Barbara Courthouse is well worth any visit to Santa Barbara. It features Spanish-style architecture and the interior is as impressive as the exterior. As a young boy, I used to walk into courtrooms to watch cases being tried. I've included photos in this review from a visit years ago, but the subject of the images remain the same. Apologies for the quality of the photos. I was just learning how to use a consumer-grade DSLR. Next time I visit, I'll bring my new pro equipment.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "An old time Beauty", "A must see if you are in Santa Barbara. The attention to detail is amazing in the construction of this historic landmark. Take the elevator to the view towers for a 180 degree view of the whole city. The inside holds Spanish charm like no other.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Very interesting history and view", "This building is not that old as it was built after the big earthquake in the early 1900’s but it seems old. We took the elevator up the see the view but then we walked down and landed up inside the security area without ever going through security. It was a fun excursion.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Moorish Masterpiece", "The true center of Santa Barbara. A working courthouse that has served as the background visuals for countless TV lawyer shows over the years. Bring a lunch to the large central lawn. Finally, a must is to visit the tower which gives you a 360 degree view of the red tile roofs of Spanish-themed Santa Barbara (city), the Riviera (residential hill overlooking the city) and the blue of the Santa Barbara Channel and the Channel Islands National Park (Islands of Anacapa, Santa Cruz, San Miguel and Santa Rosa).\nShow less"], ["Reviewed January 16, 2018", 4.0, "Great Use of a Mission Setting", "From the stree the Sana Barbara County Courthouse looks like a mission found in numerous California locations. Yet, most cities would deem this a historical edifice, Santa Barbara uses the building for civic services, as a courthouse, and other governmental services. The grounds are spotless. The interior hallways almost sparkle with cleanliness. The elevator moves slowly but it works. This is great for going up to the top floor to get a view of the surround area. From the roof one can view 360 degrees. There are placards with landmarks clearly noted for optical identification of what can be seen. Entry is free, as it is a public facility. Parking is nearby. One can spend 1-2 hours strolling to get the feel of the history of Santa Barbara.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Came here for the View from Tower", "Nice 360 views of the different sites around town. It was free and totally worth the time. We had lunch around the area, with many restaurants around the area."], ["Reviewed January 13, 2018", 5.0, "History galore", "The Courthouse is a must see place. There are tours available however there are only held at certain times. My advice is to do a walk about yourself and ask the docent what times the tours are. You may also want to know that the original jail is right next-door however can not go in there as it is still used by the sheriff as their headquarters but the outside is still worth a look.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Gorgeous Wedding Venue!", "My best friend and I recently traveled to Santa Barbara so I could see where she is getting married this year! I am happy to report that the Santa Barbara County Courthouse is an absolutely stunning venue! I can't wait for her wedding later this year when I get to return to this beautiful place.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Marriage licenses here!", "Got a marriage license here in 2004 😘 , plus it is a beautiful old building worth a visit, especially when there is an event such as Fiesta going on and dancers are performing"], ["Reviewed January 6, 2018", 5.0, "Architecture and Decoration Highlight", "Beautiful centerpiece of Santa Barbara. Go through the interior to see the amazing tiles, paintings, ironwork, and chandeliers. The tower has beautiful views in all directions. We were disappointed that the clock room was closed."], ["Reviewed January 4, 2018", 5.0, "Beautiful old building, great guided visit", "Beautiful building with the Spanish influenced architecture and lovely gardens. I took a guided tour that was really fun - the guide was interesting and helped with the history of the area as well as the building itself. Well worth the hour!"], ["Reviewed January 4, 2018", 5.0, "Wonderful Spanish Architecture!", "Beautiful grounds, and scenic view of Santa Barbara from the 4th floor observatory. Free self guided tour."], ["Reviewed January 3, 2018", 4.0, "Make sure to do the tours", "Tours twice a day, every day. Accessible to wheelchairs. The mural room is great. So is the view from the tower."], ["Reviewed January 3, 2018", 5.0, "A Beautiful view and more", "Take the elevator to the top, last bit are stairs. Worth the climb. Hope you have your camera. Be sure to explore the entire building inside, especially the large courtroom with the murals."], ["Reviewed January 3, 2018", 5.0, "Wonderful Historic Building", "This courthouse is an extraordinary building, with beautiful murals, tile details , gardens and a clock tower with views all over Santa Barbara. There are tours available and they are worth taking, but you can also walk around on your own."], ["Reviewed January 3, 2018", 5.0, "Best views od Santa Barbara", "The gardens are beautiful. The inside of courthouse has great details. Nothing beats the view from the 4th floor."], ["Reviewed January 2, 2018", 5.0, "beautiful courthouse with fantastic views", "After lunch on States Street, we walked to the county courthouse and enjoyed fantastic views from the tower. On our way down the stairs, we ran into a free tour and joined that. The volunteer docent pointed out the various Spanish-Moorish architecture style, which was very interesting. Features such as windows that don't really line up with anything, columns and windows that are not symmetric. The docent also demonstrated the defensive stairwell among many things. Beautiful grounds as well, and site to many weddings (three the day we stopped by!).\nShow less"], ["Reviewed December 31, 2017", 5.0, "Must stop and see", "The building is so beautiful and the grounds are incredibly well kept and clean. We had a nice time walking around both inside and out. The views from the top are amazing and it makes for great pictures."], ["Reviewed December 31, 2017", 5.0, "The tower beckoned", "How could we see more of Santa Barbara when we needed to head north before sunset? The County Courthouse beckoned. We skipped the elevator, admired the building’s interior, and climbed the stairs (while our Apps counted them). Our reward? The views from the top!"], ["Reviewed December 31, 2017", 5.0, "Beautiful old courthouse-- get in on a free tour!", "A visit to this free attraction is definitely worth your time. We happened to stumble upon a free tour (They run often) and learned a great deal about the history of the courthouse and the area in general. A climb to the top of the tower is rewarded with beautiful views of the city, mountains, and ocean. Teenaged children loved it.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Absolutely beautiful", "Absolutely beautiful! A must see! The views are breathtaking and the architecture is exquisite and there is no cost involved."], ["Reviewed December 22, 2017", 5.0, "First class views", "This place is stunning every floor your enter.and the views from the top are worth seeing. Don’t miss this place"], ["Reviewed December 22, 2017", 5.0, "Among the Most Beautiful Courthouses in the World", "The Santa Barbara Courthouse is not to be missed. The structure, the tile work, the murals, the courtrooms are all worth seeing, but the view from the top of the clock tower of all of Santa Barbara and the coast is the pièce de résistance. This is a working courthouse, so it is also a joy to get to work there for us lawyers. Highly recommended.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Take a docent tour, or try to arrange an architect tour", "For 25 years I had the privilege of working in this lovely old building, In fact, my office was the single balcony on the extreme left of the photograph. It is not just an historic building but a working courthouse. It was built in 1926 after an earthquake destroyed the predecessor courthouse. In fact, the sunken gardens around which the present courthouse is built is roughly the foot print of the one destroyed. When you go, sit in on a trial, and go to the mural room for a pictorial history of Santa Barbara on three walls. At the top of the wing on Santa Barbara Street is the old jail which was in use into the 1990s for holding prisoners for court appearances. The county law library on the second floor has some nice mural/maps. The tiles around the building are an eclectic collection. Take the docent tour, and if you are with a group, call ahead and see if you can get a detailed tour from a representative of the county architect's office. Finally, go to the top of the clock tower for a wonderful view of the city and its red tiled roofs.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Unbelievable! Don't miss this place!", "The grounds, building, and decor is just amazing. The view from the tower is a gorgeous 360 picture of Santa Barbara. They do tours but unfortunately due to fire or Christmas they were not doing them. Next one is December 26."], ["Reviewed December 21, 2017", 5.0, "Best view in town!", "If you’re looking for panoramic view of Santa Barbara from a unique perspective, don’t miss this opportunity. The courthouse had interesting history, the clock tower being unique from the internal workings of the clock. The walk up is easy and the view is great!"], ["Reviewed December 20, 2017", 5.0, "Brilliant Art-deco building with stunning views", "Advised to visit the Courthouse by the guide on the LandShark. This is a super example of American Art-deco at its best - one thing that the Americans do - that the Brits do not - is put money into their public built environment.\nThis is a fully functioning courthouse built in the 1930's and combines form and function in only the way that world-class architecture can. The real bonus is : from the top of the tower, accessible by lift/elevator, you have, probably, the best view of the city and its surroundings available. we went on a gin-clear day and were looking out about 25+ miles.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Breathtaking views, great architecture", "Amazing building, loved the architecture and could have spent much longer on the tower overlooking the city."], ["Reviewed December 14, 2017", 5.0, "AMAZING", "You might wonder why stop at a courthouse. This is no ordinary courthouse. It's beautiful inside and out. Best views in town."], ["Reviewed December 14, 2017", 5.0, "County Courthouse", "We took the trolley up State Street to the court house. Beautiful building and gardens. There is an elevator to the clock tower. Stunning 360 views of Santa Barbara, the mountains, the water. Be sure to stop on the 2nd floor to see the mural history of Santa Barbara.\nShow less"], ["Reviewed December 8, 2017", 5.0, "You have seen the pics online- stop by in person", "Worth the stop. Friendly folks at the desk and great architecture. The mural room is beautiful. Stop and see it in person"], ["Reviewed December 5, 2017", 3.0, "outstanding views from the tower, good historic mural", "walk up to the top to see the views from the tower. If the courtroom with murals is open stop in to see the walls covered with murals depicting the history of the area."], ["Reviewed November 30, 2017", 5.0, "Stunningly Beautiful Courthouse", "We only had a few hours to spend in Santa Barbara when we cruised from Vancouver to Los Angeles and the courthouse was at the top of my list to see.\nWe just took the city transit and didn’t take a tour. We walked from the bus stop on State Street, but we didn’t go to the top of the bell tower because my husband didn’t want to climb the stairs.\nSo when we passed by the courthouse again on our return trip from Old Mission we went back and learned that the elevator actually goes to the top and we went up. The 360 view was beautiful - what a wonderful way to see this beautiful city!\nWe walked down the stairs and were able to see the works of the clock in a large room.\nDon’t miss the mural room on the second floor because it is absolutely beautiful and shows the history of the settlement of Santa Barbara.\nThe grounds are beautifully landscaped and the architecture of this building is stunning!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Great View from the Clock Tower", "A interesting building with a pretty garden. However the highlight was climbing the clocktower to see how the clock works and then admiring the view over the city."], ["Reviewed November 28, 2017", 4.0, "Grand Building...", "Huge early Spanish colonial style multistory building that dominates the city skyscape in a pleasant way. Large green spaces surrounding it. This is what California public buildings should look like!"], ["Reviewed November 27, 2017", 5.0, "History of Santa Barbara depicted in Mural", "Inside the actual court room is a wonderful mural showing the arrival of the Spanish to this area. The view from the clock tower gives one a clear view of the entire town. In the grassy area behind the court house there are movies shown at night. (possibly only in the summer.)\nShow less"], ["Reviewed November 25, 2017", 5.0, "Not Your Typical Courthouse", "We climbed to the top of the clock tower--worth the climb as the room housing the clock mechanism has glass walls. The views were worth it (you can see the Mission) and there are elevators. I loved all the tile work, the decorative iron doors and the huge pendant lights. Events can be held here, including weddings. We did not take a tour, just used the brochure.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Best view in town from the top!!", "I live here and ALWAYS take my visitors here and also suggest it to folks on the street. Beautiful building and a majestic view from the clock tower. Many fine details throughout the building"], ["Reviewed November 23, 2017", 5.0, "A beautiful building with amazing views.", "Santa Barbara is a beautifully designed city, and the courthouse is one of the more notable buildings. With its open, manicured lawns and Spanish style exterior, it feels very pleasant and peaceful to walk through. Old murals and paintings adorn the interior and help to establish the history of the courthouse which makes it feel more like a museum than a municipal building. By far the best thing about the courthouse is the clock tower, which offers unbelievable views of the Pacific Ocean, the Santa Ynez mountains and all of Santa Barbara. It's free to go up and is open until 4:45 pm so it's great for taking landscape photos during the sunset or taking the perfect selfie!\nShow less"], ["Reviewed November 23, 2017", 5.0, "Very classy. Not prison-like they way other county's courthouses are. A pleasure to take care of business here.", "Rather than spend your time waiting in line for the metal detector and be parted from your important papers, when you have business in the Santa Barbara County Courthouse, you are allowed to keep your humanity. Grand and pleasant courtrooms and efficient clerks make your courthouse experience much better.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Worth much more than the price of this tour!", "One of the highlights of our visit to Santa Barbara ---- this tour is a must-see in the area, particularly due to it's being FREE. Tours are available to the public M-F at 2pm, rain or shine."], ["Reviewed November 18, 2017", 5.0, "Highlight of our trip to Santa Barbara", "I was impressed by the architecture of the building as it seemed so old worlde. The tiles on the floor and walls were amazing and intricate. I did not have time to join the guided tour but wished I had. There was so much to admire from the garden to the wrought iron gates. It definitely is a \"must see\" and I wished I had spent more time there.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Happy to go to Court", "The Courthouse is gorgeous and the tower gives you terrific views of Santa Barbara. The history of the building is rich and well preserved. It is easy to find and we found street parking nearby."], ["Reviewed November 17, 2017", 5.0, "A piece of colonial history", "A trip to Santa Barbara would not be complete without a visit to the Santa Barbara County Courthouse. The views fro the bell tower is very rewarding and you get a three hundred and sixty degree look at the city. The gardens are very well kept with a number of unusual plants.\nShow less"], ["Reviewed November 15, 2017", 5.0, "A working courthouse with amazing history", "If you go to Santa Barbara you must visit the Courthouse. In some ways it beats the Old Mission up on the hill. Mainly, for me, because it is not only a monument, but a working part of the legal process. Court is still in session.\n\nThe wide, dark, hallways are redolent of traditional architecture. Shaded, golden, wooden and tiled, these buildings tell the story of colonisation and conquest. In one of the oldest courtrooms the walls and ceilings are covered with amazing murals of local history. Such wondrous statements as to which local 'tribe' was the most 'friendly' are found on the walls.\n\nContinue up to the top of the tower staircase to have a view out over the city and the bay, across the red tiled roof of the courthouse. This place is a must whether you are wearing prison clothing or not.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Walk around the courthouse", "An architectural masterpiece- a Spanish castle in the middle of Santa Barbara built in 1929. Don’t miss the viewing tower and amazing clockworks. #RedShoeLiving"], ["Reviewed November 13, 2017", 5.0, "An astonishingly beautiful place - and a courthouse too.", "When we checked in on Sunday the concierge advised us to see this place first - before it closed at 4 pm. We did and were astonished. An artifact of an era where civic pride allowed folks to indulge their need for beauty. It is an easy visit - short and simple. Not much else to say, but for an Easterner, it is certainly unique.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Great building", "This building is a great exile of the Santa Barbara style. There are white stucco walls, red brick roof, beautiful gardens surrounding the building and an impressive interior. There are two wonderful spots not to miss. One is the view from the tower; you can walk up the stairs or take an elevator. The other is the mural room that has the history of the area painted on all four walls in the room. People get married in that room, as well as the in the gardens outside the courthouse.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Beautiful place for a wedding.", "Attended a wedding in the mural room. Also enjoyed the bell tower and the scenic bell tower view. Lovely grounds and beautiful architectural details inside. Really a lovely place to visit in Santa Barbara and an excellent wedding location."], ["Reviewed November 11, 2017", 4.0, "Beautiful building, inside and out", "This is a lovely building. It's hard to believe it's a courthouse. Entrance is free and they do offer guided tours. Definitely check out the bell tower. The view from the outdoor viewing area at the top provides a nice view of Santa Barbara.\n\nDefinitely worth a visit. Would take about 30 minute or so.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Rich in history", "Step back in time. Lovely time capsule. Take time stroll and learn. If possible attend one if the masses."], ["Reviewed November 10, 2017", 5.0, "Stunning views and great architecture", "Worth a visit for the 360 degree views of Santa Barbara! As well as being a beautiful building with lovely grounds."], ["Reviewed November 9, 2017", 5.0, "A jewel in beautiful Santa Barbara!", "Whetehr your a local , or a tourist, you willl love the courthouse. Take a tour and hear about the wonderful history of this landmark. The tour of the old jail and the clock tower are not your typical tours, and are worth seeing! The mural room is beautiful!\nShow less"], ["Reviewed November 9, 2017", 4.0, "Gorgeous courthouse!!", "Loved this courthouse. The architrcture is incredible and you can't beat the 360 view from the top. No charge to get in and free tours are offered"], ["Reviewed November 9, 2017", 5.0, "Beautiful", "This is probably one of the most beautiful courthouses in the country. From the bell tower you can see all of Santa Barbara. There is a lovely display of the clock works and their are murals and paintings throughout."], ["Reviewed November 9, 2017", 5.0, "Jewel in the City", "I love this place, even as a local! Don’t forget to go up to the tower and check out the ‘mural room’"], ["Reviewed November 9, 2017", 5.0, "Clocktower is a MUST see!!", "This is one of Santa Barbara's pride! The clock tower is amazing.Climb up and get a fabulous view of Santa Barbara. If they are having any activities in the sunken gardens....GO! If I wasn't so sour on marriage, I'd get married there. Very special!"], ["Reviewed November 8, 2017", 5.0, "Much more interesting than we expected, a real highlight", "We got the docent led tour which was wonderful. The story of the courthouse and Santa Barbera and even California was told knowledgeably and entertainingly and what we had hoped would be a pleasant way to spend an hour turned into a highlight of our trip.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Great views from top of tower. Beautiful murals and courtyard garden.", "This is a great spot to get a photo of Santa Barbara. The architecture is beautiful and the murals in the main meeting room are really very beautiful. They were being painstakingly restored by hand the last time we visited. Gives you a real feel of the Spanish influence on the city.\nShow less"], ["Reviewed November 7, 2017", 4.0, "Great views", "When visiting this courthouse, you can get some great views of the city from the observation tower. The courthouse is old, but it is in great shape on the inside. The grounds of the courthouse are beautifully maintained."], ["Reviewed November 5, 2017", 5.0, "Went twice, will come back!", "A place where you can see the architecture as it used to be. Take a chance to visite the court rooms, it is just beautiful."], ["Reviewed November 2, 2017", 5.0, "Elegant government building", "Beautiful artwork amidst offices and courts. Several levels with tile work of Spain and Portugal. Top has a viewing lookout over the lovely city with Spanish architecture and mountains with homes on cliffs in one direction and the ocean and beach in another. Almost reminiscent of Nice, France, even though buildings are different. Upscale shops.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A site not to miss!", "Sign up for a complimentary tour (donation suggested) and learn so much about Santa Barbara history and this wonderful building. Each docent has his/her own specialties so every tour is unique and informative."], ["Reviewed October 28, 2017", 5.0, "A Santa Barbara Must!!", "The courthouse is an historical building with beautiful Spanish architecture. The tower has an amazing 360 view Santa Barbara."], ["Reviewed October 26, 2017", 5.0, "Great stop when visiting Sanat Barbara.", "We were a party of 9 people and this was our first time in Santa Barbara. We went up to the top observation viewing area of the tower. It was a 360 degree view of Santa Barbara. Don't miss this stop . The courthouse is also an attraction in and of itself. There is no fee to take the elevator to the top.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Don't miss this unique and historic building!", "Much more than expected, and free! Superb examples of spanish and western architecture and decor. Don't miss the Tower (4th floor), Mural Room (2nd floor), and Law Library (2nd floor). THere is an upstairs section of the Law Library that is supposed to be superb but it was closed during my visit. Free guided tours are offered in the morning ~1000, and the afternoon ~2pm (check with the Information/Souvenir Desk). Parking across the street is free for 75 minutes!!\nBest advice - \"look up\"! Many ceilings are decorated.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Very interesting place", "This is a really interesting place to visit. It is a working courthouse and so I imagine it would be possible to go into a courtroom whilst in session but I am not sure how this works in the US. We joined a free guided tour which was well worth doing. Very informative and gave us information we would have missed had we self guided. There was a wedding being conducted whilst we were there so this was a bonus.\nDefinitely worth visiting.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Great place to see", "Very helpful staff and gorgeous views from top. Take the elevator to top and walk down stairs to see every floor, the clock room is great and the murals are awesome"], ["Reviewed October 19, 2017", 5.0, "Not to be missed", "Beautiful historical building with clock tower and viewing tower. Can’t describe how spectacular this building is."], ["Reviewed October 18, 2017", 4.0, "Fascinating building with a lot of history attached", "We took a tour of this landmark and it was great. There is quite a bit of history attached to this building. we just loved the panoramic view of the entire city and the view of the mountains in the distance."], ["Reviewed October 18, 2017", 5.0, "Lovely architecture.", "Very nice but court was in session. Lovely old building but didn't see it all. Ceilings of the main building had beautiful paintings."], ["Reviewed October 18, 2017", 5.0, "Santa Barbara County Courthouse tour", "Live in Santa Barbara and decided to play tourist and see what all the visitors want to see in Santa Barbara. Had a nice tour of the courthouse, walked up the tower for fantastic views of all of Santa Barbara. Beautiful building, beautiful design lots to see.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Gorgeous view onto Santa Baraba from the tower", "The County Courthouse is an awesome place to visit, and get a sense of Santa Barbara's architecture and heritage. The inside was reminiscent of some old European buildings."], ["Reviewed October 16, 2017", 5.0, "Really Is A Courthouse", "This is real functioning courthouse which is hard to believe. Nice gardens, mural room and a view if you want to walk up. Worthwhile."], ["Reviewed October 15, 2017", 5.0, "Don't Miss This", "This must be the most beautiful courthouse in America. Take a walk through it and enjoy the gardens."], ["Reviewed October 14, 2017", 5.0, "What a View", "Climb the stairs and head up to the top of the bell tower; you'll not be disappointed. The views (and the dreams they'll inspire) are well beyond compare."], ["Reviewed October 14, 2017", 4.0, "Beautiful decor, great views, wonderful murals and free", "This one is a no brainer. It is free. We had to park a block or so away but no big deal. The architecture and decor of this courthouse is wonderful with a lot of Cali history portrayed, From the tiles to the murals to the Seth Thomas clockworks in the tower this was just a nice find. The views are gorgeous too. Plus since it is open to the public there is no downside to this, It is a lovely free attraction in a beautiful community.\n\nTake the elevator up then check out each floor as you come down.\nShow less"], ["Reviewed October 14, 2017", 5.0, "A must see in Santa Barbara", "We recently returned from a California tour and the Santa Barbara Courthouse was on our agenda. Luckily we were there on a weekday so this lovely, working courthouse was open. When we visited the mural room there was a local guide who described the paintings in great detail. (Not sure if this is a common occurrence.) Of course we took the stairs to the clock tower and we were rewarded with exceptional views of the mountains and the beautiful homes dotting this scenic area. Definitely can see why this area is called the \"American Riviera.\"\nShow less"], ["Reviewed October 14, 2017", 5.0, "Nice spot", "You can see most of the city from the tower, but it's not accessible for a stroller. Interesting historical place for anyone over 5 years old:)"], ["Reviewed October 14, 2017", 4.0, "Great views and murals", "We were told this was a must see by a local; he was right. We took the elevator to the clock tower and the views were fantastic. Then we took the stairs down and stopped in a few rooms to check out the murals. They were nice to look at. Much better than wasting time at the Stearns Wharf\nShow less"], ["Reviewed October 13, 2017", 5.0, "You Really Need To Add This To Your List", "If it wasn’t for our friends we’d never had known about this building nor visited it and it would have been a shame.\n\nWhat I really find hard to bend my mind around is that it’s a working court with tourists wondering around. The juxtaposition between suites lawyers, chained defendants and tourists is really strange but interesting. I also never thought that I would sit in a live US court and I did.\n\nThe above in some ways is secondary to the architecture itself which is wonderful with many features reminding me of a church never mind a court house (and yet it’s still fit for purpose).\nWeddings also take place here.\n\nEntrance is free and there is plenty of free, on street parking.\n\nVisit. You won’t regret it!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Best view in town ...from the clock tower!", "Don’t miss visiting this magnificent architectural wonder. Just driving by is a treat... but doesn’t give you a tenth of the delight you’ll get from roaming the grounds, the halls, walking the Moorish tiled staircases, and seeing the views of the town from atop the clock tower. Bring your camera!\nStart outside by the beautiful carved sandstone “fountain” ( they need to fill this with water again & turn it on.... to heck with the silly water conservation... shouldn’t apply to this). Walk through the high arched entry to the sunken garden ( site of many weddings & cultural performances). Check out the detailed carvings & ceiling paintings. Inside... whatever you do, don’t miss the courtroom. It has wall mural paintings beautifully documenting history of the area.... from the Chumash Indians, through early explorers, California statehood.... to present. Recently restored. All free!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Here for a wedding", "Very pretty building. We attended my Brother in Laws wedding and the setting is nice. Great place to walk around."], ["Reviewed October 11, 2017", 5.0, "Beautiful Craftsmanship", "Take a tour of the Courthouse to truly appreciate it. If you don't have time for a tour, at least take a quick walk around the grounds and up to the very top. It's absolutely beautiful!"], ["Reviewed October 11, 2017", 4.0, "An operational courthouse full of history", "Well worth the visit and the time. It has an internal elevator to take you to all levels of stairs are a problem. The lady in. The gift shop was very helpful. Allow at least an hour to wander through."], ["Reviewed October 10, 2017", 5.0, "Great view", "I didn't find a lot of things to do while in port. We took the suggestion of the welcoming committee when we came ashore.and took the bus up town. Bus fare is 50 cents and you need to have exact change. Dropped us off at the corner and we walked two blocks. Very interesting and worth the trip. Great views!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Great views", "From the tower of this courthouse are magnificent views of all of Santa Barbara. A choice of stairs or elevator are offered. It was free to walk up but I think you can pay for a tour."], ["Reviewed October 7, 2017", 5.0, "Top place to visit for views", "This was our top place to visit in Santa Barbara. The court house is on the tourist bus route from the harbour and cost just 50 cents each return bus fare . Entry was free and the court house has a beautiful ceiling . There was a lift and stairs to the viewing gallery which gave us a wonderful views of the city,sunken garden and sea in the distance . A must do attraction if you visit Santa Barbara.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Beautiful Building, great views!", "Beautiful building and great views! We really enjoyed our visit at the courthouse, we got to take great pictures. Totally recommend it!"], ["Reviewed October 5, 2017", 5.0, "well worth the climb", "Okay - my career was spent in courthouses and this one by far is the most beautiful OPERATING courthouse I have ever been in. The climb to the tower - where you can see all of Santa Barbara is worth it - just take your time and enjoy the view once up there. There is an elevator - not 100% sure if it works.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Best view of Santa Barbara from building top", "Free public parking near the courthouse. Restrooms available inside the building. One of the prettiest buildings I've ever visited in the US. Love the murals that give a vivid description of Santa Barbara's history in the Mural Room. And as you walk up the stairs to the top of the clock tower to have the best bird view of the city, don't forget to take a look at the tiles and side decoration items along the way. Every little detail in this building deserves attention!\nShow less"], ["Reviewed October 3, 2017", 5.0, "The courthouse is a Spanish Revival gem. The tourist should take the elevator to the clock tower. Superb view!!", "Centrally located. Numerous eating places nearby. Parking garage across street. Garden is enjoyable. Guides great, but not a requirement."], ["Reviewed October 2, 2017", 5.0, "some say it is the most photographed building in Santa Barbara.", "The Santa Barbara County Courthouse may look like a castle in southern Spain, but it is really a working courthouse with six superior courts, a hall of records, and numerous offices. It is also according to one architect, the finest example of Spanish Colonial Revival Architecture in the United States. Built after the 1925 earthquake in Santa Barbara, it was finished in 1929 at a cost of 1,368,000. The William Mosher company headed the architectural design and was in charge of the project. To really enjoy this Santa Barbara gem, take advantage of the free tours given daily. !0:30 and 2:00 during the week and 2:00 on the weekend. You will be amazed. Take the elevator to the tower - from there you have the best view in Santa Barbara.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Fun walking tour", "It's a great old building that's also a working one. The supervisors board room has a great historic mural (from the 1930's?) showing the history of the county from native Americans forward. Have kids look for Peter Pan on the back wall.\nThe clock tower has a neat display on time keeping on the way to a great view at the top.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beautiful setting for a civil wedding!", "My spouse and I married in the courtyard of this Santa Barbara Jim of a building. We cherish the memory of our elopement for a same sex wedding when it became legal nation wide. I will never forget the wonderful little ceremony provided for us by the mattiage license bureau.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Unique site - one of the very best public places in all of the US!", "Simply stunning Spanish colonial architecture & gardens plus best view in town from the high clocktower. And it’s all in a FREE central downtown location to stroll around in - Don’t miss exploring the impressive staircases & the colorful murals in the central courtroom."], ["Reviewed October 2, 2017", 5.0, "SB Courthouse tower should not be missed", "Every visitor to town should go up in the Santa Barbara County tower. It overlooks Downtown, the Santa Ynez Mountains and, on a clear day, the Pacific Ocean and Channel Islands. Simply beautiful!"], ["Reviewed October 2, 2017", 5.0, "Beautiful architecture! Put this on your must see list above the Mission.", "We visited the Santa Barbara County Courthouse on a recommendation from our hotel. We are so glad we went there. It is FREE, beautiful and you are able to walk around and enjoy at your own pace. There is an elevator that takes you up the tower to enjoy the lovely views - do not miss! I enjoyed the courthouse more than the mission.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Nice stiyle", "A working courthouse but so attractive. Good views from the tower. Worth a wander a round, enjoy the atmosphere. Is free."], ["Reviewed September 28, 2017", 5.0, "Views all around", "Opportunity around every corner for wonderful photos to document unforgetable memories ! Highly reccomend viewing the clock tower."], ["Reviewed September 27, 2017", 5.0, "Worth the View!", "Beautiful spot in SB! Go before 4pm as tower closes. 2pm best time in my opinion based on burn off and clear view. FREE! Enjoy the peaceful view!"], ["Reviewed September 27, 2017", 4.0, "Landmark Building", "A great view from the tower, interesting clock room and amazing murals - what's not to like with free admission!"], ["Reviewed September 26, 2017", 5.0, "Amazing view!", "The visitor centre told us to visit here and so glad we did. Easy to get to...take the trolley down State Street. No cost to access and it is beautiful inside and outside. The views from the tower are spectacular."], ["Reviewed September 26, 2017", 5.0, "Beautiful architecture! Very welcoming.", "I enjoyed the free visit to the County Courthouse. Be sure and go up to the viewing area, clock room and mural room."], ["Reviewed September 25, 2017", 3.0, "Santa Barbera Courthouse.", "This was an unusual stop-off on our way to LA and it has a lot of history to it. It has a lot of really nice murals inside and great views from the Bell tower over Santa Barbera"], ["Reviewed September 24, 2017", 5.0, "Great views of Santa Barbara!", "Walk the steps or take the elevator to the top of the beautiful SB Courthouse. Great views of the city!"], ["Reviewed September 24, 2017", 5.0, "Ann interesting building", "This famous courthouse looks like a Mexican hacienda with its balconies, outdoor staircases and beautiful garden and lawns. Inside it is very richly decorated in a mission style."], ["Reviewed September 22, 2017", 4.0, "Great view from the top and free to visit", "The grounds are lovely and on the inside there are many examples of Spanish architecture, tiles and flooring. On the second floor stop off to see the wonderful murals and wall hangings. You might even get to see a wedding taking place in the main room. It surprised us that the courts are still utilised, we thought this was purely of historical value. Take a trip up to the fourth floor yo see the panoramic views across the city. It's well worth a visit.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Yoga outdoors", "I love Michelle our Yasa Yoga instructor, can you imagine stretching outdoors on the grass and meeting mindful people?!"], ["Reviewed September 21, 2017", 5.0, "View from the top is fantastic", "This is a beautiful building downtown Santa Barbara. We were walking on State Street and eating yummy food and decided to go to the top of the courthouse. We are so glad we did. Amazing view."], ["Reviewed September 19, 2017", 4.0, "Impressive surrounding", "There's not a lot to do here but the bell tower provides excellent views of the city and you can go up by elevator. The rest of the building with a diversity in rooms is created in a typical creative manner. Definitely worth a short visit.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Amazing view from the tower. And free.", "Great views and a good look back into Santa Baraba's history. All at no charge. Beautiful lanscaping"], ["Reviewed September 18, 2017", 5.0, "Was so unexpectedly good, a \"must see\"", "Wow, what a fantastic building.\nMake sure you climb the clock tower, it's not a hard climb and the views over Santa Barbara are great.\nBeing able to walk freely throughout most of the buildings was unexpected.\nThe mosaic tiles, paintings and wall hangings are very interesting\nShow less"], ["Reviewed September 18, 2017", 5.0, "Beautiful build", "Stunning Building, take the lift to the top and admire the 360° views of Santa Barbara. One floor down from the clock you can see the workings of the courthouse clock."], ["Reviewed September 16, 2017", 5.0, "An architectural gem with 360 degree views of Santa Barbara", "Start at the top with the 365 degree view of the city from the clock tower and work your way down through the gorgeous courthouse and sunken gardens. Look for Peter Pan in the Mural Room! Don't miss this stop when you visit Santa Barbara or invite guests from out of town. It is a really great place to picnic.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Free to see!", "This is a must stop. Free to climb the stairs or ride the elevator to the 4th floor to see 360 degree views of Santa Barbara. It is so worth it and you can see the clock and a courtroom. Beautiful place!"], ["Reviewed September 12, 2017", 5.0, "Beautiful", "This was my first visit to the Santa Barbara Courthouse. I don't why I skipped it on other trips because it a simply beautiful building. The view from the top is amazing. I would recommend the elevator though. Especially on a busy day. The stairwell made me feel a little claustrophobic.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Impressive Building", "I liked walking inside and remembering how often this building appears in Ross Macdonald's superb mystery novels."], ["Reviewed September 11, 2017", 4.0, "Enjoyed our visit", "Lovely view from the top/the tower - looking out in all directions. Worth the visit.\nSome folks took the elevator straight to the top and missed a few key sites.\nUp one floor is the lovely old court room - wonderful wall murals - great to see.\nWe took the stairs so saw the court room (or you can get off the elevator)\nBut walking from the courtroom floor on up to the tower is a good idea - as you take the stairs you pass by the inner workings of the court house clock which was very cool to see. Was not a bad walk and we really enjoyed seeing the clockworks.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Historic SB Courthouse", "It never gets old to visit the gorgeous Santa Barbara Courthouse. A grand Spanish style building, daily tours offer views of the original courtroom (now used for weddings and other special events), and an elevator ride or walk up to the 4th floor tower's outdoor viewing platform offer truly spectacular 360 degree views from the rolling hills to the harbor below. A must for any visitor to SB. We take guests there all the time and none have ever been disappointed.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Great views!", "Our visit to the Santa Barbara County Courthouse was suggested by one of the staff members at the Inn where we were staying. Glad we went. It was a nice walk through town from the Inn. The courthouse was very unique. The grounds were beautiful and the gardens were really pretty. We went to the top of the clock tower... amazing views of all of Santa Barbara. We went on a Saturday morning. It was super busy, but manageable.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Great view", "Great views from the tower of the Sanra Barbara area. Its free to go in and you go take the lift or stairs. Lovely gardens also. Worth a visit."], ["Reviewed September 9, 2017", 5.0, "Wonderful interiors", "This historic courthouse is built in the beautiful Spanish style, but the interior of the courtroom is painted in rich and historic murals, which will literally leave you gasping with wonder."], ["Reviewed September 8, 2017", 5.0, "Must Visit - Best Views in Town", "Beautiful building, great views over SB, capture the mountains hugging the city and out to sea over the red tiled, palm tree lined vista. ITS FREE, even the lift to give you access to this wonderful 360 view. Be sure to stop on the second floor to view the stunning Mural room and wander the sunken garden out the back.\nShow less"], ["Reviewed September 8, 2017", 5.0, "Sightseeing", "Beautiful building. The tower is a great place to see the city from and all for free!! there is an elevator if you cant get thru stairs and they show you the clock inside the tower. pretty cool"], ["Reviewed September 6, 2017", 5.0, "The most tourist-friendly building in Santa Barbara", "The Courthouse is, as the name says, the seat of law in Santa Barbara. So most tourists might say \"that's boring, let's skip that\". But the Santa Barbara Courthouse is much more than that. In many ways it is the heart of the city. During the Fiesta, and at other times of the year as well, the Sunken Garden (a large lawn on the inside of the \"L\" formed by the Court building) serves as an outdoor theater. This is where people sit while an elevated stage is erected next to the outside stairway. Various organizations hold award ceremonies and other such events here. The building is probably the best example of the Spanish Mission style that was invented in and for Santa Barbara and is not found anywhere else, since this style is a merging of several different architectural styles. The building is beautiful inside and out. Be sure to stop at the second floor mural courtroom that depicts the history of this area. It is usually open and sign near the elevator will indicate how to get there. This room also serves occasionally for evening concerts. Finally, be sure to take the elevator to the top floor and then take stairs one more floor up to the observation deck, the only such place in Santa Barbara. If you want to go inside the building, you will have to come during regular business hours. However, the building is also really beautiful at night, when it is lit up. But then you can just look, you cannot explore the inside or go to the observation deck. For couples looking for a place to get married, the Courthouse has I think 2 or 3 different options, and you could hardly find a prettier setting. Parking is free for the first 75 minutes across the street next to the Public Library, in a large parking complex (off Anacapa). There are other parking structures downtown as well, but this is the closest one.\nShow less"], ["Reviewed September 6, 2017", 5.0, "I had to come back!", "We visited the Santa Barbara County Courthouse 4 years ago. We were there too late to go inside and into the clock tower. We were able to do the tour this visit. Great murals, tile work and views. It's a beautiful place. It's a must do.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A Santa Barbara Must-See", "The architecture of the building in fantastic. It is arguably one of the best looking buildings in the city, if not the best. You can climb up to the top of the clock tower and see magnificent views of the city and Pacific Ocean, and the sunken gardens are beautiful. And it's still a functioning court house. Free parking for the first 75 minutes is available at a multi-level city parking structure directly across the street.\nShow less"], ["Reviewed September 6, 2017", 5.0, "This is a simple and beautiful place to visit with wonderful views.", "The Santa Barbara Court House is much like Santa Barbara as a whole, small but beautiful. Very easy to reach in the center of town. Interesting architecture inside and out. Great views from the top and an interesting clock mechanism recently restored and visible behind glass. Great place to talk people on their first visit to this town,\nShow less"], ["Reviewed September 5, 2017", 5.0, "Worthwhile visit in central SB", "Very nice visit to the SB county courthouse. Very nice building and grounds. Not very crowded in early morning."], ["Reviewed September 2, 2017", 4.0, "Beautiful Architecture and Views", "We walked around the courthouse to see all the amazing architecture and beautiful views from the tower. The whole area is open and breathtaking. There is a sunken green area in the middle that is meticulously manicured. YOU MUST GO TO THE TOP! The views of the beach, mountains and the rest of the city is just breathtaking.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Simply Breathtaking", "The view at the top of the clock is absolutely beautiful. All four sides are picture-worthy. You can see white houses interspersed with trees run for miles, finishing at the ocean, which seems like it goes on forever into the horizon. It feels calm, as the breeze feels nice. Visit here if you have the chance!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Amazing the second time around", "Just as amazing as when we visited the first time. Got to dupe other family members when I told them we were visiting a courthouse. They thought it would be boring, and by the time we left they were gushing. Truly one of the highlights of the trip, and it's free. Can't wait to visit it a third time someday.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Can't miss the trip to the top!", "The views from the top of the courthouse are the best in Santa Barbara. The murals and painted ceilings are beautiful. This is truly a beautiful building a must see on your trip to the area."], ["Reviewed August 23, 2017", 5.0, "Most beautiful courthouse ever!", "Be sure to stop in and wander the halls of this beautiful landmark. The tile, the paintings, the open corridors that let the breezes in, the opulent courtrooms are all must-sees!"], ["Reviewed August 19, 2017", 4.0, "Beautiful building!", "A lovely architecturally superb building! Decided to just wander around instead of a tour (very quiet mid-week) and enjoyed the view from the lookout."], ["Reviewed August 18, 2017", 5.0, "Beautiful and free tours", "Yes -free tours of the court house at 10:30 and 2:30 but check the times to be sure. Meet on 2nd floor to start tour.\nMake sure you go to the clock tower lookout for the view. And if you don't take the tour come down the clock tower stairs one floor to view the museum from inside the stairs. Proceed on down to the 2nd floor for the fabulous courtroom. You are free to walk the courthouse halls as it's a working courthouse.\nReally pretty.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Most beautiful courthouse in the U.S.", "If you're a first time visitor to the courthouse, it is definitely a must-see. Beautiful architecture that echoes its history even as it remains a functional building. Take the stairs to the top and see magnificent views of Santa Barbara!"], ["Reviewed August 16, 2017", 5.0, "Beautiful", "Just stopping a looking at this beautiful building is enough! Prettiest courthouse that I've seen in California."], ["Reviewed August 15, 2017", 5.0, "A beautiful piece of history", "We took a free tour of building. The docent was informative and enthusiastic. We learned a lot of history of the area and saw an amazing building with a marvelous rooftop view."], ["Reviewed August 13, 2017", 5.0, "Great views", "It is defiantly worth visiting the court house the views from the roof are amazing and the gardens are great to walk around with plenty of dinning options near bye"], ["Reviewed August 10, 2017", 5.0, "Interesting Early California Building", "The building encloses a wealth of history about Santa Barbara and Early California. It is like an open museum, free to the public."], ["Reviewed August 9, 2017", 5.0, "Lovely views, beautiful building", "It's free and you'll probably be within a block or two if you are in downtown Santa Barbara. Go for the view."], ["Reviewed August 9, 2017", 4.0, "Tour of Santa Barbara Courthouse", "This is a beautiful building in Downtown Santa Barbara. Learning about the architect who designed the Courthouse and the history behind it was fascinating.The tour guide was also able to give us history about the sunken gardens and landscaping. This is an incredible property and I strongly recommend taking the walking tour that the city provides.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Do not miss a visit to the SB Courthouse Clocktower", "It has 360 degree views of all of SB. You can see the Riviera, the Mission, all of downtown, parts of the Mesa, the ocean and channel islands, and soak in all the beauty SB (aka Paradise) has to offer from a bird's eye (or drone's view?), above.\n\nThere are stairs to climb all the way up for those health junkies, but if your are abled, I suggest walking at least up to the courthouse floor (where you may even spy a couple getting married! - peeking is allowed!), then taking the elevator up from there.\n\nAlways remember to 'look up' because the murals and tile work are great.\n\nThe Clocktower hours are short, so be sure to get there before 5pm.\n\nEnjoy! and be sure to send others to the Courthouse (donations welcome but not required for the docents and other volunteers who manage the inspiring and educational part of Santa Barbara's history) :-)\nShow less"], ["Reviewed August 8, 2017", 5.0, "View", "Great view of Santa Barbara from the tower. Compass model shows the coast line as east to west. Short visit"], ["Reviewed August 8, 2017", 4.0, "Tower view is worth the visit alone", "This magnificent example of Spanish Colonial Revival style architecture sits on 5 acres of lawns and gardens. Completed in 1929, it was the site of the infamous Michael Jackson trial in 2005 and is the site of musical and cultural events, usually on Sundays, throughout the year. It is the featured site of three nights of Noches de Rondo (the premier musical and dancing events of the annual Santa Barbara Fiesta celebration held during the first week of May). Climb to the top of the tower for magnificent 360 degree views of the city, the mountains and the ocean. Tours are available Monday through Saturday. Call the visitor booth (805) 962-6464 for information.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Came here to get our Marriage License!", "We picked up our marriage license here before getting married in Santa Ynez and it was such a special treat. I can see why some couples choose to get married at this location because it really is a beautiful building. If you have an interest in architecture and history it is worth a stop during your SB vacation.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Amazing view", "We just went here to go up the clocktower and see the view (Well worth doing) but the building looked really interesting too. Check it out!"], ["Reviewed August 7, 2017", 5.0, "Great city views", "By all means visit the courthouse. The building has spectacular architecture and the views from the tower are excellent."], ["Reviewed August 7, 2017", 5.0, "Absolutely fabulous", "This place is truly amazing from the first time you enter the building.\nThe pictures on the walls depicting the history of the courthouse have to be viewed to be believed.\nThere are so many buildings of interest in the courthouse that I could go on and on but it would take to long.\nTo sum up this place I can truly say it is one of the most interesting places I have ever visited and recommend to other who are in Santa Barbara in the future.\nShow less"], ["Reviewed August 5, 2017", 4.0, "fab views", "read about this building on tripadvisor and decided to check kt out as we only had one day in SB. beautiful views over the city even on a cloudy day. the building itself is impressive as well. worth the short stop. easy to park nearby"], ["Reviewed August 5, 2017", 5.0, "We got lucky!", "We were looking for a bank, when we noticed the Courthouse nearby and decided to tour it. It was incredible. The architecture, the beautiful tiles, woodwork, adobe construction, paintings, courtroom and the tower you could walk or take the elevator to that gives you a 360 degree view of Santa Barbara and helps to orient you to other sites. This was clearly built with labor from skilled artisans of Mexican and Native American ancestry. I do wish this was made more explicit in the information about the place.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Spectacular building and view from the tower", "Nothing else like it in the US; second best to being in Spain. Beautiful on the outside and inside, with great murals and tilework and ceilings. Be sure to visit the second floor \"Mural Room\", the arcaded hallways, and the circular staircase."], ["Reviewed August 2, 2017", 4.0, "Beautiful Spanish Architectural Designed Courthouse", "I had a trial here and wished I could just hang out and explore the building more - walk the nearby downtown of Santa Barbara and appreciate this special building and its gorgeous grounds and setting"], ["Reviewed August 1, 2017", 5.0, "Worth a visit, great views", "This place is free to enter, in my opinion has the best views of Santa Barbra from the clock tower, a wonderfully well decorated court room with amazing painted walls and ceiling and beautifully tiled staircase walls. Well worth an hours visit."], ["Reviewed July 31, 2017", 4.0, "Fantastic view", "The Courthouse is a quick trip and site worth seeing if visiting Santa Barbara. The view from the tower is all you need to justify visiting this historic location as it gives you a 360 degree view of the city"], ["Reviewed July 31, 2017", 5.0, "Unique experience", "The interior and the view from the top of the tower were both stunning but the best experience was sitting in on a court case. When we went there we managed to see 2 real court cases including a homicide. It was incredibly interesting to watch the court and trial procedures. Overall an incredibly unique experience.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Great views and no cost.", "Great views overlooking the red tiles roofs of Santa Barbara and an easy walk from downtown State Street."], ["Reviewed July 24, 2017", 5.0, "Great views!", "A gorgeous building in and of itself, but the views really make it amazing! Climb the stairs if you can, you'll thank me. It's not too tough and it's worth it. The mural on the second floor are lovely, the clock room is intriguing but hitting that roof shows the true beauty of Santa Barbara. Definitely the highlight of the day!\nShow less"], ["Reviewed July 22, 2017", 4.0, "Whirlwind", "We had a wedding to attend and traffic to face, however, my persistence prevailed. (Fortunately we made it to the wedding on time. My memory is of colorful tiles, gracious architectural lines and another wedding. Would indeed have liked to spend more time savoring the details from the 1920s building. An added charm was the quilting of blankets set out very early for the outdoor movie that evening.\nShow less"], ["Reviewed July 21, 2017", 3.0, "Great view of Santa Barbara AND some pretty cool court rolms", "Honestly, this was last on my list of things to do/see AND only if I had nothing else to do in Santa Barbara (SB). As almost everyone thinks....a courthouse!? There's got to be SOMETHING better to see I SB!\n\nFortunately, I had some time to kill before going to the SB salt caves. Visited around 11:30am and spent about 30 minutes here.\n\nIt's essentially a courthouse with character and a view. You can actually watch cases (though I went on a holiday weekend so no court was in session). I was still able to go into a courtroom and see the walls covered with big murals. It was interesting to see since my only views of courtrooms has been on judge Judy, the people's court, and making a murderer.\n\nYou can catch an elevator or walk up the stairs to the top of the court tower and see 360 degree views of the city. Great to see and get some panorama shots of the city for your social networking memories (or albums for the older gens).\n\nThere are paintings in the halls and some other memorabilia, but they didn't quite grab my attention so I can't even remember what they were of.\n\nPROS:\n1) Free!!\n2) It will be better than you expect!\n3) Great views and photo op\n\nCONS:\n1) can't think of any as long as you go in knowing what your going there for. You may be disappointed if you passed something else up?\n\nP.s I saw some signs that they host movies there (there is a big grassy area outside). That's probably super fun, but I went in the day so can't comment on how it actually is.\n\nShow less"], ["Reviewed July 19, 2017", 5.0, "Stately Santa Barbara Icon", "We took our kids here to explore the grounds and the iconic building, it is just as great as we remembered it from years ago.\nYou are able to wander around the court house and even go up the stairs in the tower - about three stories - and get a wonderful view of the surrounding area.\nThe inner quad with the grass and shrubs and flowers are beautiful especially this time of year.\nHighly recommend it for a family trip or even a couples trip. The whole are is gorgeous!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Nice place for some history and a lovely view", "The courthouse is open for public and you can run around pretty much whereever you want. The court room is very impressive and you can even visit it during weddings and meetings. The view on top of the clock tower gives you a nice picture of Santa Barbara. Definitely worth a visit\nShow less"], ["Reviewed July 19, 2017", 5.0, "Santa Barbara's Gem", "This location is stunningly gorgeous. The grounds are expertly maintained. Docent tours available, or just take your time and explore. The tower affords amazing views of the city and its famous red tile roofs."], ["Reviewed July 18, 2017", 5.0, "Visit to the Court House on July 4, 2017", "Enjoyed the tour and the grounds of the courthouse. It is a beautiful building inside and out, especially enjoyed the little chapel and the rooftop view of Santa Barbara."], ["Reviewed July 17, 2017", 4.0, "You can See for Miles and miles!", "Beautiful old, historic building with fabulous views from the tower! Definitely, a \"must-see\" when visiting Santa Barbara. There are always several wedding photo shoots going on the grounds and tower but it's worth the shuffling to see the views. Don't miss the interesting Clock room on the 2nd floor either!\nShow less"], ["Reviewed July 16, 2017", 4.0, "Nice views and outdoor concerts", "Travelled here for 4th of July weekend. The courthouse is very attractive and has interesting artwork and other decorations. The clock tower is worth the climb up the stairs and there's a little clock museum towards the top where you can see the insides of a complicated clock.\nIf you get a chance to catch an outdoor concert or other performance here, please do. There is nice grass all around and the setting with the courthouse as backdrop is even a bit romantic, just like the rest of this beautiful city.\n\nShow less"], ["Reviewed July 15, 2017", 5.0, "A beautiful must see attraction", "I had heard something about the courthouse having great views...and I really didn't think much about going into a courthouse. However, we were driving by and decided to park and walk around it and take pictures. We ventured inside and were very surprised to find beautiful hallways, fixtures, and works of art. The tiled walls and mosaics were breathtaking. We made our way to the very steep stairs up to the observation deck and we could not believe our eyes. There were 360 degree views. We spent about 20 minutes up there taking pictures and soaking up the views. It was foggy over the beach that day so we could not see the water, but the sun was high and the city looks amazing. I highly recommend stopping by and taking pictures. This truly is a Santa Barbara treasure that should not be missed.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Psych, sort of", "My 18-year-old daughter is a fan of the TV show Psych, so we had to stop at the Santa Barbara County Courthouse. (We know the show is actually filmed in Vancouver, but she wanted to go anyway.)\n\nOf course, we had to stop first at a grocery store down the street for--you guessed it--a pineapple. Believe it or not, they were on display as soon as you entered. Not sure whether that was a coincidence or a necessity.\n\nParking around the courthouse was easy. We walked to around the property, snapping photos with the pineapple. I really enjoyed the architecture, and the grounds are beautiful.\n\nUnfortunately, the building wasn't open--it was Sunday--so we didn't see the interior.\nShow less"], ["Reviewed July 12, 2017", 5.0, "THE BEST OF OLD SANTA BARBARA", "I was in court in this building and able to see the faces of visitors full of wonder and appreciation. This is truly an extraordinary opportunity to see old California and the history of Santa Barbara, once an extraordinary city."], ["Reviewed July 12, 2017", 4.0, "Worth the visit", "I am not one who usually visits court houses without being invited, but the Santa Barbara courthouse is certainly worth a visit. One can get a history of the area by walking through or by taking a guided tour. The paintings on the walls tell it all. This is not your typical courthouse. We particularly enjoyed the the tower clock and bell ringer. Be sure to visit on the hour to hear and see the complete operation. Go to the top of the tower for a view of the area.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Great wedding location!", "Wonderful wedding location ! Gorgeous setting with no hassle. Wedding planning made easy! The courthouse is very stunning. You don't realize that you are visiting a municipal building. Tourist come from all around the world to take pics. My wedding photos were gorgeous in May!"], ["Reviewed July 11, 2017", 5.0, "Must see for the views", "The architecture was beautiful but make sure to get up the viewing area. It's a breathtaking 360° view of the city/surrounding area."], ["Reviewed July 11, 2017", 5.0, "Always a must for visitors", "The Courthouse is one of a kind, beautiful inside and out. Always take out of town guests up to the tower for a 360 view of Santa Barbara. Breath-taking views."], ["Reviewed July 11, 2017", 5.0, "Amazing Views!", "Just might be the coolest courthouse in the US! However I wouldn't want to be a juror, attorney or judge as there is NO A/C!! However the architecture and interior of the building is spectacular. And the views from the top are a must see!"], ["Reviewed July 11, 2017", 5.0, "Worth the day trip from LA!", "Visiting Santa Barbara has been on my bucket list, so we decided to take a drive up here one day while on our visit to LA. Not only was this place worth the trip, but so was the beautiful architecture of ALL of the buildings in Santa Barbara. Walking into this place takes you back to another time period as it has stunning Spanish style. There was a wedding in the garden in the back, which was really cool to see. The weather was stunning the day we went, so the view from the tower was impeccable. The best part is that you can just walk in as you please, it is free, and we found free parking right on the street for 90 minutes. If you appreciate Spanish architecture and history, this is a must see! BTW, try to visit State Street if you have time. Beautiful tree lined streets, great shopping and great food! Of course, visiting the beach speaks for itself. Beautiful.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Truly Spectacular", "I had the privilege of working in this building for many years and was always proud to take my friends on the \"insider tour.\" But even though I no longer have the keys to that kingdom it's still a favorite Santa Barbara experience."], ["Reviewed July 10, 2017", 5.0, "This is a must see!", "This a wonderful gem of Santa Barbara, old Spanish style tile work throughout the building. Views from top floor are wonderful. This is an actual working courthouse during the week."], ["Reviewed July 10, 2017", 5.0, "Beautiful Building, Great to get Married At!", "My Wife and I came down from Canada to get married in Santa Barbara. We chose this courthouse as it was by far the most beautiful we found."], ["Reviewed July 10, 2017", 5.0, "Drop Dead Gorgeous", "This is why I moved to Santa Barbara 40 years ago. Nicest courthouse anywhere. The view from the tower is great. Don't miss it!"], ["Reviewed July 8, 2017", 5.0, "A must see in Santa Barbara", "If you want to see the best views of the city, on all sides, this is a must see place to go. Go all the way to the top of the tower and you will not regret it."]]}}