{"Santa Monica Bay": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Monica Bay", "url": "/Attraction_Review-g32655-d156698-Reviews-Santa_Monica_Bay-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/41/39/db/santa-monica-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "4640"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90013", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Beautiful", "The Pier and Santa Monica are fantastic and a must to visit. Lots to do for families and an unbelievable beach. Lots of places to eat and drink"], ["Reviewed 2 days ago", 4.0, "Lovely sandy shore", "One of the best bay to visit in the evening for sunset. We had the best sea food in a little cafe. The place seemed to have lots of entertainment but didn’t spend much time as it was very windy that evening."], ["Reviewed 3 days ago", 5.0, "Incredibly wonderful beach and views", "Having lived in Los Angeles for 3 years and many visits later, I still love Santa Monica Bay. In fact, when I overnight in the Los Angeles area, I always stay in Santa Monica in part because of the panoramic views of the bay extending to the north and south. On a clear day it is stunningly beautiful.\n\nThe path along the Bay is convenient and active. It is not only good for exercise but delightful people watching. The views are constantly changing as the sun rises and then sets beautifully into the Pacific Ocean at sunset. You can even enjoy the view and the Bay by walking along Ocean Avenue which looks down on the Pacific Coast Highway the beach area.\n\nMost special of all is the sunset. It is spectacular and special. My sons used to crawl along the beach while my wife and I drank a margarita or cold beer. And on the day my youngest son died, I was in Santa Monica when I heard the news. That beach and the sunset will always be very special for me.\n\nDon't miss the opportunity to walk, run or simply sit and relax at Santa Monica Bay. It is very special.\nShow less"], ["Reviewed 5 days ago", 4.0, "Awesome place", "This place is very famous for photography lovers and usually a lot of tourists from all over the world are seen here."], ["Reviewed 5 days ago", 4.0, "A lovely and beautiful beach town", "With a great view to the pacific ocean and clean blue water, this town is amazingly clean and well organised. Open performance with Tom Petty music filling the air, surfers around and amazing murals all over, makes it an enchanting getaway. again a must visit"], ["Reviewed 1 week ago", 5.0, "Beautiful morning stroll!", "Before heading to LAX, decided to relax and take a stroll on the Santa Monica Beach - it was first thing in the morning, not busy, sand was freshly grated and cleaned, simply breathtaking scenery. Next time we'll definitely enjoy this stretch of beach more and rent the bikes and peddle the 26 mile path. A must do when in Santa Monica.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful", "Beautiful beach. Clean and not full of bums like our experience in Venice beach. I would feel comfortable bringing my grandchildren here."], ["Reviewed 1 week ago", 3.0, "Is a place just to see the ocean and tanning", "the beach is full of people, there are no places to eat or to drink something. if you want just to bath or to get tan is the place to go. on the pontoon you will find different artist selling their creations."], ["Reviewed 1 week ago", 5.0, "Goliath set", "We came here because of Billy bob Thornton and Goliath.. The Pier is nice, the beach wasn't filled bums on my day but that doesn't mean they aren't there. be safe."], ["Reviewed 1 week ago", 4.0, "Nice for a walk", "We got here around 9am, before anything had really opened, so we went for a walk along the beach and down the pier. It's a really nice area for a walk when the weather is nice"], ["Reviewed 1 week ago", 5.0, "So much to see an do", "Santa Monica Pier is well worth a visit. So much to see and do. We hired bikes and rode up to Venice Beach. A very memorable day and easy public transport links by bus or metro train."], ["Reviewed 1 week ago", 4.0, "Great Escape", "Not a beach person but it’s nice to be by the sea. The Pier reminds me of the East coast, Wildwood, Ocean City and Atlantic City back in the day. Great shopping in town, good food and comfortable places to stay."], ["Reviewed 1 week ago", 4.0, "Really Nice Day Out", "Santa Monica is a beautiful beach and fair ground. It wasnt as big as i thought but it was still nice. It takes about an hour but its a lovely walk to the buzzing Venice Beach. Plenty of shops and restaurants along the pier. Recommend Bubba Gumps! Small fair ground but still good especially for the kids.\nShow less"], ["Reviewed 1 week ago", 5.0, "Christmas Eve breakfast.", "We had breakfast at Bubba Gumps. The food was good, the vserice very friendly and the view fantastic."], ["Reviewed 1 week ago", 5.0, "Sunny day in LA", "Been here on my last trip to the west coast. Definitely a good spot, the pier is always packed and it's a very lively place."], ["Reviewed 2 weeks ago", 4.0, "Great Fun", "Lovely old fashioned pier with a roller coaster and other amusements. Beautiful clean beach. Not many places to eat and a bit pricey."], ["Reviewed 2 weeks ago", 3.0, "Not much activity on a Thursday evening", "We were disappointed that everything was closed at 8pm on a Thursday evening. Only bubba gump shrimp was open, the rides and all stores were closed. Would love to have gone back during the day but we didn't have time."], ["Reviewed 2 weeks ago", 5.0, "Beautiful place", "We enjoyed several hours walking along the pier and Oceanfront Drive. It was a lovely, sunny day, not too warm, with clear blue skies. It was fun people watching, enjoying the local talent, seeing the people work out at Muscle Beach. We'll try to come back on our next visit to the LA area.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Little beach area with flavors and vibes", "There were many little shops on the boardwalk and bike / scooter rentals.\n\nWe had Eggslut (always amazing!!!) which is closer to Venice Monica beach then walked down the boardwalk to Santa Monica Pier. The little community here is welcoming and there will be a lot of people hustling products of all sorts here!\n\nA little northwest of the Santa Monica Pier, there were a ton of typical shops and food that i see in many different countries.\n\nThis beach is beautiful, worth coming to see if you have at least 3-4 days during your visit. I'd recommend getting the bikes for only an hour, there arent an insane amount of things to see and prices are quite inflated at the shops that cater to tourists.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A Fun Place", "Never a dull moment here, with endless characters of all sorts running, cycling and walking up and down, also a glorious beach"], ["Reviewed 2 weeks ago", 5.0, "Great way to escape LA reality", "During a recent convention I took the Metro from downtown LA to Santa Monica. Although I would like to have spent more time, I walked the Santa Monica Pier, listened to some good musicians and stuck my toes in the Water at the official end of Rt. 66 highway. A great place to unwind!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "BEAUTIFUL and ICONIC!!", "We spent the afternoon and early evening here with out family of 5 (boys ages 7, 11, and 16) just last week. Lots to see and do. Boys loved muscle beach as well and the equipment kept them quite entertained. I would not recommend walking all the way to Veince Beach though as even in the afternoon, it was a bit sketchy and my boys had a LOT more questions than I had answers for.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A beautiful day on the bay", "Be prepared for big crowds on the weekend. Queues were not too long to get on the Ferris wheel, a lovely open air experience."], ["Reviewed 2 weeks ago", 5.0, "A Favourite LA Stop", "While we only had a few days in LA, Santa Monica was one of our favourite places. Reminded me a lot more of Australia except the sand goes on for miles. Not sure if the long walk to the water is a good or bad thing! Clean, well to do and beautiful. Definitely worth a visit on any visit to LA. The prom above the beach gives great views up and down the coast.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "DAYCATION - A DREAM DATE", "SANTA MONICA is alive, active, even passive...whatever you want it to be. The beach is clean, and one could walk miles; the air is clean, crisp, & fresh. Near the beach are fantastic & oh so many restaurants, bars, & parking (all of these require more $$ than a small town).\nThe beach itself is great also for children to swim, make sandcastles, & imagine. A quality stroller would provide your tiny ones & breath of fresh air, and just listening to the waves is calming. A stroll is also great for couples, who may need a good long talk, walk, & be alone. Bicycling is great; make sure it is a BEACH BIKE. Please note that when Hollywood was in its heyday, Santa Monica was THE place. In fact, the famous ROUTE 66 was created for people anywhere from Chicago to Santa Monica. I traveled that route a dozen times, & the arrival to this elegant beach was the climax. You must include this if you are in the area.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Romantic", "A very romantic place to visit during sunset. Even with the crowd, the place looked very lovely and serene. I went here capturing GoPro footages and the view is just stunning.\n\nNever tried the rides and the food here. I must say, just plain walks here will keep you full and satisfied.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best of our LA Trip", "The area is clean and picturesque. Park and a beach and the pier. Also many nice shops and restaurants when you are ready for a stroll. Try to spend one day here."], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "This is one of the most beautiful beaches in California. The Santa Monica pier is also fun to walk and there are lots of cool places to eat where you might be able to share a table with someone from anywhere in the world. There are lots of places to buy souvenirs too. Sunsets are spectacular.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful!!", "What could possibly disappoint?!? Beautifully clean uncrowded beaches in the SoCal sunshine, plenty of parking and only a short stroll from the bars and restaurants of Ocean Drive or the shopping and coffee of 3rd Street Promenade!"], ["Reviewed 3 weeks ago", 5.0, "I was in awe!", "I absolutely love the beach, so obviously I HAD to check out Santa Monica while I was in Los Angeles! it was a clean beach with great waves and good restaurants as well as shopping. It is very touristy, so if that isn't your thing, it's not the place for you.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Local Favorite", "Santa Monica is a great getaway from the city. If you are a local or just in LA visiting and don't have too much time/or a car, Santa Monica is the beach to hit up. It is accessible by Metro using the blue Expo line however driving is also simple but parking can get pricey as prices fluctuate during peak times. The pier offers fantastic views of the surrounding areas, quick eats, souvenir shops, fishing, a killer arcade (old and new games) and a mini theme park including a ferris wheel and rollercoaster. The rides get pricey ($6/ride) however if you are to choose one, take the ferris wheel at night or sunset. The beach is usually crowded near the pier but walk north or south a bit and you will find plenty of space including exercise areas, volleyball nets, and bathrooms. Off the beach, a few blocks east of Ocean Avenue, downtown Santa Monica offers a great shopping area with name brands like H&M, Victoria Secret, Johnny Rockets, and a movie theatre.\n\nTIP: Sunset is a great time. You will find many photographers, couples, families, and locals on the sand to watch the sunset.\n\nFun fact: This is the pier where they filmed Lost Boys!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beaufiful bay and nice sea side city", "The Santa Monica Bay is extremely beautiful, stretching from Malibu to Palos Verdes. Many beautiful beaches to choose from with great views of the city and even Catalina island. After driving or walking on the beach, you can go to the Santa Monica Pier and people watch, shop, eat or enjoy carnival rides. Up from the pier is the 3rd Street Promenade in the city of Santa Monica. Lots of shops and good restaurants to partake. Fun place to go for the entire family.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful but pricey", "Santa Monica Bay is a beautiful bay with stunning beaches but activities here can be expensive. You can walk from here to Venice beach which makes a nice stroll as well."], ["Reviewed 3 weeks ago", 5.0, "A great beach area!!", "Santa Monica Bay is great beach area!! (I live further south) This location is amazing on the water in Santa Monica. There is so much to see and do here. Shopping, eating (especially The Lobster on the pier), etc."], ["Reviewed 3 weeks ago", 5.0, "Definitely a place to see", "This area is a must see, especially for someone who has never been to LA. It was about a 20 to 30 minute drive from downtown LA. The pier has lots of interesting characters, souvenir shops and kiosks. There are restaurants as well with indoor and outdoor seating. The amusement section is small, but children and adults alike can have a good time with the rides, or the carnival atmosphere.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Summer is here in January!", "Yes, with 72 F or warmer up to 84F this is the place to be, roler blades, bikes, you name it, restaurants and of course the famous beach. come and play. recommended MeuterMedia"], ["Reviewed 3 weeks ago", 5.0, "Shore is nice!", "Park anywhere you like to take in this lovely coastline! Pay lots are abundant, but so too is ample free parking up Temescal Canyon, below Pali High (a locals secret). You can enjoy the Bay during the day for all the right outdoor reasons- bike or skate for miles on the smooth bike path or choose to walk in the water along the shore as you beach comb for shells and other treasures. Did you know sunset over the coast is a great photo op, too?! All of this is a wonderful, relaxing escape from day to day hassles! This has been my family’s go to place for 3 generations and the magic still holds true!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Relaxing place", "The beach near the Santa Monica Pier is always crowded on weekends and when it is good weather (almost always it is good). Great place to walk near the ocean and just relax."], ["Reviewed 3 weeks ago", 5.0, "Great for staying active", "This was a fun cute area of Santa Monica. The pier itself is smaller than I thought. There are more activities on the pier for kids with rides. Outside the pier you can walk, ride a bike, play sport or any other type of activity. Great scene and friendly people.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Just a lovely place to hang out.", "Really enjoyed shopping at Santa Monica Place. Lots of history in the architecture and street art. Lovely arcades full of restaurants."], ["Reviewed 4 weeks ago", 5.0, "A must do when ending the Route 66", "it was one of my child memories to visit this pier when finishing the Route 66 on a motorcycle. Did it and it was worth it. After a very long day traveling looking at the sea and feeling the vibe it boosts all the energy levels lost during the whole day. Cant wait to go back.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Like the East Coast Boardwalk on a small scale", "Fun pier to walk out on; lovely long beach with views to swim or sunbathe on; busy times bring lots of people but the whole thing is a happening CA style. We enjoyed the whole scene. Go out to the end of the pier...it feels like you are really in the ocean!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "good beach", "nice beach to hang out and have some fun with family. There are many shops around the area. It is difficult to park."], ["Reviewed January 21, 2018", 4.0, "The Hotel California On Legs", "Every city in Los Angeles has it's own look, rhythm and dress code and Santa Monica is no different. If you are a woman it's minimal makeup, tanned and no bra. If you are a guy it's tattoos if you are younger, a little more muscle than the normal guy and some expensive if you know what you're looking for piece of clothing or accessory. There are no exceptions. You may also pass some transients and sadly economically displaced individuals on the walk from wherever you parked your car to the bay. Be wary of anyone who looks \"out of it\" because looks don't deceive.\n\nNow you are at the beach, and things literally start to get cool. The heat of Los Angeles is replaced by a beautiful just right breeze. The indigenous look of Santa Monica residents is replaced by having the diversity of the world right in front of you. It is a heady mix of tourists from around the world and the residents of Los Angeles who have come to escape the heat of Los Angeles, their busy lives and just have fun, fun, fun. The beach is clean and well patrolled by lifeguards. There are bathrooms on the pier which you should probably use before the family sets foot on the sand and you can just have a great day enjoying your friends and loved ones. Look for any signs and/or red flags that warn you of places not to swim or if you plan on doing a spot of fishing what you should not eat. Afterward, take a walk to Venice, or go eat at one of the many tasty eateries in Santa Monica that cater to all tastes and price points. So wear what the heck you want, take water, sunscreen and comfy shoes for your feet and have a ball. That is what Santa Monica is all about.\nShow less"], ["Reviewed January 21, 2018", 5.0, "When LA gets to ya", "This is the place I went to clear my head - a bit of fresh air while dipping my toes in the cold water"], ["Reviewed January 21, 2018", 4.0, "Great", "We went to Santa Monica for a day out it was such a great place to visit and lots to see and do. Well worth going to."], ["Reviewed January 20, 2018", 5.0, "Santa Monica Fog", "Great place to visit. The Pier and attractions are worth the trip. Take a walk along the beach to Muscle Beach. We also went at night where one of California's famous fogs moved in and you could not see 10 foot in front of you. It then cleared after an hour, an incredible sight.\nShow less"], ["Reviewed January 20, 2018", 5.0, "A nice day trip from Los Angeles", "We took a bus from the airport area to get here in 50 minutes. It was a Saturday and there were a walking street and market near the pier. We walked around and took a lot of pictures. The bay was very nice but the water was VERY cold during our visit. Anyway, it is a MUST visit attraction when in the area.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Family", "Great place to visit and shop. A lot of great places to dine in. It is also a great family getaway and I would definitely recommend it."], ["Reviewed January 15, 2018", 4.0, "Great for kids", "Something for everyone, but there's nothing that compares to the beaches in Australia. The water looked cold, but there was still people out swimming, flags lined the beach, as well as crosses for the fallen soldiers which was very emotional."], ["Reviewed January 13, 2018", 3.0, "A nice walk along the beach towards Venice Beach", "THe highlight is the Monterey Jetty where Route 66 ends. Photo opportunities aplenty here! A nice somple beach that also has many surfers."], ["Reviewed January 13, 2018", 4.0, "Great Stroll along the pier and beach.", "you have to go out on the concrete walkway to the beach edge. It was The day after Christmas so it was a little cold, but the views were spectacular!"], ["Reviewed January 11, 2018", 4.0, "Classic landmark", "We stayed near the pier so it was only a short walk. A bit busy as it was Christmas, but good fun never the less. Paddled in the Pacific to get rid of our jet lag. There are a lot of homeless people there which we weren't expecting, very sad to see in a country with such wealth.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Love it here", "Santa Monica is one of my favourite places in the LA area - the nostalgia of the pier , the food options and the shopping are all great.\n\nIt’s busy and very touched by human hand but you’d still never know that LA was just a few miles along the boulevard\nShow less"], ["Reviewed January 9, 2018", 5.0, "Santa Monica Pier", "Such a beautiful place to see. We hired a bike at Venice Beach, rode over the pier & spent about an hour there. Not really anywhere on the pier to site down and eat however there is plenty a few minutes walk away."], ["Reviewed January 9, 2018", 3.0, "Cheesy and Not Especially Scenic", "I was in Santa Monica Bay 20 years ago when I was much younger and sort of like it. However, in the recent visit, I feel it is not as good as I remember. Possibly it is also because the day I visited (the Saturday before New Years' Eve), I feel it is overcrowded and the atmosphere is too cheesy.\n\nThe beach was crowded but the water did not too tempting for swimming. The beach itself is also not specially scenic.\n\nIf this is your first time to Los Angeles (or, even the first time to the United States), it can be an interesting experience and a good photo opportunity. For people who are local and been to LA many times, there are other better (more scenic) beaches to visit.\nShow less"], ["Reviewed January 7, 2018", 3.0, "Santa Monica Pier", "My husband, son (age 48), and I wanted to see Santa Monica Pier on a recent trip to West Hollywood to visit our younger son, so we went. We are from Sonoma Co and used to the San Francisco pier and the Monterey pier. I expected to see something like the Monterey pier. It is not!\nThe beach is beautiful and seems to go on for miles, but the pier itself had a lot of cheap touristy stuff on it, no restaurants, and an amusement park next to it. There were also 3 \"preachers\" along the pier.\nIf that is what you are looking for, then the pier would be fine. We had hoped to find a nice seafood restaurant on the pier, as there are in Monterey, so it was a let down. We decided that it was not a place to which we wished to return.\nWe went back to the Westlake shopping center and ate at a restaurant called the Italy, which had excellent Italian food.\nShow less"], ["Reviewed January 7, 2018", 5.0, "be ready to swim", "nice warm sand, bring your drink to cool down. nice sun tan is recommended. do not worry about getting wet"], ["Reviewed January 5, 2018", 5.0, "Feels the teen spirit", "With a small amusement park on the pier, the vibe at Santa Monica is quite teen-ish. Yet it's a beautiful beach with a lovely backdrop of hills. So many options to eat and shop makes it an ideal day for a day out."], ["Reviewed January 5, 2018", 4.0, "Who doesn't like the beach?", "OK, for visitors...DO NOT swim too close to the S. M. Pier. Bacteria from birds all around the pier is in the ocean and not great for humans. That said, it's a must visit. A lot of traffic on weekends. Great restaurants nearby. Rent a bike and ride along the path past Venice to Marina Del Ray.\nShow less"], ["Reviewed January 5, 2018", 4.0, "A great place to visit", "We visited this location in Dec 17, and it was very quite. There was heaps of parking available. The Pier was great we stayed to the evening so the kids could goto the fair. A must see if in the LA area."], ["Reviewed January 4, 2018", 5.0, "Beach and games", "Nice beach with lot of playing options. Good restaurants for kids and all type of age people. Enough parking on peak hours too. Everywhere fun and people are busy with activities."], ["Reviewed January 4, 2018", 5.0, "Great place to go to the pier, beach, farmer's market, and eat!", "We love spending a half day or more in Santa Monica. We often go to the Saturday Farmer's market on Arizona and get organic produce. We love to go to the pier and walk around, sit on the beach and make a sand castle, and eat at Bubba Gumps. It's a great place to spend the day!\nShow less"], ["Reviewed January 3, 2018", 5.0, "This is about the bay, not the pier.", "I thought that the title of this \"place\" was kind of funny -- \"Santa Monica Bay\", but the address is for the pier. Well, the pier is fun, but that's a review for another day. This is about the bay itself, the long crescent that runs down from Malibu to Palos Verdes, that contains a host of sea life, sailboats, fishing boats, usually an oil tanker or two, with an astonishing amount of Marine traffic on its western edge.\n\nThere are some key geographic markers for the landlubbers and sailers alike. For me, it starts at the north with the Malibu pier. Some brave souls will anchor nearby, as the depth is relatively shallow and take a kayak in, but there's no official landing: you'll have to surf in and beach the kayak. Then there's the Santa Monica Pier, (the address above). That has a lot of history, and still has the old-time 20's vibe to it. If you're out to sea, you'll be sure to notice the seals and sea lions that hang out on the buoy near the pier, and watch out for the submerged shoals north of the pier. It's a good marker--we like to sail up just past the pier, and tack back down toward the Marina. If the wind is right, we'll set the spinnaker just to put on a show for the kids on the pier.\n\nAlong this stretch as well, you'll see parasailers (especially in summer) being towed by speedboats along the beach, which is also a pretty sight. Some other marine life to look out for include Pacific sunfish basking near the surface, and not infrequently a curious dolphin or three. And if you're fishing, you'll probably meet a seal trying to steal your catch.\n\nFurther south, there's the Venice pier, and the Marina Del Rey harbor entrance, marked by a giant American flag. There's a distinct aroma here, as a large colony of sea lions can be found hanging out on the breakwater year round. Further south, you'll almost certainly pass an oil tanker riding at anchor near the El Segundo refinery pipeline -- if you're on a keel boat at low tide, be careful of the snags! You'll pass under the LAX flight path on your way to King Harbor, which is a fun stop. Pro tip: you can reserve a mooring at basin 3 for 24 bucks a night should you need to stop on your way up or down the coast.\n\nSouthern tip ends with Malaga Cove, named after one of my favorite cities in Spain. The Palos Verdes cliffs rise up, covered with some of the most expensive real estate in the Los Angeles area.\n\nYou can get charters and daytrips for sightseeing, fishing and whalewatching on the Bay from Marina Del Rey and King Harbor. It's the fastest way to get out of the city, and deep into nature within at least three hundred miles. Or you can just rent a Sabot or Lazer, or paddleboard and just tool around the marina. One note of caution: paddleboarders, please look out for the boats: they don't have brakes! Crossing in front of someone's bow could lead to less than optimum outcomes!\nShow less"], ["Reviewed January 3, 2018", 3.0, "Good News, Bad News", "Here’s the good: It’s really fun to walk on the pier. Take a ride on the merry-go-round and then have a great hamburger at Pier Burger. For a high-end experience, have martinis and lobster at The Lobster.\n\nThe bad: There has been a lot of crime on that beach and under The Pier. The ocean has tested as one of the dirtiest. It’s not safe at night to be on the beach at all.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Friendly Santa Monica", "Santa Monica is a friendly place to visit. The Pier is the main attraction. Lots of rides for the kids, and many restaurants within walking distance at all cost levels. If you swim it is best to walk a hundred yards away from the pier before you put down your blanket. Water is cleaner away from the pier. Water is never Mediterranean warm in the Pacific. Don't be surprised if it's a bit chilly. The Promenade is three blocks from the Pier. Take a walk down the shops. The view from the top of Ocean Blvd is spectacular. Venice is ten minutes down the shore, and Malibu is thirty minutes up the shore. You can ride a bike on a path next to the ocean for miles, if you wish. Or take a hike in the mountains above Malibu. It's a friendly place.\nShow less"], ["Reviewed January 2, 2018", 5.0, "A must in L.A.", "Great place to spend a day alone or with family/friends. Many places to take pictures and near to the Hollywood area (if you have a car). Totally recomended."], ["Reviewed December 28, 2017", 5.0, "took grandkids on outing during school vacation", "beautiful grounds , and views , lots of activities for children , worthwhile to go , small aquarium for $5 entrance fee"], ["Reviewed December 26, 2017", 4.0, "Good decent property", "We visited in may 2017 & stayed there for 2 nights , hotel staff is pleasant & helpfull , it's ideally located."], ["Reviewed December 25, 2017", 5.0, "Dream Baby Dream", "Sun,Beach and Sand.. Take your stuff lay on the beach and have fun ! its the best beach ever in LA !"], ["Reviewed December 24, 2017", 5.0, "Beautiful fun family spot!", "Beautiful place to bike ride to or rptake a walk along beach and out to pier. We didn't have time to go on amusements, but looked like lots of fun. Lovely day for a walk, and not to far from shopping centre"], ["Reviewed December 23, 2017", 5.0, "Views", "Santa Monica, and every other beach I visited during the week I spent on the west coast, blows away all expectations one may have based on what can be seen on television or the internet. Physically go and see for yourself!"], ["Reviewed December 22, 2017", 5.0, "Rides, rides, rides!", "Santa Monica pier is always fun for swimming, sunbathing, eating, drinking, shopping, surfing, fishing, and...carnival rides! Parking at the pier is reasonable and will save you loads of time. Many tourists don't realize you can park right on the pier and save your walking for the attractions.\nShow less"], ["Reviewed December 21, 2017", 3.0, "Good for sunset viewing", "這裡很美！但水蠻冷的！ 基本上只待1、2小時的話推薦將車停在橋上，因為不貴的！ 而停周遭大型停車場反而超貴。 （麥當勞旁那個停車場）\nWater was cold, but the sunset here is really beautiful! You can also have the colorful ferries to be your photo shoot background.\n\nParking is not easy to find during the weekend. Highly recommend to park \"on the pier\", because the fee is actually not bad compared to the public one( next to the Macdonald), ifffff you only will stay on the pier for about couple of hours.\nWatch out your kids, because the sea waves here are very crazy and dangerous.\nWe didn't try the restaurant here called water grill or something, but I heard it was a good place. I might give it a try next time when we visit here!\nShow less"], ["Reviewed December 20, 2017", 3.0, "Long stretch of beach", "Nice big beach. Small waves but watch for under current. Plenty of firm and soft sand. Gets very busy in summer. Santa Monica Pier nearby and a bit touristy. Plenty of homeless around but they keep to themselves."], ["Reviewed December 20, 2017", 5.0, "worth it", "well worth the trip as well as the pier you can also go to Venice beach at once which is a plus. parking however is over priced and you don't realiase to after the beaches actual parking is cheaper."], ["Reviewed December 19, 2017", 4.0, "Santa Monica Environment", "Santa Monica provides an array of options regarding shopping and eating but it is very hustle and bustle. Traffic is congested. When they close off the streets in the evening, the atmosphere is full of an artsy vibe with vendors and musicians. Definitely arranged for tourists but still a cool place.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Good both day and night", "Had a morning g walk and beach activities happening everywhere. Lotsa of life and adventure even especially at nights with the carnival and lights.\nGo early to the shopping g mall and 3rd street to walk before heading back for a seafood meal at Gumpa. Look for Domino, he's the best waiter there.\nShow less"], ["Reviewed December 18, 2017", 4.0, "Afternoon in the Sunshine", "After being rushed through Hollywood in the morning we spent a relaxing afternoon in Santa Monica. The pier is pleasant to walk along the pier look at the scenery and soak up the atmosphere. This is of course where Baywatch was filmed unfortunately no sign of Pamela Anderson!. This was our first full day in California and i liked Santa Monica very much. It has an old world charm about it. Do not be alarmed by the vagrants you see walking around they do not seem to bother anybody. After a walk we went into the town and found a splendid English pub just up the road called The Olde King's Head. You can sit outside in the sunshine watch the scenery and drink draught Boddingtons at 8 US$ a pint!. Better then Bud Lite!. Great pub in a nice town!. Well worth a visit!.\nShow less"], ["Reviewed December 17, 2017", 3.0, "A tourist trap clean beach.", "Most people come to the Pier where you ll be met by various vendors and typical tourist attractions, amusement park, ferris wheel, hamburger stands, clowns, sketch artists, etc. Very few people venture to go down to the beach, which has nothing special to offer, Other nearby beaches proved to be superior. Spend 30-45 going down and up the Pier take all the selfies you want and then head for downtown Santa Monica just few blocks away. Enjoy the sun.\nShow less"], ["Reviewed December 15, 2017", 3.0, "Life is a beach", "They have great ocean view, amusement park, food, drink and life here ~ You should definitely visit here when you come to Los Angeles."], ["Reviewed December 13, 2017", 5.0, "Like in Baywatch!", "Excellent beach. The lifeguard posts make you feel like you are on stage of Baywatch :) The Santa Monica Pier gives this area a great support. One of the best beaches I have been to."], ["Reviewed December 10, 2017", 5.0, "Relaxing Day at the Pier", "Visiting Santa Monica Pier was one of the highlights of our trip. It was a great day trip and my 2 kids (ages 6 and under) enjoyed it. There lots to see in a relatively small area so you can just park in one spot and walk around for the whole day.\nShow less"], ["Reviewed December 7, 2017", 3.0, "Nice to see but way overated!", "IMO, this is so much nicer from a distance. Further down from the pier is a nice walk but the pier area is crowded and the people not generally real respectful. I have seen this area just deteriorate over the period of many years! Still, if you need an activity, it is an activity.\nShow less"], ["Reviewed December 6, 2017", 5.0, "VitaminSea", "What could be better than a light tan at one of the most sexy beach strips in the world? Don't forget your sunglasses ;)"], ["Reviewed December 6, 2017", 5.0, "A winters day Santa Monica Style", "A peddle along the bike path on Ocean Street, atop Santa Monica Bay in the warmth of a winters day is just a damn nice place to be!\nYou can rent a bike down near the famed pier and just peddle your way up and along... Easy and fun and the view is right there at your finger tips!\nA must for anyone who just loves to get out in the air on a glorious Californian winters day!\nVICKI\nSydney\nAustralia\nShow less"], ["Reviewed December 6, 2017", 3.0, "Average beach, pier is fun", "Beach is underwhelming - crowed and not as pretty as the pictures look. The pier was the highlight (if a little tacky) worth a visit."], ["Reviewed December 4, 2017", 5.0, "Beautiful sunsets", "The Santa Monica Bay and Pier is very lively and entertaining, the beach is beautiful and its a great walk to many places to eat as well. Beautiful views of the sunset!"], ["Reviewed December 3, 2017", 5.0, "Great day at the pier", "Worth getting down to this iconic location.....fast food, rides, people fishing, it is a vibrant location to spend a few hours or the day."], ["Reviewed December 3, 2017", 5.0, "Was a great experience", "Loved this beach, parking was easy and it was the happy medium between the calmness of Malibu and the business of Venice beach."], ["Reviewed November 30, 2017", 4.0, "as seen on t.v", "santa monica gives you the scenery of l.a as seen on tv with the dock and the crowded beach with lots of activities to do.great location for choosing to stay there."], ["Reviewed November 27, 2017", 5.0, "Must see", "To truely enjoy the Los Angeles experience must visit the Santa Monica Pier and beach. We where on the hop on hop of bus tour and spent 2 hours here"], ["Reviewed November 26, 2017", 5.0, "Beautiful area", "Just stopped for half an hour here, but next time we will stay overnight (one or two nights). Great Beach and shops."], ["Reviewed November 22, 2017", 5.0, "Beautiful Pier", "Famous end route 66.Theme Park and restaurants. A must to visit, only a day trip from LA. Romantic place for couples. Ideal for family outings."], ["Reviewed November 22, 2017", 4.0, "Great Day Out", "We stopped here on our Hop on/off bus tour. It was one of the places we wanted to visit on our travels and we weren't disappointed. Great pier, plenty going on, end of Route 66 sign. Weather wasn't great the day we went so didn't use the beach.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Well worth the visit!", "The pier was amazing and the beach was beautiful, I'd recommend a full day here. We went on a sunny day and the water was so refreshing. The beaches aren't like Aussie beaches and it was really cool to see a beach with so much sand. My favourite part of Los Angeles!\nShow less"], ["Reviewed November 20, 2017", 5.0, "Clean and Beautiful", "The beach is gorgeous and the sunset view is one of the best in the area. Great places to eat in the area."], ["Reviewed November 20, 2017", 5.0, "Lovely.", "What a scenery! We loved our stop here and walking around and seeing some amazing properties around. Made us very jealous!"], ["Reviewed November 19, 2017", 4.0, "great place for a walk", "Santa Monica was by far my favorite place out of my trip to LA. It is very walkable and has lots of restaurants and shops by the beach. The pier and beach walkway, as well as the beach are great and relaxing. You can see people having a good time exercising and having fun. If you go to Los Angeles definitely visit Santa monica\nShow less"], ["Reviewed November 19, 2017", 4.0, "Go for the sunset", "Santa Monica Bay is a must do place when in LA. The beach is nice , but don't spent to much time here. Get your baywatch sunset picture and look online for the best food truck nearby. For shops: get your local shirt (for cycling fans) at th Rapha store on 4th street.\nShow less"], ["Reviewed November 18, 2017", 5.0, "You never know WHO you will see here! lol", "Hopped off the Hop on/ hop off bus and spent a little time here. So glad that I did. I walked the pier but it was the sight of the huge beach and mountains in the background that made my day. And if I can post a picture on here... look who else was there that day. lol\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful beach", "Always the first place I head to when I arrive in LA. Such a relaxed vibe. The beach is so clean and during the weekdays not so densely populated as it is over the weekend. Lots of places to eat and drink. I like to grab a slice of Joes pizza on Broadway which is the best pizza in the world. There are great shops also at 3rd St Promenade.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Nice and clean", "The beach was well right very nice and clean and it was a very inviting family atmosphere while you’re here you must see the Santa Monica pier and have a nice overlook of the day in the mountains"], ["Reviewed November 9, 2017", 5.0, "A pretty bay", "This bay is usually calm and pretty. You can go to the beach, swim, fish, etc. There aren't too many stores or shops on the beach, but it can still be fun. For shopping, you are better in Venice."], ["Reviewed November 8, 2017", 5.0, "Loved this area", "We walked along Venice Beach to Santa Monica Pier! Quite a way in the heat but soooo lovely. There was a lovely atmosphere here so relaxing. It was a great place to visit want to live there!"], ["Reviewed November 8, 2017", 4.0, "A large impressive Beach", "One of those places that you must visit if you are in LA. Easily reached by Metro. However be careful as prices on the old pier are extremely expensive."], ["Reviewed November 8, 2017", 5.0, "Great Bay and Atmosphere", "First time visit here and will be back again. The Bay has a great atmosphere!!! The path to walk along is great and able to be walked by all ages and abilities. A fantastic view where ever you look. Car Parks near by and also able to arrive via public transport\nShow less"], ["Reviewed November 8, 2017", 4.0, "SM summarizes a CA Beach.", "Santa Monica beach captures much of what So Cal beaches are about. Lots of people, cold waters (typically), and not much rain.\n\nTraveler Tip: I've lived in So Cal most of my life and grew up going to the beach. Junior Lifeguards as a child and then surfing multiple times a week or just going for a quick jog as an adult. Santa Monica has a nice blend of activities with the boardwalk and 3rd street promenade so I'd say it's a pretty good choice for someone visiting CA and looking to get the full experience.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Pacific Ocean at its finest", "My son was able to test drive his new skateboard along the boardwalk....something for everyone here...love Santa Monica"], ["Reviewed November 7, 2017", 5.0, "Lovely Santa Monica", "Really nice beach! And nice boardwalk experience. We ate at Bubbas - great seafood place. Based on the movie Forrest Gump. We stayed about a block from the beach so just walked everywhere. Great shopping mall nearby. The beach is like something out of Baywatch."], ["Reviewed November 5, 2017", 3.0, "Pretty view", "We arrived and the beach had large area with crime scene tape. Someone was murdered early morning hours. A lot of bums, sleeping, scraping their back against the tables we are to sit and eat at. Gross. Did see a few dolphins."], ["Reviewed November 4, 2017", 5.0, "A beautiful day by the ocean", "We spent a beautiful day on the fishing pier with a great lunch and ice cream. Parking at the pier is only $1 per hour"], ["Reviewed November 2, 2017", 4.0, "Great beach, pier is fun but tacky", "It is a good place to go, the pier is a bit like a midway, but it gets you out over the waves. The beach is huge, the sand is soft, but the water is cold! Lots of fun."], ["Reviewed October 31, 2017", 4.0, "West Coast Beach LA", "This bay is accessible by blue line metro station. This bay also consists of pier, which is the main activity area. By the way,it is a good place to relax."], ["Reviewed October 29, 2017", 5.0, "Doesn't get better in Cali", "Going to the SM bay never gets old. Always something to do throughout the year. Tons of restaurants nearby in downtown Santa Monica- things for kids to do and just a great place to hang out- Second best people watching (Venice beach best). As a native Californinian, I still manage to get here at least once a month.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Huge seaside", "Lacking in good bars and places to eat although we did find a nice restaurant ,it's a huge beach with the pier being the hub of activity"], ["Reviewed October 28, 2017", 1.0, "Those lovely Days are no longer ....", "Every other week, my boys and I used to make a day of it at Santa Monica Beach and the Promenade. Wandering along the walkway and pier, swimming, biking and enjoying food and music along the Promenade. As of a year or so ago, those lovely days are no longer . The once fresh breezes blowing ocean air are now blowing the inescapable smoke of a horrifyingly ridiculous amount off hookahs, cigarettes, marijuana and e- cigarettes. And the people smoking these .....well, they could care less if they are standing next to a 3 yr old blowing their smoke directly into a child's face / lungs.\nShow less"], ["Reviewed October 27, 2017", 5.0, "LA Birthday57", "Visiting LA for my birthday for 1st time. We took the Hop on Hop off bus tour. Love the atmosphere, nice and relaxing...I will be back and this will be my \"things to do\" list."], ["Reviewed October 27, 2017", 5.0, "Great Beach", "We were staying in LA and wanted to see something different. We go Uber to drive us over to Santa Monica. We live on the East coast and didn't want to leave until we saw the West coast. Was amazed at how much beach front there was. There was so much to do on the pier. Loved it\nShow less"], ["Reviewed October 26, 2017", 5.0, "Day trip", "We visited on the hop on hop off bus and spent a few hours wandering down the pier. The beach is huge and really clean. The area is very touristy and attracts huge numbers of all ages. A very interesting place."], ["Reviewed October 23, 2017", 5.0, "Lovely", "Great beach with lovely pier, very clean and easy parking. Lots of places to eat. Great people watching."], ["Reviewed October 20, 2017", 5.0, "Clean beach", "We are not really lay on the beach people. So we really went to look and soak it up. The beach is so clean sand goes on and on and beautiful.\nThe pier was a little disappointing. Not sure what we expectected however felt let down.\nDefinetly and over used and out of date tourist attraction.\nI would so see myself relaxing all day on this beach if l had extra days\nShow less"], ["Reviewed October 20, 2017", 4.0, "Really enjoyed our visit to the Bay and Santa Monica Pier!", "We visited Santa Monica Pier with our 2 kids (age 6 and 3) as part of our week-long spring break vacation in the LA area. Overall we really enjoyed it. We played some of the games and went on a few of the kid rides, and the ferris wheel. Views were spectacular. It was a bit crowded but we managed with a stroller just fine. Carousel was also a classic experience. Beautiful at night with the skyline and the pier all lit up. It was a bit of a walk from where we parked to the pier entrance but doable even with 2 small kids. This place is worth a visit!\nShow less"], ["Reviewed October 19, 2017", 3.0, "Beautiful view", "Surprised by the artificial lights they have on the beach and how late they allow cars to enter. I live on Atlantic side and our beach has a cutoff time for vehicles entering and no artificial lighting, disappointed at the litter and lack of respect. Shops, restaurants, and such to enjoy. Regardless, go and get your feet wet and sandy and stay for the beautiful sunsets. It's iconic area and need to see at least once if you're visiting,\nShow less"], ["Reviewed October 18, 2017", 4.0, "Nice place for few hours", "If you want to do something different you should go to Santa Monica at the Pier or eating and drinking with friends in one of the restaurants and bar on the strip."], ["Reviewed October 17, 2017", 5.0, "Best Bike Ride Ever", "My sister and I visited here on our last day in LA as it is closest to the LAX International Airport (>30 mins away).\nWe Hired Bikes from Daniel and the Marina Del Ray and rode Washington Blvd down to Santa Monica Pier.\nBest decision ever, beautiful morning to ride, exciting sights to see, traffic quite light in both directions on the paths.\nAmazing Day overall. Thank You LA for a fabulous trip\nShow less"], ["Reviewed October 16, 2017", 5.0, "santa monicea pier", "amazing place and experience . the pier itself is so live with tons of people, performers, food and the amusement park with rides ferris wheel and roller coaster . a must go!`"], ["Reviewed October 16, 2017", 5.0, "Super fun", "Took my nephews for their first time. If your a AAA member you get a discount on a wristband for the rides. Had some Dippin Dots which taste amazing. Great place to walk around and people watch, take pictures and see the beauty that is California.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Very nice", "We stopped to contemplate the spledid view and to grab a bite. Very peaceful and beautiful. The little amusement park adds a little something good."], ["Reviewed October 12, 2017", 5.0, "Fantastic!!", "Drove down to Santa Monica on an afternoon as we wanted to catch the sunset over the ocean. Beautiful place, laid back and relaxing. The pier was fun, went on the ferris wheel just before the sunset and it was fantastic. Route 66 finish in Santa Monica. Great shopping on 3rd Avenue, plenty of restaurants and bars.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Good beach", "Very clean beach that has a very good viewing area to just sit back and relax and enjoy. You can park off on the road and walk to view the waves and ocean view. Very peaceful setting."], ["Reviewed October 9, 2017", 5.0, "Beautiful beach!", "We had a great time! the beach parking was $10 which was fine.. wanted more food and drink selections though"], ["Reviewed October 9, 2017", 5.0, "Beautiful view!", "Excellent view point of Santa Monica bay and pier. Clean beaches and green area to view Malibu. Great place to take photos"], ["Reviewed October 8, 2017", 5.0, "Lovely beach and pier", "I only had one day in LA, and I knew I had to stop at a beach. I decided on Santa Monica because reviews were good and it was close and easy to get to. There were a lot of people at the beach, but it didn't feel overly crowded and it was still very peaceful and relaxing walking along the beach. There was also plenty of open space for picnics or sports or just hanging out. The pier was pretty neat and had a variety of attractions and restaurants. The view from the end of the pier back at the shoreline and city was pretty neat as well. It was definitely a nice afternoon at the beach, and I would 100% go back if I'm in the area again.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Great place to be with family", "I have visited during the day, best time would be evening with family and children. Can go for nice long walk."], ["Reviewed October 6, 2017", 3.0, "wanted to see it. not fabulous.", "we went here at night, had to check it out. we paid 12.00 for parking and only stayed for like an hour. it was a weeknight and most things and restaurants were closed. there was other parking that seemed to be on the wooden pier off to the left that was like 3.00 an hour. lots of teens around. was a little worried about safety. really enjoyed watching people fish off the pier at night.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Beach, Beach beach", "One of the nicest beaches in California, The sound of the waves breaking into the beach is mesmerizing,"], ["Reviewed October 5, 2017", 4.0, "Great sunset", "Beautiful place, watching the sunset in this location is a bucket list must. Good atmosphere and food on offer."], ["Reviewed October 2, 2017", 5.0, "It's Santa Monica...", "Beautiful beaches, lots to see, really good beach eats. Parking can sometimes be a challenge, so get there early on the weekend and spend the day."], ["Reviewed October 2, 2017", 4.0, "Great place great pier great beach", "This was one of our stops on the Los Angeles city tour so unfortunately didn't have a lot of time did manage to walk down the pier and walk on the beach the area looks very nice lots of restaurants and aparrently the end of Route 66 on the pier would suggest spending a bit longer here and Venice beach not far away either\nShow less"], ["Reviewed October 2, 2017", 5.0, "Iconic and worth a visit! Free parking under 90 minutes", "Keep your visit short and you could enjoy the Santa Monica Pier and Beach for FREE. All public lots off of 2nd, 4th, 5th are FREE under 90 minutes. All the beach parking lots are about $12/day or part thereof. My kids love the fitness obstacle course on the south side of the pier. You can see alot of folks doing their tight rope, Cirque du Soleil type acrobatics or just gymnastics conditioning all around. Rent bikes, go on rides on the pier or just buy junk food. It's fun if you feel like dealing with the crowds. Groupon recently had an all day pass for the pier rides. Avoid coming on Saturday, it's just nuts. Do Friday afternoon or Sunday late in the day to have a better chance at finding a decent parking spot.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Nice beach", "Planned to swim at the beach next to the pier, The pier was a great experience, plenty to see and places to eat, it had a good view of the beach and nearby mountains, I went swimming in the surf which at the time was not too rough, one interesting thing to note is the board walk on the sand from the pier down to the water. The sand is nice and soft and white and clean.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Beautiful", "It was beautiful,we enjoyed the pier and the entertainers, but there was a ton of aggressive homeless people."], ["Reviewed October 1, 2017", 5.0, "Beautiful white sands", "Santa Monica beach is beautiful with miles of soft white sand bordering the beautiful blue Pacific Ocean. There's plenty to see and do including watching the beautiful people working out; cycling or skating along the promenade and going on the rollercoaster on the pier. Oh and swimming in the warm water or learning to surf or paddle board. All in all a wonderful place to relax.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Gorgeous views", "The Bay has natural stunning beauty with miles of sandy clean beach and gorgeous views and cool sea Breeze. The beach has pier and has many restaurants, attraction and restrooms there along with sufficient parking. Must visit when in LA."], ["Reviewed September 28, 2017", 5.0, "World famous beach. Clean and vibrant", "We went in an afternoon it was little crowded but very nice and vibrant. People looked very cheerful and happy. Lots of tourists from US and other part of the world.\nThere is a Metro rail to reach this place it's very convenient and cheap. The place is a beach with parking facilities and lots of fun activities including restaurants. Most of the places in this area appears to be familiar because it appears in Movies and TV series.\nIf you are in LA don't miss it.\nSince it's a beach summer dress will be suitable. Have a comfortable foot wear for walking take enough water\nShow less"], ["Reviewed September 27, 2017", 4.0, "On tour with the Mclintons", "Went for a stroll along the pier to see what it had to offer, it has rides and food stalls, nice to go out to the end and check the surf. Very crowed but a lovely thing to do."], ["Reviewed September 27, 2017", 5.0, "amazing vibes and excellent view", "I love Santa Monica beach, clean and get good vibes from here. Around you can rent bycycle and go to Venice beach, use attractions and buy something in gift shops."], ["Reviewed September 24, 2017", 5.0, "Just fun and a beautiful view", "Easy parking right at Santa Monica Pier and only $12.00 for all day. Shorter term parking available too. It was a great treat."], ["Reviewed September 24, 2017", 5.0, "Beautiful sunny day at the beach", "It is a great to visit with your family, or also for couples, I believe there's something for everyone. We really enjoyed it. We spent a whole day there, went by car and parked it in a municipal parking lot next to the pier, really don't remember how much it was, but it was cheap.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Always beautiful", "Is it ever not a beautiful day here? I make it a point to walk around Santa Monica every time I come to the LA area. It's gorgeous and the sun is always shining."], ["Reviewed September 23, 2017", 4.0, "Great to see BUT Crowded and Water Warnings Occur", "The Santa Monica Pier can really be fun, and everyone should see it at least once. The Bay itself, well....it's Great to see BUT Crowded and Water Warnings Occur.\nIf you are thinking picnic and staying the day, be sure to check the warnings online for water safety and cleanliness.\nBeautiful to sit on the grassy areas and take in all the sights.\nShow less"], ["Reviewed September 23, 2017", 3.0, "Beach day", "During a trip to LA decided to have a beach day so drove down to Santa Monica, we parked at the pier, loads of parking spaces, we paid $12 for the day. The beach is massive loads of room and if you walk away from the pier it gets quieter. We hired bikes and cycled all the way down and past Venice pier, very safe, large flat cycle path, with loads of places to stop, like muscle beach, Venice boardwalk etc. Had a great day out and swam in the Pacific.\nShow less"], ["Reviewed September 23, 2017", 5.0, "A gorgeous place to see the Pacific Ocean", "Route 66 ends at the cliffs overlooking the Pacific Ocean in Santa Monica. The beach is absolutely beautiful. The best time to see it is in the early morning before the crowds come, and it is very peaceful to stroll along the shore."], ["Reviewed September 20, 2017", 5.0, "Awesome place and great beach vibe", "This is one of those places that you go to because you are in LA. Because the pier is the start/end of route 66 it is another great reason just to go there.\nFound people here to be laid back and very unstressed. Great feeling walking around the place.\nOnly negative is along the top of the beachwalk there are a number of homeless people sleeping etc. However, it still feels quite safe.\nShow less"], ["Reviewed September 19, 2017", 4.0, "lovely massive beach and nice pier", "used the hop on hope off bus to get here, great beach, seems to go n for ever, and very wide, the pier was very good, worth a visit,,,some nice bars/restaurants on the front too,,"], ["Reviewed September 19, 2017", 4.0, "Nice", "Pretty bay but unfortunately there seems to be a problem with drug addicts and homeless. It did not bother us and we did not feel unsafe but this is something to consider."], ["Reviewed September 16, 2017", 5.0, "A fiesta !", "It's a beach and pier with an atmosphere of its own. Very distinct, quaintly charming yet teeming with visitors of all ages at all times. There are attractions down the pier on both sides of the wooden path for children and adults . Enchanting music, mouth watering smells of all kinds of food from several stalls , ferry wheels and merry-go-rounds with squeeling children on the one side and those getting sprayed by playful beach waves on the other only add to the magic. Please go with some time on hand - you would not want to return !\nShow less"], ["Reviewed September 15, 2017", 5.0, "So Cool!!", "this place is everything you expect. from people on their skate boards, roller skates, bikes, hanging off the gym bars in the sand or walking the tight ropes it's all happening! The beach is fantastic and rolls for miles. The quaint old pier with sideshows, street performers and rides. Go see it!!\nShow less"], ["Reviewed September 14, 2017", 4.0, "another must go", "a real nice, clean beach and the pier is a must go to take some good pictures. And surely a place for Route 66 fans - as this is the western end of Route 66 :)"], ["Reviewed September 13, 2017", 4.0, "I Left My Heart in Santa Monica", "Few know the historic significance of Santa Monica Bay. Spanish explorer, Juan Rodriguez Cabrillo commanded the first European expedition to the west coast of the America. He dropped anchor in Santa Monica in 1542, a mere fifty years after Columbus sailed the ocean blue to the new world in 1492. There was no Panama canal then so he had to navigate the treacherous water around the south tip of South America.\n\nFast forward to modern times. One might wonder why Los Angeles was not first settled with Santa Monica as the epicenter. The rich and famous discovered it, including William Randolph Hurst who built his mistress Marion Davies a palatial mansion right on the beach. The mansion is long gong but the olympic sized pool remains open to the public along with her guest house -- which by today's standards could be considered a modest mansion -- also open to the public.\n\nThe best place to appreciate the panoramic vista of the bay is along Pacific Palisades Park. Lined by palm trees, it is in my opinion the most picturesque spot in Santa Monica if not all of Los Angeles. It begins at Pico Blvd. and winds north all the way up to San Vicente Blvd. From there you can view from left to right, Palos Verdes peninsula, Catalina Island, the iconic Santa Monica Pier (with roller coaster and ferris wheel at the end) and Malibu.\n\nDon't miss the 3rd Street Promenade mall that begins at the famous Miramar Hotel (every movie star from the golden age and luminaries from all over the world have stayed there -- and where I honeymooned). Walk south to Santa Monica Place outdoor mall.\n\nThere are many great restaurants that adorn Ocean Avenue, with open window views of Palisades Park and the bay. If you are lucky, you may see a pod of Killer Whales that call the bay their home.\nShow less"], ["Reviewed September 13, 2017", 3.0, "It is a nice place to people watch and look at the ocean from a world famous pier.", "It's free to walk to and enter if you are staying in Santa Monica. I'd park at the Third Street Promenade parking (free), earlier in the day the better, and walk down the driveway towards the Pier. It's a nice pier with attractions and rides for the kids. On a clear day you can see as far north as Pt. Dume and and far south as the Santa Catalina Islands. As the day progresses though, it becomes slightly sketchy as a certain element starts to show up. Nothing to be alarmed about, but definitely more adult at that point. If you are staying in the City, take the Expo train line, which goes directly there.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Must See", "If you are in the area, this one is a must see. It's iconic. It's beautiful and dirty all at the same time. Glad my daughter and I were able to take it all in and stroll down the beach to the next stop. The walkway between the beaches was fun and we enjoyed people watching.\nShow less"], ["Reviewed September 7, 2017", 5.0, "A walk along the beach", "A little windy today when we arrived for an hour break there where quite a few wind surfers doing their moves and making people gasp well worth stopping off and watching"], ["Reviewed September 6, 2017", 5.0, "What a Great Place", "What a great place to visit, the pier and beach is amazing!! There is also great shops and restaurants. I would recommend getting here early as its gets busy in the afternoon."], ["Reviewed September 6, 2017", 5.0, "A must see", "A visit to Santa Monica is a must see and I doubt if anyone would be too disappointed. Can be very busy due to the popularity"], ["Reviewed September 6, 2017", 4.0, "Good to see the sea", "Almost just another beach but with plently of room for all sorts of people and things to do. Great place to just sit and relax and or people watch"], ["Reviewed September 6, 2017", 4.0, "Crowded beach", "The beach was abit crowded at the time we went, but still able to walk along the beach for some distance. The weather was gloomy on the evening we went, so abit chilly without jacket."], ["Reviewed September 4, 2017", 5.0, "A must see if only for once", "but being here for Labor Day weekend was too much - too many people but great for family. Tons to eat and different choices."], ["Reviewed September 4, 2017", 5.0, "Had to make the bus stop here one of my places to see", "The pier is very long to walk to end. Looked like a nice beach it was crowded. However only came by bus to see the santa monica pier just for the heck of it. It had very little interest on pier to me. Might be a nice place for younger children\nShow less"], ["Reviewed September 4, 2017", 5.0, "Beautiful!", "It was a beautiful day and not too crowded at the time we visited, but was filling up by the time were heading out. We didn't eat at any of the restaurants, but I did buy a waffle cone from the ice cream shop. Parking can be costly so if you're lucky, try parking at a meter. There is a three hour limit at $2/hour and that's all we needed.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Good place to spend some time next to the ocean", "Even its a very crowed place, you spend good time next to the ocean. The pier have everything you need from sodas bar to places to eat."], ["Reviewed September 3, 2017", 4.0, "Great day out", "Fantastic place to go. Pier is ok, but rides for the kids are very expensive. Great views and great place for kids to play. Plenty of space to park. Weekends gets very busy."], ["Reviewed September 2, 2017", 3.0, "Great bike ride", "We rented a couple bicycles next to the pier.Ride down the Venice through the park is very nice people watching easy riding on flat side walk.Pier itself little old looking rides also ,need to do the iconic ferris wheel $17.50 for 2 ,but it's the only thing we wanted to do on pier. Note people don't swim around pier septic water .\nShow less"], ["Reviewed September 1, 2017", 4.0, "Nice promanade", "Beautiful pier. Nice shops a nd vibe in the area. Can spend a morning or a afternoon there. Beautiful beach"], ["Reviewed September 1, 2017", 5.0, "Emotional", "I've wanted to come here for so long. There are lots of beautiful sights and it's all very relaxed. (I did not have to worry about parking.)\n\nThey have their own version of Muscle Beach and it was great fun to watch all the trapeze artists and things like that.\nShow less"], ["Reviewed August 31, 2017", 3.0, "Santa Monica Bay - Santa Monca to Malibu", "Santa Monica Bay - Malibu is the place to be. Unfortunately the people of Los Angeles throw their cigarette butts and trash into street gutters and way too much ends up in Santa Monica Bay. Unfortunately, because it could be one of the best in the Nation. Recycle Reduce Reuse. One great things about Santa Monica, the town, lots of great restaurants and bars! All kinds, something for everyone.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Iconic Beach visit", "My son loved visiting Santa Monica. Its a very iconic beach with lots of people around. FYI we did encounter some seemingly troubled individuals late at night that seemed to be homeless and that did make us somewhat uneasy (because they were yelling out from the street corners and lurking on the sides of buildings. I enjoyed walking the trail that goes toward Venice, although we were too tired to walk the entire way. My son enjoyed the water, but it was too cold for me to get in. We walked around on the pier and took in the sites but did not visit any of the shops or ride any rides. My son wasn't too worried about doing any of that. We watched a beautiful sunset, which was great to pictures.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Time to get some sun", "I love Santa Monica beach/pier. It is lively, fun and full of people. Don't forget to ride the ferris wheel at the pier and you get a very nice view from above of the bay and the pier. At night, the lights are pretty. It's safe and it's one of the best pl;aces to catch pokemon.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Lovely day spent at the beach", "My family and I visited Santa Monica pier and beach recently and hard a great day out. We walked along the pier, had a ride on the Ferris wheel and paddled in the water. We then walked along the beach to the Original muscle beach location and watched people practising yoga and gymnastics.\nMy tip would be park in the shopping centre it's cheaper and keeps your car is cooler when you are ready to go home\nShow less"], ["Reviewed August 29, 2017", 3.0, "Simply over rated", "High pressure vendors and over-crowding are the norm here. Don't waste your money getting anything from the restaurant, which was one of the things I wanted to do, very disappointed.\nI guess it is worth a quick stop just to take a couple pictures and say you have been here, but that is about it.\nShow less"], ["Reviewed August 28, 2017", 3.0, "Decent beach", "Spent a few hours here. Pier is a throwback with lots of entertainment on it. Beach is ok. Weather was foggy on the beach but sunny in LA. There are nicer beaches, Laguna, Seal for example. Parking is USD 12 which is steep."], ["Reviewed August 28, 2017", 5.0, "Loved the beach", "Wow, what a fantastic escape from the traffic and the 45 minute journey to go 10 miles. Great diverse community who all complement the surrounding. BEAUTIFUL! Santa Monica pier, entertaining and great place to meet people. My first trip to L A and I stayed on Hollywood Boulevard. I have no regrets as it has to be done, but next time i will be around Santa Monica. My husband and I loved the place and the people, plenty of first class accommodation to be had, well worth a visit.\nShow less"], ["Reviewed August 28, 2017", 3.0, "Visited the Pier", "Took the rail to about 3 blocks from the beach. vendors and amusements on the pier. Crowded and street performers were doing their thing while we were there."], ["Reviewed August 28, 2017", 5.0, "Warm water, lovely sunset, shops and many more!!", "My go to place for evening strolls when in LA!! Loved window shopping and eating fruit cups:) A must go place."], ["Reviewed August 28, 2017", 5.0, "walk the pier", "This was part of a tour we took and the coach brought us just a stone throw away and when we embarked and walked the pier, it was awesome, but so many people there too - in the beach and in the pier. Best to walk and enjoy - there were performers including street evangelist.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great Family Day at the Pier", "Took the bus out to Santa Monica Bay. Loved it there. Lots to do for the family. Great Beach, Boardwalk, Entertainment, and amusement rides and shops and food. Must see"], ["Reviewed August 27, 2017", 5.0, "Great time!", "Had a great time here. Loved the beach, the pier, the shops available and the food options. Definitely a must!"], ["Reviewed August 26, 2017", 5.0, "Pier is like an old school fair with wide beach", "Many things to see, eat, drink and do at this iconic old pier and beach. Fun to see. Rides, shops, pier, beach and people fishing. Interesting facts display near end of pier, about its history and on whom Popeye was modelled. Lots of people - crowded on a good weather day. Caught a normal bus there.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Nice", "Well it's Santa Monica it's just like you see in the movies except you're there for real Whoopee, just go you'll have fun."], ["Reviewed August 25, 2017", 5.0, "VARIETY - DEFINITELY THE SPICE OF LIFE", "Santa Monica is the mid way beach inbetween Venice and Malibu and definitely has a flavor all of it's own. Whether you're looking to do a bit of exercise; stretching those muscles, acrobats, walking the rope, pull ups, biking, skating, swimming, walking, you'll find it all here.\n\nif you're not into that it's also good, you can just watch them perform for fun, wonder and interest and then move on to more tamer things. Visit the Aquarium, go to the Pier - full of things to do, see. eat and performers to listen to .....\n\nThis is probably the best for a family / tourist beach in my opinion.\nShow less"], ["Reviewed August 24, 2017", 3.0, "nice", "this is a nice place to spend some time by the water. if you are in the area ...it's a great place to bike or walk"], ["Reviewed August 24, 2017", 4.0, "Lovely", "It's not as good as I remember from 2010, but it is still a fun place to visit.\nThere is a small aquarium, which only costs about $5, a ferris wheel where you can see the whole beach with an amazing view, rides for those carnival lovers, resturants, ice cream parlours, ocean view and of course souvenir stores. A fun Carnival style attraction.\nShow less"], ["Reviewed August 23, 2017", 2.0, "Santa Monica Bay - Needs Our Clean-up Efforts", "Though you can't compare the beaches of Hawaii in any way shape or form to those on our Southern California shores, it was a sad day to visit Santa Monica Bay (far from the Pier - because it's normally cleaner), to find the water to be very dirty and littered with trash and bits of tar/oil from the rigs off-shore.\n\nI've previously enjoyed coming here - close to LifeGuard Station 24-27, for the gentler waves so you can swim in the ocean, but sadly it's been a tough summer here and we need to clean our bay - again :(\nShow less"], ["Reviewed August 22, 2017", 5.0, "Hire a bike", "We recommend to hire a bike from Venice or Santa Monica and drive to the other side. Very nice to do!"], ["Reviewed August 21, 2017", 5.0, "Great Beach Vacation Spot to Relax", "I visited Santa Monica Bay twice in the past three months. I hope that should give you a hint of how I love this place. The weather was amazing and the ocean wind took all the work stress out of me. I will definitely recommend this place to anyone who is looking to have a relaxing vacation.\nShow less"], ["Reviewed August 21, 2017", 3.0, "Visti to Santa Monica Pier", "The visit to Santa Monica is definitely a worth while trip. It is something to do while in the area. I would not go out of my way to visit there but if in the area its entertaining. Always very busy"], ["Reviewed August 21, 2017", 4.0, "Worth the short trip from city", "A very pleasant resort spot with a good ambience on the coast. A good Pier for children. Main strip an interesting shop for the ladies Yatch marinas are great with some freal quality vessels"], ["Reviewed August 21, 2017", 4.0, "Beach weather", "Its always nice to be at the beach. Nice walk, normally as I remember this beach was always very clean, this time I have seen a bit too much litter. It was crowded but still its nice to be at the beach."], ["Reviewed August 19, 2017", 5.0, "santa monica pier", "everything was AMAZING!!!! the people were so friendly, and there was music playing which was so cool! the ferris wheel on the pier is something that we highly recommend because the views are amazing. not to mention, Bubba Gump's Shrimp Shack is a place you have to go to eat! along the pier are many shops\nShow less"]]}}