{"Santa Monica Pier": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Monica Pier", "url": "/Attraction_Review-g33052-d104238-Reviews-Santa_Monica_Pier-Santa_Monica_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/06/ef/73/santa-monica-pier-10.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "14120"}, "address": {"@type": "PostalAddress", "streetAddress": "200 Santa Monica Pier Santa Monica Pier Restoration Corporation", "addressLocality": "Santa Monica", "addressRegion": "California", "postalCode": "90401-3126", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Must do in Santa Monica!", "I wasn’t planning to go to the pier but my hotel was close by and I decided to check it out as a solo traveler just finished with work. I’m so glad I did! There is so much activity going on ranging from amusement rides (which I didn’t do) to musical entertainment to souvenir shops to viewing posts on the pier, plus some eating spots. The views are amazing as you get to see both sides of the beach. I suggest you be there for sunset. What a treat! I walked out onto the beach and joined many others in taking photos and basking in the scenery. It feels very California and the pier is a lot like Times Square. Worth a visit even if you aren’t into amusement rides.\nShow less"], ["Reviewed 2 days ago", 4.0, "Park and Beach", "It has an amusement park with some good number of rides, beach, lot of food options etc. Will be very crowded during evenings. You can see many people enjoying games like beach volleyball, throw disc etc."], ["Reviewed 2 days ago", 4.0, "Fun evening", "It was a cold evening but we had fun on the rides. There was a roller coaster, ferris wheel, scrambler, drop type of ride"], ["Reviewed 2 days ago", 5.0, "Always a cool place", "Santa Monica is happening. Great shopping. A million restaurants. And this pier. A must when visiting LA. Enjoy a day outside on the Pier. Decent rides. Incredible location."], ["Reviewed 2 days ago", 4.0, "As I expected.", "We wanted to visit Santa Monica Pier just so we could say we had been really. We parked up and walked to it, on the walk to the pier we didn’t feel all that safe and this was during the day. Their wasn’t really a lot to do on the pier and a few places where closed. It wasn’t really for us but do be cautious of this area.\nShow less"], ["Reviewed 2 days ago", 5.0, "To Play or Lay", "Some beaches are made for laying on and catching some rays. Others are made for play. Southern California beaches are made for play. Whether cruising and watching the crowds or playing Frisbee... California will always be California. Even when I lived in a more remote area in Laguna during my college years, I never really laid on the beach. People were playing basketball or jogging, rollerblading or on skateboards. Great food stops, music stops and lots of things to do.\nShow less"], ["Reviewed 2 days ago", 3.0, "Nice.", "The pier was a nice place to visit. Plenty of shops and places to snack. There are a few rides for the kids and the views are great, especially at night at the end of the pier looking back at the city. That said, one visit was enough. I probably wouldn't go back a second time.\nShow less"], ["Reviewed 3 days ago", 5.0, "Iconic stop", "We have always heard about the Santa Monica Pier. This was one of our must see attractions. We were not disappointed. The atmosphere was fun and the food was fun. We even went on the Ferris wheel, what an awesome whew from the top. My husband was thrilled to be at the end of Route 66!\nShow less"], ["Reviewed 3 days ago", 5.0, "Alan", "Beautiful views. A few crazy vendors around trying to get money from tourists. To many people packed together in area for my liking. Good to see once."], ["Reviewed 3 days ago", 4.0, "Nice place to visit in LA", "We Visited the pier of SM one sunny evening on mid february. Really nice place, a lot of people, specially tourist as us, a lot of things to do and watch. Good plan for a few hours."], ["Reviewed 4 days ago", 5.0, "Fair ground", "As a local I have grown up with this place.\nNostalgia is the word.\nWatching the children scream and smile like I did as a child.\nIt really does warm the heart.\nBring a blazer though as later in the day it can get a little cold.\nShow less"], ["Reviewed 4 days ago", 5.0, "Beautiful", "Such a great place. Beach is good. Hire a bike and cycle to Venice beach few miles along the bike lane. You will not regret it."], ["Reviewed 4 days ago", 3.0, "Iconic LA stop", "When in the city, I felt we needed to give the Santa Monica Pier a visit. It was fun walking around, but we couldn't see spending more than 1 or 2 hours here. Some great photo ops, and the beach is nice. Be prepared for a ton of people!\nShow less"], ["Reviewed 4 days ago", 4.0, "Midway Fun", "A classic LA icon. Not everyone’s favorite place but great fun for kids of all ages. Grandchildren from 6 to 16 all had a wonderful time on the rides and in the arcade. Rollercoaster and Ferris wheel were the most popular rides and the arcade was a great way to keep the kids engaged. Don’t go there to eat. No good or even mediocre restaurant on the pier. Great people watching.\nShow less"], ["Reviewed 5 days ago", 3.0, "A carnival attatched to a pier", "This is the ultimate tourist trap with high priced diabetes-inducing fried carnival food, meager carnival rides, and a lot of people selling tourist junk in the stores. It didn't help that the winter wind was cold in February. With so many proper theme parks in the LA area, save your money and just hit the beach.\nShow less"], ["Reviewed 5 days ago", 4.0, "Cute area but couldn’t enjoy due to weather", "Cute area to spend an afternoon with lots to do but the day we visited was unusually cold and windy so it was difficult to be outside."], ["Reviewed 5 days ago", 5.0, "Lots of fun", "Great arcade and rides. Classic pier atmosphere with lots of music, tourist shops and restaurants. You can also walk into down town Santa Monica from the pier which is worth doing. Beautiful beach too!"], ["Reviewed 5 days ago", 3.0, "Not as nice as we expected", "The pier was fine, but it was not as nice as we had expected it to be. There were not many rides that cater two older kids and the things that were there were just mediocre. It’s fun to visit for an hour but not much more than that\nShow less"], ["Reviewed 6 days ago", 4.0, "Morningvtrip", "We were only staying a short distance away so caught the bus, $1.75 for each adult to travel.\nThe pier is just like you see on TV shows although slightly smaller.\nShops and cafe on the pier it self.\nWhite sandy beach with lifeguards and we saw sea lions surfing in the waves.\nA lot of homeless people around which is sad to see.\nTour guides wanting you to buy tickets at $85.00 when you say no they immediately drop to half or below. It’s a place to spend a few hours unless you sit on the beach.\nShow less"], ["Reviewed 6 days ago", 4.0, "Great family stop and great views!", "The Santa Monica Pier was first built in 1909 and is a must stop while visiting Hollywood. Couples can have dinner and admire the sunset over the ocean. Families can have some cotton Candy and enjoy streat entertainers. Bubba Gump has a restaurant on the pier if you want to have drinks and a few beers. Robert Downey Jr buzzed the Santa Monica Pier in the first Ironman movie. Many movies were shot there. A must for tourists.\nShow less"], ["Reviewed 6 days ago", 5.0, "Cloudy but not too chilly.", "December in Santa Monica and the weather was nice. Lots of tourists and locals roaming around. The beach busy with beach goers. The pier is easily walkable."], ["Reviewed 6 days ago", 3.0, "Walk on the beach", "It was good to visit and see, lots of ppl , rides are nice, lots of walking, restaurants, good sunset sight !"], ["Reviewed 6 days ago", 5.0, "What a fun time!", "We came on a Thursday afternoon and stayed until sunset. It is an incredibly beautiful setting and the people watching is pretty awesome. Watching the street performers was hilarious and at times jaw dropping. Pacific Park was a fun amusement park with nice employees. We snapped a ton of pictures. The beach was quite clean, surprisingly. We could’ve parked right at the pier for $10 but made a mistake and parked in a covered garage across the street for $21... that was a lesson learned. The amount of riff raff was actually at a minimum, which again was very surprising. We were very happy with our decision to come!\nShow less"], ["Reviewed 1 week ago", 2.0, "Nothing to write home about.", "If it wasn't for the amusement park, this pier would be nothing else. Definitely catered for the tourists with the overpriced food and your usual souvenir shops and restaurants. I had more fun trying to track down the nearest Jack n the Box."], ["Reviewed 1 week ago", 5.0, "Like in the movies", "It's like in the movies, so much to see and do, so many people from all walks of like and backgrounds all gathered on this pier, souvenirs on the pier are on the expensive side, went to the restaurant at end of the pier, had nice Mexico atmosphere and nice service. Had the wet burrito, was that big on the plate only manages to eat half of it, definitely recommend it\nShow less"], ["Reviewed 1 week ago", 5.0, "Great beach day walking the pier", "First time on Santa Monica Pier in a long time. I enjoyed the slack line park my friends created. The Buzz Pop Cocktails were amazing as well. Weather was mid 70's and perfect for February. Only downside is parking sucks"], ["Reviewed 1 week ago", 4.0, "Enjoyed it", "Visited here a couple of days back. It was a lot of fun even though it was windy. Such a nice walk and everyone seems to be having a good time or at least free minded. I enjoyed all the people trying to sell you fruits and the walk. It is a must see.\nShow less"], ["Reviewed 1 week ago", 5.0, "Vibrant and lively", "Loved being here as a tourist. The whole vibe, cute amusement park, sunset, beach, everything combined makes this place a one of a kind, magical place to be. Only thing is that food and drinks are overpriced but thats probably common in such touristic places."], ["Reviewed 1 week ago", 5.0, "\"we had a great afternoon at this Pier\"", "This is a must visit place, there is a lot to see and do. you will see people working out at the beach, entertainers,you will be able to buy your souvenirs and enjoy the beautiful views of Santa Monica, CA."], ["Reviewed 1 week ago", 5.0, "Fun day at the beach", "Rent bikes, walk everywhere, enjoy the sun & sand. A great beach & pier anytime. All kinds of food is available. Bikes are affordable. Head down to Venice & Marina del Ray for a great couple of hours."], ["Reviewed 1 week ago", 5.0, "Great for the family", "We had never been to Santa Monica and were worried about things to do with the kiddos, and this was perfect and we had so much fun here."], ["Reviewed 1 week ago", 4.0, "Good photo opportunities", "Cool place to hang out for a few hours. Kids young kids would enjoy the carnival type amusement park. Ate at the Bubba Gump Restaurant and was good but pricey."], ["Reviewed 1 week ago", 4.0, "a classic sight", "It was amazing to see the end of route 66. We had photos with the sign on the pier. We rode on the wheel and the rollercoaster. We ate at bubba gumps and enjoyed the beach. couldn't be more different from Worthing West Sussex. Even hired bikes and rode to Venice Beach which was lots of fun and very safe.\nShow less"], ["Reviewed 1 week ago", 4.0, "A classic", "This seems like you can not travel all this way to not go to the pier. It was alright the rides were very over priced but that is to be expected."], ["Reviewed 1 week ago", 5.0, "First Time Here", "It was our first time here at the Pier. We came at night, and were able to use our GO LA pass to get on the roller coaster which was cool. Lots of kids and familys having fun. It was even just fun looking at all the lights sparkling in the distance.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful", "Visited at sunset, what a beautiful picturesque place. So much going on. Entertainers all along pier, carnival attractions & of course the iconic Ferris wheel. Lovely walk along pier soaking on the atmosphere."], ["Reviewed 1 week ago", 4.0, "Friday Afternoon Fun", "We visited the pier on a Friday afternoon, walking to the end of the pier and then getting to the rides as they were opening. We bought the unlimited band (highly recommend) and rode as many times as we wanted in an hour. The view from the Ferris Wheel is awesome! Our 8 year old loved the rides. We kept our bands on and went back after dinner to experience the roller coaster in the dark. Very fun. We did not eat on the pier - we chose a restaurant nearby on Ocean Ave.\nShow less"], ["Reviewed 1 week ago", 5.0, "Scenic, iconic and fun", "Nice spot with live music, rides and views all around the pier. Route 66 ends here, from Chicago. We had a nice beach walk from our hotel to get here."], ["Reviewed 1 week ago", 3.0, "Santa Monica Pier at Night", "Got into Santa Monica later in the day, and decided to walk the boardwalk in the evening. Perhaps because it was at night and dark, it seemed to invite all kinds of people and we decided follow our comfort level and not stay very long. We enjoyed all the lights and action of the Pier from the hotel, and it was just as beautiful as depicted in advertising.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fantastic Spot on Pacific Ocean Coastline", "One of the few places I can recommend being fun for all in Los Angeles. The Ferris wheel on the Santa Monica Pier can be seen in numerous tv shows & movies and is part of a great little amusement park that is ON the Pier.\n\nYou can park directly on the pier; just drive down the big hill and follow the signs. You could also park in one of the public lots up the street, but it's a pretty steep walk back up (especially if you're pushing a stroller or have tired, small children with you). Touristy shops line the pier and there's a Bubba Gump restaurant at the base of the pier. The view of the Pacific is incredible.\n\nMy absolute favorite thing on the Santa Monica Pier is a once in a lifetime experience - The Trapeze School of New York (Los Angeles location) has a spot where you can take flying trapeze lessons. There is nothing quite like flying through the air looking out over the ocean. If you're looking for a really unique activity to do that's not the typical L.A. vacation, check it out.\nShow less"], ["Reviewed 1 week ago", 5.0, "One of LA's Best Beaches! Bring the Whole Family!", "The Santa Monica pier was a super cool place for the whole family, and you must give the better portion of your day to being there. It's a pretty long walk across the bridge especially if there are little kids with you and they may get tired out pretty fast. Once you are actually at the pier, there is a lot going on. If you see some people with a spinner offering you 2 free nights of vacation, it's most likely a scam. It was fun to play, however. There was also a small basketball court which part of the all-star NBA weekend took place, which was cool to see. The mini amusement park was really awesome, and a lot of the carnival game booths on the side were really fun, and the prizes all large and possible to win. There were a many rides, and the coolest was by far the roller coaster, which is very easy but goes around twice. There is also a boat swing, frogger, and more, which gives people of all ages a ton to do. Each ride varied from around $5-10, yet unlimited rides for the whole day was only $18, so that would be super fun to do if you have the whole day. The ticket booth in the front has a huge line, but if you sneak your way to the back entrance, there is a booth with almost no one in line (don't tell!). The beach is worth walking around in, but personally the amusement park was the best part. Since everything is nearby, people can choose what they would like to do and meet up right after, making it the ideal situation (much like Coney Island in NYC). If in LA, this is one of the coolest and most fun experiences at little to know price, so you should make your way down to the Santa Monica pier!\nShow less"], ["Reviewed 1 week ago", 5.0, "Just as i had imagined it to be!!", "The beach first of all was simply breathtaking the sheer size beach blew me away and\nthe homes on the beach are beautiful. The Pier was exactly how i imagined it to be , It was almost caught in a time warp and i loved it, hopefully get back some time in the future and spend more time there.\nShow less"], ["Reviewed 1 week ago", 4.0, "The Attraction of Santa Monica", "The Santa Monica Pier is an iconic destination for tourists and locals alike. Stroll the boardwalk, eat street food and play arcade games.\n\nPro Tip: Kick off your shoes and walk out to the sand. Stand under the pier and take it in from a different point of view.\nShow less"], ["Reviewed 1 week ago", 3.0, "Nothing out of the ordinary", "I would skip - way to crowded with a lot of people and nothing out of the ordinary in terms of attractions."], ["Reviewed 1 week ago", 5.0, "Such a nice time!", "I know you are going anyway haha, so I would just say to use your money and time wisely! Good place to take kids, family, dates..."], ["Reviewed 1 week ago", 4.0, "The Best of LA", "The hardest part about a visit to Santa Monica and it’s Pier / Boardwalk is the drive. When you finally reach the ocean it’s like the rest of the city melts away. If you are lucky enough to find a beach-front hotel you can relax and enjoy the view of the Pier and then visit it at night when it’s all lit up!\nShow less"], ["Reviewed 1 week ago", 4.0, "A must to visit", "Well worth a walk along the pier and take in the bracing fresh air. If you like additional entertainment go for a ride on the big wheel"], ["Reviewed 1 week ago", 5.0, "Loved it!", "What a terrific place. I just walked and looked, took in all the sights, but there is lots to do. Loved the old carousel. Street performers. Ice cream shop. (My salted caramel milkshake was so good!) Beautiful beach."], ["Reviewed 1 week ago", 4.0, "Pretty Pier with great views", "We really liked the pier, the views were lovely and there’s lots going on on the pier. The children enjoyed the arcade. The ice creams etc on the pier are very expensive so we didn’t buy too much."], ["Reviewed 1 week ago", 4.0, "a little messy but still good fun", "The Santa Monica Pier gets lots of visits due to many reasons : fun , sun , sea , and more fun !!\nKids will love this place for its carnival games and rides and adults will love the views of the pacific ocean and enjoy great cuisine . Parking does get crowded so do come early to truly enjoy the world renowned pier!!\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice place to be at sunset.", "Boardwalk is full of street performers and gift shops. Tourist trap but nice to see at least once. Great for people watching."], ["Reviewed 2 weeks ago", 5.0, "Great place to eat and hang out", "Lots to see and do. Good food options. Great views. We ate at the restaurant at the end of the pier and the food was good and the service was fast."], ["Reviewed 2 weeks ago", 5.0, "Nice pier", "The pier itself is iconic and a must if you’re visiting Santa Monica Beach. Shops are quite expensive, But take a look at the last shop from Route 66 at the end of the pier."], ["Reviewed 2 weeks ago", 3.0, "End point of Route 66", "The Santa Monica Pier was very busy with numerous people busking or selling their wares. Beautiful sunset is to be experienced. A must to visit together with a stroll along the beach."], ["Reviewed 2 weeks ago", 5.0, "Typical American Dream; Great Fun", "We stopped here by accident. We ended up spending 3 hours soaking up the atmosphere. Great old style fun with a great view. Would definitely stop off and have some fun"], ["Reviewed 2 weeks ago", 4.0, "Great atmosphere", "Santa Monica is a lovely town and a visit wouldn't be complete without a visit to Santa Monica Pier. It has a lovely buzz about the place and lots of fun activities for all ages. It also provides lots of photo opportunities."], ["Reviewed 2 weeks ago", 5.0, "Enjoy the beach", "Enjoy your day at the beach and pier is full of activity and shops. Should stay specially at sunset time to view teh sunset."], ["Reviewed 2 weeks ago", 4.0, "Really good fun!", "I went there with my family at night and although a little apprehensive at first, it was definitely worth it. The atmosphere was great, the rides cheerful and very cute little stalls."], ["Reviewed 2 weeks ago", 4.0, "Lively place, but small", "It is a smaller than I though from th movies. Lively place and good view to the city beach. Worth a visit."], ["Reviewed 2 weeks ago", 4.0, "Great stop in Santa Monica", "The pier has rides and crowds. I enjoyed the eclectic crowd more than the rides. Fun to see the yoga, hula hoops, skaters. Cleaner than Venice beach."], ["Reviewed 2 weeks ago", 4.0, "Good first experience", "First time to the pier. It was a cool experience. Lovely views. Prepare to pay for parking. Metered parking is $2 an hour."], ["Reviewed 2 weeks ago", 5.0, "Pleasant to watch the Ocean", "We are on holiday during the Winter, but took a stroll along the pier and it was a pleasant experience. We saw buskers, souvenir stalls and fast food outlets. Fishing is allowed on the end of the pier. The floor is old and uneven with a funfair on the side. Entrance to the pier is free.Worth a visit.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Part of the tour", "Neat place to visit. We went on a beautiful Saturday afternoon so it was very crowded. Lots to do on the pier and also a beautiful beach. Tons of restaurants across the road from the pier. Parking was scarce but was worth the time to see it. Came back a week later at night. Gorgeous view of the Ferris Wheel as we drove down the PCH(pacific coast highway).\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful ocean & mountain view", "A little touristy by the views of the beach and mountains are spectacular. We got tacos at a little place here and they were sooo good! A bit crowded but not so bad that you can't get away easily if you need to."], ["Reviewed 2 weeks ago", 5.0, "Great place to visit and lots of things to do around", "We visited LA as a family with kids. There is lots of things going on at the Pier itself, and there is broad walk around. You can also go to the shore itself and spend time on the beach. They have 3 streets parallel to the beach with walking zones, lots of restaurants and many cheap city parking garages (Streets 2,3,4). There is mall right there too, you just walk off from the pier and continue one block straight, mall will be on your right. So great place to be overall. In the evening it is very safe and again tons of people walking around, sitting at the cafes and going by the water. They have very nice illumination at the streets 2,3,4. This is probably the most alive place in LA in the evening.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Iconic", "Spent a few hours exploring Santa Monica and you must go checkout the iconic pier. Great views of the coast line, entertaining buskers and good for people watching."], ["Reviewed 2 weeks ago", 4.0, "Nice stroll great food", "Nice stroll. Great street musicians. Great food. Did not know it was the end of the famous route 66. If you love people watching this is the place to be."], ["Reviewed 2 weeks ago", 4.0, "Stroll in pier", "Leisurely stroll in the pier. Amusement park is nice and clean. Lifeguard shack at the end of the pier is a small testament to the history of the pier."], ["Reviewed 2 weeks ago", 5.0, "Nice visit", "Great spot Nice location Tourist area but must be seen Clean and tidy Organised despite being busy Lovely area and great place to visit"], ["Reviewed 2 weeks ago", 5.0, "A must see", "This is the place. Wow. People watching at its best. So much to see plus it’s the finishing point of Route 66. Plenty of activity."], ["Reviewed 2 weeks ago", 4.0, "Something Fun To Do On A Saturday", "We went to the Santa Monica Pier to let the kids have fun on the rides. There is parking right at the pier and it was a flat $12. I read that online but there was so much traffic that we just parked at the Shore hotel for a flat $15 and walked a block over to the pier.\n\nThere are a lot of people and a lot going on. It was cool to know that it is the end of Route 66. Your typical boardwalk and food. We ate at Pier Burger, walked to the end of the pier and then went to the amusement park.\n\nWe had the LA Go Card. A great value for everything that we did in Southern California including the Santa Monica Pier Amusement Park\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun for kids, adults, couples, or groups", "The Santa Monica pier has a carnival atmosphere with a ferris wheel, arcade games, souvenir shops, and other games. It is beautiful any time of day, but especially nice at sunset, especially on a rare clear day without the smoggy haze that is so common. The pier has restaurants and souvenir shops or stands all along the pier that overlooks the beach and the ocean. Great places for lunch, dinner, snacks, or drinks.\nThere are people performing music, some extremely talented (an impressive violin with an amplifier and another playing an acoustic version of \"Hotel California\"), and some more unintentionally comical like a man in his 50s that performs in a gladiator-type skort and dancing the Macarena (yes, I know it, I admit it :) to a rendition of Prince's \"When Doves Cry.\"\n\nAnother thing to mention, but not to be concerned about, there are usually panhandlers asking for money, but none of them were aggressive or dangerous. I went 3 times in a week, once for lunch and twice for dinner, in a group of 2 to 4, and there was never a problem.\n\nGreat views, good variety of restaurants, a good place for tourist souvenirs, and you can take the stairs to the sand, and go down to the shoreline if you want. They also have a shower and a foot shower (don't pull the wrong handle!) to rinse off the sand. The water is very cold in months like January, even though the high when I was there was in the mid 70s to mid 80s, but considering there was snow on the ground back home, it was nice to enjoy the warm mild weather, the view, and the seafood!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Buzzing!", "Get there early if you want to snap pictures to avoid crowds. Many restaurants around with very good sea food menus!"], ["Reviewed 2 weeks ago", 4.0, "Pier Pressure", "Heading from LA up the Pacific Coast Highway today Santa Monica was our first stop. It was one of our favourite places in LA and taking time to stroll along the Pier and soak up the atmosphere was well worth it. Great views and plenty to see and do if you have the time. We only stayed long enough to walk up and back as the road was calling!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Good musicians fun place", "Park close to the beach, $7 per day. Lots of entertainers. The restaurant at the far end is where you want to go."], ["Reviewed 2 weeks ago", 4.0, "Beautiful Day", "Lots of fun and not very crowded. Beautiful beach day for February, awesome for people watching. We rented a tandem moped-like bike and cruised down to Venice Beach. Make sure to stop at some thrift stores for designer labels. Ate lunch at Shutters- great day! Ride the roller coaster (pricey though)!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Such a nice place", "They have shops and places to buy food they have rides like a and games even a little game room the beach is so beautiful"], ["Reviewed 3 weeks ago", 4.0, "Great iconic spot!", "Loved our stroll along the pier. Not sure if rides don’t operate during the week or not? We went to ride the Ferris wheel one week night and it as well as all the other rides were closed. We found pier parking to be easy. Look out for the monks, the try to give you a bracelet and then want $10 for them.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best Experience Ever", "When I go to Santa Monica Pier for the 1st time what I had on my mind was just the beach\n\nBut when I reach there it was mind blowing and to be honest if you're the 1st time travelled to ST definitely you will enjoy the activities there a looot\n\nMany more activities to do !!!\n\nHighly recommended\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Tourist attraction", "Great place to go on a beautiful day. It is crowded but spectacular setting . Definitely take out of town guests."], ["Reviewed 3 weeks ago", 5.0, "Fun place to hang out near the beach", "Lots of shopping & food, street vendor shows as well....great place. Surprisingly there is also clean bathrooms!"], ["Reviewed 3 weeks ago", 5.0, "Great walk", "When in LA I park up on Ocean Park dr then walk down to the pier and to its end. Definitely people watching but please note the area is loaded with food trucks BUT lots of homeless on the walk overlooking ocean. Lots of people walking, jogging , dogs etc but on clear day a must walk to enjoy just be aware of surroundings.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Spend a few hours", "Its not a mind blowing experience to come here, but its still nice to walk up and down the pier, in a leisurely fashion, no rush, and take it all in.\n\nThere's the overpriced souvenir shops, entertainers, an amusement park, and restaurants to keep you busy, or you can just look out at the nice views over the water and beach and up the coast.\n\nWe parked on the main drag and walked down, and that seemed a cheaper option and a nice way to see some of the beachfront town as well.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun at night!!!", "Great place to end up after a long day of touring the LA area. Great Mexican restaurant on the end of the Pier. The pier was clean (cleaner than the rest of the area) and we felt safe. We saw a cool bicycle parade that was all lit up and that was cool. A beautiful carousel at the beginning of the walk out into the pier. The colorful Ferris wheel overlooks the ocean. Quite a beautiful site.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Santa Monica", "This place was so much fun. Great place to take pictures, people watch. We rented bikes and rode to muscle beach on Venice. Really cool place."], ["Reviewed 3 weeks ago", 4.0, "It's got to be on your list.", "I read mixed reviews on this site about Santa Monica and the pier which almost put me off going. When we arrived at the pier on Sunday afternoon about 2, it looked very busy and generated a oops maybe we made a mistake moment. Saying that when we entered the pier it felt very comfortable. Lots of food stalls. Live music. Fair ground rides and souvenir stands. Regardless of being the end of route 66, I just thought it was a fun place to pass a good hour or so. The people were very nice and no hassle or pressure at all and the sun set to die for. Bubba Gump shrimp company restaurant was a great addition sitting at the start of the pier. The food will not set the world on fire but the service and experience was a great end to a very nice afternoon. Don't miss this one off your list.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Santa Monica Pier", "We took 9 teens (17) and 3 adults to the Pier. It was a gorgeous day in January so we walked Venice to the pier. Enjoyed the rides, walking the pier to the end, shopping and eating. Neat place to visit and walk around. Only warning was food places are limited as far as sit down restaurants. Alot of walk up carts and windows, but not full service restaurants right on the Pier. Bubba Gumps is very popular and we put our names in for a party of 12 and waited about 45 minutes. They were great about moving orders, food, etc. I would return here for a fun beach day plus!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice sunny day in the pier", "Usually jammed parking can be a challenge and the food is boardwalk or amusement park quality. Be careful with your belongings. Worth seeing but the view is just amazing specially from the Ferris wheel."], ["Reviewed 3 weeks ago", 4.0, "Leisure walk after a dinner", "was surprised not seeing a lot of tourists on Wednesday night with a super nice weather & clear moon"], ["Reviewed 3 weeks ago", 5.0, "Surprisingly fun", "Spent a lot longer here than expected due to the number of rides and stores crammed into this small area. Ended up riding the coaster and ferris wheel, got some great views of the sun setting from up there. There's also a pretty awesome arcade with some old classics like Centipede and Street Fighter II, as well as air hockey and Foosball tables, very fairly priced (most games were between 50 cents and a dollar per go). It went from just taking a look, to spending a few hours on the pier before taking a walk on the lovely beach.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Love the pier", "I went to the pier 3 times in the 4 days I was there. Twice at night and once during the day.\n\nIt’s a really fun place to visit. Tons to do and see! Family friendly. Rides and games for the kids. Street performers riddled the pier. Everyone was just having a freaky great time. The lights at night are awesome. Walk to the very end and turn around to see the lights!!\n\nThere are people fishing off the pier day and night. We stopped to watch them fish for a bit while drinking coffee from the Coffee Bean and Tea Leaf.\n\nYou could go down to the beach and play in the ocean or just sit and watch/listen to the waves crash against the shore. Plenty of places to eat and gets snacks.\n\nEasy to get an Uber to and from. It’s a must see if you’re in LA.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Every now and then you have to go to the Ferris wheel over the ocean", "There is a place that ALWAYS takes the blues away. When I am on the West Side, during the week, I try to get on the Ferris wheel over the ocean for a quick attitude adjustment. There is something that can be cured by flying alongside seagulls high above the water below. If you want to do something SUPER special and the wallet is thin, jump on the metro to the end, and walk to the pier. A whole new world is there.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Crowded & commercial.", "Touristic area, fast food, beaches & sun. Busses access available. Highway usually very crowded, take time to go by car."], ["Reviewed 3 weeks ago", 5.0, "An old gem in a modern town", "The pier is reminiscent of Blackpool back in the day. Lovely wooden pillars and walkway.\nRides and street entertainment makes it a fun place but for sheer beauty sit on the bleachers at the end of the pier and watch the sunset over the ocean\nGreat fish restaurants\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great way to spend a sunny day", "I don't know of it was the weather, the location or the fun, but it was a memorable day and will return. We enjoyed the rides, saw dolphins off the pier and had a great day."], ["Reviewed 3 weeks ago", 5.0, "Fun for all!", "I’ve only been here before the attractions are opened but the views are nice and fishermen friendly."], ["Reviewed 3 weeks ago", 5.0, "Fun Fun & Lot of Fun", "Atleast need to spend 1 Full day to enjoy Santa Monica., good shopping, beach attractions, food and other lot of things to explore and enjoy. Easy to access and ample parking spaces. FUN all the round from morning to mid night."], ["Reviewed 3 weeks ago", 5.0, "A must visit to know end of Highway 66", "The breeze and buzz of activity was amazing. For the lovers of history and cars, this is supposed to be the end of the Highway 66 - one of the first highways to stretch from the East coast to the West coast."], ["Reviewed 3 weeks ago", 5.0, "very warm and exciting visit", "i recently visited this establishment while we were on a layover for 2 days before connecting onto vancouver it was a pleasant day and we visited the arcade, roller coaster and the ferris wheel: which gives an amazing view of the city i will definitely visit santa monica again on holiday i would highly recommend to tourists and locals alike.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Good place to spend a couple of hours", "Loads of entertainment here. There are busker, restaurants, stalls for shopping and fair rides. Parking is easy to find with a walk to the Pier."], ["Reviewed 4 weeks ago", 5.0, "Fun", "Just adjacent to Santa Monica beach, the pier is filled with a lot of activities for all age groups. We all saw a few seals swimming nearby. As with all things in So Cal, bring sun block with you."], ["Reviewed 4 weeks ago", 4.0, "Very nice", "A good place to visit especially if you have young children. Plenty of rides etc. good to see this place still exists. Very touristy but fun."], ["Reviewed 4 weeks ago", 4.0, "Pier made for fun", "Our first time there. Glad we went. So much history since it opened in 1909. We didn’t go to the amusement park but there were lots of people there, riding the Ferris wheel and other rides. There were several entertainers singing, dancing or doing magic tricks as we walked along, making it fun. But the views of the beach and the ocean were what drew me to want to go back. We had lunch on the patio of a restaurant at the end of the pier and it was delightful.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Legendary!", "Opened in 1909, the 1400-foot-long Santa Monica Pier is one of the most iconic seaside piers on the west coast (and all) of the USA. It has been featured in countless films, television shows, music videos and even video games (Grand Theft Auto V immediately comes to mind). It has been designated a historic landmark since 1976 and has a rich, storied history since its opening. (Seriously, read a little bit about it and discover some of its more darker past during Prohibition and the WWII era. It's fascinating!)\n\nIt's also REALLY cool to visit. At just over ¼ of a mile long, the pier offers lots of entertaining options to keep you busy for a few hours. Most noticeable/famous on the pier is the Pacific Park seaside amusement park (with its legendary Pacific Wheel Ferris wheel and West Coaster junior roller coaster), along with 10 other rides. Additional options include the original Hippodrome building (with its original indoor carousel) from the 1920s, a trapeze school(!!), the Santa Monica Pier Aquarium, plus numerous shops, restaurants, bars/pubs, entertainers, and other attractions. At the far western end of the pier, you will see numerous anglers fishing, as well as find restrooms and a somewhat upscale restaurant for memorable dining. The pier is fun during the day, but it's at night when it REALLY comes alive, with all the lights, music, cool ocean breeze and entertainment options that give it a magical quality. You never know what you're going to see there, from Chinese Acrobats, to musicians playing exotic and foreign instruments many Americans aren't accustomed to seeing, to fortune tellers, magicians, and other acts. It really is a neat place to visit. The Santa Monica Police Department has a station on the pier, so police presence is regular. I've never felt unsafe while visiting.\n\nIt's busy though. Even at night, the pier can be so packed with people that walking gets difficult. I've seen lines for the rides at Pacific Park an hour long at 11pm before. Finding places to eat, places to grab a drink, and a place to park your car can be a real challenge. I recommend avoiding the Santa Monica Beach/Pier and Pacific Park on the weekends in the summer because it just gets to be too busy to truly enjoy yourself.\n\nDespite its popularity and overcrowding issues, if you find yourself in LA with time to kill and you haven't been to the Santa Monica Pier, you HAVE to go. It's one of those life experiences that you will be glad to cross off your bucket list (even if you never intend to return again)!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Crowded but amazing", "Wished I could've stayed longer. Views were great. Lot of entertainment on the Pier. Little Rock band put on a concert, some guy shirtless dancing and having a good time to some funny tunes. Only thing I disliked was PAYING 4$ FOR A WATER!!!"], ["Reviewed 4 weeks ago", 4.0, "Fun Place!", "We were fortunate to visit this attraction on a warm January day; it was glorious! The air was clear affording wonderful views of the ocean. Parking was easy as we went on a weekday. On can actually park on the pier and there is a parking lot at ground level. There are public restrooms available, also. The pier was lots of places of places to eat, some shops, as well as several interesting buskers, or street musicians.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Was nice", "Nice to see the ocean. Great Mexican restaurant. Strange characters singing and dancing everywhere. Lots of trinkets for sale. Gets crowded."], ["Reviewed 4 weeks ago", 5.0, "Nice", "Very nice place to go and spend a while. It has a lot of activities and fun things to do for all family members. It is very nice for pictures."], ["Reviewed 4 weeks ago", 5.0, "Nice beach", "The sunset is amazing here, I don't know why the colours are so nice compared to some other places I've been. The beach is huge, there is an amusement park, lots of food, and you can rent bikes or skates about 10 minutes walk away."], ["Reviewed 4 weeks ago", 5.0, "Mid winter vacation", "Santa Monica Pier is simply a fun place to be at, especially if you’re into people watching!\nMany places to eat, grab a coffee and watch the bay.\nWe rented bikes and rode all the way down the beach-a wonderful two hour ride.\nThere is a small amusement park as well to add to your fun.\nEvery few feet, there are musicians, artists and even a dancing native, showing off his strange moves!\nThe Pier is definitely a place to visit and spend the morning.\nWalk around Santa Monica and visit the shops, restaurants and if your lucky, the farmers market will be in full bloom.\nIt’s a wonderful place to shop fresh and organic vegetables.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Came by for sunset", "Just as a must-do attraction of LA, we came to Santa Monica pier without expecting to take any rides, or eat there, or enjoy the beach - basically nothing that a tourist would do. We took a stroll along the pier and enjoyed the sunset; the views and buskers made the atmosphere a simply beautiful place.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A nice walk and interesting atmosphere", "If you are looking for something to do in L.A. for an hour or so, go for a walk along Santa Monica Pier. Many colourful characters and stalls, a gorgeous carousel complete with icecreamery, and a beautiful beach. We didn't try to go on any rides, or buy any food.\nShow less"], ["Reviewed 4 weeks ago", 1.0, "Very Tired", "My son wanted to visit this pier as of course has seen it in many tv shows. Needs a bit of an overhaul and is looking really really tired. Nothing to see really and some dubious buskers, a little on the weird side and everyone has their own CD to sell. Does anyone even use a CD player anymore.......\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Santa Monica pier", "Crowded and a very interesting mix of people. The pier itself is a fun walk and people watching but not much for food. Fairly long walk to the promenade area and not much to choose from for food."], ["Reviewed 4 weeks ago", 3.0, "Beach", "Beautiful view of the ocean & walk along the beach. Santa Monica Pier was crowded & expensive for the kids to go on the rides."], ["Reviewed 4 weeks ago", 3.0, "Pleasant walk", "While some relaxing time away here, take it slow, check out some kiosks. Nice view of the beach and the city from the pier. Take some fun rides if you feel like it."], ["Reviewed 4 weeks ago", 4.0, "1 hr is enough", "We went in the evening...around 8 p.m and you can see the bay from the pier, it's a nice view. There's a park where you can buy tickets and enjoy in a rollercoaster or the wheel of fortune (I don't know if this is the correct name)There are places where you can eat, buy some momorabilias or just enjoy the different artist that there are in the pier. If you like to take pictures...this is a great place. You can park there ($2 × hr) You can visit the end of route 66. You have to go there!!!\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Disappointed", "Lines were looong! Waited an hour to get on rides. I also waited 45 minutes in line to get a cup of coffee Finally walks away because the small coffee shop was so full you couldn’t move. We had a difficult time just walking on the pier. There were so very many people. I also expected it to be cleaner than it was. Couldn’t find any rest rooms either.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "Walk into the Past", "The Santa Monica pier is a remnant of the past. There are many performers and small stalls lined along the pier. In addition to some carnival rides and arcade games. The pier does offer some spectacular views of the beach and scenery."], ["Reviewed 5 weeks ago", 3.0, "Very nice place to visit if you need some beach time", "It is very much talked about tourist attraction in LA. Not very close to downtown. The food is delicious there and so are the shops. There are street performances along side every day. Honestly just too busy."], ["Reviewed January 24, 2018", 5.0, "Felt like baywatch", "Absolutely like seen on TV. Great beach, great walkway, tones of activities. Reasonable rates at the parking lots"], ["Reviewed January 24, 2018", 4.0, "Pier", "Quite a beautiful place in LA about 30 min drive from the down town... it has good view .. lot’s of energy around with restaurant , pubs and coffee shops .. nice place to spend a good evening"], ["Reviewed January 24, 2018", 4.0, "Nice little walk", "It's a nice walk You can treat the kids to a few mechanical games and enjoy a funnel cake or a nice coffee There are artists who sale their talents like you name on a rice grain... paintings etc It was nice."], ["Reviewed January 24, 2018", 5.0, "Bucket List - Tick", "This has always been on my bucket list, and was a crucial part of my visit to California. We arrived at this area by UBER just outside of the main arch welcoming you to the pier. It was a beautiful day with the sun shining and you could see up and down the coast for miles. The pier has many attractions and restaurants which would appeal to everyone. The first place we saw was Bubba Gump Shrimp, but only visited the shop on this occasion. You will notice that there are several souvenir shops on the pier, but luckily they sell different things compared to Hollywood which was great. The funfair is the main attraction on the pier and proudly stands out. Its such an iconic attraction, and its great to see that it was always busy with families. There is a restaurant at the end of the pier, and an amazing viewpoint over the ocean (I took far too many photos at this point) I personally would highly recommend this location as it is full of little stalls and has an amazing history behind it.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Beautiful", "The beach, the city, the attractions...it’s a magical combination. We even saw dolphins. All the musicians made it even more pleasant"], ["Reviewed January 23, 2018", 4.0, "Busy Busy", "Just travelled to the pier for the first time. You park you are out 10 bucks but the rest is free. It was sunday and we decided to drive up from LA to see it. For my last couple of visits to LA I have tried to visit a couple of piers each time. (malibu, Huntington, Venice, etc..). This was the most fun of all so far to date more to visit you know. You can buy crafts, go to amusement park, visit Arlington West, listen to preachers, m.usic, etc... We left befor everyone was piling in to watch the sun go down from the pier. I would go back again\nShow less"], ["Reviewed January 22, 2018", 5.0, "Lovely sunset and pier walk", "Caught the bus from Hollywood and spent a lovely afternoon wandering the boardwalk and pier. A few venors onnthe pier, fun fair we didnt go into it."], ["Reviewed January 22, 2018", 5.0, "Lots to see", "A nice famous pier with plenty to see and do. Lots of performers and had lunch at Bubba Gump which is cool!"], ["Reviewed January 22, 2018", 5.0, "Amazing part of our 2 week road trip! (Sunday visit)", "We are visiting from England on a 2 week road trip!\n\nThe pier was pretty busy but everywhere tends to be in LA we have quickly realised!\n\nWe spent a while on the pier - there are plenty of places to eat although we didn't need food. There are also loads of great people from all walks of life and people entertaining others. There are lots of little stalls selling fridge magnets, souvenirs etc!\n\nWe parked on the pier and this cost us $3 an hour which we thought was really reasonable and there were plenty of spaces.\n\nRecommend a visit - the beach is beautiful!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great for sunset", "Gets really busy! But great place to come to see the sun set. Lots to do here win funfair rides, restaurants, snacks and games!"], ["Reviewed January 22, 2018", 4.0, "Very Good", "Reached in the morning and enjoyed the shopping street and the pier. Very lively. If have time to visit. Took Uber in both direction from Hollywood where we were staying."], ["Reviewed January 22, 2018", 4.0, "Even if you are Californian, a walk on the Pier is a must", "This eclectic venue is a slice of Southern California with its historic carousal, its fried seafood eateries and a multitude of individual craftsmen along the way offering all sorts of beach souvenirs . Crazy of course, especially on the weekends, but still a gotta do kind of experience.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Fun, relaxing and romantic", "Great to be at with your significant other, fun to explore on the pier, even cooler underneath. Got a good long nap at the beach LOL. Highly recommend."], ["Reviewed January 22, 2018", 5.0, "Fun Pier", "A trip to this attraction is recommended. It has a lot of shops, bars, restaurants and the Fair. The Ferris Wheel provides a great view."], ["Reviewed January 22, 2018", 5.0, "Evening walk", "We went there on our second evening in the US. We had the LA GoCard which was usefull for getting in attractions. We just had to show the Care at the ticket office and recieve an all in ticket. Great times we had there!\nYou can alsof purchase single tickets.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Old World Charm", "We came here to see a number of attractions. First we wanted to walk the iconic Santa Monica Pier, Wow - It did not disappoint, but was amazing. There were places to eat and drink, gift shops, street performers and the view of the northern beaches was just stunning. People were friendly and helpful and always had a smile. A great place to wander with young or teenage kids.\nShow less"], ["Reviewed January 21, 2018", 5.0, "awesome", "great place to visit just so relaxin ..for a drink or go on the ferrus wheel.or listen to the music.love this place"], ["Reviewed January 21, 2018", 5.0, "Love it!!", "I absolutely love this place the beach is clean and The pier is a must see when visiting the LA area. The train runs to downtown. A lot of eateries and shopping. Numerous places to rent bikes and just take in the sunset."], ["Reviewed January 21, 2018", 2.0, "Crowded", "I’m really not sure what is the big deal with the pier. They have a few rides for kids but I would never take my kids there unless you are prepared to grip their hands tight as you walk past the many people who are either homeless, drunk or high. The food smells like a heart attack waiting to happen and it’s too crowded to take a picture without someone else coming out. No reason to go here.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great fun", "What a cool vibe there is here. Real characters singing and dancing and also the rides with the distinctive Ferris wheel.The beach is beautiful and wee souvenir shops dotted along. Definitely pleased we made this trip here."], ["Reviewed January 21, 2018", 5.0, "Great experience", "Don't forget to grab an ice cream before you walk onto the pier, or to stick your head into the aquarium below, where you're greeted by a friendly staff that's willing to share with you about how they take care and then release endangered animals like nurse sharks etc.\nBe wary that it gets insanely crowded on weekends, but if you're around to catch a view of the sunset it's worth a million!\nShow less"], ["Reviewed January 21, 2018", 5.0, "First time on the pier!!", "The view and scenery was breathtaking. This was our first time seeing the pier. There is something for everyone with vendors food and crafts and just everything. This place is for families and everyone. Don’t miss an opportunity to experience this magical site!!"], ["Reviewed January 21, 2018", 4.0, "Great if you have not seen before", "My first time to see Santa Monica Pier and i really enjoyed it. A great vibe of people milling around and so many interesting little vendors displaying their wares or various talents. Superb views around the beaches and headlands from the end of the pier. Highly recommended.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Great food - Way to many people tho", "Love the food options on the pier, in the weekends it can get crowded however not overly crowded - Stolling optional"], ["Reviewed January 20, 2018", 4.0, "Must-See", "We road our bikes out to the pier and enjoyed ourselves. Our kids are too old for the rides but it's such a fun place to visit and the view of the mountains and ocean are wonderful. There are neat food stands for snacks and while we didn't park a car there seemed to be ample parking openings when we were there.\nShow less"], ["Reviewed January 20, 2018", 3.0, "Crowded and touristy", "When I’m in Los Angeles, I avoid Santa Monica Pier at all costs. It’s very crowded and touristy. Definitely stop by if you’ve never been before, but it’s not a place I’d recommend for a group of adults to visit together on a weekend in Los Angeles.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Beautiful old fashioned pier", "Really good place for our morning stroll. Has a good funfair if you fancy some thrill seeking Lobster restaurant nearby really gorgeous"], ["Reviewed January 20, 2018", 4.0, "Beautiful View", "I have been here before and there is a lot to do for the whole family. It is a very crowded place. There is a beautiful view of the ocean. This time I was not lucky enough to find parking."], ["Reviewed January 20, 2018", 5.0, "You have to GO !", "Loved Santa Monica pier :) just a really chilled out fun place to be :) If in La check it out I can’t wait to go back again ,"], ["Reviewed January 20, 2018", 5.0, "Iconic tourist spot", "There’s probably not much new I could say about the pier. It’s a must see destination with shops, amusement rides, street entertainment, great views of the ocean and surrounding mountains. All for free. Easy access to the beach and available parking."], ["Reviewed January 19, 2018", 3.0, "Could be fun, but......", "This pier has an amusement park. It has some activities to do there, but I was bothered by how dirty it was and how many sketchy people there are. I was a bit creeped out. I have been there and seen it, but I will never go back.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Great visit ! .. dont miss this pier ..", "Its a great pier with a really nicd view , theres plenty of places to play, eat of all kind of food , ice cream, candies etc.. walking there is a great experience and theres a parking near the entrance .. Its a must if you visit LA as a tourist and of course is a must to get up.on the Ferris wheel !! the view is amazing ..\nShow less"], ["Reviewed January 19, 2018", 3.0, "NS", "Very crowded but it was a weekend, ate at the Mexican restaurant at the end of the pier, busy but not a long wait. Food was good and service was fine. Would go again."], ["Reviewed January 19, 2018", 4.0, "Very cool place", "We walked out on the pier everyday! Lots of great views and people watching to be had. Lots of entertainment in a small area."], ["Reviewed January 17, 2018", 2.0, "I visited early morning so it was boring", "Later that day the Pier put on her glad rags and looked pretty good from the road.\nThe Ferris Wheel was attractive but certainly not The Eye!\nI personally find these places tacky with games of chance which might as well be a straight out donation.\nSo even though it did look attractive from a far it didn’t call me to spend time there.\n\n\nShow less"], ["Reviewed January 17, 2018", 4.0, "Beautiful", "We enjoyed our time there, was beautiful, lovely to walk around listening to so many pier performances, a good get away."], ["Reviewed January 16, 2018", 5.0, "Fantastic!", "Santa Monica is beautiful, such a cool atmosphere around the pier and the beach! The pier is fun to walk on, and see the sights. And it's the end of Route 66, which is cool! A great place to people-watch...."], ["Reviewed January 16, 2018", 4.0, "Lively", "As a European/Asian I miss to be in the real (not in a concert etc.) crowd. That gives me the feeling to be a member of a society. Santa Monica is a great place to be among nice people and the Pier in the location where you can see them all.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Worth the trip", "Went here with my 7 year old daughter. It was good to be on the pier. We did the aquarium and the rides which was a fun couple of hours. This is a best do while in Santa Monica"], ["Reviewed January 15, 2018", 5.0, "Exceeded expectations", "I have been looking forward to seeing this place for years!!! I was very impressed with the beauty and the views! Great for families!"], ["Reviewed January 15, 2018", 5.0, "Cool atmosphere", "We went on a thursday evening and then on a saturday evening: not the same vibe at all! It was very calm on thursday and we were almost alone. Some musicians were playing calm music.\n\nOn saturday, it was crowded but we loved the atmosphere! You must go there just to walk around, dip your feet in the ocean et watch the ferris wheel.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Go at sunset to people watch.", "Find a spot to watch the sun go down here. Interesting people to watch and always some entertainment. The shops and restaurants look so touristy they are best avoided. See the sea lions swim by."], ["Reviewed January 15, 2018", 4.0, "First time", "My husband and I spend our birthday at the pier yesterday.\nWhat a blast we enjoyed every minute of it\nWe did not get on any of the rides but walked around, enjoy the sunset had a good dinner and listen to all the artist a long the pier.\n\nIf you are big rides don't expect too much this is the old fashion carvival games,rides and food SUPER CUTE !!\n\nUnlimited Wristbands $29-39\nPopcorn $8\nParking $10-20 or free (only on Sundays) a long the streets if you lucky enough to find one\nJust to give you an idea.\n\nWe will defently go back with our kids.\nShow less"], ["Reviewed January 14, 2018", 3.0, "A bit old and tired", "It was a bit of a disappointment. Things looked old and well worn though still quite heavily visited. Not sure I would come back for a second visit. Food and other items were quite overpriced."], ["Reviewed January 14, 2018", 3.0, "Go at sunset", "It’s fun to see the carnivalstuff on the pier, see and hear the performers, see the fishermen clean out their catch (if any) and sit on the beach.\nMy partner was stung by a bee on the beach; dont know if thats something that occurs a lot but it was painful for an hour and less painful the days after.\n\nFun for about an hour. City wifi available if lucky.\nShow less"], ["Reviewed January 14, 2018", 4.0, "USA trip", "Beautiful location easy to navigate an easy bus ride from Hollywood would recommend a good pair of shoes also 3 blocks from the pier is a great shopping area with no traffic in it only pedestrians great variety"], ["Reviewed January 14, 2018", 4.0, "A Fair at the Beach", "There are rides and souvenir booths and food vendors and craft displays all along this walkable boardwalk raised high above the beach. This is a nice family attraction. We saw people doing yoga in open areas near the pier itself."], ["Reviewed January 14, 2018", 4.0, "End of the trail", "I've spent a few years exploring segments of the historic Route 66 and finally made it to the end of the line. Living in the desert, it was refreshing to visit the coast and see the ocean. I came mid-week to avoid the crowds and that worked out, well. Dogs are permitted on the pier, but not the beach.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Beautiful Beach", "This is a must visit while in Santa Monica. The beach is beautiful and the pier is fun for the entire family. We parked our car and rented bikes to get a up close and personal feel\nOf the area. The shops are average beach shops with towels and souvenirs and regular goodies . Of course many smoke shops are also on the beach especially when We ended up at Venice. Venice beach has a huge skateboard park , this was only about 15 minutes from the pier. I enjoyed myself and can’t wait to get back!!\nShow less"], ["Reviewed January 13, 2018", 3.0, "Been there done that", "we have been there , and done that no need to return\nYes it's unique , it has history however it's just a Pier\nLost of sellers selling not much\nThe fair / rides are expensive\nLike I say go see it , tick it off the list and move on\nShow less"], ["Reviewed January 13, 2018", 5.0, "Historic Santa Monica Pier", "Great atmosphere huge beach - easy access by public transport great for families, couples or solo when you need a place to wander and think\nLots of side shows going on acrobatics etc only downside was the food not so great and expensive if I went again I would take a picnic though.\nAll in all great day out oh and wait to buy souvenirs from the guy in the shop at the end of the pier near the sea he is nicer and better priced than the vendors who have stalls on the pier\nShow less"], ["Reviewed January 12, 2018", 5.0, "Iconic Santa Monica Pier", "We were in Santa Monica for Christmas and we really enjoyed soaking up the atmosphere on the beautiful Santa Monica Pier. There is lots to do on the beautiful Pier and an afternoon stroll is an absolute must."], ["Reviewed January 12, 2018", 5.0, "Fun place where everybody will find something to do", "Nice bright ambiance with filled with people from all age groups. Ran into a guy playing songs of Bruno Mars in a sitar. Yes, you read that right. Good food, lots of gift shops, benches to sit and just gaze at the infinite waterbody ... magical :)\nShow less"], ["Reviewed January 12, 2018", 2.0, "Underwhelmed", "Ticked it of the bucket list but a very sad lacking place to visit. Beach is dirty, homeless everywhere and drug addicts as plentiful as tourists. Shops on pier selling junk at expensive prices.\nRides keep your expectations low especially if you are from Australia.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Reminded us of Home and Years gone by", "This is your typical old fashion pier by the sea with some lovewlt gift shops and the famous Bubba Gumps restuarant which is a must to experience as the food is fantastic,just make sure your hungary as the portions are BIG!!"], ["Reviewed January 11, 2018", 3.0, "Think the pier needs a make-over", "I think if you are rush for time, you can skip this place. Pier looks old to me. Went early evening so not as crowded as I expected, perhaps everyone was already done for the day. Souvenir stalls scattered around the pier with many buskers trying their luck but I thought it contributed to noise pollution - hip hop dancers, someone trying to sing a western, another girl singing the latest pop hits. I tried very hard to discover the charm of this place, but failed.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Never Fails!", "Always a great place to visit and re visit! Plenty to do for everyone! The usual shopping, eating, plus more physical related activity for the young and active! Was with my family and we just added more memories again visiting this wonderful pier and it’s neighborhood! Perfect Weather too!!\nShow less"], ["Reviewed January 11, 2018", 3.0, "Looking for a frozen banana", "We were on our way to Venice and took a wrong turn! Parking was $10 and crowded. There are a lot of vendors selling stuff, some in a kiosk and some just selling fruit out of a bin. Hey everyone has to make money so I wasn’t bothered. On the pier we tried to find a frozen banana, my favorite beachside treat but no luck. We walked and enjoyed the area, but it was very crowded on the pier. The boardwalk was a nice walk with lots of people watching!\nShow less"], ["Reviewed January 10, 2018", 3.0, "Looking tired", "This was my third trip over a 12 year period and the pier was looking worse for wear - I still think it’s a must see but would be good to get it upgraded to keep the icon looking good and worth the trip"], ["Reviewed January 10, 2018", 5.0, "Fun place", "We took the band for all rides and got onto each and every ride here. It was a fun time for sure. Everyone will enjoy here"], ["Reviewed January 10, 2018", 4.0, "Fabulous old fashioned fun", "I love the pier, it reminds me of everything I loved in childhood - rides, fairground fun and food and cute little stalls selling souvenirs both cool and tacky! The mush do for me is the wheel and have a fortune from Zoltar"], ["Reviewed January 10, 2018", 5.0, "A fun place to see at night...great food...great views!", "Went at night and the place was just beautiful. Lit up like a Christmas tree!... we got there a little late so the amusement park had just closed, so check closing time. Quirky little souvenir shops, buskers and yummy food. A happy place to be! I dare you not to sing the song! ( all I wanna do is have some fun...until the sun comes up over Santa Monica Boulevard!)\nShow less"], ["Reviewed January 9, 2018", 5.0, "The Coolest Place EVER!", "We took our young children here and the rides were perfect for all ages. Nothing too crazy here. The atmosphere was great. The beach was great. The Ferris wheel looks AMAZING at dawn! We highly recommend this attraction!"], ["Reviewed January 9, 2018", 4.0, "Great place for walking and sightseeing day or night", "We visited Santa Monica Pier during a summer evening in August. We parked near the mall in the city area, it was quick walk and parking wasn’t expensive. We walked by sights as we made our way to the pier. We stopped at a burger place on the pier that was good. We walked around for a bit and went through the amusement area. This is a fun place for a date night and for a walk.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Colourful", "Dropped in on way to Venice Beach - kinda ‘cute’ but wouldn’t say spectacular. Bubba Gump had an hour wait, the Beach Burger Bar was nice instead."], ["Reviewed January 8, 2018", 5.0, "Fun day and night", "Make sure to go day and night to see it lit up. Very pretty and a great day with kids! Bathrooms are the cleanest too along this stretch of Santa Monica."], ["Reviewed January 8, 2018", 5.0, "Fun Historical Place", "My husband & I enjoyed a quiet morning walk on the pier. The view was beautiful & fun! We saw a seal & a dolphin swimming around the pier. I'm sure it's a fun place when all the shops & rides are open but it was great for a nice walk back in history. You can see old pictures & read about the history of the pier. Even in the morning there was one musician playing pleasant music & a few souvenir shops were open.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Felt like waste of time!", "We walked from Venice beach and compare to Venice which is so clean Santa monica is dirty and saw like 2 dead birds on the beach were kids was playing."], ["Reviewed January 8, 2018", 4.0, "Good eating joints around", "The pier was right outside out hotel so went down in the afternoon for a sightseeing and lunch. This was one long walk with restaurant and gift shops on the right side.we saw quite a few people fishing and saw lots of sea lions right below the pier. Sunset was an amazing sight. Just that the place was lot windy. I definitely recommend this place\nShow less"], ["Reviewed January 7, 2018", 3.0, "Great for a walk", "Walking on the pier at Santa Monica is kind of a right of passage. The offering on the pier are second rate amusement park. The people watching and views along the beach are first rate."], ["Reviewed January 7, 2018", 5.0, "New Year’s Eve!!", "What a great way to ring in the new year! Watching the East Coast celebration fireworks from the roller coaster was awesome!"], ["Reviewed January 7, 2018", 3.0, "See it, but save your money", "Great to go, see the view and take pictures. But certainly do not need to spend any money at any restaurant, store or ride. Again, great to go and have pictures."], ["Reviewed January 7, 2018", 4.0, "Another One for my Bucket List", "I've been visiting Sourthern California at least annually since 1978. But I never made it to see the Santa Monica Pier until near the end of our last visit. The occaison was prompted by a visit to see my niece who had recently relocated from Brentwood to Santa Monica. We planned to meet for dinner after she got out of work. I went a little early so I could see the Pier. Found a parking spot a few blocks from the Pier and got to it just after sunset. The Pier was crowded with people and the lights had just come on. The Ferris Wheel and roller coaster were carrying lots of people. Lots of street musicians with skills that ranged from ear-hurting to pretty damn good. Lots of shops with stuff I think only tourists would buy. The restaurants weren't that interesting in that they were often-seen chain reataurants that charge higher prices because they are on the Pier. Even so, most of them were full of people. At the end of the Pier, there is a second floor observation deck and I'm sure the sunset views are absolutely stunning. Wouldn't recommend that visitors go out of their way and through heavy traffic to come here though. Unlike the Piers in Huntington Beach and Seal Beach, there isn't much room for people to fish.\nShow less"], ["Reviewed January 7, 2018", 4.0, "About what you would expect.", "Great place to visit just from an historic perspective. Not showy, more touristy. Fun place to \"people watch\"."], ["Reviewed January 6, 2018", 5.0, "An iconic local landmark", "I will preface this by saying we have small children so the rides on offer were perfect! We had a lovely day visiting this iconic landmark, a place we had only read about or seen on tv. It was full of rides and games that entertained my 3 small children and the view! Who could complain about the gorgeous Santa Monica beachfront. We have absolutely loved Santa Monica. Such a beautiful part of the world. Great for tourists!\nShow less"], ["Reviewed January 6, 2018", 4.0, "Fun boardwalk activities", "You can't go wrong visiting the pier. The art and food vendors, souvenir shops, the rides, the beach, the people watching - it's a fun time for all."], ["Reviewed January 6, 2018", 4.0, "Nice atmosphere", "We enjoyed walking around the pier, there is a great atmosphere and nice places to eat and have a few drinks."], ["Reviewed January 6, 2018", 5.0, "Best beach", "We went to the Santa Monica pier for my sister yoga and it fun for me the water is so cold and the food Is great we will return soon"], ["Reviewed January 6, 2018", 4.0, "Well you have to go", "The end of historic Route 66. A mix of everything from t shirts shops arcade games food vendors fishing and amusement rides. It’s a must stop. Be prepared for a lot of people but sit back and soak it all in"], ["Reviewed January 6, 2018", 5.0, "Nice experience 👍🏻", "I wend last weekend... Very crowded but fun. We rented bikes which was cool but hard to navigate the crowds at times. Fun ride down to Venice Beach!"]]}}