{"Santa Cruz Wharf": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Cruz Wharf", "url": "/Attraction_Review-g33048-d269709-Reviews-Santa_Cruz_Wharf-Santa_Cruz_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/9a/aa/32/20161020-123606-largejpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1063"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Santa Cruz", "addressRegion": "California", "postalCode": "95060-5459", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Best wharf i visited", "We were advised by the hotel staff about the best sea food restaurants around the wharf.we had the most delicious meal watching the sea lion just below us.lots of seabirds,sealions , restaurant and gift shops along the wharf. one of the longest wharf walk we had although it was both sunny and very windy\nShow less"], ["Reviewed 5 days ago", 5.0, "A great collection of restaurants and shops", "Easy access, take card, pay when leave, not that bad, many parking spaces. Great restaurants and shops, and people watching and fisherman. Watch sunset over far cliffs and lighthouse on the water is worth the visit"], ["Reviewed 1 week ago", 5.0, "Nice walk.", "We were surprised to see how cheap it was to park on the pier itself, 1$ for every 4 hours. Nice little stores to shop for souvenirs. We ate at Woodies Café, good food for not much. Take a long walk until the end of the wharf and you can the seal resting or playing. While on it you have a great view of the boardwalk. If it’s windy just bring an extra long sleeve shirt with you.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Restaurants and a few shops", "If you are fish eater the wharf gives you several options of restaurants of varying degrees of casualness. I don't eat fish so choices were extremely limited. Prices are on the high side. There a couple of souvenir shops. In a few places you may find sea lions lounging below the wharf. A nice stroll that doesn't offer much shade.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great afternoon walk and dinner locale", "Visited the wharf late afternoon and stayed til after sunset. We walked the pier the enjoyed the ocean’s salty air, watched the hearty play in the waves and checked out the shops and restaurants. Parking is cheap - $1/Hour for the first 4 hours - providing more than enough time to eat before the price “jumps” to $2/hr.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice walk and don't forget to look under", "Enjoyed the views from the wharf and pleasant walk. The view of sunset is just awesome. The sea lions take their naps underneath just for and fyi. Many restaurants to enjoy also."], ["Reviewed 4 weeks ago", 3.0, "Cool wildlife, overpriced everything else", "I appreciate that the wharf has free access to the sea lions that hang out toward the farthest point, but the proximity of the wharf to the boardwalk means everything on it is above average in price. Not my favorite place to go in the area-Capitola is cheaper and, in my opinion, more fun-but by no means bad.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Must visit", "A nice way to spend an afternoon is to visit the Santa Cruz Wharf. Plenty of parking, lots of restaurants to choose from, shops and a candy making store where you can get chocolate covered bacon or Santa Cruz salt water taffy.\nYou can walk or drive, at the end of the wharf is where the large sea lions congregate and watching them is interesting. You can fish from the wharf in certain areas, get food to go or just hang out and look at the magnificent Pacific.\nThere are fishing tours you can sign up for also from the wharf.\nParking fee is reasonable and observing marine life is free!\nShow less"], ["Reviewed January 24, 2018", 5.0, "\"Great place!\"", "I love having dinner on the Santa Cruz Wharf! Lots of great restaurants to choose from. Especially fun to eat on the Wharf when it's raining and stormy. Have a great time!"], ["Reviewed January 23, 2018", 4.0, "A lovely place to visit", "Take a stroll up the wharf, and enjoy the sea lions at the top - they were all on the struts asleep when we went, which was great to see. Some nice eateries and shops. We were only there for half an hour so even had free parking!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great views, good food and shopping!", "Even though I live in Santa Cruz, I still love going out on the wharf for a meal on occassion. If you avoid peak touristy times it is an easy experience to park and find a table at a nice fish place. And on Tuesdays they validate parking, so that you don't need to pay to park. I love the ocean and Boardwalk views!\nShow less"], ["Reviewed January 22, 2018", 4.0, "Great place", "Visited in October so it slows down from the summer months, beautiful place on a nice sunny day to walk around and look at the view, lots of neat shops and restaurants around to go to. Great place to just sit on a bench and people watch. Will go back for sure.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Lot's of fun!", "My boys love going here. They love the rides and the beach and it's all around fun for the entire family."], ["Reviewed January 9, 2018", 1.0, "Too many homeless", "Too many homeless In the past was much better In the evening was scary to walk whit the kids Out of the hotel no way to enjoy the tipical SoCal atmosphere"], ["Reviewed January 6, 2018", 5.0, "Like San Francisco's Pier 39 but smaller scale", "...and a lot less touristy.\nA line of seafood restaurants and of course the historic Stagnaro Brother's restaurant and fish market. You can drive out onto the pier almost to the end.\nSea lions are often perched atop a plank seen through a large opening in the deck of the wharf towards its end. When you hear them from the beach, you know they're way down at the end of the wharf.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Nature, sea lions, food, shopping.", "Nice place to relax and bring kids.\n\nThere are shops to get local souvenirs, restaurants, candy shop, and great relaxing nature.\n\nListen to the sounds of the ocean, birds, sea lions, and someone’s spot a whale.\n\nIs so comfortable out here you might just nap on the bench.\nShow less"], ["Reviewed January 3, 2018", 4.0, "\"Nice place to spend some time\"", "We have walked this wharf many times. It appears to be the same, but really it is ever- changing. New shops, restaurants etc. It is not the place I would like to shop unless you are looking for souvenirs from Santa Cruz. Many restaurants to choose from. We enjoyed looking at the seals which is always a good show. It is also fun to watch the fisherman cast off and hope that they get something on their line. I for one love to just watch the ocean!\nShow less"], ["Reviewed January 3, 2018", 4.0, "Nice fun Getaway", "Santa Wharf is located adjacent to the Santa Cruz Beach and Boardwalk, a major tourist attraction. The wharf has a variety of restaurants, gift shops, wine tasting, candy stores, and one can just stroll and peer down at the sea lions below. The Wharf has over 1 million visitors a year who come to the Santa Cruz Wharf to fish, shop, dine and sight see. Since I live in Santa Cruz, I get there a few times a year. Enjoy it every time.\nShow less"], ["Reviewed January 1, 2018", 4.0, "California Classic", "Last time I strolled this wharf was three decades ago. Just did so again last month. As Jim Croce once sang, \"If I could catch time in a bottle...\" it would be like visiting the Santa Cruz Wharf. The shops may change. The restaurants may update. The visitors may come and go. But the place, the sea lions, and Monterey Bay seem timeless. It's a joy.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Wonderful", "We visited Santa Cruz for a quick getaway and really enjoyed the wharf. It is not really a shopping place, but there were lots of places to sit and enjoy the water and sea life. Attached is our dinner view!"], ["Reviewed December 31, 2017", 5.0, "So many activities!!!", "I drank a fishbowl, ate great food, admired seals and became an expert first time kayaker! We had an amazing time, kayaking was by far the best part, a must do! Don’t miss it!!!"], ["Reviewed December 30, 2017", 4.0, "Always a nice walk while in Santa Cruz", "This is always a nice walk, you can see people fishing off the pier’s, seals below the wharf, and there’s plenty of coffee shops and candy and restaurants for everyone’s liking’s.\nIf you’re a geocache sure there’s one at the very end of the wharf that’s worth discovering\nShow less"], ["Reviewed December 19, 2017", 5.0, "Beautiful spot!", "We got to see a local sea otter named Truffle swim around eating a crab as well as plenty of sea lions, people diving and just overall a good time, it was a quick in and out as none of the restaurants were open yet but we will certainly be ba k\nShow less"], ["Reviewed December 19, 2017", 5.0, "Love it!", "Absolutely love it. Beautiful views of the beach and seaside. You can walk at any time during the day, sit to enjoy the sun and watch the sea lions. There are several restaurants and gift shops so lots of options. A must place to visit in Santa Cruz.\nShow less"], ["Reviewed December 8, 2017", 5.0, "I walk to this place to get freah air and see the peole having a good time- it has been there over 150 years and is a mi", "rgw Wharf is a mile long making it the largest wharf in the usa- a must see attraction . Just go! I usually play guitar at the end or fish thre for fun0 it is beautiful views"], ["Reviewed December 4, 2017", 5.0, "Love this", "Absolutely love this place! You dont have to spend money since you can just sit outside, enjoy the sealions, seagulls, amazing views and sunsets. If you do get hungry or crave a cocktail, there are plenty of restaurants. Stop by for a souvenir? You can get one here too!\nShow less"], ["Reviewed November 29, 2017", 4.0, "Nice walk", "Very old, historic, gift shops, a few restarants. High point for us was at the very end where there were seal watching areas. Really fun."], ["Reviewed November 25, 2017", 4.0, "Plenty of choice to eat", "We went for a wander down the wharf to find somewhere to eat. There was lots to choose from we went to Woodies Cafe and had a great meal with pleasant service and fantastic views of the bay. We then walked to the end of the wharf to watch the sea lions, which is a must-do they’re very entertaining!\nShow less"], ["Reviewed November 21, 2017", 5.0, "Get the doughnuts.", "When at the Wharf enjoy everything but then head back north on Hwy 1 and stop at Ferrell’s Doughnuts. They are the best. Definitely. I try doughnuts everywhere I travel. I’m from Montgomery Alabama and have had doughnuts all over the world. Most recently as I traveled on an Oceanic Cruise around Italy and 3 other countries. I would say this place has the top 2 Doughnut anywhere I’ve had doughnuts. Light, fluffy, full of a unique taste, and plenty of choices. And they have one of the best ol cake doughnut shaped like tractor tires topped with chocolate icing. They are just as good the day after as they are fresh. Go get you one.\nVery reasonably priced. A dozen huge doughnuts. $9.95. You can’t beat that. Oh and they only accept cash.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Romantic place for the view", "Enjoyed the pier, was great to sit and watch the waves, get a drink. LOVED the sea lions, watched them trying to jump up into the beams and enjoyed their \"barking\" and antics."], ["Reviewed November 20, 2017", 4.0, "Beautiful views", "A lovely place to watch people and the ocean while feeling the crisp ocean air on your face. Grab a bite to eat or a coffee and enjoy the views."], ["Reviewed November 19, 2017", 4.0, "Must See Attractions (MSA) - Santa Cruz Wharf", "Santa Cruz is the perfect weekend getaway for families. We planned our trip in the last minute and guess what it ended up being one of our memorable trips.\nAt first I thought that the Wharf at Santa Cruz to be a normal place and nothing interesting about it. To my surprise I found the Wharf a perfect place to hang out with family. Me and my family visited the Wharf multiple times. Since the wharf takes you little bit into the sea it provides a really good view of the coastline and it is kind of peace and calm. Also we were able to see some of the wildlife up close from the wharf like sea gulls and sea lions. The sea lions were sheltering under the wharf, at first we did not realize that they were present there, but when we started hearing noises from under the wharf then we spotted them. Kids will enjoy this place very much. There are places to dine here and most of them serve clam chowder which was yum yum. Overall the Wharf is a perfect place for families to relax and enjoy.\nShow less"], ["Reviewed November 19, 2017", 4.0, "Always a Good visit", "Everyone needs to walk the wharf each visit to Santa Cruz.\nThe shops are nice,the restaurants offer some of the freshest tastiest food in the area but watching the seal lions were nice.They play,bark and swim entertaining all who stop to watch.Quite a few memorial benches to sit and watch what's going on in the waters.\nSaw a crabber catch an octopus so you never know what you might see.You'll see something different on all visits.\nFun walk on the wharf!!!!\nShow less"], ["Reviewed November 16, 2017", 3.0, "Fine, nothing super special", "Decent enough for some average tourist crap shopping, and the restaurants and bars looked good (we didn't eat/drink). Having cars out there kind of detracts from a nice walk out on the pier like you can do in many other cities."], ["Reviewed November 12, 2017", 3.0, "For tourists looking for trinkets and candy; also food", "Interesting walk that we take our visitors on, to see the seals and sea lions at the end of the wharf and to have dinner at Stagnaros. Can often see people fishing from the pier. Cars can drive out on the pier for a price, but we always walk. Lots of souvenir shops, candy shops, and restaurants. Food there is okay, but better at other locations in town.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Wharf was fun - pretty basic but the sea lions are a fabulous attraction for the kids", "Enjoyed taking a walk on the pier / wharf in Santa Cruz ! Little fish markets were great and the sea lions are so fun for the kids to see ! View is beautiful as well ! Definitely will be back ! It was very cool on the wharf so make sure to dress warmly !\nShow less"], ["Reviewed November 9, 2017", 1.0, "Shows her age and poor maintenance", "Again, I used to enjoy many an afternoon stroll, lunch and shopping here on the wharf. Pier is patched so many times it isn't holding. I really feel for the shop keepers here. Several restaurants have closed. It's just sad, but the air was still the ocean smells. The harbor seals and the massive sea lions are great. Fishing still a great treat for anyone. Kayaking always has been good here.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Driving onto the old wooden wharf is a kick, with first hour parking FREE.", "The old wooden wharf still hosts sight seeing boats, but it is now mainly a tourist attraction. There is an area where sea lions have taken over, and you can be very close to them, separated by a chain link fence. Animal lovers enjoy this very much. There are actually some happy hour deals at some of the restaurants, and so not all the prices are Tourist Too High.\nShow less"], ["Reviewed November 3, 2017", 3.0, "Nice on a pretty day", "If you want to stop at a beach and walk out on a wharf in Santa Cruz, this is the place. I'm not a \"boardwalk\" person (it's next to Santa Cruz Boardwalk), as I don't do rides and am not a fan of touristy stops, but I did enjoy sitting on the beach and watching my nephew play in the water. We walked out on the wharf and once again, it does have touristy shops, but I liked the water view and seeing the sea lions. They did have a small Halloween exhibit.\nShow less"], ["Reviewed October 27, 2017", 5.0, "A fun visit", "Nice walk. Loads of playful seals to see and photograph from the pier. Shops and restaurants to visit. Good for all ages. Handicapped parking on the pier."], ["Reviewed October 26, 2017", 3.0, "Our first time driving on a wharf!", "We were fascinated with the seal and sea otters that were under the wharf and spent a long while watching them and trying to figure out how the seal got up onto the high beams! Then we walked down and found a place to eat."], ["Reviewed October 23, 2017", 5.0, "Mr G", "Lots to do plenty on cheap parking close to beach boardwalk and many hotels. Down town with in walking district"], ["Reviewed October 19, 2017", 4.0, "Food options", "Several places from coffee shops to full restaurants and bars. Decent Mexican food and basic meal options at Splash. Shops are mainly tourists nik nack type stuff. Fun to roam and watch the sea lions bark and play off warf."], ["Reviewed October 18, 2017", 5.0, "I love this place", "Whenever I am in the area I enjoy a walk to the end of the wharf. There are always barking sea lions under the pier, people fishing, take away sea food, restaurants, gift shops, hand holding, children laughing. Plus a great view back at Santa Cruz. I sat with several people to watch the sunset\nShow less"], ["Reviewed October 15, 2017", 4.0, "Had lunch at the Harbor Cafe", "so I got a chance to walk down by the water and look at all the boats, away from the Boardwalk crowd"], ["Reviewed October 14, 2017", 5.0, "The sea lions", "Such a beautiful, character-filled old Wharf lined with great shops, restaurants and takeaways - the Dolphin Restaurant does great fish and chips - we got them from the to go window and sat out enjoying the sunset. Wherever you are on the Wharf you can hear the sea lions barking away at each other and can stand and watch them rolling around for ages as they are all so entertaining and seemingly oblivious to the people high up above them watching their interaction.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Good restaurants, great views.", "The iconic Santa Cruz Wharf is home to several excellent restaurants. During the summer, the quality of service drops a bit, but in the off-season, you can get great food and service at excellent prices."], ["Reviewed October 9, 2017", 5.0, "It’s just fun", "The weather has been perfect this trip & we always enjoy a stroll along the pier. Rivas restaurant is our favorite for seafood!"], ["Reviewed October 8, 2017", 4.0, "Nice Little Stroll", "Had a nice little stroll along the pier whilst on holiday with great views of both coastline & my gorgeous wife. Wandering holding hands in the sun, what could be better. Saw lots of Sea Lions that live under the pier. Worth a visit if in the area. 9/10\nShow less"], ["Reviewed October 6, 2017", 3.0, "Not worth a special trip.", "If you're on the beach boardwalk, the wharf is close enough to walk to but not worth a special trip. First impression, dingy and in disrepair. Restaurants uninspiring except perhaps a new place called Splash and outdoor seating at The Dolphin at the end of the pier. Decided not to try either because the wharf overall felt actually more depressing than inviting.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Gorgeous", "What a beautiful stretch of coastline. We saw pelicans, otters, sea lions by the boardwalk. There were beautiful stretches of beach, light house, surfing memorials etc. lots of fun to walk and take in the scenery."], ["Reviewed October 4, 2017", 4.0, "A lovely area to explore.", "Several good restaurants, a made-in-Santa Cruz shop, Mariani's candy shop and a chance to watch to harbor seals. Gilda's is an old established restaurant for a variety of everyday entrees and sandwiches. Has nice views and good prices."], ["Reviewed October 4, 2017", 4.0, "Nice place to stroll plenty of restaurants and shops", "We went for a stroll and dinner. Nice view. Plenty of restaurants to choose from. Nice shops. Good place to wander around."], ["Reviewed October 3, 2017", 3.0, "Just ok", "Restaurants seemed a bit run down and dirty outside of entrances. At at one, was ok, but not very clean, tables, etc."], ["Reviewed October 2, 2017", 5.0, "A Pacific Delight", "The Santa Cruz wharf embodies the glory of the Bay Area surf, sun, sand, seagulls, sea lions, souvenirs and delicious seafood!!!!\n\nWe enjoyed a sunny day at the wharf for lunch at the FireFish Grill restaurant. We enjoyed outstanding fresh seafood and one heck of a bacon cheese burger.\n\nThe wharf was a delightful mixture of old and new, classic and modern, and had us wishing we had more time to enjoy all the shops and restaurants.\n\nIf only the ocean wasn't so calm, I'm sure we would have seen quite a surfing show as well.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Love this place!", "The wharf is a great place to shop, eat, kayak, seal watch, stroll with your honey or just get away from the crowds. Very relaxing!!! Just needs to be cleaned up a little bit."], ["Reviewed September 30, 2017", 4.0, "Put your walking shoes on!", "We visited the wharf on a recent combined business/pleasure trip to Santa Cruz. My husband loves fishing of all types, so we loaded up our rods and mini-tackle box and headed out. The whole area was a little confusing for strangers to the area ( like us) and we ended up heading around the block a couple of times before we got our bearings. You have to pay to park on the wharf, so if you enjoy walking it is probably smarter to find an all day lot close by and take a hike! We had heard that fishing was usually only fair and that was our experience as well. There are a variety of shops and restaurants\nall along the walk which we enjoyed. We picked up several souvenirs including a terrific fleece jacket at less than half price! It's my new favorite fall jacket. Lunch was at Woody's (separate review), and we wondered past a number of other restaurants as well.\n\nPhoto opportunities are plentiful, so don't hesitate to bring your camera.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Wharf Restaurants", "lots of restaurants to choice from on the wharf and there is parking there too. Boardwalk was closed. There are a lack of nice hotels."], ["Reviewed September 29, 2017", 5.0, "Sea lions or seals were fun to watch and the seafood was great.", "Be sure to visit the Wharf. It is paid parking - pay when you leave - but there seemed to be parking all along the wharf. Best to go to the far end, park and watch the seals and sea lions on the wharf structure below though big square fenced openings in the pier. You may see them better in the sun on a section that sticks out on the south side of the pier a bit back toward shore so walk down that side.\nWhile the seals are fun to watch (and listen to while they \"bark\") the other main feature of the Wharf is the seafood. Stagnola Brothers has been there since 1937 run by the same family offering fine dining inside for fairly moderate prices or outside you can get carry out at lower prices including soups like chowder, seafood , and sandwiches. Outside they also sell, like a market, fresh fish both local catch and other seafood to take home and cook yourself. This place is as authentic as you can get and the local fish as fresh as you can get so you can imagine what they serve inside is excellent too. It was. But there are a number of other good restaurants on the pier (like Riva Cafe) so if you are there for a few days or nights you have a number of good choices.\nShow less"], ["Reviewed September 28, 2017", 5.0, "The Wharf!", "I enjoyed strolling the Wharf. Shops and restaurants and plenty to see. Walk to the end of the wharf to view the sea lions. They sleep and play under the wharf and can be viewed on the sides and through the viewing area."], ["Reviewed September 27, 2017", 4.0, "Nice views and lots of Sea Lions", "The wharf has a good range of shops and restaurants. It also has great views of the boardwalk and the beach. If walk to end on the left hand side you can't help but hear the constant barking of the Sea Lions catching the sun and playing around.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Longest wharf in the USA Half mile Long", "This was really fun. For 5 bucks you can drive out on the wharf. There are several place to eat and drink. Great time"], ["Reviewed September 17, 2017", 5.0, "Sea Lions Are Always Fun; Dinner at The Dolphin - Santa Cruz Wharf", "We have visited Santa Cruz Wharf many times. This time we went around sunset. We liked seeing the sea lions. There were lot of them. We then enjoyed dinner at The Dolphin. There is a parking fee to visit the Wharf."], ["Reviewed September 17, 2017", 3.0, "No different to other wharfs along this part of the coast", "Having visited Pier 39 in San Francisco and Monterey Wharf there isn't a huge difference. Shops and restaurants abound with great views out into the bay, the ever present sea lions and sea birds. Saying that you still feel like you have to take the stroll and tick it off the list of things to do while in Santa Cruz\nShow less"], ["Reviewed September 17, 2017", 4.0, "A must sea while in Santa cruz", "Old time wharf, lots of sea lions sitting under shards, cut out for viewing. Good view of amusement park on beach. Expensive parking, meters are best if you can get one (1.50/hour) . Kitchy, old time vibe. Breezy walk and nice views of ocean front."], ["Reviewed September 17, 2017", 4.0, "Wharf parking", "Spent a half day road trip from San Fran to Santa Cruz by driving Route 1, which was a great scenic drive in itself. Rather clean for a wharf. easy parking but it was a week day. Had nice lunch here at Dolphin restaurant, and took lots of photos. great views. nice breeze that day. surrounding area was a nice walk.\nShow less"], ["Reviewed September 14, 2017", 5.0, "We love it.", "We would never come to Santa Cruz and not stop in at the Wharf. Loads of shops and restaurants, but the viewing of the seals and sea lions is amazing. Could gaze at them for hours! You can also rent kayaks, and there is lots of people watching to be done!\nShow less"], ["Reviewed September 14, 2017", 5.0, "Gilda's Restaurant on the wharf", "The only place I will eat on the wharf. I try to make the 35 mile trip once a month just to order the luncheon crab salad which has no shortage of crab and even the bread that is from a local bakery is delicious. I have been going for several years and the quality does not change\nShow less"], ["Reviewed September 13, 2017", 4.0, "Never knew you could drive on boardwalk", "Parking - they don't validate - $10 a trip. Love the wharf in general - a night out with dinner, drinks, and walk down the pier was great. There are places to watch and listen to seals here (opposite of restaurants) so great place to show the kids.\n\nDinner - if you're going to wait - get a spot by the window. I mean... you are there for the experience.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Parking a nightmare", "Parking is crazy here. We had to go around the block a few times to find a car park, and they charged us $20. There is still lots to see and do if you don't want to spend money on rides and it does not cost anything to go into the area.\nShow less"], ["Reviewed September 12, 2017", 2.0, "Santa Cruz Visit", "The pier is dead during the morning and weekdays (which is when I visited). I used to visit 50+ years ago and it has changed little over the years although it should! It is tired and in need of sprucing up. The area around it is rather run down and in need of urban renewal.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Great place to view the sea lions!", "My goal, when in Santa Cruz, is to be doing something along the water, enjoying the views of the ocean, the sea life, dining with a view of the sea,..... One of the best options if you want to observe some sea life is to go to the Santa Cruz Wharf. There are many sea lions resting on the piers under the wharf, with several viewing spots, with rails, towards the far end of the pier. There are often people fishing along the pier, and so you'll also see sea gulls ready to take their catch, as well as pelicans flying by. Many times you will also see some otters or seals swimming in the ocean, as well. It's a great place to capture some photos, and you have a view of the Beach Boardwalk, as well. Then there are the dining establishments and tourist shops. If you wanted a Santa Cruz sweatshirt, beach-related souvenirs, etc., there are a few little shops to browse through, and quite a few restaurants, as well as walk-up food stand options where you can enjoy a meal, while observing the activities going on around the wharf and the sea. Or, just rest on a bench to relax and unwind, looking out towards the ocean.\n\nI didn't give it 5 stars, as it's not the best restaurants, nor are there a lot of shops, but it is an enjoyable escape, and worth wandering along, if you are in the area. Parking on the wharf is currently $7.\nShow less"], ["Reviewed September 6, 2017", 3.0, "The crows nest", "Not so good. They tried\nTo make everything alright, but the food was just not great. Don't try to feed an Englishman bad fish and chips. Fish was dry and Panko. Real fish and chips are batter fried. The ceviche was ok. Views were good, but a tourist trap.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great place to walk", "My kids and I enjoyed walking here more than the boardwalk. They enjoyed seeing the seals and otters. It is great fun to people watch here, too. There are a couple of restaurants and restrooms."], ["Reviewed August 31, 2017", 4.0, "A good place to walk", "The wharf is loaded with shops and restaurants. Seals live under the pier and fun to watch them sleeping. Sound of all their barking is very loud."], ["Reviewed August 28, 2017", 4.0, "A nice walk and places to satisfy your appetitr", "The wharf or pier is lengthy and a good home to the end. Along the way I bought a jacket as I was cold. I realized my last hoody was from Santa Cruz when I visited in 2010. If you prefer other souvenirs there is an assortment, along with chocolate and candy, food and coffee. At the end of the pier I enjoyed a bowl of chowder while listening to the sea lions and when I got back to the start a cup of coffee. The next night we ate dinner outside on the pier. Both days, there salespeople strolling, fishing, eating and drinking. A popular splendor visitors.\nShow less"], ["Reviewed August 26, 2017", 4.0, "lot's to eat", "if you are craving seafood this is a great place to stop by. May different kind of restaurants await you to try from cheap fry fish to expensive dine in you can choose. You can also rent boats and shop the shops so plan ahead."], ["Reviewed August 23, 2017", 4.0, "Restaurants, shops, sea lions with a great view", "Great way to spend a few hours. Lots of quirky shops to browse in and the sea lions are always a hit. They have some really good food on the wharf hitting all the price points. The various restaurants have amazing views and haven't disappointed yet even after 40 years of visits.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Good place to see seals", "The seals halfway out are very entertaining, and you can get pretty close to them (from the perch above). The view of the bay is great. But the stores are touristy and parking is expensive and hard to get close."], ["Reviewed August 19, 2017", 4.0, "Nice walk, the seals are amazing!", "We came to have lunch but even better than the food was seeing the beautiful seals and sea lions! They're simply adorable! Nice view of the boardwalk. Stagnaro was a bit overrated and it would have been nice if they allowed restaurants to validate parking."], ["Reviewed August 19, 2017", 4.0, "Go for the sea lions", "As stated in other reviews it's a wharf. There are souvenir shops and restaurants starting about half way down. We didn't stop at any of them but watched the fishermen, people in kayaks, surfers and of course the sea lions. There are a set of stairs you can go down to get an up close look and see their antics under the wharf also. This is well worth the walk out onto the wharf.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Not quite what we expected", "I was surprised by the empty stores on the Santa Cruz wharf and thought it seemed a little rundown. It was clear that some restaurants and shops had closed, while the remaining stores were pretty touristy. We enjoyed watching lifeguards dive off the side of the wharf and saw many sea lions barking and lounging on a deck just underneath.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Lovely afternoon walk and visit to see the barking sea lions.", "I wanted to take my son here to see barking sea lions. He loved hearing them from a distance and then getting to peak through the cut outs in the wharf to spy on them. We were able to see quite a few of them laying around and just snoozing. He had a blast counting them and watching the funny ways they were lying in. They are some shops and eateries to extend your visit as well. We loved the breezes and being able to enjoy the ocean without competing with all the bodies on the beaches.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Nice view, good fishing", "My son had a great time catching anchovies, and everyone enjoyed the antics of the sea lions. Lots of nice shops and restaurants too."], ["Reviewed August 8, 2017", 5.0, "It's a Wharf", "What more is there to say? A lot. One the left hand side, about the middle, there is a place were the sea lions hang out and it is fun to watch them roll into the water. Sometimes you can even go down and get fairly close if the stairs are open. Great food all along the way, snack shop, and trinket shops, too. The place just smells great, like a wharf should/\nShow less"], ["Reviewed August 7, 2017", 3.0, "Nothing Special", "There are some retail shops and restaurants (we didn't eat there), other than that it's just regular pier like all the others. A good place to hang out with your lover and romancing the ocean horizon, seagulls and pool of fish down below."], ["Reviewed August 5, 2017", 5.0, "Memorable experience", "A memorable place to visit and experience the California coast and its culture. People are laid back and friendly, good restaurants, and memorable viewing of sea lions and other wildlife.\nOne caution: I initially parked away from the wharf area along River street. I noticed some vagrants (hobos) trying to break into a parked car. Parking in bigger lots near the wharf would seem safer as there are gate attendants.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Wildlife", "Amazing to go out on the fishing pier and hear the sea lions bark and see the little sea otters trying too open the oysters And all suddenly a huge whale is throwing itself out of the water only a hundred meter from the pier Wow\nShow less"], ["Reviewed July 31, 2017", 5.0, "All of Santa Cruz is worth seeing", "This is a lovely beach town . The wharf is nice . There are hotels as you walk away from the wharf that are nice to eat and watch the scenery.\n\nOn the wharf itself we had tried several restaurants and it was not good at all :Not the seafood or anything else we tried there.\n\nIf you drive away from the wharf towards the right as you face the sea there is an area where you can park your car and have a lovely walk and view of the sea.\n\nThere is an amusement area but we did not visit it to the left of the wharf.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Very active", "Seems to be a great culture here. Volleyball courts line the wharf and this attraction is closely accompanied by the famous Santa Cruz Boardwalk"], ["Reviewed July 28, 2017", 3.0, "Dinner after a long walk", "The wharf is very nice and has some fantastic views. You can see a lighthouse where the surfers Museum is and at night the boardwalk looks fantastic all lit up. There are a lot of restaurants and the one we ate at was pretty good, the highlight of the whole window view into Monterey Bay. You could hear and see sea lions barking under the wharf.\nShow less"], ["Reviewed July 27, 2017", 5.0, "great place to see the sea lions", "The wharf was the highlight of our trip due to the sea lions. They were so close. We watched them for a while. I loved watching them sleep, bark, and interact with each other."], ["Reviewed July 27, 2017", 4.0, "Ocean Breeze with VIEWS!", "You can't go wrong with the amazing views of the ocean and surrounding coast. There are fun little trinket shops along the wharf and several restaurants. I would have liked to see more interesting boutiques because all of the stores basically carry the same \"Santa Cruz\" apparel and touristy items. None of the restaurants really popped out as exceptional, and the one we ate at was pretty 'average'. But, all in all, the walk down to the end was worth it because there is nothing like being on the water.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Fun summer evening", "We spent a few hours here for the kids to ride some rides. We enjoyed watching the sea lions, playing some sand volleyball, eating dinner, and of course the rides. We happened to go on a Monday night, which was retro night. All the rides were only 1.50 each, so that was a nice surprise. Although it was a bit crowded becuase of this, but not too bad. Kids and teens really enjoyed it!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great memories", "We came here as a kid, now we live here. The wharf has a lot if Great restaurants, shops and even a candy shop. You can parkl and go to the Boardwalk if you'd like, but if you're going to be there all day, don't park here. You are able to fish off the pier and I'm not sure if this is replace they have fishing charters. A great place to visit.\nShow less"], ["Reviewed July 25, 2017", 4.0, "Don't come before 11am.", "We visited on a cooler day, the wharf was not crowded and parking spots were plentiful. However, if you arrive before 10, not all the shops are open and most of the restaurants aren't either. Easy to navigate if you are there to see the view and watch the sea lions and seals.\nShow less"], ["Reviewed July 23, 2017", 3.0, "Plenty of Restaurants", "Parking is available on wharf, plenty of restaurants and some shops. Below wharf there is spot where sea lions congregate. You can walk down steps for up close and personal view and photos. View is gorgeous"], ["Reviewed July 23, 2017", 3.0, "Potential", "Santa Cruz is so nice and the Boardwalk is so famous but you never really hear of the wharf. They have one but it isn’t in tip top condition. There is such potential here. Other way smaller cities have nice wharfs and Santa Cruz’s is pretty much for show. You can go and shop but I’m telling you it’s just not nice. Might as well and wait till you get to Frisco.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Nice restaurants claiming to have fresh seafood!", "Much slower pace wharf than San Francisco. People are strolling leisurely, enjoying views of the boardwalk and locals fishing for small fishes. Had some laughter with other couple, when noticed the food delivery truck unloading cases of frozen seafood to the restaurants which claim the fresh seafood dishes, though!!\nShow less"], ["Reviewed July 19, 2017", 4.0, "Nice shops!", "Many places to eat and clothing shops. Fun to see fisherman. Long walk to end of wharf. Pretty view of Boardwalk and beach."], ["Reviewed July 19, 2017", 5.0, "A great outing to enjoy the views", "I love the wharf it's a great place to get some beautiful views and along with the beautiful restaurants you can always get something good to eat in one of the fine restaurants. And don't forget there's also a little wine bar upstairs close to the end of The Wharf, and you can also have breakfast, yes, there's a few places that do breakfast\nShow less"], ["Reviewed July 17, 2017", 5.0, "Crowded and scenic combo!!", "First time here n I heard the cry of a sea lion for the first time !! It was a nice walk n there is always a cold wind even in summers!! This place is super duper crowded which is the only drawback !! It's beautiful around wen u look from here !!\nShow less"], ["Reviewed July 15, 2017", 3.0, "The local council needs a shake up.", "Such a potential gem, looks like a run down business. Tourist tshirt shops, average food outlets, wharf urgently needs millions spent to fix the decay."], ["Reviewed July 15, 2017", 4.0, "Nice Stroll Down the Wharf", "While in town for a couple of days, we took a couple of walks down the wharf, once midday and once Friday Evening. The wharf has a number of restaurants, gift shops, and awesome views of the ocean and Beach Boardwalk.\n\nIf you have some extra time while visiting the area, I recommend driving or walking down the wharf. Oh and you can enjoy some good ice cream or candy there too.\n\nEnjoy!\nShow less"], ["Reviewed July 15, 2017", 4.0, "Nice walk", "We walked up here a couple of times, a few shops & restaurants to look at and eat in. It's a great spot to look at the views. We mostly stood looking at seals!"], ["Reviewed July 14, 2017", 5.0, "Family tour down the PCH", "Excellent stop and lots to see & do. Lots of marine life to see. Seafood in abundance. Close to the Boardwalk and also free to walk down. Walk right to the end for great pics of the sea lions etc"], ["Reviewed July 13, 2017", 4.0, "Worth a stroll...", "A very nice pier/wharf if your in Santa Cruz and definitely worth a slow stroll to take on the view of Santa Cruz in the distance, the seals, restaurants etc. It want blow your head but it's a very nice hour spent and in a good location to explore other things.\nShow less"], ["Reviewed July 11, 2017", 4.0, "A Great Place for an Outing!", "We, a family group of five including our grand daughter, had gone on a weekend visit to the Santa Cruz Wharf and Pier. Being a weekend, it was a bit of a challenge to get a parking spot. The boardwalk has several attractions including several rides. The Pier is unique in that there is parking available on the pier itself. There are several restaurants and a variety of shops. There is also a bonus opportunity of fishing from the pier.\nShow less"], ["Reviewed July 11, 2017", 4.0, "A stroll on the pier is a must", "Be sure to bring your fishing pole and a \"Lucky Joe\" jig and fish for rock cod, perch, smelt, etc. No license required! The pier has fresh-caught fish for sale and an assortment of restaurants to fit every budget and taste. Or charter a fishing boat. Great views of the Boardwalk, the beach, and the surrounding cliffs.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Shops and restaurants", "The wharf doesn't only offer a fine choice of restaurants and tourist shops / boutiques, but also a great view of the beach and boardwalk; a great place for sunsets."], ["Reviewed July 9, 2017", 1.0, "Worthless", "Santa Cruz itself left us scratching our foreheads, we've never been there before, we will never come back again. Hopefully our experience, will save my friends time and money."], ["Reviewed July 8, 2017", 5.0, "a great destination walk", "This very very long pier is a great place to stretch your legs and get some fresh sea air in your lungs while enjoying a great view, day or night. There are shops and restaurants, but they are easy to ignore if you like. The view back to the boardwalk is great, and better still are the sea lions that cluster under the pier in easy view, and the pelicans along the railings! This is an unforgettable part of any vacation to Santa Cruz.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Great for a Stroll and more!", "Gift shops, restaurants, ice cream shops line your walk towards the end of the wharf. Stop and watch the sea lions sleep or play. The views from any side are fabulous but don't feed the seagulls ... they will hover above and drop dangerous processed food on you. True fact!\nShow less"], ["Reviewed July 6, 2017", 4.0, "Nice drive-on pier with shops and restaurants", "You have to pay to park on the wharf, but it was worth it for us, because it is a long walk to the end. Make sure and check out the amazing water fountain towards the end of the pier in front of one of the restaurants- cool octopus metal sculpture.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Santa Cruze Wharf", "the Wharf is a great place to spend the afternoon soaking up some of the local flavor of Santa Cruz. Lots of neat shops & eateries."], ["Reviewed July 4, 2017", 3.0, "Nice Wharf", "Nice wharf to walk down. Price for our parking in the wharf parking lot was $5 for about 1 and 1/2 hour to 2 hours. If you are already at the Beach Boardwalk for the day and have paid your $15 parking pass for the day, you can easily walk here. Has lots of restaurants and shops with some reasonably priced items in them. We went in the morning and the seals you can watch off the side of the wharf were jumping out of the water and doing flips on their own in their own habitat, better than Sea World.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Great food on the wharf.", "Pleasantly surprised by the good dining options. Fire Fish Grill. Super and casual. A bit upscale from some of the other place. Decent shopping for beach related items as well."], ["Reviewed July 3, 2017", 4.0, "Just walking around", "This place has some nice gifts at reasonable prices. There are several places that offer nick nacks to t-shirts. There are also several food places to eat so you can rest and enjoy some good food."], ["Reviewed June 29, 2017", 5.0, "Escape the heat", "Drove from sac when the temps got to over 100. Good food and a nice walk with cool ocean air. You can rent a boat or fish from the pier."], ["Reviewed June 29, 2017", 5.0, "I NEVER miss it!", "I never fail to stop at the Wharf when I'm in Santa Cruz. I love viewing the sea lions. Even when they are not perched on the boards under the Wharf, you can see starfish and/or other good things!\nThe shop \"Made in Santa Cruz\" is a really fun stop and there are several good restaurants! I would recommend Gilda's for anytime; try to get a window seat! Dolphin at the end of the Wharf is also good for casual occasions and has a wonderful view. For a little more formal milieu, Stagnaro Bros. is the bomb!\nThe Santa Cruz Boardwalk can be seen from the Wharf and there are photo ops and take-out seafood and typically beautiful weather.\nThe Santa Cruz Wharf is one of my personal \"Happy Places\".\nShow less"], ["Reviewed June 28, 2017", 4.0, "Strollin the wharf", "Stunning views back to the carnival ashore and out to see. Heaps of shops and places to eat. But when you hear that sea-lion holler its just magic...wow"], ["Reviewed June 27, 2017", 5.0, "Lots of things to do and places to eat", "Very busy wharf with lots of places to eat.... a nice place to have a stroll. Parking is a challenge."], ["Reviewed June 26, 2017", 4.0, "Enjoyable", "Hit up the wharf on a Thursday evening and it was not too busy which made it enjoyable. We walked the length to check out all the shops and restaurants before deciding where to eat. The sea lions were not around so it was quiet, but didn't get to check them out. Beautiful view of the water and shoreline and the sunset was also very peaceful.\nShow less"], ["Reviewed June 25, 2017", 4.0, "A Santa Cruz must!", "Each restaurant is a bit overpriced, but it's worth it to hit a happy hour or two. The views in most places are great and you can watch people swimming and kayaking; we even saw two seagulls trying to steal a fish from a sea lion.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Family fun", "Great spot to eat, walk and shop Easy access and just the right amount of shops, not overwhelming. Food is very good especially clam chowder!"], ["Reviewed June 23, 2017", 4.0, "Shop, Eat and View Sea Lions on This Huge Wharf", "This huge long wharf (2,745 feet) is the longest pier on the West Coast of America. It was built in 1914 for commercial purposes. Now it's for tourists to shop for a variety of souvenirs including a local sock shop and to enjoy a meal at the many mainly seafood restaurants. Another pastime is to watch the sea lions, with the bull, his cows and the pups, rest and sun themselves and eventually clumsily move on the raft to slip into the water. The innumerable wood pilings support the paid parking spots on the pier besides the tourists. We visited the wharf twice in the two days we spent in Santa Cruz and enjoyed this top tourist spot.\nShow less"], ["Reviewed June 22, 2017", 3.0, "About as expected", "As expected there are a number of tourist shops on the wharf and restaurants. We had fun watching the sea lions cavort and enjoyed walking along the wharf to the end. Had lunch and walked back. As mentioned, there is a parking fee on the wharf and metered on the streets around it. But it was not too bad--$1 for 20 minutes so $3 for an hour. It was a nice way to view the city and the amusement park next door.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Nice walk", "Nice quick walk with shops and cafes along the way. Good place to see surfers and when I was there they had lifeguard training that was fun to watch"], ["Reviewed June 21, 2017", 4.0, "Pretty wharf - lots to see", "A pleasant walk with great views out to sea, the Boardwalk and the beach. Seals are a regular attraction. Some great places to eat - either sit-down or just seafood at one of the kiosk vendors."], ["Reviewed June 16, 2017", 4.0, "Seal show at 12!", "Star performers were the seals, nude sunbathing mid-way up the pier.\n\nFunny how watching them doing nothing at all was so fascinating. It was like a zoo out there, standing only 10 feet away from those lazy animals!\n\nDon’t know about allowing cars to drive up & down the short distance. The asphalt looked pretty run down, with cracks all over the place…\nShow less"], ["Reviewed June 14, 2017", 5.0, "You MUST visit", "Great views of the Bay, Boardwalk, surfing, sea life. If you don't go to the wharf you've missed out on local shopping...check out the stores that have items from local artists! Watch and listen to the sea lions resting underneath. It can be breezy even on a hot day so you might want a sweater. I love the seafood and clam chowder from most of the restaurants, but love the view from Stagnaro's upper level.\nShow less"], ["Reviewed June 12, 2017", 4.0, "Great place for a stroll", "It was great to walk on the Wharf and see all the shops and restaurants. The Sea Lions are another attraction and it was good to be able to see them especially at the end of the Wharf."], ["Reviewed June 11, 2017", 3.0, "Your average California Wharf", "It's nice - touristy. Compare to Monterey, Santa Monica,... it's nice when you're there. Splash is a fun restaurant with a rotating platform, some shops - so if you're there, it's good for a stroll or run but not a destination."], ["Reviewed June 11, 2017", 4.0, "Nice walk on a warm day.", "Lots of parking for a price. Lots of restaurants and gift shops. The best part however is the views of the ocean, beaches, and boardwalk. A good way to enjoy a warm day and a nice walk."], ["Reviewed June 10, 2017", 5.0, "Great place for a morning run", "We went to SC for weekend and I ran the wharf every morning- beautiful run! My teenagers came with me one morning and stopped for clam chowder which they are for breakfast! Very friendly people and a scenic view!"], ["Reviewed June 10, 2017", 4.0, "very scenic walk, some stores and places to eat. Nice view of the beach", "We recently returned from Santa Cruz and had a nice time there. The wharf is basically the main strip alongside the beach in Santa Cruz. It is very scenic, great for people watching (sand volleyball games going on, etc.) and has some nice shops and eateries along the way. We had lunch at a nice little place called the Picnic basket which has a nice view of beach. Great area for biking as well.\nShow less"], ["Reviewed June 9, 2017", 4.0, "Really nice scenic walk", "The wharf is very nice to take a romantic stroll on with quaint little shops and restaurants to grab a bite or a drink if you prefer. I highly recommend stopping and visiting the seals and sea lions as they are always a site. However, the stairs can be a bit nerve racking as they are wooden and while very sturdy look as if they might break at any moment dropping you into the Ocean. But still a very spot and stroll.\nShow less"], ["Reviewed June 9, 2017", 4.0, "A pleasant walk", "We came on a gray, cool morning, and the wharf was pretty quiet. We enjoyed the views and the barking sea lions. We didn't really go into the (touristy) shops. There is parking on the wharf, but we did street parking about a block away."], ["Reviewed June 6, 2017", 5.0, "Good morning visit", "We arrived early morning and we drove inside without having to pay because they charge for parking from 10 AM. We had a nice walk, took photos of the seals and had coffee in one of the restaurants with nice ocean view."], ["Reviewed June 2, 2017", 4.0, "Always fun on the boardwalk", "Santa Cruz is a fun place to visit. There are cute coffee shops, boardwalk rides, birds, fisherfolk and the like. It is fun to walk along the waterfront and hear the waves and see the sight. Beware tar in the sand though!"], ["Reviewed May 30, 2017", 5.0, "Sea Lions!", "Worth all the hassles of parking (we walked a mile) to get to the end and see the sea lions below! Bring your own sunscreen - we couldn't find a single shop, out of all those tourist traps, that sold it!"], ["Reviewed May 26, 2017", 5.0, "Stopped for dinner and drinks, beautiful views", "Enjoyed walking down the Wharf, watching surfers/sea lions, checking out the shops and stopping for dinner. Within walking distance of the beach boardwalk."], ["Reviewed May 26, 2017", 3.0, "Typical seaside pier/ wharf", "There are shops and restaurants about a third of the way in and the seals are fun to watch and listen to. It is looking a little tired and run down in places and needs some maintaining or renovation"], ["Reviewed May 24, 2017", 5.0, "Dinner", "Had a great dinner with family! Great views and friendly area to visit. Take a jacket in evenings to stay warm."], ["Reviewed May 24, 2017", 5.0, "Love the wharf", "I've been going here for years. There are shops, restaurants and great views. You can also watch the sea lions"], ["Reviewed May 22, 2017", 5.0, "Eat, fish, listen to music, shop, talk to the seals, watch the boats,walk, etc.", "Great place for many activities or just to hang out at. There is something for everyone who loves the Ocean. Parking is a problem if you don't get here early on weekends."], ["Reviewed May 22, 2017", 5.0, "Santa Cruz Wharf", "The wharf is a main attraction for Santa Cruz visitors. Situated adjacent to the boardwalk, it is a nice vantage point to see the boardwalk and to observe the sea lions that inhabit the substructure of the wharf. There are a variety of businesses on the wharf that range from rentals of kayaks to great seafood restaurants. The Dolphin Restaurant is a tiny place towards the end of the pier that serves great clam chowder in a bread bowl although several other places do the same. You will have to explore for yourself. Parking is not free.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Nice long pier", "Nice long pier for walking or fishing. Plenty of bathrooms. Places to eat and get a drink. Can rent boat. Souvineers. Parking available on the pier. Can be cool so jacket may be good to bring."], ["Reviewed May 20, 2017", 4.0, "Nice pier and shops", "A Good location to spend time shopping, eating and viewing the sea lions. You can also fish or watch the newbie surfers learn off the coast."], ["Reviewed May 15, 2017", 4.0, "Excellent Spot To View the Water with Nice Shops and Restaurants", "I was impressed with this wharf and the views it offers of the water around Santa Cruz. You have the option of parking and walking out on the pier or you can drive out and park on the pier itself. There are many local shops and restaurants\n\nBeware during the week everything closes at 9PM. Unless you are strictly going for a stroll no reason to go after 9PM.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Amazing view", "The Wharf offers a great viw out to the ocean and to the Boardwalk. You can observe people fishing, which can be fun when they catch a fish. Seals live below. They're great fun for small and big.\nThere're shops and restaurants. We had the opportunity to try several restaurants during our stay and I would recommend Firefish.\nShow less"], ["Reviewed May 6, 2017", 4.0, "Nice place to take a leisurely walk, look at the water, and dine.", "We decided to take a walk on the wharf after visiting the boardwalk. We were hungry and wanted to try one of the restaurants @ the wharf. We ended up at Woodie's Café. We enjoyed the views, the food, and our stroll. Very nice relaxing time!\nShow less"], ["Reviewed April 29, 2017", 5.0, "Nice attraction.", "I went with my wife, mom and her boyfriend. It was fun to take our time and shop and soak in the gorgeous views. Watching the surfers was really cool. Make sure to go to the end of the wharf and look down the designated cut outs to view the sea lions. We ate at Gilda's restaurant on the wharf and the food/service was great.\nShow less"], ["Reviewed April 27, 2017", 3.0, "Lots to see and lots of changes", "I have been coming her for 45 years so I have seen lots of changes. Although there is not the old charm, it's still a great pier. The Dolphin restaurant was great our first night. Gildas for breakfast was not what it used to be and when I mentioned to the server ,it was an ,oh well attitude. But two nights later for dinner it was great. Also they all have special so pay attention. We found the salt water taffy was less expensive on the wharf then the boardwalk. Again check ck things out.\nShow less"], ["Reviewed April 26, 2017", 5.0, "sunset walk", "This place is hardly ever crowded. I guess they are all at the Boardwalk down the beach. Works for me. Got an hour ? This is a great place to take a walk with kids and Grandparents. There is something for everyone. Buy some fresh fish to take home for dinner, visit the Sea Lions, talk to the fishermen. Check out the view. There is a secret little bar in one of the restaurants that overlooks the water. I'm not saying which one, you will have to explore a bit. Twice a year you can bring a chair and watch the fireworks. What could be better for a free good time? Oh, don't forget a\nsweater.\nShow less"], ["Reviewed April 24, 2017", 4.0, "Nice", "Great place for a nice walk. Good atmosphere around the wharf. Plenty of stuff going on, from surfing, volleyball etc Amusement park for the kids so they wont get bored. Plenty of eateries nearby. All in great experience"], ["Reviewed April 24, 2017", 3.0, "Fun place to stroll along the water with family", "The wharf has a large number of amusements, some shops, and restaurants. It's definitely a \"tourist trap\" but you know that as soon as you see it. The water is beautiful and the adjacent pier is a good walk with more shops and restaurants. You will pay to park and need to stay on top of the time left on your meter. There is also a large lot across from the boardwalk entrance. Security was present on the boardwalk, which is always nice.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Lovely Buzzing Place", "Santa Cruz is a really vibrant place full of tourists it has a lovely vibe and the wharf is the heartbeat of the town. So many people congregate here to stroll along by the water. Loads of amusements nearby for the kids and lots of cafes and restaurants.\nLovely views of the water and the beach. Well worth your time if you're in town.\nShow less"], ["Reviewed April 20, 2017", 5.0, "The world famous Santa Cruz Wharf", "The world famous Santa Cruz Wharf is a great place to visit lots of restaurants sea life fishing off the pier borrow a boat or a kayak."], ["Reviewed April 19, 2017", 4.0, "Nice wharf", "This is a pretty nice Wharf go all the way to the end so you can see the sea lions Under the Pier , there is also a splash Cafe there but don't get it confused with the splash from Pismo Beach the food there is ok but not nearly as good as the splash from Pismo Beach. I much prefer the boardwalk. But remember both areas are tourist traps.\nShow less"], ["Reviewed April 18, 2017", 4.0, "Weather was horrible but still had a great time", "My friend took me site seeing. The beach was not very nice. It just finished raining really hard. The weather was cold and windy but I still had a good time. I walked the Broadwalk. I had a few beer and took some great pictures. I saw some seals too.\nShow less"], ["Reviewed April 17, 2017", 5.0, "We had a wonderful walk in the sun on the wharf.", "We loved our stop here. We got some fresh salty air visited shops and restaurants on the wharf. We will definitely come back if we are in the area."], ["Reviewed April 14, 2017", 5.0, "Good Sea Views", "Service was a bit slow but the Fish & Chip dinner and Crab cakes were good. We were able to watch the surfers while we waited. We had to wait for our bill"], ["Reviewed April 14, 2017", 3.0, "Average", "If you have been at Monterey Wharf the one in Santa Cruz is just average and shops and restaurants seems to be lower quality."], ["Reviewed April 12, 2017", 3.0, "Checking it out solo", "I was here sightseeing and choosing a restaurant for lunch. The wharf has a good view of surfers on one side and the Boardwalk on the other. You pay for parking, but ask the businesses to validate your ticket. Besides restaurants, the wharf has gift shops, a candy shop, and fresh seafood. This is also where you can get a kayak or a charter boat. I walked here from the Boardwalk. It's a good stretch of the legs.\nShow less"], ["Reviewed April 10, 2017", 4.0, "Nice long Walk", "There were several shops and restaurants along the walk on the wharf. We enjoyed shopping and eating at the Dolphin at the end of the Wharf."], ["Reviewed April 10, 2017", 4.0, "Historical and very Santa Cruz!", "Take a stroll down the infamous Santa Cruz wharf - full of beach shops and restaurants. For home cooked style cooking, dip into Gilda's restaurant - they have just about everything on their menu! For breakfast, try their crab omelet and be sure to get their homemade salsa! For dinner - prim rib special and their cioppinno are both a locals favorite\nShow less"], ["Reviewed April 9, 2017", 5.0, "Loved every second of it!", "So, I never really thought much of stopping to see the wharf until I read some reviews on here. If you are in or near Santa Cruz, this is a MUST DO! We paid a few bucks for parking ($3 I think), we walked around and shopped. The shops were quaint and not too touristy. However, the highlight of the trip were the Sea Lions! They were awesome! At the end of the wharf they made several cut outs so you can view the resting sea lions. I could have stayed there all day watching the resting ones, as well as the ones swimming around. You can hear them barking as soon as you get out of your car! They are so amazing and you can get so close!\nShow less"], ["Reviewed April 6, 2017", 5.0, "Wonderful place to visit", "Lots of nice restaurants, a couple of tourist shops, great views of the water and surfers. Right next to the boardwalk but less congested. Definitely recommend a stroll on the wharf."], ["Reviewed April 5, 2017", 4.0, "Fun visit", "We had dinner on the Wharf then enjoyed listening to and watching the California sea lions (or was it seals, i forgot). Very nice evening. Parking is available on the wharf."], ["Reviewed March 31, 2017", 4.0, "Very Nice Experience", "Visited here with friends and we strolled all the way to the end of the wharf and even managed you have lunch there. Very relaxing and different if you are not used to the ocean. There is a large presence of Sea Lions under the pier and they can be very entertaining. I highly recommend visiting should you be in the area.\nShow less"], ["Reviewed March 31, 2017", 4.0, "Strolling on the Wharf", "A trip to Santa Cruz wouldn't be complete without a stroll on the Wharf. Fun shops, great Happy Hours, and those fascinating sea lions. Olitas has the best HH and incredible views, not to mention the friendliest staff!"], ["Reviewed March 30, 2017", 4.0, "If you like sea lions", "They hang out at the end of the wharf, very close and very charming. Worth the short walk for them alone."], ["Reviewed March 29, 2017", 3.0, "Great for walking and sight seeing", "Bring lots of money for the rides and games. No public parking either so be prepared to pay for parking."], ["Reviewed March 29, 2017", 4.0, "Pleasant Half Hour Stroll On The Wharf", "This is pleasant wharf, which shops, restaurants, and even a wine tasting room. The sea lions are fun to watch; there are plenty of them out toward the end of the wharf. We ate dinner at one of the restaurants, we were seated at a window table with a gorgeous view of the ocean. Very enjoyable way to spend a late afternoon, early evening.\nShow less"], ["Reviewed March 28, 2017", 5.0, "I love the sea lions!", "I live in Santa Cruz and never tire of seeing the California sea lions that hang out underneath the pylons at the end of the wharf. Whether you're dining out or shopping on the wharf, make sure to also check out these amazing animals."], ["Reviewed March 28, 2017", 5.0, "fun stop and don't miss the end of pier seal display", "This was a nice relaxing stroll before lunch. Views are just spectacular. lots of seals at end of pier. eat lunch at one of the restaurants."], ["Reviewed March 23, 2017", 2.0, "Over rated", "The pier has a few touristy shops and several restaurants. In fact mostly restaurants. Looks run down at spots and a couple of businesses closed down. Reminded my wife and I of an area that is going down in upkeep and businesses. We were there on a Saturday_ cloudy but no rain and people traffic was very light. Compared to other areas like Santa Barbara and Santa Monica piers this is not even close.\nShow less"], ["Reviewed March 21, 2017", 3.0, "A little too crowded for my taste", "This is a go-to tourist destination but on a real tourist weekend you'll have a lot of competition for the paved sidewalk. There are other less popular places that have as good or better views--try Point Lobos State Park but again watch for crowds!"], ["Reviewed March 14, 2017", 5.0, "The Santa Cruz Wharf is a delightful place for locals and tourists alike.", "There are frequently tourists that enjoy basking in the sun, souvenir shops, the early morning fishing boats, kayaking, the myriad of restaurants, and of course the seal watching at the end of the Wharf. The locals usually enjoy the simpler pleasures, tourist watching, enjoying the sun and eating at the many delightful restaurants replete with clam chowder, and the fresh seafood meals. However be warned, you will need a few dollars to get off the Wharf as the rules have changed, a fee will be required when you drive past the toll shacks. FYI, it is still free for pedestrians to enjoy the Wharf at no charge.\nShow less"], ["Reviewed March 13, 2017", 3.0, "Tourist haven", "Little tourist shops and plenty of seafood restaurants from quick to expensive. Some empty storefronts and worn out buildings. Even a Marini's location on the wharf to get your sugar fix. Parking can be difficult and honestly walking the entire wharf is nice and easy. Nights get chilly so being a sweater or coat.\nShow less"], ["Reviewed March 9, 2017", 3.0, "Typical Tourist Wharf", "You can park on the wharf or walk from the parking lot at the bottom of the wharf..a long walk. Most of the stores are selling ocean related trinkets and shirts. However there are a few good restaurants located here. The advantage of eating here is the view of the Pacific if you choose well.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Great spot to take friends, family, kids", "Cute shops, restaraunts, indoor and outdoor seating at some restaraunts with beautiful ocean views. Can see seals lounging below wharf on beams of wharf, easy to see boats, surfers, marine wildlife."], ["Reviewed March 3, 2017", 5.0, "Seals and sea lions", "Great place to see seals and sea lions. Grab a coffee and wander to the end. Views are fantastic at night (seeing the Boardwalk's lights undulate in the water)."], ["Reviewed March 2, 2017", 4.0, "Nice walk or drive on", "Beautiful scenic views all around. You can walk or drive on. We drove half way and then walked through the shops. Had dinner while the sun set"], ["Reviewed February 26, 2017", 3.0, "a place to show someone from out of town", "the wharf is very close the boardwalk so you can visit both places fairly easily. If the weather is nice, the walk is very pleasant. Besides seeing the birds and fishermen, you can visit the restaurants and cheesy tourist stores. From the wharf, you can get a nice picture of the beach boardwalk. Parking can be tough but today was not bad because it is still winter.\nShow less"], ["Reviewed February 17, 2017", 5.0, "great view", "this is a great boardwalk for restaurants and seeing otters and sea lions. it is not too long and the view of the lighthouse is delightful"], ["Reviewed February 15, 2017", 4.0, "Relaxing Afternoon", "We decided to meander down the wharf on our recent visit to Santa Cruz. It was a beautiful day. The sea lions were sun bathing on the pylons of the pier. The sun was shimmering on the ocean. The views were beautiful and all the little shops and eateries were delightful. It was not crowded and it was very relaxing. We had a Bloody Mary at one of the little diners with an outstanding view. If you are in the mood for a stroll and would like to take in some great views, the wharf if the place.\nShow less"], ["Reviewed February 14, 2017", 3.0, "Needs work", "Wharf is very old. Needs work. That being said, it's a nice place to sit on a sunny day. Go out to the end. Grab a coffee or something sweet from Marini's. Enjoy the view and the sea lions."], ["Reviewed February 13, 2017", 4.0, "Nice walk to the end", "It was a sunny afternoon that I wandered down to the boardwalk and discovered the wharf. As I was walking out the wharf it seemed to go on and on and on. I had no idea what was at the end of The Wharf and I was pleasantly surprised just see all the sea lions swimming in the water and lounging on the rafters. I didn't stop at any of the restaurants, and there were plenty. I would definitely recommend walking The Wharf when you come just Santa Cruz\nShow less"], ["Reviewed February 13, 2017", 5.0, "A Must See If You Are in Santa Cruz", "If you want to really \"get\" Santa Cruz and experience the biggest bang for your time and buck, the Wharf is the place to do it. This is not like any Wharf you've been to. First off, you can drive right onto the Wharf and there's plenty of parking. You pay a very reasonable parking fee on the way out so no worries about overstaying a parking meter and getting a ticket.\nThere are lots of restaurants featuring local catch, souvenir stores, fishing expeditions, and fishing. As you stroll the Wharf, you will likely hear the melodic howls of the sea lions that love to hang out on the structural members under the Wharf. There are lots of places from which you can watch them lazing around or climbing over each other.\nOn one side of the Wharf is the World famous surfing area, Steamer Lane, On the other side is the Santa Cruz Beach Boardwalk, the oldest amusement park West of the Mississippi. I believe it was voted the best beachside amusement park in America at least once. It is very well managed. The Boardwalk’s original Ruth & Sohn band organ has played alongside the Looff Carousel since 1911. In addition to the original Ruth organ, a rare Wurlitzer 165 band organ from the former Playland-at-the Beach amusement park in San Francisco now shares playing time with the Ruth. There is also indoor miniature golf and a large game arcade, all in an iconic building right on the beach.\nIf you can, sit down to dinner at one of the restaurants just before sunset. You'll be at eye level with dozens of birds cruising by the windows and the sunsets are beautiful.\nIf that's not enough for one spot, Santa Cruz just added the Monterey Bay National Marine Sanctuary Exploration Center.\nLastly, Roaring Camp Railroad, another must do in Santa Cruz, has a tourist train that runs from their replica Old West Village in Felton down to the Boardwalk. In fact, you can take an early train down from Felton and spend the day at the Beach and Wharf, then take a later train back up to Felton. An unbeatable day!\nSo don't miss this spot or you'll have missed some of the best Santa Cruz has to offer.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Great place", "Walking along the front is great, even at dusk, you could see the sea lions coming up onto the pier to sleep for the night. Quite a few places to eat, parking on the pier is reasonable.\nI did not realise this was the location for lost boys until I got home!!\nI am likely to visit here agai during summer, to get the most out of this sea side city.\nShow less"], ["Reviewed February 10, 2017", 5.0, "Santa Cruz Wharf Strip", "Years full of Memories cruzing down the wharf strip in Santa Cruz. Easy access to the beach, board walk, shops, resturants, hotels, and the location where the movie \"The Lost Boys\" was filmed."], ["Reviewed February 8, 2017", 5.0, "Always fun", "Even though they are remodeling part of the boardwalk, the place is always a blast! The arcade is crazy, the rides are fun, the food super greasy, and they still have the rings on the carousel that you can throw in the clown's mouth. Love this place!!\nShow less"], ["Reviewed February 3, 2017", 4.0, "Pleasant afternoon", "It's one of those places you have to visit at least once if you're in the area. I was happy with the eatery we chose spontaneously for a late lunch. The shops are good, but somewhat repetitive. Fantastic views and photo opportunities."], ["Reviewed February 3, 2017", 4.0, "Great at night too!", "Really spectacular views, even at night. One idea is to catch the sunset here, which is what we did. Really fun energy here."], ["Reviewed February 3, 2017", 5.0, "Wonderful walk", "Great place for a mid-long walk. If you think 25*C temperature is good for a beach day (which is perfect in europe even in Oct) - you are wrong. There's nearly no one around. Whish to be there again when the season is in its glory!\nAs a reward you can always speak to the Sea Lions!\nShow less"], ["Reviewed February 1, 2017", 5.0, "Nice walk to say Hello to the seals", "Love the wharf. There is food there and water activities and the best part are the seals lazing around and humping at the end of it. Highly recommend. I had been there 24 years ago too and still remember it. Not much has changed."], ["Reviewed January 28, 2017", 5.0, "Nice stroll", "Such a lovely place to take a leisurely stroll, enjoy the calls of the local sea lions that like to hang out here, watch the sun set over the land, gaze at the beautiful boats, people watch and meandering in and out of kitschy local shops and tasting the delights of the restaurants. It really is simply a lovely place. Free to visit and a place to enjoy. I enclose a picture of the view walking along here as the sun went down.\nShow less"], ["Reviewed January 27, 2017", 5.0, "Enjoyable walk", "This is a nice walk. It is free when you walk on the warf.. There are always sea lions sleeping under wharf near the end where the holes are. Good picture taking oportunity. Usually there are people fishing and they are fun to talk to. The 1st time I took a grandson we met a guy fishing who had just caught a baby octopus. He let the octopus crawl across my grandson's hand.\nShow less"]]}}