{"Santa Barbara Zoo": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Santa Barbara Zoo", "url": "/Attraction_Review-g33045-d104228-Reviews-Santa_Barbara_Zoo-Santa_Barbara_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/45/76/63/giraffes-with-an-ocean.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1198"}, "address": {"@type": "PostalAddress", "streetAddress": "500 Ninos Dr", "addressLocality": "Santa Barbara", "addressRegion": "California", "postalCode": "93103-3798", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Wonderful zoo", "A really nice, open paddock zoo, Small enough to see in one day. Little train ride around the park. You can feed many of the animals."], ["Reviewed 3 days ago", 5.0, "Santa Barbara Zoo", "Had a great time at the Zoo! Lots of interesting animals and birds. The zoo is just the right size for an enjoyable morning or afternoon."], ["Reviewed 1 week ago", 4.0, "Always a hit", "Another successful visit to the Santa Barbara Zoo! This zoo is the perfect size for families with small kids and those who don’t want to spend the entire day walking to and from exhibits (yet large enough where you CAN spend the entire afternoon there should you want to). The grounds are extremely well kept and there’s ample open space to relax, picnic, and let your little ones run around. The exhibits include all of the “traditional zoo” animals as well as a unique assortment for those wanting to learn more. This is always a must-stop for us when we’re visiting SB. It does get busy and a little congested on the weekends (esp the parking lot) so go during the week if possible and buy your tickets online to save time and avoid waiting in line (there’s also ample street parking but it does fill up quickly so go early if you want to avoid paying for parking).\nShow less"], ["Reviewed 2 weeks ago", 5.0, "my favorite zoo in the world", "As far as zoos go (caged animals), this one is gorgeous. Beautiful grounds in the hills by the ocean. Compact, pleasant to walk, nice spots for a meal. Aviaries were lovely. They have elephants and snow leopards!\nThey have play areas for little kids.\nYou can find free parking on near-by streets.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Cute Zoo", "We enjoy the zoo but with most things, it gets expensive. Train rides and feeding the giraffes are an additional cost as well as rock climbing.\n\nMake sure to bring cardboard to ride down ant hill. Not to stress, people leave their cardboard all the time.\n\nThis is a smaller zoo and the train ride isn’t quite as exciting as I wish it would be but it’s a nice place to go.\n\nGet there early or later in the day otherwise parking will get full. We ended up having to park around the corner near the baseball fields.\n\nCamps here are fun for the kids. Not sure how it would be for a weekly camp but the daily ones are great. We also did a Girl Scout trip here which was fun. The girls were able to see a lot of behind the scenes things that you normally wouldn’t get to see.\n\nMeal choices are extremely limited so make sure to pack your own lunches.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best cute little zoo with beautiful location and view", "It is a must see place in Santa Barbara. While animals are really well taken care of, the ocean view of this amazing location and the view to the lake it’s amazing. Also, don’t miss the trip with a train which is a nice tour for the kids. I can’t get tired of the zoo!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Nice animals", "When I went to this zoo I was in love with the animals. We were having a great time until I slipped on an area of water that had been leaking for a while. It had alge growing. I didn’t see it until I went down. I tried to tell some one there but they didn’t seem to care. Watch your step there. My knee was hurting for a few days. Just saying.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful little zoo!", "This zoo is gorgeous! It’s small so it’s easy to get around and you can see everything in just a couple hours. You can also feed the giraffes which was pretty awesome! The zoo itself was very clean and the animals look to be well taken care of. 10/10 would recommend!\nShow less"], ["Reviewed January 23, 2018", 5.0, "A lovely setting for a family gathering", "We always took family when they came into town, grown ups or kids, its a fun place to walk all over, or just sit and enjoy the gorgeous views of the ocean, the islands, since it sits up high."], ["Reviewed January 22, 2018", 5.0, "Nice Walk", "Good walk for the money you pay. It is not a big zoo but it is pretty well organized so you can’t really miss anything. Very clean and a decent variety of birds and animals. Also 2 interesting tropical exhibits. In the center of the zoo there it is a nice children playground so it is definitely a good option for families to spend a few hours. You can find enough vending machines along the visiting paths so you can get some water or a snack for very decent prices.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Beautiful zoo with nice assortment of animals", "This is a cool little zoo that has a variety of creatures from penguins to lions. The grounds are well-kept and the landscaping and views of the ocean while strolling between exhibits is great. Take the shuttle to the zoo for a relaxing afternoon activity. Animals seemed well and their environments looked clean.\nShow less"], ["Reviewed January 20, 2018", 4.0, "Great day trip stop from Los Angeles.", "The zoo is not too large, but appears to have newer enclosures and a very friendly staff. Was a great way to spend a few hours.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Wounderful Zoo!", "Family visit to the zoo with an elderly member was excellent! Great exhibits and close up interactions maje this one of my Favorite places to visit! Consessions are available thru out the facilities!!"], ["Reviewed January 12, 2018", 5.0, "Always Fun", "Grew up in SB going to this zoo. Now when I visit I take my daughter.Though not a big fan of zoos - this one is gorgeous and the animals seem to get good care. My daughter has enjoyed it many times."], ["Reviewed January 12, 2018", 5.0, "GREAT LITTLE ZOO!", "We had a wonderful day at the zoo. This is a lovely little zoo with a fantastic and well informed staff! Zoo is very well maintained. We personally got to feed the 5 giraffes. Amazing! Also notable was the train conductor who knew all about the zoo history and about the animals and their habits. He stopped when one of the animals was doing something special he thought we should see and explained what was happening. My 7 year old also really enjoyed the playground which was themed to the zoo. Great day we will be back!\nShow less"], ["Reviewed January 10, 2018", 5.0, "Love this Zoo!", "This is one of our favorite zoos! It is small and manageable. It is so pretty with views of the ocean. You can bring your own picnic lunch and enjoy it in the very spacious lawn and even watch a Dino show. The kids can run, cartwheel and slide to their hearts content! Bring your own cardboard to slide on the little hill in the children's playground if you don't want to wait for a piece to become available. Make sure to feed the giraffes which is so much fun! They also have rock climbing and a little train ride. My kids are 9 and 12 and love to visit this zoo.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Practically perfect in every way", "Practically perfect in every way. The size is not overpowering and the crowds do not get in the way of a perfect day. For families with young children and even couples who simply want a pleasant walk it is a enjoyable zoo. Perhaps the San Diego and Berlin zoos have a greater variety of animal life. But they require hours of exploration. Santa Barbara’s is the perfect size and adjoins one of the most spectacular beaches. Great day on the Central Coast.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Endangered Amur Leopards here!", "This is a nice small zoo, with large zoo quality exhibits and unique species at peril in the wild that are being conserved here in partnership with world wide network of wildlife conservation organizations such as WCF. Easy parking"], ["Reviewed January 3, 2018", 5.0, "Lovely Zoo", "This is a small and beautiful zoo, easy to see most everything in an afternoon. We had closeup views of gorillas, giraffes, lions and many other creatures. When our feet got tired, we hitched a ride around the perimeter on the photo-worthy little train. A fun outing, well worth a visit!\nShow less"], ["Reviewed December 28, 2017", 4.0, "Oceanfront View + Animals", "Located directly across the street from Santa Barbara’s East Beach, this should be on everyone’s “must do” list for visitors with children. It is small and easily walkable, with a nice assortment of animals. There is a train ride around the perimeter of the zoo and giraffe feeding. A big hit with our young ones is an AstroTurf sliding hill (bring your own cardboard or there are usually pieces left behind). Lunch on a lovely grassy slope overlooking the Pacific. A great place to visit!\nShow less"], ["Reviewed December 28, 2017", 3.0, "Cute for Families with a very young children, but not a destination zoo", "It is difficult to review the zoo because I guess it’s kind of cute for what it is. What it is is a very, very small zoo that would be a nice day trip for families with very young children who tend to tire out and get cranky very easily.\n\nWe got through the entire zoo in under two hours, and we really took her time. The zoo is also a bit pricey for how small it is. There are no healthy food choices, and feeding the giraffes costs eight dollars.\n\nI would not recommend this zoo for zoo lovers or for families with older children. But if you are looking for something to do for a couple hours with young children, this would be the zoo for you.\nShow less"], ["Reviewed December 22, 2017", 4.0, "A wonderful place to spend an afternoon", "While this zoo is not large, it is charming. A great place for children, easy to see all the animals in a day, lovely places to picnic AND a charming miniature train ride around the perimeter. Factor in the (usually) beautiful weather and superb location and you have a perfect family outing!\nShow less"], ["Reviewed December 11, 2017", 4.0, "Wonderful little Jewel in Santa Barbara", "This is the perfect outing for young families. Not huge but charming and sweet, right near the water. Your kids will love it!"], ["Reviewed December 10, 2017", 5.0, "A great small zoo!", "The Santa Barbara Zoo encompasses about 30 acres and is home to around 500 animals/birds/reptiles (Heaven knows how many bugs... the hissing cockroach exhibit was packed!). It is the perfect visit for a day with young children.\n\nWe took my two granddaughters, ages 4 and 2 and they had a wonderful time. I don't think they'll ever forget feeding the giraffes (extra fare). The exhibits are well laid out, and the cool temps of the community (we visited in December) means that the animals are fairly active. It's easy to get up close to the animals in the exhibits and they all appear content and well cared for. The orphan elephants have called the zoo home since the 1970's, and thank goodness there was a facility to take them when they needed it!\n\nThe zoo participates in the Condor repopulation efforts, and it's obvious that conservation is one of its priorities.\n\nWe rode the train (extra fare), and I highly recommend it, to orient yourself to the layout of the zoo. The little ones loved the sliding \"ant hill\", and as a special treat, there were a couple areas of artificial snow that they got to play in.\n\nIt is reasonably priced and plenty of activities and exhibits to spend a day.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Fun time...", "The 'feed the giraffes' was amazing...I had never fed a giraffe before and was so excited...train ride was informative...gift shops throughout zoo was a nice touch...very enjoyable day..."], ["Reviewed November 25, 2017", 5.0, "Great small zoo", "Loved this...great walk! Good variety for such a small place. Very kid friendly with easy to follow course."], ["Reviewed November 23, 2017", 5.0, "Thanksgiving day at the zoo", "Our first time at the Santa Barbara zoo. Not a big zoo, but has a nice layout, good animal exhibits. Enjoyed watching the “pumpkin smashing” by the elephants. Ideal zoo for families with young children. If you are in Santa Barbara, you should certainly check out the zoo!\nShow less"], ["Reviewed November 21, 2017", 3.0, "Not a Great Zoo", "Very small. Probably good for young children. Most animals were laying down and very depressed it seemed to me. Only the elephants were somewhat active. We ordered some food right when we entered the zoo and they lost our order. The grounds are clean and well maintained.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Fill in visit", "Lovely zoo staff very friendly we opted for the giraffe feeding experience the zoo operates a conservation program would recommend for younger families with picnic areas train rides check ahead as it doesn’t run every day can be toured in 2-3 hours"], ["Reviewed November 9, 2017", 5.0, "The \"Best Little Zoo in America\"!", "Many people have said this Zoo is the most beautiful zoo they have ever been to. Views of the ocean, and mountains are abundant. The little train is fun for all! The exhibits have been very well funded by generous benefactors, and are of very high quality. The animals have ample space in their environs. This all make for a wonderful experience for kids, and adults alike!\nShow less"], ["Reviewed November 9, 2017", 3.0, "Really small zoo", "Everyone is so nice who works at the zoo. The zoo is clean but smells bad everywhere in comparison to the Ohio zoos. There are really gorgeous macaws in the zoo. There are also neat animal exhibits, just not a ton of animals at the zoo. We got through the entire zoo in an hour and a half amd saw everything.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Love love love the zoo", "It is a small zoo, with a very different approach to larger zoos.\nBeautiful area with tables and benches so you can bring a picnic and enjoy being right in the heart of it.\nAnd you can feed giraffes!!., I did!\nOur grandchildren loved being there. There was entertainment and delightful weather helped to make it a wonderful place to visit.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Clean, well-maintained and a reasonable size for a short visit", "We stopped on the way from Santa Ynez Valley to LA. Clean, well-maintained exhibits and young, friendly staff. We saw animals out at every exhibit. Not sure if that was good luck or the norm. Very pleasant way to spend a couple hours on a Sunday morning. To be fair, I'm comparing SB to the LA Zoo which is an embarrassment to the city and zoos in general, so anything is a step up. We didn't eat there, so I can't speak to the food. We had lunch 2 miles away at La Super Rica Taqueria, a great Mom and Pop taco stand with rave reviews on Yelp. Outstanding food and service. Cash only.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Reasonably Sized Zoo", "Lots of activities for kids. And actually most kids were not that interested in the animals. Good size not overwhelming. Close up views of most displays. Food choices very limited and not that healthy. We had a great time. Used Lyft to get to and from. Very convenient.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Cute little zoo", "A small zoo but great on conservation. The variety of animals was great. You can spend a hour or longer highly recommend"], ["Reviewed October 18, 2017", 5.0, "SB Zoo", "Favorite attraction here in Santa Barbara for my grandchildren. A smaller zoo with fun animals and beautiful grounds just across f rom the ocean. Zoo has a great kids play area with a grass hill for sliding (bring a piece of cardboard) Also has a fun little train that goes around the whole zoo. Great place!!!\nShow less"], ["Reviewed October 17, 2017", 4.0, "Nice Zoo for Toddler", "I visited the Santa Barbara Zoo for the first time with my 3 1/2 year old grandson this month. The zoo is beautifully situated and landscaped well. The playground kept him busy and it was creative. The animals are somewhat limited and the cages seemed small. He had a blast going to this zoo.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Cute zoo", "Santa Barbara has a lot to offer! It is really nice to enjoy the beach, go shopping, enjoy the food. When you have some extra time I would really recommend to visit the zoo! It's very small, but so so cute! It was awesome seeing some animals while seeing the sea in the background! The animals have beautiful cages and the ambiance is nice!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great Regional Zoo", "This is a great place for a family to see a variety of animals. Great size! Open year round. Slight hills but easy to walk. My kids enjoy the lion, elephants, and giraffes. Zoo discount and AAA discount available. Year round fun and great spot for parties.\nShow less"], ["Reviewed October 16, 2017", 4.0, "hilly zoo", "Zoo is in very nice setting with views of the hills and the ocean. But cages seem small and collection of animals seems modest. Good for small children, but not for ecology minded or big animal lovers."], ["Reviewed October 14, 2017", 5.0, "Great little zoo", "Pro's: cozy, nice area's, cute playground, beautiful garden with an outlook on to the ocean. Healthy, well groomed animals.\nOK: food and gifts are pretty standard for theme parks and zoo's.\nCons: Train ride costs 5$ and goes around the zoo, mostly through employee's only areas and not fun for kids.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Love the zoo", "I have visited several local Southern California zoos because of kids (LA, San Diego) and this is the best by far. Not too big especially when you are traveling with young kids. The location is awesome, right near the ocean and because of that, the weather is usually nicer. They had multiple shows which were nice. You can cover the whole zoo in half a day. Love it.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Nice zoo", "Realy a nice zoo. Just the right size. Not too big that you are unable to see it all in one day. Large enough so that children would not get bored. Plenty to do and see."], ["Reviewed October 10, 2017", 5.0, "Great for conservation", "We love animals so had to visit and we were not disappointed. It is not as big as some city zoos but there was a great variety of animals and lots of activities for the families so kids seemed happy. Our favourites were the leopards and the giraffe feeding.\nShow less"], ["Reviewed October 7, 2017", 2.0, "Too expensive", "For as small as this place is and as many exhibits that they had closed the day we went was way too expensive, $17.50 plus you pay extra for parking. Not worth it at all"], ["Reviewed October 6, 2017", 5.0, "Fabulous family trip", "I love the charm of this lovely zoo. It's smaller than Los Angeles zoo but just as interesting with lovely views of the ocean. My grandchildren prefer to visit this zoo rather than the much larger LA zoo as its not so tiring especially on very hot days. A must with younger children. The gardens are beautifully set out.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great Small-town Zoo", "My grandkids love to go to the Santa Barbara zoo and do so on every visit here. The feeding of the giraffe is a major part of that visit as is the train and climbing wall."], ["Reviewed September 24, 2017", 5.0, "Great zoo with views of the ocean!", "This is a nice zoo - lots of activities for small kids. Beautiful landscaping and a wide range of animals. The gorilla looked so sad as did the lion. Some animals had really large pens, which was great. I wish the condors, lions and gorillas had larger spaces and more things to keep them busy. The lion spends a lot of time high up on a boulder in his pen, looking out at the ocean or sleeping.\nShow less"], ["Reviewed September 22, 2017", 5.0, "A Walkable Zoo", "Unlike the massive LA Zoo, I usually prefer to drive up to Santa Barbara to visit the much smaller (30 acres, 500 animals) Santa Barbara Zoo. (For one thing, it is almost impossible to visit the LA Zoo without having your ankles whacked by strollers pushed by desperate parents with screaming toddlers.) The only bad point is that the food services here can be significantly improved -- which would probably also make for greater attendance.\nShow less"], ["Reviewed September 19, 2017", 4.0, "A fun Zoo for kids of all ages - great environment", "Like many other attractions in Santa Barbara, this Zoo is very educational and informative in an interesting and 'fun' manner. Kids seem to love to visit it again and again.\n\nThe Train inside the Zoo is a nice treat and great way to get around the perimeter to help you prioritize which exhibits to see and in what order. It is a simple, yet roomy enough seating and the trip circuit doesn't last too long, or too short.\n\nFood offerings are relatively healthy, pricey but not as overpriced as other similar venues can be.\n\nHighly recommend, particularly for families with children.\nShow less"], ["Reviewed September 16, 2017", 5.0, "The Little Zoo That Can: Location, Location, Location.", "You've probably hear this line a thousand times in media, \"Location, Location, Location. The Santa Barbara Zoo may not be the biggest, or even the best, but oh the location. Situated in the heart of Santa Barbara, a stones throw from the beach and minutes from the best stores and restaurants on the South/Central coast.\n\nThis little zoo is a great family attraction especially if you have little ones, strollers or chairs. The Santa Barbara Zoo has exotic animals in as humane as possible enclosures which are easily accessed by people large and small. The park can be walked in a fairly short time, normally my family spends about 2.5 hours in the park, 3 hours if we ride the little train. If you've never been to this zoo ride the train that circumnavigates the park, the kids love it and mom and dad get to sit down for 15 minutes or so.\nNow to location, you can make a day of this trip, we spend time in the park then walk right over to the beach and run the kids ragged. By the time they are beached-out we have kids ready to eat, and with a little rinse and a clean t-shirt we're ready to hit Main Street, and any one of the casual bar/restaurants found there. You can walk it or drive. (Parking stinks in town.)\nThis trip makes a great day get away, but the zoo really makes it special.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Weekend trip to Santa Barbara", "This zoo is adorable! Very well kept and lots to see. For a small fee you can feed the Giraffes which we did and was pretty cool. During some seasons Santa Barbara has a shuttle to take tour around town which is what we did to get to the zoo from our hotel. It's a short walk from the Main Street to get to the zoo entrance.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A fun and \"doable\" zoo", "The Santa Barbara zoo is one of the best laid out public spaces I've been to. For starters, there is plenty of parking. Right at the entrance, you're greeted by a pond with swans and a cute bridge. A train track runs around the circumference and that is the best way to see the animals. The pedestrian trail is also chock full of enclosures large and small. One of the nicest aspects of the zoo is that the larger animals look out towards the ocean or the mountains. We always see the lions playing from the train much better than from the viewing perch. There is a large public park with a wonderful playground in the zoo\nTip 1: bring a cardboard box to use as a slide on the \"mound\". So much fun!!!\nTip 2: check in advance and buy giraffe feeding\nTip 3: ask for a docent tour because that gets you even closer up access to the Lions.\nRight outside the zoo parking lot is a lovely public playground.\nBeware: sometimes traffic slows to a crawl at the 101 ramps which are where you would enter/exit the zoo.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great place to take the kids", "Small zoo, but with a surprising number of animals (Gorillas, Lions, Giraffes, Elephants, etc., and lots of different birds). There is a small cost to take the little train which does a circuit around the entire zoo. Well worth it as you get views of the animals you can't get from walking and it also affords great views of the mountains, the bird refuge lagoon, and the ocean.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great experience!!", "I usually don't like going to the zoo, but i have to say that this one feels a lot like a natural reserve. Animals are not kept in cage but they have the space to roam around in their enclosure. Great the idea of the little train that takes you on the backstage tour of the zoo .\nShow less"], ["Reviewed September 5, 2017", 5.0, "Quaint Zoo with a million dollar view", "You really can't beat this zoo. Sure, there are bigger zoos. Sure, there are zoos with more of a variety of animals. But this zoo, located across the street from East Beach in Santa Barbara is the best! Plenty of places to relax. Tons of animals. Giraffe feeding opportunities, all with a beautiful view of the ocean.\nShow less"], ["Reviewed September 3, 2017", 3.0, "Just ok", "The summer shuttle is very convenient for getting to the zoo. It was hot when we were there so many animals were hiding in the shade. Overall it is a small zoo that only takes about 2 hours to see everything. Not a very impressive number of large animals. Lot of birds and Small reptiles. Not a highlight of our trip but good way to kill a few hours.\nShow less"], ["Reviewed September 2, 2017", 3.0, "Very clean zoo...but pricey.", "The cage glass is clean so you can get clear pictures. There is very little food to choose from, I woudv'e been much happier if they had those little food carts that sell sno-cones or ice cream. The train that goes around the zoo costs $6.00 and no one rode it all day.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Nice zoo, small enough to cover in an hour or two", "The SB zoo is great for families! Lots of cool exhibits and exotic animals. My favorite was the giraffe feeding! Really fun and cool. The zoo itself is small enough to cover in an hour or two. Worth the visit!"], ["Reviewed August 28, 2017", 4.0, "Fun for a day w the kids!", "My family w 2 nephews went here (1.5 + almost 5)...was a great, easy, fun day. The animals are awesome, of course, and they had a big selection given it isn't a huge zoo. We did the little train ride, it was ok - a large part was more the background scene of the zoo and not really lots of animals, but cute nonetheless (you wouldn't miss anything if you missed out on it tho). I liked the kids play areas, that was a great option. Overall, it was a nice little zoo.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Small enough to see it all, big enough to have lots to see", "We spent an enjoyable 3 hours strolling the grounds. Especially loved the aviaries. You can see it all in 3 hours and have time for lunch."], ["Reviewed August 20, 2017", 5.0, "Dilly's trip to Santa Barbara zoo", "Small, clean, easy to get around. Animals looked cared for. This was a lot of fun. Must see in Santa Barbara."], ["Reviewed August 18, 2017", 4.0, "Cute Zoo!", "We enjoyed this well maintained zoo. It is easily do-able in 2.5 hours and a good experience for families with children 10 and under. Feed the giraffes! Good picture moment!"], ["Reviewed August 18, 2017", 3.0, "Small zoo that's looking rather 'tired' but worth an hour of your time", "I'll start by saying that my 'gold standard' for a zoo are the San Diego Zoo and the Columbus Zoo and Aquarium so I realize my standards are high. This little zoo would be great for families with young kids who are wanting nice areas to play and explore along with seeing some exotic animals. The enclosures are adequate for the animals, and the landscaping is very nice. It is a pretty walk through the property but the number of animals, for the price of the admission, is quite small. (I used my zoo membership from the Columbus Zoo to get in for half price; check to see if your zoo is on their reciprocity list.) Like I said, there are many open areas for little kids to run around in, and the playgrounds are creative and safe. The best exhibit, I thought, was near the entrance and involved connecting pathways between aviaries and bugs/reptiles exhibits. Clever concept to link these together. Signage for the exhibits were user friendly and nice emphasized the conservation efforts that individual humans could do to help each species.\nShow less"], ["Reviewed August 3, 2017", 5.0, "Best zoo ever", "This is a great zoo for kids young and old. Beautiful grounds, animals seem happy and well cared for in carefully designed habitats. Good food options, places to play and run, a train, you can feed the giraffe (for addl fee)."], ["Reviewed July 31, 2017", 5.0, "Great fun and educational.", "A beautiful zoo, the prettiest I've seen. Take the zoo train to gain a perspective on all the exhibits and the layout. It's an intimate place and one can view the animals quite closely. Personnel is exceptionally helpful and friendly. A thoroughly enjoyable visit. Not many dining choices, however, so best to have lunch elsewhere.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Fun time!", "This was a fun easy walking zoo. Lots a great animals, the giraffes were my favorite and really fun to watch! It also had a very cute train that ran around the whole park. A fun time!"], ["Reviewed July 27, 2017", 5.0, "Great, beautiful zoo!", "We visited on a Tuesday at opening. There is good parking, which might be a challenge later in the day. We budgeted $37 for our trip to the zoo. But being disabled seniors we wound up paying $26 total. Hint: get your tickets online to avoid the lines. We had been here 20 years ago and it is so much better by leaps and bounds. The animals seem happy and are in nice enclosures. There are no prison cells. Watch out for the mommies and little kids. A very happy place!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Fantastic zoo with great variety!", "This zoo really impressed. Beautiful grounds, so much so that the landscaping could be its own exhibit. Beautiful views and location. And an incredible layout that spreads out both the animals you came there to see and the other zoo-goers you didn't come there to see. We were very pleasantly surprised with the variety of the animal exhibits, from the penguin, elephant, and giraffe favorites to the bugs and the birds and the foxes. Plus meerkats! This zoo is a great size, as it is possible to see everything in 2-3 hours, and also possible to chill out on the lawn for a bit between sections, or spend extra time visiting with your favorites.\nShow less"], ["Reviewed July 26, 2017", 5.0, "A great zoo...perfect size", "This zoo was a wonderful surprise. I was a bit skeptical of the zoo at first but the size and quality was perfect for adults and small kids."], ["Reviewed July 26, 2017", 4.0, "sb zoo", "perfect size and animals seem very content and happy and well cared for. very clean and employees very friendly and for the area a very good bargain"], ["Reviewed July 25, 2017", 5.0, "Awesome gem of a zoo!", "We stumbled upon this zoo and we were so happy that we did! Our daughter loved it and so did we. What a hidden gem!"], ["Reviewed July 23, 2017", 5.0, "Lovely grounds", "This is a really nice small zoo. The grounds are really nice, lots for the kids to do and ocean views in places."], ["Reviewed July 22, 2017", 2.0, "Day trip", "I saw some of the reviews and say it was rated at #4\n\nBut I just don't see it.\nThe zoo can be done within an hour or so not to much to see and some of the animals look disarray.\n\nThe bald eagle they have looks terrible\nThe penguin was biting itself to spots; might be sick.\nThe fox was running around looking for an escape route.\nThe enclosures are so tiny it's like they don't have space to move.\n\nTickets are 17 for adults\nAnd 6 for a train ride\n\nTrain ride which is honestly a waste of time. It says it shows you the behind the scenes, it really just trailers and buildings. The only thing you do get to see is the giraffes & 1 lion from the back side.\n\nI can see it was would be good for kids to kill a day doing some sorta activity.\n\nShow less"], ["Reviewed July 17, 2017", 4.0, "A nice small zoo", "This is a small zoo as compared to Los Angels zoo or San Diego Zoo. The zoo is well maintained and its beautiful. From some points you can enjoy the beautiful sights of sea and hills. There is a small play area for toddlers and kids. Our toddler daughter loved it. She was too excited to see her favorites Giraffe, Gorila and Elephant (She relates to big animals mostly :) ) . We liked it there and it don't take much time 2-3 hours with kids. You have a train track for kids to enjoy too.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Wonderful zoo", "I loved this zoo! Reminds me of the world famous San Diego Zoo. It's not as big, but the feel and details were there, which are definitely above average, and has a great variety of animals. Includes a fun & informative train ride throughout the zoo. Viewing & access to the animals was also great, and has nice food & gift shop options for visitors. The restrooms were also very clean, which is a definite must! Definitely a fun & enjoyable day trip for families & couples.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Small but beautiful", "This is a relatively small zoo but beautifully kept and it felt much more like a park than many other zoo's Ive seen. The animals are extremely heath and happy looking and the knowledge of the wardens is amazing. A great day for nature, knowledge and fun.\nShow less"], ["Reviewed July 10, 2017", 5.0, "It's amazing at the zoo", "A smaller but fun packed zoo, it a great way to spend a day in Santa barbara. All the regular animals r here & a few hidden surprises await you, just behind a rock..."], ["Reviewed July 9, 2017", 5.0, "Probably the \"most beautiful\" zoo you will ever visit.", "Just got back from the Santa Barbara Zoo - wonderful experience, beautiful grounds and layout, great selection of exhibits, nice activities for kids as well as adults. The grounds are spacious and lush with greenery. Make sure you get there early...the parking lot fills up fast - of course, parking is crazy everywhere in Santa Barbara!\nShow less"], ["Reviewed July 8, 2017", 5.0, "Nice Zoo!", "The Santa Barbara Zoo feels like it's part zoo and part park. There are many open spaces which seem to want a picnic in them. The staff there is accommodating and highly knowledgeable. Also, the zoo is small enough for a day trip to see everything. Some zoos are more packed with things, but this one you can do in a day. I recommend the giraffe feeding! It's a nice treat to get so close to these gentle giants!\nShow less"], ["Reviewed July 6, 2017", 5.0, "One of the most beautiful zoo's in Ca.", "This zoo is across the street from the beach adjoining a small lake which makes it an ideal setting for kids. We are members of the Sb zoo and go at least once a month. There is always something fun happening for the kids daily. The zoo is on the smaller size and I would say you can go through the whole thing in 2 hours. The only thing about this zoo is the food court situation. It is lousy and very $$ for basically fair food.\nI think an upgrade to the zoo restaurant experience is needed BAD! We recently went to the Fresno zoo and they upgraded their restaurant and it is ideal for a zoo. I think Sb zoo needs to look into re doing the top food court and create a beautiful setting for lunch as well as for events. This can be very productive for the zoo. Honestly we don't want to ever have lunch there because it is so meh not appealing. Other then that this zoo is amazing and a definite must see while in the area or even stuck in traffic passing through, it is right adjoining to the 101 and it is a nice break to walk around and enjoy.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Fun little zoo", "The Santa Barbara Zoo is small but well laid out. It took about 90 minutes for my husband and I to view the exhibits. Parking was easy right at 10am but when we left at 11:30 the small lot was jammed. This is definitely a fun place to visit with kids or with people who adore animals.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Zoo with an Ocean View", "This is our families favorite zoo. The animals seem happy and well cared for. The size isn't overwhelming. And the ocean views and breezes are wonderful.\nHighlight is feeding the giraffe - must pay extra.\nThere's also a train for the locomotive lover in your crew.\nShow less"], ["Reviewed June 30, 2017", 4.0, "A Kids' Delight", "The perfect zoo for little kids -- you can get quite close to the animals because enclosures are smallish, and a visit doesn't require lots of walking. They can feed the giraffes and hang out in the petting zoo."], ["Reviewed June 29, 2017", 4.0, "A Very Nice Zoo", "The Santa Barbara Zoo is small but nicely done. It's located in a beautiful area with an ocean view which makes it especially delightful. I suggest you get there early as the animals may be more available. We were there in the middle of the day and most critters were asleep or hidden away which was disappointing. We had very warm weather so that may have had something to do with it.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Not what you would expect", "At first glance, it seems that it's a zoo like any other. Then when you get in you realize there's so many specific types of animals, that you probably never heard of before. Need to see it !!"], ["Reviewed June 26, 2017", 5.0, "Beautiful smaller easy to stroll zoo", "Zoo made for a nice afternoon, small zoo, excellent location by the ocean with mountain views, animals easy to see, gardens and landscaping beautiful. Easy parking, must see if going to Santa Barbara."], ["Reviewed June 22, 2017", 5.0, "Loved it", "Such a sweet little zoo. Not too big and overwhelming. Well taken care of and clean. My toddler just loved it. They have a nice little play area for the kids too."], ["Reviewed June 21, 2017", 4.0, "WILD!", "beautiful setting, with some great animals. If you have small kids, bring a cardboard box to slide down the astroturf hill, kids love it! You can see it all in about 2 hours, if you really want to..."], ["Reviewed June 19, 2017", 5.0, "Best zoo!", "This is such a great zoo. You can see everything in 2-3 hours and they have the best animals, reptiles, etc...Gorillas, Giraffes, Lions, Bald Eagles, Monkeys, Pink Flamingos and more!!!"], ["Reviewed June 18, 2017", 5.0, "Zoo by the beach", "Our family loves the SB Zoo. The highlight for my 7yr old is the kids play area. The kids, and some adults, slide down a hill on scraps of cardboard. It's hysterical to watch and a lot of fun. We walk and cover the zoo grounds at about 4hrs. I recommend checking the hours and such on the zoo prior to arriving. They close early at times for special occasions they have at the zoo. They also have weddings there too. Throughout the zoo, you have a cool air and a view of the ocean by the giraffes. We're from Los Angeles and a member of the LA Zoo, if you are as well, you can get a discount on the admission at SB Zoo. Parking is $10.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Best small zoo", "I say its a small zoo, but that is in comparison to LA Zoo, San Diego Zoo and Oakland Zoo. This is a great way to spend the day getting up close to so many animals.They do an amazing job at conservation and the zoo is gorgeous with mountain and ocean views.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Beautiful Zoo, Beautiful Space", "The Santa Barbara Zoo was a favorite of mine growing up. Now I'm loving bringing my kids here too. The train is always a must for us, and the park inside the zoo is wonderful. My kids love racing down the hill on cardboard or trays. There are plenty of places to sit and enjoy a picnic lunch. There are a good variety of animals to see and a lot of options for hands-on experiences.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Driving buy in our Hot Rod Limo we took a peek.", "Looking forward to coming back so we can go to the Santa Barbara Zoo. We saw these animals during their feeding. Very beautiful day for traveling. Glad we did it."], ["Reviewed June 4, 2017", 4.0, "Nice place", "With the early summer flowers this by far the best and most aromatic zoo I've been to. It's not a large zoo but has a good number of exhibits. The train seems pricey but the conductor stops a few times to give information about the animals. The best part was reciprocity with my home zoo so no entry fee.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Best small zoo!", "We have been to many zoos in California and this one by far is the best! A lot of animals including gorillas and lions. Very easy layout to navigate"], ["Reviewed May 28, 2017", 5.0, "Gets better with each visit", "I'm not usually a fan of zoos, but this one is special. It's small enough that it's not overwhelming and you can see all of it in a few hours. A small but very interesting collection of animals, birds, reptiles and even bugs, all set on beautifully landscaped grounds overlooking the Pacific Ocean.\n\nAnd, the optional train ride offers some behind-the-scenes look at how the zoo operates.\n\nWell worth a visit.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Way better than expected!", "Welcome from a town with a pretty great local zoo, so my expectations were high. The SB Zoo exceeded my expectations! Great variety of animals, excellent layout and easy-to-follow maps, and AMAZING exhibits!!! My husband, 6-yr old, and I loved every minute of it! My only complaint was the food selection wasn't that great (our zoo has an AWESOME cafeteria), and parking was bad, but everything was manageable. I will note we went the Saturday of Memorial Day weekend, so it was very busy. Despite that, it was still an enjoyable time!\nShow less"], ["Reviewed May 27, 2017", 4.0, "Great location - small zoo, but a lot of fun", "This zoo is located almost on the beach with a great mountain view in the other direction. Our 5 year old fed a giraffe and thought that was so fun. The train is enjoyable for everybody. Highly recommend for families with children."], ["Reviewed May 26, 2017", 5.0, "Great !", "This zoo is great. There is a lot of different animals. It is well maintained and there is an area for the kids to play. Also it is inside a large park so it is ideal for picnic . It is not Big but not so small. Price is not very expensive . A lot of fun.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Grandchildren's visit to Santa Barbara Zoo", "The Santa Barbara Zoo is one of our grand children's favorite places to visit when then come to Santa Barbara for summer vacation. Their favorite attraction is Duncan the Dinosaur"], ["Reviewed May 22, 2017", 5.0, "The zoo", "Very nice place well maintained and very clean. Parking was very easy u didn't have to walk far and free parking. Thanks food was very good for the price . Not very crowded and the staff was very helpful about telling you about the animals. They had a train that when around the whole zoo which is nice after walking around the zoo . There animals look very well kept and health very active and the outlay of the zoo is well thought about and done nice . They have shows for the kid's and grass spot to relax and a playground. I would say it's a hole day of adventure and knowledge for the family . It's well worth the price and time the park is in great shape\nShow less"], ["Reviewed May 22, 2017", 4.0, "Lovely but pricey", "Beautiful and well kept grounds. Can get really close to animals. Very small and limited in numbers of attractions. $10 for parking and ticket prices are high."], ["Reviewed May 20, 2017", 4.0, "Nice little zoo", "A very well kept zoo. Not too much walking. Giraffes are great. The other birds and animals seemed to be a bit cramped . It is worth a visit."], ["Reviewed May 16, 2017", 5.0, "Our go-to zoo", "This is he zoo we have a membership to. It is always so fun to visit. We always learn something new about animals. It is a great day out!"], ["Reviewed May 15, 2017", 5.0, "Zoo with a great view.", "This a great little zoo about 30 well kept acres. The enclosures are nice and clean and the animals are well cared for. One of the restaurants has a wonderful view of the ocean. A nice place to spend a couple of hours."], ["Reviewed May 13, 2017", 5.0, "First giraffe experience!", "If you ever get a chance to feed the giraffe, do it. The property is very beautiful and the animals seem very well cared for."], ["Reviewed May 10, 2017", 5.0, "First zoo visit mit first grandkid", "I'm from Germany and this was our first visit to SB Zoo with our first grandkid. He loves it to go there and likes to watch the animals. Especially the otters and the parrots! He's 20 month old and very active. The playground with the music instruments are amazing too. I will visit this zoo again when I'm back at California .\nShow less"], ["Reviewed May 10, 2017", 5.0, "Always on our list", "We love the SB zoo and ALWAYS visit when in SB. Impressed how clean and updated they keep it. Good variety of animals and you can get up and close"], ["Reviewed May 3, 2017", 5.0, "Animals galore", "Great place to take the entire family...very clean, animals well cared for, places for kids to play, grass area for parties or family picnics..."], ["Reviewed May 3, 2017", 5.0, "One of the Best Attractions in Santa Barbara", "The Santa Barbara Zoo is one of the nicest small zoos in the Nation. A wide variety of animals on display plus amazing grounds right next to the ocean. A great place to take the family for an outing. Santa Barbara Zoo is actively involved in animal conservation and education. Do not miss the opportunity to enjoy a day at the Santa Barbara Zoo\nShow less"], ["Reviewed May 1, 2017", 5.0, "Not to be missed - with or without little ones", "What a beautiful and well maintained zoo. So many animals to see in created habitats that are as close as space allows to their natural environments. I thought it would be a little 2-3 hour zoo; but, if time allows, plan for at least 4 hours and take the train ride!\nShow less"], ["Reviewed April 30, 2017", 4.0, "Good trip", "Very small zoo,not so many animals more reptiles ..but the ones that they do have are great and fun to watch...great playground for the kids to have fun...nice landscape for kids to run around and have a great lunch."], ["Reviewed April 29, 2017", 5.0, "Beautiful Grounds!!!", "Amazing little zoo! Very relaxing with lots of animals to see and enjoy! The grounds were amazingly kept and picturesque!!👍🏻"], ["Reviewed April 28, 2017", 5.0, "Friendliest zoo", "Small zoo but amazing. Will come back someday. Customercare was friendly and they let me in even before opening."], ["Reviewed April 27, 2017", 5.0, "Awesome place to spend the day", "Baby giraffes! We were lucky enough to see a Bon Voyage carcass meal for the young female lions who were being transferred to another zoo. The zoo & surrounding area are in a safe & very walkable location; great place to visit for everyone of all ages.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Love this little gem of a zoo!", "Absolutely love this zoo! Have been taking my children there for years. This zoo is located right across the street from the beach so needless to say the giraffes have an unbelievable view! Very manageable to see everything in whatever time you have. While a small zoo you will see lions, giraffe, elephants and even gorillas! Be sure and take the train ride around the zoo. You will learn lots of interesting facts. Still one of our favorite family attractions.\nShow less"], ["Reviewed April 25, 2017", 5.0, "A great place for the family, or a lazy afternoon", "Something of interest for the whole family, from Snakes and other small creatures of interest to the giraffes and other larger animals.\nEasy walking the paths are smooth and there is a small tram/train, but I have never taken it as the walk is so pleasant.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Girls Trip 2017", "While visiting Santa Barbara we made it a point to visit the zoo. The zoo was located across the baseball field from out hotel. This zoo is one of the best I have ever visited, it was clean the grounds were beautiful and the animals were lively. We paid $8.00 to feed the giraffes, which was a treat for my daughter as she loves giraffes. The employees were helpful and knowledgeable. $17.00 entry fee $16.00 if you get the $1.00 off coupon offered by most hotels.\nShow less"], ["Reviewed April 20, 2017", 3.0, "Small but nice use of the space", "Admission charged. Built on a hill. Animal population was not real extensive but well thought out. The condor and eagle exhibit were nice. The elephant was amusing. Good place for young children. Lots of picnic areas. Would be OK if you had not been to one of the big zoos.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Nice little zoo", "We like the SB Zoo so much , so even only being here for 7 months we bought an annual pass. We come frequently and like this little kids friendly place. If you are coming only once it is a little expensive, if you come more than 2 times with 3 kids like we have the membership is great.\nShow less"], ["Reviewed April 17, 2017", 5.0, "A really fun Zoo", "This is a great place for all ages. Our kids loved it and so did we. The highlight of the day was feeding the Giraffes. They supply the food and the creatures come right up to you and take it out of your hands."], ["Reviewed April 15, 2017", 5.0, "Great Half Day Outing", "This zoo is easy to navigate and see all the animals.You can take time at each exhibit and really enjoy the surroundings. Don't miss the opportunity to feed the giraffes! The time and money is worth it! When do you get to do that?"], ["Reviewed April 12, 2017", 5.0, "Fun", "Very pretty zoo. Nicely landscaped.\nEasy stroll to see all the animals.\nPerfect for families.\nI came to feed the giraffes....which lucky for me there was no long line.\nThere is a cute train ride that is perfect for families with little kids.\nThe flamingos seem to be extra pink in color.\nNot expensive. ... Although I was not happy paying for parking and then having to wait for someone to leave to get a parking spot.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Beautiful Zoo", "Really nice zoo. The habitats are not too large and there are many animals. It is a really nice walk through and a great place to take kids."], ["Reviewed April 11, 2017", 5.0, "Awesome!", "Beautiful zoo perfectly laid out for visiting with children. Great feeding giraffes and fun train ride."], ["Reviewed April 11, 2017", 5.0, "Happy kids at Santa Barbara Zoo", "A relative small yet lovely and full of activities zoo. My grandkids enjoy feeding lettuce to the giraffes and watching the flamingos and elephants."], ["Reviewed April 11, 2017", 5.0, "Perfect way to spend a day with grandchildren", "My niece has a family pass and we went with her two young children, her mother and me. The zoo is full of interesting information about the animals, for older children and adults, including what you can do to preserve the animal habitats. And the animals are impressive. It's small enough to walk through and still have energy left at the end!\nShow less"], ["Reviewed April 10, 2017", 5.0, "GREAT FAMILY FUN", "Took the grand children who had only been to a very small zoo with only a handful of the smaller animals.. THEY LOVED the Giraffes and elephants and the reptile exhibit. There were so many nice opportunities to allow them to blow off some steam they have a number of play areas all around the park and it was so well laid out. The train ride was esp a HIT! Highly recommend esp for younger children Ours are under the age of 6\nShow less"], ["Reviewed April 4, 2017", 4.0, "Good visit", "Great visit. I would recommend not buying online. The staff could not scan any of our online tickets."], ["Reviewed April 1, 2017", 4.0, "Beautiful zoo, great for the young ones", "This has to be the most scenic zoo in the country, with views of both the mountains and the ocean. Not a huge zoo, but everything was well laid out. The giraffe exhibit was one of the highlights, and for $5 you can actually feed them. In the middle of the zoo, there's a small park for kids to play in -- a nice diversion for the young ones, or even the older ones. A couple of food concessions with OK food. Stroller rental for #7 per day.\nShow less"], ["Reviewed April 1, 2017", 4.0, "Zoo is a small gem in SB", "Raising kids in Santa Barbara, the zoo was a definite resource. It is small but specialized and very well run. Grounds are picturesque -- lots of weddings are organized at the park at top. The zoo borders on bird refuge which is a large lake/estuary on the east Santa Barbara Beach area. Zoo as a small guage childs train which is diesel fired locomotive - and offers camps for local children interested in animal care and observation.\nBird aviary is definite high point, aquarium area is also surprising.\nShow less"], ["Reviewed March 29, 2017", 5.0, "A beautiful place to spend an afternoon.", "This charming zoo is enjoyable for people of all ages. The animals are well cared for, the grounds are beautiful and clean. Lots to see and do. Bring a picnic and sit on the lawn to eat. The children's playground is inviting and delightful."], ["Reviewed March 29, 2017", 4.0, "Nice little zoo, in a great location.", "The zoo is small, but very nice. Excellent location and the animals are well cared for with the history of the animals posted so you feel like you get to know them. I did think some the enclosures were a bit small, but it was a nice experience.\nShow less"], ["Reviewed March 27, 2017", 5.0, "SB Zoo - Very Unique Concept", "The Santa Barbara Zoo is a small but beautiful attraction. It strategically incorporates children's playgrounds and open space in the middle of the animal exhibits. Wish we had known about it when my collegiate children were still kids. Park staff was very friendly - right after we entered, one gentleman went out of his way to escort us all the way across the zoo so we could be on time for the feeding of and short lecture on the meerkats.\n\nThe assortment of animals is limited, but in some cases ones you may never have seen at other zoos (Black Swans, the cute Fennec Fox, and the beautiful Blue-Crested Pigeon). The grounds and animal habitats are all clean and well maintained. Many educational sign stations are placed to educate children (and adults) of things we can do to help protect the environment and co-exist with animals in the wild. Picnic areas and playgrounds, plus a mini-train that runs around the park perimeter.\n\nAlthough hidden at the end of a cul-de-sac, the zoo is less than three blocks away from the beach. Nice place to visit at least once in your life. Plan for a half day, then hit the surf !\nShow less"], ["Reviewed March 22, 2017", 4.0, "Love this little zoo!", "First of all, this zoo's location can not be beat. It minutes away from State street, Montecito, the bird refuge lake, and the Southern beaches of SB. Make sure to visit Gemina, the crooked neck giraffe!"], ["Reviewed March 18, 2017", 5.0, "Great Zoo - Great location", "What a great location for a zoo. The animals are well cared for have nice enclosures and there is great information about them. The staff is great! I love feeding the giraffes and the train."], ["Reviewed March 15, 2017", 4.0, "Very nice zoo but limited attractions", "The zoo was very nice but the attractions seemed a little limited considering the size of zoo. But the available attractions along with train ride was still a fun experience with friends and family. Prefer to go straight to train ride first thing when you come to park. Long queues form pretty fast.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Santa Barbara Zoo is a boutique gem and localized treat", "We have become members of the Santa Barbara Zoo because of it's appropriate size for a quick morning or afternoon treat for the grandkids. It's friendly size is just right for small ones, and it's specialized areas of local fauna are a unique look at what's really around you. It'll be hard for you to get the kiddos off the sliding anthill, or to talk them out of the train ride.\nShow less"], ["Reviewed March 13, 2017", 5.0, "surprisingly great zoo", "My expectations of the zoo were not high based on the fact that Santa Barbara is a modestly small community. This beautiful zoo is a pillar of this community. It is clean, kind, beautifully designed, well run and worth every penny of the not-so-modest entrance fee.\nShow less"], ["Reviewed March 3, 2017", 5.0, "Enjoy the Zoo!", "The Santa Barbara Zoo is a beautiful little gem. It's just the right size and the grounds overlooking the Pacific Ocean are the perfect place for a picnic. Don't miss feeding the giraffes! Fun for everyone from little children to adults."], ["Reviewed February 26, 2017", 3.0, "Too small for the money", "A relatively small zoo with a big-zoo admission price. The lack of space really affects the number of exhibits. I found the small size of the elephant enclosure particularly troubling. Seattle's Woodland Park Zoo closed their elephant exhibit and it was much larger than Santa Barbara's. Even with only 2 elephants it simply isn't big enough. I'm not a PETA freak by any stretch of the imagination but I don't think they should be keeping elephants in those conditions.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Beautiful Zoo with Amazing Views", "Having grown up going to the San Diego Zoo and the Wild Animal Park, I tend to expect a lot from a zoo. The Santa Barbara Zoo is in a beautiful location with gorgeous views. It's not big and can be finished in a couple of hours. Most importantly though, every animal care giver we met, truly seems to love the animals in their charge.\nShow less"], ["Reviewed February 22, 2017", 3.0, "Not bad, great views", "I do not like zoos, but the one in Santa Barbara is family oriented and fun to spend the day. The best part would be to feed some of the animals!Then you can take a stroll by the ocean and finish the day at a fish restaurant.\nShow less"], ["Reviewed February 20, 2017", 5.0, "Not crowded and so fun!", "After much rain, we were eager to see the sunshine and visit the zoo.\n\nOur party of 12 (3 families) quickly found parking spots, got our tickets and began our visit. There were no crowds and with sunshine and temps in the high 50's, we had a great visit.\n\nLots of room for kids to run around and explore and great exhibits. Highly recommend!\nShow less"], ["Reviewed February 19, 2017", 4.0, "A small zoo in a beautiful setting", "Santa Barbara zoo is a local zoo. It combines animals with a relaxing park, which gives you a scenic view of the area surrounding the zoo.\n\nA little outside the city centre, the city's transfer busses ($1) can get you there. I think you can spend a good 3/4 hours in the zoo, having seen everything and have a nice meal in the park.\nShow less"], ["Reviewed February 18, 2017", 4.0, "And we fed giraffes", "We loved loved feeding the giraffes. What a special treat! Overall, we enjoyed the zoo. We felt sad for many of the animals as the enclosures were small and uninspired."], ["Reviewed February 16, 2017", 5.0, "Fun", "A lovely morning spent at the zoo with nice weather. Not too huge for getting around and seeing the animals and learning Have been here before some time ago. It was a lovely visit"], ["Reviewed February 16, 2017", 5.0, "Vacation", "My bf and I decided to visit this zoo because we never been here before. It was worth seeing. Alot to see and do. Very nice"], ["Reviewed February 16, 2017", 4.0, "Worth a Visit", "It's not San Diego but still a fun and interesting way to spend a few hours. The elephants are 45 years old and looked lethargic. The big cats and gorillas also appear bored. The birds are amazing and the snakes....We have mixed feelings about zoos but we are glad we went if only to support the care of these animals.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Great Zoo", "I was really amazed by this zoo. OK, so it's not San Diego zoo. But for a small town, this was really lovely. Feeding the Giraffes was fun, seeing all the different birds they had and the lions too. Really a fantastic place to take the kids also. The Elephants were beautiful. The exhibits are really well put together.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Lovely small zoo", "We went here on a visit to Santa Barbara and had a great time! The zoo is lovely, clean and pleasant. It's mostly small animals but it's beautifully laid out and perfect for young children.\nThey had a fun dinosaur show while we were there that my two year old granddaughter loved. Most of all, she loved going down a hill on cardboard \"sleds\".\nNot a great choice of food but otherwise a fun couple of hours.\nShow less"], ["Reviewed February 6, 2017", 4.0, "As good as Zoo's get", "Feeding the Giraffe's is a great experience and one my children like to do every year. As Zoo's go, we find this one to be the perfect size, fairly easy to navigate around and plenty of kids activities to let them let off steam."], ["Reviewed February 5, 2017", 5.0, "Great little zoo", "Loved this little zoo! Great animals. Love the history of the elephants, they've been together since '72. Lots of picnic space."], ["Reviewed February 1, 2017", 4.0, "Santa Barbara Zoo", "Santa Barbara Zoo is the perfect zoo for the whole family big enough but not to big it will keep you entertained. With interactive attractions this zoo is a lot of fun. There is a small food place to get a bite. With animals that you do not always see at other zoos making this great for adults as well but especially great for the little ones.\nShow less"], ["Reviewed January 25, 2017", 4.0, "Family Time", "This is the perfect size zoo. Small enough for a toddler's attention span but has enough to keep adults interested too. The play areas are spaced just where you need them for wiggle breaks. We took our children here 30 years ago on vacation and now our toddler grandchild lives in the area.\nShow less"], ["Reviewed January 20, 2017", 5.0, "Pretty Cool!", "One of the smallest zoos in the country but worth the visit. Took our one year old and three year old grandkids. Apes, lions, giraffes, elephants, penguins, were some of the animals that we never get to see at the Anchorage Zoo that we usually visit. Friendly staff highly recommended the ten minute train ride but didn't get a chance to do it.\nShow less"], ["Reviewed January 17, 2017", 3.0, "Fun Place to Visit", "We went here with my 1 year old Grandson. Some of the exhibits were tired looking and a bit boring. However the interactive parts were real fun. Feeding the Giraffe as very cool and feeding the goats and sheep kept him giggling almost constantly. It was also fun to find the penguins names and follow them around the pool. There is a small playground and snack bar to eat at. It was an average zoo in our experience but a fun time with kids.\nShow less"], ["Reviewed January 15, 2017", 4.0, "Always fun", "Just loved the grounds, animals and train-ride. We went with our grand-kids and it was very enjoyable:))"], ["Reviewed January 12, 2017", 4.0, "Great For Young Children", "I recently had to be in Santa Barbara for a wedding during the New Year holiday and was told that the zoo is a good place for children. A few things to point out: This is not a large zoo. This is not like the San Diego Zoo where you have tons and tons of animals. However, that being said we really had a great time with our 10m old. It was the perfect amount of walking and sightseeing. The leopard and lions were out. As well as all the monkeys, giraffes, and elephants. We only spent maybe 1.5-2 hours here maximum. It was sprinkling so there was not many people here which made it even better.\n\nThere are many places for your children to get out and run around and explore too. You could also feed the giraffes if you so desired. A great cold weather day activity.\nShow less"], ["Reviewed January 7, 2017", 3.0, "Nice but overpriced", "This zoo is a nice 2-3 hr visit. They have a nice variety of animals to view but its small. We visit the Fresno Chaffee Zoo and pay half the price for a larger zoo with huge safari exhibits.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Awesome Zoo!", "Such a fun zoo! I have been going to this zoo for nearly 50 years and it just keeps getting better and better.\nBe sure to check out the baby giraffes, Lucky the penguin, the snow leopards, the elephants, the Fenec Foxes, the California Condors, and so many more...\nYou can even spend the night at the zoo...\nShow less"], ["Reviewed January 6, 2017", 4.0, "Santa Barbara Zoo: great", "The Santa Barbara Zoo is great. It was very crowded with families since it was the week between Christmas and New Year. The place was very clean and fairly easy to navigate. I loved the elephant exhibit (he was taking a nap when I was there!) Great aviary as well, for those who like birds.\nShow less"], ["Reviewed January 5, 2017", 5.0, "Lovely Zoo with Beautiful Animals", "The Santa Barbara Zoo is such a lovely place. My favorite are the beautiful Giraffes. You can see the newest additions and feed the adult ones, Am a kid at heart here and enjoyed seeing and feeding the awesome Giraffes. Was so impressed by this Zoo, I signed up for an annual pass.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Perfect for small children", "We had 3 little ones with us and they easily were able to tour the entire zoo in 3 hours. They loved feeding the giraffes too. Downside: Only one place to get lunch and the lines are long."], ["Reviewed January 2, 2017", 5.0, "Small but lots of fun for kids", "This is a great little zoo for the entire family to visit. A bit on the pricey side but the kids will love getting up close to the animals. Beautifully tended exhibits and some views of the ocean."], ["Reviewed December 31, 2016", 4.0, "End of year trip with James Family", "Loved this small zoo. Crowded due to Christmas time but enjoyable. I am used to SD Zoo which is huge in comparison. This was more intimate."], ["Reviewed December 26, 2016", 5.0, "Fantastic zoo, a must see!", "We had so much fun at the Santa Barbara zoo, they have reciprocal benefits with other US zoos, so bring your membership cards. The condor rehabilitation area and biologist's talks were incredible. The kids play area was so much fun. This is a hidden gem, you won't be disappointed.\nShow less"], ["Reviewed December 21, 2016", 1.0, "Not good value for money", "They try to charge you extra everywhere you go. When I mentioned how this seems to tourists, one staff member in particular went out of her way to be rude and unpleasant to me through out the park. This visit has given me a poor impression of this whole town. Avoid.\nShow less"], ["Reviewed December 9, 2016", 4.0, "A good place to go", "There are lots kinds of animals, and good sevice there. It's very good for children to go, the bookstore is not expensive, and lots of good souvenir that I want to buy, but the only thing is zoo is not big."], ["Reviewed December 7, 2016", 4.0, "Impressive Small Zoo!", "One of the best zoos I've been to, despite its small size. They are very customer-oriented, with great signage, lots of activities, lots of little tidbits to add seasoning to the experience. Most zoos, it's \"Here are the gorillas... here are the elephants.. here are the snakes...\" At the SB Zoo, we were able (for a few extra bucks) to feed the giraffes (one of my wife's bucket-list activities); we watched the lions eat an animal carcass - a little gory, but really cool, and they helped us see it as a part of the natural life of lions; it was after Halloween, and the day we were there, the elephants were having a \"Pumpkin Smash\" day, tossing around pumpkins and eating them. VERY knowledgeable staff, helped us learn things about the animals we didn't know. The one less-than-excellent thing? The food at the food place was marginal, overpriced, and the service was terrible. But other than that, it was a great experience, very different from most zoos.\nShow less"], ["Reviewed December 2, 2016", 5.0, "Monthly Visit", "I recently moved to Santa Barbara and my children (5 & 13) and I love this zoo. I bought a yearly pass and try to go there once a month. We have been to many in other cities but this one is beautiful and easy to walk through in 3 hours. My kids love the elephants and giraffes the most. Skip the train ride. Just enjoy seeing the beautiful landscape and animals. Your children will love it. It's very relaxing.\nShow less"], ["Reviewed December 2, 2016", 5.0, "Wonderful animals!", "We visited the Santa Barbara Zoo while on a cruise. We had planned on taking a taxi from the harbor, but found a local trolley for 50 cents instead. We easily explored the zoo and returned to the ship via trolley. It was a great, inexpensive excursion\n\nThe zoo is relatively small and the animals were close and easy to see. We loved watching the elephants using their trunks to pick up food. The baby giraffes were darling. Several people were feeding the larger ones so they were up close. The two fairly new gorillas were sitting and watching everyone. The Channel Island Fox and condor exhibits were well done.\nShow less"], ["Reviewed December 1, 2016", 5.0, "Great Zoo", "Small, clean, manageable and the animals actually seem happy. Great little zoo. The train is so much fun."], ["Reviewed November 28, 2016", 5.0, "A lovely zoo", "My daughter calls this an \"animal spa\". A beautiful place with no cages. Beautiful grounds and many interactive features. Worth visiting."], ["Reviewed November 28, 2016", 4.0, "a nice accessable zoo", "the grounds are really nice and the animals are well cared for. It is a small zoo but worth the time. It is a little pricey, especially if you and your family take the train"], ["Reviewed November 27, 2016", 5.0, "Great place to visit for young and old", "A beautiful setting for a lovely zoo, loved the penguins, elephants, lion and giraffes. The playground is a nice place for a brake and the train ride is great. My grandson (2 yrs old) had a good time!"], ["Reviewed November 27, 2016", 5.0, "Nice medium size zoo & botanical garden", "We always try and see every zoo when we travel. SB Zoo is a good medium size zoo with nice free roaming exhibits for their animals. The open area is filled with botanical native plants and playgrounds, it's not a crowded zoo where you feel overwhelmed to go from exhibit to exhibit to get it all in. Bring a lunch and drink and make a picnic day of it.\nShow less"], ["Reviewed November 27, 2016", 4.0, "My favorite zoo", "Great place to visit for an afternoon, my Not big but animals are well taken care of and A fun adventure for all ages"], ["Reviewed November 26, 2016", 4.0, "Thanksgiving", "Fun little zoo! We could walk there from the Hyatt. Worth the price. I liked that they had large animals."], ["Reviewed November 26, 2016", 4.0, "Nice little ZOO", "Obviously not a world´s best ZOO but it was a pleasant surprise for us after the rest of so called \"Riviera\" in Santa Barbara had not impressed that much. Enclosures looked nice and most animals happy, and you even can find some really interesting ones in there (snow leopards would be on the top of the list obviously). There is also a larga park with a great botanical section, so it was really a pleasant walk for us\nShow less"], ["Reviewed November 26, 2016", 1.0, "Felt sad for the animals.", "This zoo is very small. I fell bad for the animals in such small cages. It has a beautiful ocean view but i unfortunately will not return unless they make bigger habitats for the poor animals."], ["Reviewed November 25, 2016", 5.0, "Small, well curated and an ocean view", "The San Diego zoo it ain't, but it is a wonderful small zoo with some good displays and some creatures you don't see everywhere. Laughing kookaburras from Australia - five of them looking quite comfortable perched on tree parts. California condors in a large netted area with a picture nearby of their nine foot wing span. A lion couple who groomed one another and then settled down gazing off just like an old couple watching tv. Finally some very good looking giraffes. The landscaping is beautiful and all the people we saw seemed happy. The signage provides excellent information and should be readable and understandable to kids as young as 7. For younger children you obviously need to interpret - just what we saw parents doing.\nShow less"], ["Reviewed November 24, 2016", 5.0, "Best small town zoo ever!!", "The Santa Barbara Zoo is outstanding in every way. It is fantastic for a family visit of any age kids. The price is affordable and the location is awesome."], ["Reviewed November 23, 2016", 5.0, "Satisfied a Longing to Visit a Zoo", "I have been wanting to return to the Minnesota Zoo for many years and the opportunity to satisfy my longing to visit a zoo happened this past November with a visit to Santa Barbara. What a gem! I was able to view three California Condors. A memorable moment was watching the elephants strip and eat some type of tree. Watching how they utilized their nose in the eating process was interesting to see. We watched them feeding for twenty minutes. The prairie dog exhibits was fun to watch, watching the prairie dog guard and other rodents was fun.\nShow less"], ["Reviewed November 21, 2016", 5.0, "A wonderful place to wander and view the animals", "This is a great, friendly place. Seems like a family run zoo, with really welcoming staff and a good variety of animals. There are lots of places to wander and get good views of the ocean. I highly recommend bringing a picnic lunch and sitting on the huge grassy area that overlooks Santa Barbara. There are lots of well timed exhibitions. The animals are in large enclosures with great viewing places. I would consider this a must see place if you are staying in Santa Barbara\nShow less"], ["Reviewed November 19, 2016", 5.0, "very relaxing", "even on a busy day, there was space ,all the animals looked relaxed and healthy, good gorillas and giraffes .overall nice way to spend 4 hours"], ["Reviewed November 17, 2016", 4.0, "Cozy little zoo", "All the attractions you would expect, and a magnet for moms with toddlers. I was great to watch all the little ones oohh and ahhh at the great wild life they were seeing. Zoo is physically small which makes it manageable for the young ones. There is plenty to see and re-see and there were very helpful patient staff around to answer all kinds of questions, relevant or not.\nShow less"], ["Reviewed November 16, 2016", 4.0, "Fun little zoo", "Ive been coming here since I was a kid and now I get to take my son, and he loves it. Good variety of animals and a great gift shop. We fed the giraffes which was awesome. The only reason it's not 5 stars for me is the cost. It was like 42 for me my boyfriend and our son. But a fun day none the less.\nShow less"], ["Reviewed November 14, 2016", 5.0, "A delightful day at the Zoo", "A wonderful small, but terrific Zoo....lots of great things for kids, and the animals are so well cared for"], ["Reviewed November 14, 2016", 5.0, "As the song goes, it's all happens at the ZOO!", "Great for all ages, grandparents in particular. Have great sliding hill and other attractions as well as great displays and educational matters to explore and share. Parking is excellent , food is healthier than most places, and the staff well trained. The best part is the open atmosphere and easy viewing for little ones. Also has very expansive gift shop affordable for early target \"grandparents\" to visit to \"spoil all ages\". Lots of educational materials and games suitable for today's savvy kids. Also camps, and other events throughout the year. It's a place where animals are included in everyday fun.\nShow less"], ["Reviewed November 12, 2016", 2.0, "Small and sort of sad", "We love zoos, but this is not a great one. Many of the exhibits seemed shabby and a surprising number of exhibits were empty. The various enclosures seemed too small for several of the animals, notably the snow lion. Not good value for what there is, considering even parking was pricey. The good news is that there were hardly any people there, so no need to fight crowds. But, really one of the most mediocre zoos I have seen.\nShow less"], ["Reviewed November 8, 2016", 5.0, "Excellent", "Very nicely done. We enjoyed the displays, and layout. Plenty of good viewing. Overlooking the ocean on one side and the mountains on the other."], ["Reviewed November 8, 2016", 5.0, "Pleasant zoo", "This is definitely one of the nicer zoos. Accessible, temperature always nice so the animals are out and visible. Baby giraffes are adorable. Nice place for sure."], ["Reviewed November 6, 2016", 4.0, "Very nice zoo", "This is a smaller zoo, but it has a lot of nice exhibits and it's not very crowded. We had a very nice visit."], ["Reviewed November 6, 2016", 5.0, "Santa Barbara Zoo Visit", "We absolutely loved the Santa Barbara Zoo. This is one of the nicest zoo's we gave visited. The zoo is very clean and the staff was very informative. Our family spent 5 hours there. The Santa Barbara Zoo encourages family's to enjoy the grounds and there are plenty of picnic tables to have a packed lunch. We will definitely be back.\nShow less"], ["Reviewed November 2, 2016", 4.0, "Great family outing", "Enjoyed walking through this zoo which is relatively small and therefore quite manageable to do in a few hours. Had great weather and enjoyed the animals - especially seeing the otters. Took the train ride but found that we could not really hear the commentary."], ["Reviewed November 1, 2016", 4.0, "Very nice small zoo", "We took are 6 year old twins and they enjoy the dinosaur show . If you are planing to go with children make sure they wear walking shoes . The view is great and you can also take food and have a family picnic . They have a gorilla display and it lets you get up close to them\nbetween thick glass .\nShow less"], ["Reviewed October 31, 2016", 5.0, "Loved this park like atmosfere", "Great for really young kids. We had a great experience. Not the typical zoo. It is small and walkable for babies. Plenty of shady open space for children and great garden like feel. Animals seem happy and well cared for - we saw no distressing situations and the animals were close enough to actually see them. Our one year old loved it and so did we.\nShow less"], ["Reviewed October 27, 2016", 5.0, "Beautiful views and lovely walkway", "I love the Santa Barbara Zoo. It's small, but you can get up close to the animals and theres still a lot to see. Feed the giraffes! Theres a baby there now. So fun to watch him run around. Not as crowded as other zoos I have been too either. Animals seem healthy and happy here : )\nShow less"]]}}