{"Seaport Village": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Seaport Village", "url": "/Attraction_Review-g60750-d103192-Reviews-Seaport_Village-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/f8/31/8f/photo4jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "3948"}, "address": {"@type": "PostalAddress", "streetAddress": "849 W Harbor Dr Downtown", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-7744", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Love this area", "I love seaport village. The stores are fun and there are plenty of restaurants to choose from. There's a bookstore/cafe where you can play chess upstairs with giant chess pieces. Fun!"], ["Reviewed 2 days ago", 5.0, "A must do when visiting San Diego", "Either for a visit to San Diego or being a San Diegan, Seaport Village is a MUST!! It is one of the best spots in the harbor to enjoy the breeze, to go to its shops, enjoy fine dining at the different restaurants."], ["Reviewed 3 days ago", 5.0, "Place for snacks and view", "Nice place to have a stroll, take some pics , have a bite to eat, buy souvenirs and have fun with the kids. Relaxing afternoon."], ["Reviewed 3 days ago", 4.0, "Enjoyable walk with beautiful views.", "My family walked through here a couple of times during our stay in San Diego. We were staying at the Marriott Marquis so it was just outside our hotel. On Sunday they had street performers out who were very good and fun to watch. Shops and restaurants. Fun for an hour or two. I wouldn't walk a long distance or go out of my way for it though.\nShow less"], ["Reviewed 4 days ago", 5.0, "Good hangout", "Seaport village has a great atmosphere. It was easy to get there by tram. Good place to spend couple of hours, do some souvenir shopping and grab a bite to eat. Many eating places have seafront seating."], ["Reviewed 4 days ago", 5.0, "Visit now", "We heard that new owners bought Seaport Village and that their plan is to make it more like a mall, ruining its character."], ["Reviewed 4 days ago", 4.0, "Nice place", "This was a nice place to visit for a couple of hours. Lots of shops and eateries and nice views of San Diego harbour."], ["Reviewed 5 days ago", 5.0, "Quaint", "This little shopping village is adorable. There are so many little shops tucked away. It just keeps going. Unique and quaint are perfect descriptors for this local. Food and shipping combined."], ["Reviewed 1 week ago", 5.0, "A Favorite Place To Explore!", "Enjoyed a day at Seaport Village with my daughter and grandkids. We just enjoyed the shops and lovely weather!"], ["Reviewed 1 week ago", 5.0, "Must Stop", "Fun shops, great food choices, and amazing ocean views. The stores didn't seem to open up until 10ish. It wasn't too busy when we were there. Well worth the time, great walking area."], ["Reviewed 1 week ago", 3.0, "crowded and touristic but still a must see", "We strolled on a Sunday and the place was packed with locals and tourists. It was sort of a zoo but still lovely to walk by the water and enjoy the afternoon. You can get a nice walk if you start by the cruise ship pier and walk along the water past the convention center. It takes you right by Seaport Village\nShow less"], ["Reviewed 1 week ago", 3.0, "Cute", "Small, touristy village. Scenic, on water. Good for restaurants and gift shops close to hotel. Pretty boats and bay views."], ["Reviewed 1 week ago", 4.0, "Fun Place for an Afternoon", "Nice quaint little shops and great places to eat all in a great harbor side location. My family and I really enjoyed our time there."], ["Reviewed 1 week ago", 5.0, "Lovely shoppes and seaside setting!", "Highly recommended! A charming seaside village with great restaurants and shops. Very scenic, colorful kites flying, and lots of people strolling yet not overly crowded."], ["Reviewed 1 week ago", 4.0, "Shops and restaurants", "We walked down from a harbor after a day on a boat. There are a number of shops and restaurants. There was a kite shop and near the water in a park area a number of kites flying.\nThere is paid parking, public restrooms.\nWe stopped for ice cream before walking back to the harbor, it was delish.\nShow less"], ["Reviewed 1 week ago", 5.0, "Good walking/ running/ eating location", "Seaport Village is right behind the Manchester Grand Hyatt. It offers many stores with clothing, jewelry, souvenirs, etc as well as many food choices. There are both take-out places like Ben and Jerry's (yummy) as well as sit-down restaurants. You can easily spend 45 to 90 minutes walking around.\n\nIf you are motivated, you can walk, run or bike both north and south. I've gone north several times with stunning views of the harbor. You can go all the way up to the airport which is between 1.5 and 2 miles depending on where you turn around.\n\nAlternatively, you can just take a seat and watch the world go by.\nShow less"], ["Reviewed 1 week ago", 3.0, "Buzzing and busy", "We visited on a Sunday afternoon and it was very busy but still pleasant. A nice atmosphere and a good place to enjoy fresh air and the harbourfront. Lots of small artisan shops."], ["Reviewed 1 week ago", 5.0, "Great place to walk around!", "Plenty of shopping options and dining options. On e of my favorite places to go to in San Diego. So nice to stoll along the water and take in all the sights!"], ["Reviewed 1 week ago", 5.0, "Great shops and views", "I pretty much always go to seaport village when in San Diego. It’s a great place to walk. The views are perfect. There are a lot of nice shops many with unique items. If in San Diego you have to go at least once."], ["Reviewed 1 week ago", 5.0, "Great place to eat and shop!", "Great place to go to shop and eat right on the water. Loved the decor and quaint shops. Very relaxing."], ["Reviewed 1 week ago", 3.0, "Touristy but pleasant", "Crowded and lots of tourist shops. Expensive restaurants. In spite of all this a pleasant place to walk and look at the water"], ["Reviewed 1 week ago", 3.0, "Tourist Area on the Water", "This is a nice place to take a walk and there are several good restaurants. Shopping is mostly tourist souvenirs. It’s missing the nicer stores of 20 years ago.\n\nParking is expensive if not validated. It’s $5 for first three hours with a validation - without its $16.\n\nBut it is a great place to see the Bay and the Coronado Bridge.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great area to visit", "This area has great waterfront restaurants and shopping. The USS Midway is right there as well. I wish we had scheduled more time to spend here! Definitely something for everyone."], ["Reviewed 2 weeks ago", 4.0, "Carousel!!", "one more of the best carousel 1918. Hand carved. All original. I LOVE these old carousels. I look for them all over the world. This one is beautifully cared for."], ["Reviewed 2 weeks ago", 5.0, "Favorite spot in San Diego", "One of the main reasons we go to San Diego. Sea Port Village is right in the heart of Downtown Sa Diego along the sea wall where the tuna industry used to be. Plenty of interesting shops and places for eating. Our recommendation for the best Fish and Chips in the world is the San Diego Pier Cafe. Hangs out over the water. Great view of the bay and Coronado/North Island. A must to eat there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Cute, fun and clean", "We had a great time walking around in the village. Cute stores and good food. Was a perfect stop while walking from our hotel to the USS Midway."], ["Reviewed 2 weeks ago", 4.0, "Many gift shop stores", "There's many stores within here and great prices too. Also many places to eat and tours for the city."], ["Reviewed 2 weeks ago", 5.0, "Great place", "Scenic views with much to do and eat. We walked to the Midway Museum and shopped. We saw individuals on bikes and many vendors along walking pathways. The marina was close by. If walking poses a problem, there are bicycle rickshaws but are expensive."], ["Reviewed 2 weeks ago", 5.0, "Nice assortment of stores", "This area is much bigger than you think when you start walking around. There are many unique stores to browse within and lots of places to eat. We ate some delicious shrimp tacos at one of the restaurants overlooking the boardwalk and water."], ["Reviewed 2 weeks ago", 4.0, "Outdoor shopping and entertainment area", "Seaport Village is always great for a couple hours to visit Scott some nice restaurants a few bars several featuring great views of the Bay. Upscale and does feature outdoor entertainment from time to time. A Waterfront walkway connects Seaport Village 2 other waterfront hotels as well as the Midway on the other side.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Balanced rocks, ice cream and whimsical shops by the sea", "After you park and put your ticket in a safe place get some Ben and Jerry’s it’s one of the few stand alone shops they have and it makes the stroll around the touristy fun shops even better. The stores here are quaint and surprisingly funny, you can buy a spiral wind kite or a music box and see so many little gadgets. You could easily buy all the gifts you need on a visit, it’s a place made to pick up cherished souvenirs and make memories. There is also a rock balancing artist who has become part of the attraction there, as he sets up regularly and can be googled! Definitely a special site to see!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful Views", "We love Seaport Village there is so much to see and always visit there when we come to San Diego. The shops are great & the restaurants also. Friendly people and great views if you stop and look. We love it."], ["Reviewed 2 weeks ago", 3.0, "Expensive tourist destination", "My wife and walked all over Seaport Village; exploring the area. The restaurants are high end as are the shops and stores. It was interesting to view, but made me cringe when looking at the prices. Not a place for a family or couples on a tight budget.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Lots of family friendly retail / food options", "A place to attract tourists with small shops, restaurants and great views. Good selection of fast food, restaurants and wine bars along with themed retailers."], ["Reviewed 3 weeks ago", 5.0, "More Fun Per Square Foot!", "Seaport Village is jam packed with great stuff to do!\nDozens of place to eat from a fish taco or hamburger to the finest dining!\nDozens of artisan shops, curios, collector, art, you name it.\nSpend and afternoon here and soak it in.\nWalk along the seawall and watch the birds and boats on the harbor.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful walk", "Awesome place beautiful go every year....i love happy people...( not drug induced).. super shops and some good deals on shirts not very crowded during week parking is fair and available."], ["Reviewed 3 weeks ago", 3.0, "Disappointing", "I expected something different. All new, not historic. The Carrousel was nice. The restaurants seem nice but we did not eat there."], ["Reviewed 3 weeks ago", 5.0, "Great hang out and shopping", "Cool setting and harbor views. Great restaurants, we ate at the Edgewater Grill. Unique shops. Outdoor park nearby. One of the stops on the hop on hop off trolley."], ["Reviewed 3 weeks ago", 5.0, "Nice place to eat and shop", "We have gone here numerous times and always enjoy it. There are lots of restaurants and shops. There are lots of places to walk, passing ships and boats that are docked, and also park areas. It's close to other areas to walk to in San Diego. We stayed at the Embasey Suites across the street which was very convenient.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Shops are pretty cool but parking is quite expensive", "We enjoyed our visit down to Seaport Village. The shops here are pretty neat and have a lot of local novelty shops and restaurants. We didn’t eat hear so can’t speak to any of the food here. I felt the parking here was pretty spendy. $8 an hour with no ticket validation. With a validation it’s $5 for the three hours on weekdays and then $3 every 30 minutes after that. Weekends are $5 for the first two hours and then $3 for every 30 minutes after that. No maximum for the day!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Walking. Great Shopping.", "This was one of the first places we stopped at during our visit to San Diego. There is a great boardwalk in front of Seaport Village which eventually links you to the Midway exhibit and is worth taking. There are tons of great shops and restaurants located here. The grounds (and plantings) are beautiful and photo worthy in their own right. There are also quick food places to get an ice cream or drink. Something there for everyone.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Enjoyed the shops and walk!", "Nice place to walk around and look in the shops. Some of them have unique finds, and others are more standard tourist shops. There was live music playing as we walked around through the shops. We had dinner at a restaurant in Seaport Village, and the food and atmosphere were great.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Loved", "This place is a dream! You should go at 4 pm to enjoy the small stores the carrousel the ice cream. Shopping little thing you never will forget! The ocean views are incredible! The small restaurant with candles and lower lighting is so romantic! not cheep but nice!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice place to stroll", "The Seaport Village is walking distance from the convention center and many hotels in San Diego. It a great place to visit for a leisure walk, plan a few hours. It has many boutiques, restaurants and a bonus is that it is along the waters edge. There is also a marina nearby to dream of the boat in your future.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Love this area", "Love Seaport Village. It is a shame that it will become the victim high rise builders. Seaport Village is a nice go-to place to just chill but it is being lost to builders! What a shame that there is no respect for the character of the downtown area!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A way to pass the afternoon", "What a great place to kill time. Small eateries, great shops (visit Sinfulicious for the most amazing skincare), and wonderful employees. Parking can get a little pricey, but a purchase of a fairly reasonable amount includes validation - cuts the parking price in half."], ["Reviewed 3 weeks ago", 3.0, "Typical tourist trap", "We've been to San Diego quite often but have never been to Seaport Village. So we thought we would check it out. We went on a Sunday hoping not to have to pay for parking. Wrong. They charge for parking at the village. Park on streets in the area and walk. There was a lot of tshirt shops and touristy place to go but not much to see. They had a nice park there and plenty of restuarants. We didn't spend a lot of time there to say the least. If you've never been. Check it out. Not my first place to go though. There a plenty of more fun stuff to do in SD.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Like Downtown Disney", "Loved the prefabricated, engineering-designed, old school village feel if this place. Right on the bay, and prices weren’t bad. Lots of cute shops really do feel like an “old time” seaside village."], ["Reviewed 4 weeks ago", 4.0, "Nice place to visit", "If you into shopping this is a nice place to go. They also have nice cafes and restaurants right off the bay view. Parking is not free however you can get a metered parking at a decent price. I walked from the parking lot at the Midway Museum so I didn't have to pay for parking twice. It about a ten minute walk.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Lots to see hear", "Lots of shops and sites to see here. Take your time and walk the boardwalk. A lot of the shops are over priced but I still enjoyed looking inside of them."], ["Reviewed 4 weeks ago", 5.0, "Great Little Shopping Area", "Every time we are in San Diego, we make a point of visiting Seaport Village. There are a number of store that are quite unique, lots of unusual gift ideas. There are many good eating places in the area, and a really nice park & waterfront too. Recommend this area for a nice relaxing evening.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Closes too early. Ghost town.", "Was a ghost town in the evening we were there. Closes down way too early. The headquarters complex next door is newer and better."], ["Reviewed 4 weeks ago", 3.0, "Nice attraction, very touristy!", "Nice area around the Harbor in San Diego. Lots of shopping, restaurants, live music. Very touristy and crowded, though. Worth a look see.."], ["Reviewed 4 weeks ago", 3.0, "Nice to stop by", "A nice place that we passed by before heading to Balboa Park. However, this would not be a place that I would have chosen to add to my itinerary as there didn't seem to be much to do. Nicer views can be found in other piers too.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "It’s a yawn....", "Basic tourist shopping area. Nice walking, views, water, marina. Restaurants are probably the draw. Ok to stop by, but wouldn’t make it a destination."], ["Reviewed 4 weeks ago", 5.0, "Fun Shops and Restaurants", "We enjoyed two evenings at Seaport Village just wandering around looking in the various shops and eating at the restaurants. Very nice."], ["Reviewed 4 weeks ago", 4.0, "Close to everything downtown", "This place has a variety of shops from jewelry to toys. It is right on the water just down from the gaslamp area and also across from the bar where the movie Top Gun was filming using the piano inside. The many restaurants have really good seafood as well as desserts. Bring walking shoes\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great to bring your visitors to or if you’re visiting it’s a must see.", "Tourist attraction but definitely a must see. Little shops with lots of souvenirs. There is a Harley shop there for those who are bikers. Great view of Corando Island. Good food places here as well. Dogs are allowed. The Medway is there to tour if you’d like.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Lots of wonderful little unusual shops", "Different and yet similar to when I visited almost 30 years ago. Sad to hear that it will be torn down for yet more condos in a few years.\n\nLove to meander around - grabbing a snack, buying treats that can only be found here, watching the unusual performers and the view of the boats on the water.\n\nRestaurants in the area of obviously very pricey so we opted for snacks here and went elsewhere for dinner.\n\nBe sure to get your parking ticket validated or you will be hit with a big bill when you leave.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Wine tasting and so much more", "Loved wine tasting here, its just a short walk from most downtown hotels. extremely romantic atmospher"], ["Reviewed January 23, 2018", 4.0, "Great Stop While in San Diego for Shopping, Dining and Views", "We walked over to Seaport Village on our first afternoon in San Diego. We walked along the water (past the excursion ships, the USS Midway, etc.) to reach this spot. It's a great option when you first arrive in town.\n\nSeaport Village has shops, restaurants and views. We walked, popped into stores and just enjoyed arriving in San Diego. We ended up returning to the Harbor House restaurant here the next night. The views were amazing!\n\nWe were a large group of parents and kids, and this was a good spot to visit. I would recommend walking there from either the marina or the convention center. The walk is to the village is part of the experience.\nShow less"], ["Reviewed January 21, 2018", 1.0, "Great views and shopping.", "Seaport has wonderful shops and restaurants. Great place to walk and see beautiful boats in the marina."], ["Reviewed January 21, 2018", 4.0, "Great shopping", "This is such a charming little village! It always has been. Definitely a stop for the avid shopper. Great for pictures as well."], ["Reviewed January 21, 2018", 5.0, "Conference", "Great little area. Really touristy. Fun shops and restaurants. Get some ice cream and walk the boardwalk."], ["Reviewed January 21, 2018", 4.0, "Nice Area", "I have visited the village many times over the last several years. It is a very nice collection of shops, restaurants - both food court style and full service - and generally local flavor. Don’t think of national chains but nice local businesses. Wonderful area"], ["Reviewed January 21, 2018", 5.0, "A Great Place To Spend Time!", "This spot offers a wide variety of shops and restaurants - and is one of the stops on the Hop-on/Hop-Off bus! Lots of walking - wear sneakers or comfortable shoes!"], ["Reviewed January 21, 2018", 5.0, "Great atmosphere and interesting shops", "I came here back in 2001 and enjoyed it so i wanted to return and see if it was as enjoyable as it was then, and the answer is yes! The shops were very unique. One place i would recommend is the shop that has wind chimes. Inside they have these bell chimes that are made in India and pretty cool and cost as little as $3. A cool cheap souvenir! The cupcake place was delicious and the sock store was fun! There are restaurants here also and we ate at the Fish cafe and it was awesome and on the water.\nOk so you have to pay for parking but it gets reduced if you buy something at the shops so that is not terrible. Will be back!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful", "Loved this place! Right on the water with plenty of shops and dining places. Outdoor entertainment as well. Beautiful views of the water and skyline."], ["Reviewed January 20, 2018", 4.0, "Nice place", "Lot of shops to buy a souvenirs, lot of restaurants too\nIt’s nice to have a walk there but it’s not that big either so i can recommend to walk in the direction or the museum and have a picture with the big statue of the kissing couple.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Spend the day!", "This little nugget is so much fun you could easily spend an entire day there. It is full of great food and restaurant options. Has many interesting little shops and of course the infamous Midway."], ["Reviewed January 13, 2018", 5.0, "Fun shopping", "This is always one of my favorite places to go even if I never buy anything. Quaint shopping area right on the Bayfront."], ["Reviewed January 13, 2018", 3.0, "Quick place to visit", "Typical seaport shopping center. Several decent restaurants for lunch our dinner. You can tour the stops in about an hour or so and sour down to s nice lunch overlooking the bay. I can recommend the harbor house four a nice lunch."], ["Reviewed January 12, 2018", 5.0, "On the trolley", "This was one of the stops on the trolley tour. Enjoyed the shops and restaurants. Everyone was very nice."], ["Reviewed January 11, 2018", 3.0, "Touristy", "Too many other nice places to go. This just seemed a little too touristy for me. Overpriced. Food was only okay. So many better restaurants"], ["Reviewed January 10, 2018", 4.0, "Evaluation depends on your needs", "This is an architecturally attractive mall area that has lots of creature comforts for sale. If you need more clothes and shoes and have a desire for franchise type food, you will enjoy this experience. But it is not much different from similar malls except that it is located on beautiful San Diego Bay.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Super cute with places to eat and shop.", "Super cute place to shop, WALK AROUND, have something to eat. Very enjoyable place to see the water and boats."], ["Reviewed January 8, 2018", 4.0, "Fun for walking around", "This is a beautiful little village by the sea in San Diego. Close enough to the airport that you could add an extra hour before and enjoy a beautiful day. Mostly tourist shops but a couple of really nice shops on the entrance by the main street entrance.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Typical Tourist Zone", "I have been to San Diego numerous times over the years. I have visited Seaport Village exactly twice. Once in the Summer of 2005, and briefly Jan 2018.\n\nMy impression is this collection of shops/Restaurants is designed to attract the various visitors that arrive via the nearby cruise ship terminal (or the nearby Convention Center).\n\nThere is a nice mix of food/drinks/shops/activities available. All seem a bit pricey to me. I think that for a cruise liner visitor (or newbie to SD), this area offers a one stop shop. You can catch a bicycle taxi, rent a bike, find a cool souvenir, grab a beer/snack (with a view), or just stroll about.\n\nIf you are familiar with Pier 39 in San Francisco, then I can say this is San Diego’s version of it. It does not have near the options/intensity of the San Francisco venue, but worth a stroll nevertheless (for a people watcher like myself).\n\nI cannot specifically review any of the shops/restaurants on the site (since I only walked through it.\n\nIf you are walking along the waterfront area, consider Seaport Village.\n\nShow less"], ["Reviewed January 6, 2018", 5.0, "Pleasant afternoon", "Even though it's a tourist trap we enjoyed our time here very much. Lots of good dining and places to sit and enjoy the views. Good prices on souvenirs also."], ["Reviewed January 6, 2018", 4.0, "Great Place to Walk and Enjoy", "Staying nearby, Seaport Village was fun to walk and explore, people watch, enjoy the sun, watch the water, and trinket shop if you wish. The area was not overly busy and and it was very relaxing."], ["Reviewed January 6, 2018", 3.0, "Quick stop", "Nice enough little spot. If you aren't having dinner you really don't need much time. Shops are nice bit pretty typical tourist shops. Views are nice. Stop for various tours."], ["Reviewed January 5, 2018", 5.0, "Another Happy Place", "Seaport Village is one of my happy places.\n\nSurrounded by the marina, coloured by palm trees and beautiful flowers, this little trendy village has very picturesque little stores.\n\nIn the center of the village you will find coffee shops/a couple of really nice restaurants, and you are right on the boardwalk. Going for a stroll on a sunny day, a little corner of paradise on this planet.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Fun place to shop and eat", "This place was recommended to me 5 years ago when I went out to San Diego for a convention and I enjoyed it so much I looked it up again this time and took 2 friends with me. Love the waterfront restaurants and the quaint little shops. I could spend hours here!\nShow less"], ["Reviewed January 4, 2018", 4.0, "Nice walk along the front", "Lots of shops, restaurants, entertainers here, takes you along to the Embarcadero and USS Midway. Nice family feel"], ["Reviewed January 3, 2018", 4.0, "Super Cute!", "Cute stores and a variety of non chain places that are very fun to browse. Perfect location on the water!"], ["Reviewed January 3, 2018", 3.0, "It's an outdoor shopping area......", "This is an outdoor shopping area that is on the harbor. There are a lot of specialty/gift shops here as well as a few eaterie/snack places. There is a gazebo area where they sometimes have outdoor entertainers (musicians) it seems mostly on the weekends. This was less then a 5 minute walk from the Manchester Grand Hyatt where we stayed so we took a jaunt through. Not a must do but worth checking out if you are in the area.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Very Nice Area", "Seaport Village is in a beautiful area. The shops are a little pricey but it is San Diego. Great place to sit and have lunch and just enjoy the weather."], ["Reviewed January 3, 2018", 4.0, "Cute shops", "We wandered down to Seaport from our hotel sort of by accident. It’s very cute with a range of shops and a few restaurants. Open til about 9pm so a nice way to spend an hour or two."], ["Reviewed January 3, 2018", 5.0, "Beautiful", "Beautiful place to visit walk around, sit and watch the water, or anything you'd like. Plenty of dining and shopping options. Watch the boats and seals in the water."], ["Reviewed January 3, 2018", 5.0, "Nice long walks", "This area you can have a nice long walk by. There is some museums, hotels, and restaurants to enjoy as well."], ["Reviewed January 3, 2018", 4.0, "something to do espescially with kids", "Its a great family place, priced OK and lots of unique stuff to by. Great rest rooms and a great location. They should put benches or expand umbreela tables along the water. There is a stream of traffic between the busineses and the water. A go to place for out of towners on a limited budget. Close to other attractions as well..\nShow less"], ["Reviewed December 31, 2017", 5.0, "Major changes coming", "Get there soon as major construction change is coming. Right now it’s warm and cozy with great food and shops."], ["Reviewed December 31, 2017", 4.0, "A great place to walk around", "I always visit Seaport Village when I go to San Diego. Love to just walk around it on a lovely day. Shopping is good too but I go mainly for the atmosphere."], ["Reviewed December 30, 2017", 4.0, "Great Place to Take a Stroll", "Seems like parking is always an issue, but on an off day we had no trouble. Filled with lots of shops & an easy stroll to the USS Midway."], ["Reviewed December 30, 2017", 3.0, "DOWN BY THE SEA", "Visited the Seaport Village and spent a couple of hours walking around and stopping by various shops. While a pleasant day to tour the village, it was overwhelmed by tourists and the typical type of places that would attract them. It is a reasonable place to spend a couple of hours, but cant see spending more time than that.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Very cool in December", "We could.e to Seaport Village every time we come to San Diego. Christmas time was really cool and they have ice skating over by the convention center. A must do if your in the area. It also benefits the USO"], ["Reviewed December 30, 2017", 4.0, "Shoppers paradise", "There are plenty of shops in this quaint little village. Located just a few blocks from the USS Midway with views of San Diego bay, fine dining and more."], ["Reviewed December 29, 2017", 3.0, "Ok shops, nice food", "The shops here are ok - nothing spectacular but they’re ok. The food is good though. We ate at a restaurant, had cupcakes and ice cream. Everything you could want in food really."], ["Reviewed December 29, 2017", 4.0, "Nice views", "Seaport Village has a lot of Little Stores and restaurants. It has a great View of the harbor. There is a grass area where you can sit and picnic or fly kites."], ["Reviewed December 28, 2017", 5.0, "Wonderful", "It's a wonderful place to visit. We enjoyed the shops, specifically Mugger. Not the mention the broadwalk and the views. There are lots of food options as well. We had the deep dish pizza and we loved it.\nThe place had a wonderful vibe and if I had a chance, I would visit again\nShow less"], ["Reviewed December 28, 2017", 5.0, "Beautiful", "Always lovely to take a walk through seaport village. Full of shops and beautiful scenery. I can never get bored of it."], ["Reviewed December 28, 2017", 5.0, "We walked here everyday!", "Quaint and beautiful. Fun to have a beer and watch the sun go down. Lots of homeless people around but very friendly folks too."], ["Reviewed December 27, 2017", 5.0, "Shop 'Til You Drop", "Seaport Village is an outdoor shopping complex with 54 one of a kind shops, 13 casual dining eateries, 4 fine dining waterfront restaurants. It is located in close proximity to local hotels. It is located in downtown San Diego on West Harbor Drive and Pacific Highway. Parking is available but can be on the expensive side. Be sure to have your parking ticket validated while doing your purchases.\nShow less"], ["Reviewed December 26, 2017", 3.0, "Interesting shops", "Parking is $5 if you spend at least $10 at one of the stores. The sign on the parking lot explains this; otherwise it is several dollars per hour. We arrived late afternoon, but it was fun to go into all the different stores. There seemed to be more sales in December due to the slow season.\nShow less"], ["Reviewed December 26, 2017", 4.0, "sunset", "We were here to enjoy the sunset before we realized that there was a chopping complex as well in the area. Some products are very interesting and authentic like hand weaved from Latin America, and some wooden craft. However, you have to prepare for more mid to high range of price.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Christmas Parade on the Bay", "We visited Seaport Village on the evening of the annual lighted boat parade on the bay. There were probably a few thousand people in the area. We walked around for a couple of hours before dark. There are a number of shops and restaurants in the area. We wandered in and out of several shops featuring a variety of clothing, art and souvenir items.\nShow less"], ["Reviewed December 25, 2017", 4.0, "Fun and Touristy", "This is a great open-air mall to take a good morning walk. The shops are cutesy and kitschy and cater to the tourists. The shop keepers are pleasant and the location against the water front makes for a very relaxing area.\n\nWe used it mostly to get out and stretch our legs. The prices are high, understandably so, given the location next to all the hotels.\n\nBring a camera and some good walking shoes and enjoy yourself. If you're in the hotels along Pacific Highway, I'd recommend walking over vs driving. There is a charge to park and it fills up pretty quickly. Unfortunately, it is one of those places that I'd avoid simply due to the parking charge. It is fun but it's not that fun. Our hotel was across the street which mitigated the parking.\nShow less"], ["Reviewed December 24, 2017", 4.0, "Beautiful", "Nice shopping, but mid to high end prices. Food places are good but more places in downtown that are better"], ["Reviewed December 22, 2017", 4.0, "Pretty village", "We had a fun night walking around Seaport Village, but in general, there were not that many stores that we were actually interested in. But very cute in a beautiful setting."], ["Reviewed December 22, 2017", 4.0, "Best to get there when it opens.", "The parking lot gets pretty full if you don't get there when it opens. Parking price has gone up. Love the cute little shops. We found a new area to see things. They had an area on a pier where they sold fresh fish. BIG fish too. About 3-5 ft. long. Many different kinds you normally don't find in stores.\nShow less"], ["Reviewed December 22, 2017", 3.0, "Tourist Area", "Shops were nice but definitely made for tourists. Area was well kept and s mix of stores and restaurants."], ["Reviewed December 22, 2017", 4.0, "Nice shopping and eating", "Stayed in SAN after a cruise and wondered around this area for the day shopping, having lunch and drinks."], ["Reviewed December 21, 2017", 5.0, "Shop til you drop", "Such a cute shopping area. Walking around and going to all the shops is a must. Plenty of food and coffee stops...and lots of goodies for your sweet tooth. Friendly people. Clean area. Lots of variety."], ["Reviewed December 19, 2017", 3.0, "Great Collection of Shops", "We visited Seaport Village during our visit to San Diego in November. We found a great collection of shops and snack places and several nice restaurants. Seaport Village was decorated for the holidays and quite festive. It was worth the time to walk and explore."], ["Reviewed December 19, 2017", 1.0, "sbarro pizza", "have been going to the pizza place in seaport village for over 20 yrs. but never again!!! ordered a pizza with the works,was told it would be 20-25 min. waited over 30 min. then went inside to check and was told it would be done soon.waited another15 min and asked again and was told it would be done soon.finally they put the wrong pizza on the counter and I told them that wasn't what I ordered and got into an argument with the person that took the order that I ordered what they made . they didn't care at all that I didn't order what they gave me,and pretty much called me a liar. I or anyone I know will ever go there again I hope this place finally gets some help with some class.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Love It!!!!", "I love this place, it is a must everytime we go down to San Diego, so much to see and do. Variety of food and beverages for all!"], ["Reviewed December 18, 2017", 4.0, "Vacation get away", "A nice walk to shops and restaurants. A good place to go to get away and get gifts for family and friends"], ["Reviewed December 18, 2017", 4.0, "Fun shopping", "Cute shopping area with clothing and collectibles. Lots of fun to walk around. I'd recommendation a trip there."], ["Reviewed December 16, 2017", 3.0, "Average", "It's pretty and it is a nice walk, but I can't say there's anything out of the ordinary about it. That said, it is free."], ["Reviewed December 15, 2017", 4.0, "Nice village on the seafront", "Just out of the back door of the hotel we found the village with a variety of shops and restaurants (had breakfast in the Village Cafe substantially cheaper than the hotel). Nice walk along the seafront."], ["Reviewed December 14, 2017", 4.0, "Lunch and a stroll", "We walk there after the harbour cruise. A pleasant and interesting walk along the beach on a nice day. There are many restaurants to choose from and a few shops to spend some money."], ["Reviewed December 11, 2017", 4.0, "Fun touristy spot", "Lots of restaurants and T-shirt shops. Beautiful, clean landscaping. Other types of foods and shops here also. Popular destination on the coastline."], ["Reviewed December 10, 2017", 4.0, "Typical tourist shops", "We visited San Diego with our 15 and 11 year old boys. Our hotel was adjacent to Seaport Village. Seaport has the docks for boaters staying at the Marriott Hotel, and the dock area is beautiful. Seaport itself is what I would consider a typical tourist area, various shops and restaurants. It is located on a nice walkway along the bay. There are T-shirt shops, toy store, clothes, etc. some of the bars and restaurants have nice bay views, and of course seafood. It is worth a walk through on a nice day, but I can’t honestly say there is much difference from all of the similar areas we have been to. If you are nearby then go, but I wouldn’t go out of my way.\nShow less"], ["Reviewed December 9, 2017", 4.0, "Wonderful walk", "We walked through the village enjoying the shops. A great place to take kids and appreciate the views. There are clothes shops, food and various specialty stores. The harbor views are worth the walk. Great view of USS Midway close by."], ["Reviewed December 9, 2017", 4.0, "Lots to see...", "Had walked for several miles and wanted a place to rest up, eat some delicious baja fish tacos, and a beer which we found. Went and did some shopping and bought a few items to take back home. Nice views of the harbor and a short walk to the Midway and other attractions.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Cute place to watch people and the water and eat.", "This place is a nice shopping/eating village right on the water. It is really cute with some amazing shops. The food here is excellent too with many choices. There is a merry-go-round and water filled ponds and ducks etc. The shops have things you would never find anywhere else. If you are looking for wonderful ornaments there is the most amazing shop here with some gorgeous Christmas ornaments. It's also a great place to bring lunch and picnic.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Very nice place for tourists and good food", "My husband especially liked the Greek restaurant there. The egg lemon soup was the Best I’ve ever had !"], ["Reviewed December 5, 2017", 5.0, "Everything is at Seaport Village Restaurants.Candy stores and book store without too many books", "This is a great place to walk all the water way and see all the yachts, have a meal buy a book , get some kites, take a pedi cab buy a ice cream cone or jump on a duck tour or a old town trolley tour and learn the history of the area..and all about the rabbits!\nShow less"], ["Reviewed December 5, 2017", 4.0, "Cute and Relaxing", "Shops and restaurants along the coast. Perfect for a relaxing walk along the water with stops for food and shopping. Great place to see buskers."], ["Reviewed December 3, 2017", 3.0, "Losing some of its charm", "I have visited this place since the 1990's and it's quaint charm has always appealed, however on my last visit it seems to have lost some of its lustre. It's by no means the cheapest place to eat or to shop in San Diego but this time I saw more homeless on its periphery than ever before. It's clean and the restrooms are also spotless but somehow it just doesn't feel the same as it once did. Go there if you have a budget to blow or else simply pass through on route to the other great waterfront attractions such as the USS Midway. The one aspect I do like about this area is the ability to walk rather than needing access to a car to get around.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Very Touristy but Great for those Last Minute Gifts", "Lots of small gift shops in a confined area alongside the wharf in downtown. The Christmas Shop is well worth a second look as was the Coffee and Bookshop where we rested our bones, had an enjoyable coffee while reading a good book or two."], ["Reviewed December 3, 2017", 5.0, "My Mom’s surprise birthday party", "We went to dinner and drinks great drinks. Lots of shops close to the ocean. I don’t know why I don’t move here it’s beautiful ❤️"], ["Reviewed December 2, 2017", 4.0, "Nice place to visit especially in run up to xmas", "Seaport Village as I have said previously was designed by the Walt Disney People and it does show.\n\nIt’s an attractive place with a slightly confusing lay out with a mix of souvenir and specialist shops, bars and restaurants, including fab fudge and cookies.\n\nThere is a good choice of restaurants, some reasonable, some a little expensive, but we would recommend the Pier Cafe.\n\nIt is also where you pick up the old town trolley tours, the SEAL tours and the City Lights tour.\n\nIt’s a great place to watch the sunset from and to people watch....and is situated next door to the Hyatt Hotel.\n\nYour can also pick up pedicabs from the edge of seaport Village.\n\nAlso the boardwalk bans cyclists so no risk of being mown over,\n\nWell worth a visit, particularly at this time of year when the holiday lights are on.\nShow less"], ["Reviewed December 1, 2017", 5.0, "Fun area", "I love Seaport Village. Lots of gift shops and restaurants and a historic carousel to ride. Easy walking and fun environment right on the San Diego Harbor and across from downtown. Just a short walk from the Hyatt, Marriott, and Convention Center too!"], ["Reviewed November 30, 2017", 5.0, "Great Shops!", "A beautiful place to visit & walk about. Wonderful shops to visit & shop right on the bay. Great places to eat at too."], ["Reviewed November 29, 2017", 4.0, "Nice Walk", "Very nice Walk with many dinning options ; you can park your car very easily in one of the many parking garages near by but it's going to cost you a pretty penny.\n\nGood option for families or large groups because it's free and the weather is never too cold to enjoy a stroll\nShow less"], ["Reviewed November 29, 2017", 4.0, "Small craft and specialised shops", "Easy to get to by public transport but as is usual with these type of places you can buy the same items for less elsewhere"], ["Reviewed November 28, 2017", 4.0, "Seaport Villagr", "In town for a conference so we went over to Seaport Village and walked around the shops. This is a very nice shopping village with some restaurants as well. We had been there before and enjoyed the walk through there. Getting Christmas decorations up so it is very pretty at night.\nShow less"], ["Reviewed November 27, 2017", 3.0, "Shops along the waterfront", "Many shops along the water made for a lovely afternoon of browsing stores. Lots of souvenir shops as well as places to eat seaside. We also stopped by the San Diego prison which once housed there. Interesting lists of crimes with mug shots reminded me of something you’d see in Mayberry on the Andy Griffith show.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Beautiful San Diego Bay", "The Marina view is incredible and the boardwalk is easy to get to. Excellent walk, shop and eat. I would recommend to anyone on business or family."], ["Reviewed November 26, 2017", 3.0, "Small shops and a carousel near the water", "There are a few interesting shops to visit but mostly there are a lot of tourist shops, selling things like T-shirts and souvenirs. However, there is an old carousel from 1895 that is worth seeing. The place is mostly a nice area to walk around near the water. There are some restaurants if you get hungry.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Great place to Relax", "Great place to shop and sit and relax. Watching the ducks and crane in the pond. All kinds of shops our favorite was the kite shop. Lots of different resaurants and sitting in the common area with a live performance of Jazz music was great."], ["Reviewed November 25, 2017", 4.0, "Save the Seaport!", "Seaport Village is a very unique San Diego shopping icon, right on the bay. Several harbor- view Restauarants,an outdoor food court with live music and an old fashioned complete the atmosphere. Sadly, shops are leaving due to high rent and short leases. Due to the proposal to tear the place down, replace with high rise condos and a high-end mall. The current shops are local and unique, just cannot be replaced. Find the web site and vote \"NO\"!\nShow less"], ["Reviewed November 24, 2017", 4.0, "Beautiful shopping and eating along the water", "This is the lovely little place next to downtown San Diego. It has a spacious walkway right along the water. A beautiful way to spend the day. Also many restaurants and other places to snack. Plus shops."], ["Reviewed November 24, 2017", 3.0, "Just a bunch of touristy shops", "The location is very nice, on the water, but I wasn't very impressed with the shops. I had hoped to find some unique gift items, but...........mostly your typical Tshirt and touristy shops."], ["Reviewed November 22, 2017", 4.0, "Beautiful waterfront Area", "I have visited Seaport Village many times and have always had a great time. Even as a Native San Diegan, I have always enjoyed walking here just to enjoy San Diego,s Bay area. It's a great area even though it's one of the areas busiest tourist attraction. I rarely go into the shops now and just like to walk along the waterfront towards the Midway Museum and enjoy the nice scenery.\n\nMy favorite times to come here though is when they have special events such as the Parade of lights in December, Fourth of July, and the Buskers Festival. I have enjoyed most of the restaurants here and had great food. I will admit though some of the restaurants are quite pricey.\n\nNow as for parking, that can be a challenge on the weekends and as when they have special events. You also have to remember that San Diego is a tourist town and It can get busy here during the summer as well. There are two main parking lots which fills up quickly so come early. There is a charge for parking and can be quite expensive unless you have your ticket validated. The parking information is actually on thier website. I will admit I too have gotten a little tired of driving around and decide to just leave.\n\nI have had some great food here at the restaurants but I tend to eat most at the Harbor house and Pier Cafe. I have always had a great experience at both of the restaurants. We use to actually book the outside deck area of the Harbor House and watch the fireworks above the crowd. So if you are here on the Fourth of July, I would definitely try to book that. The Pier Cafe is great because it stretches out onto the Bay.\n\nAs I stated before my favorite time to come here are during special events. My favorite though is the Buskers Festival. I love watching all the street performers such as the fire eaters, jugglers, and others.\n\nOverall this is a great place to walk around and enjoy the scenery, shopping, and restaurants. but my best experience is just to seat back and relax and enjoy the waterfront. On a side note The face of Seaport Village maybe changing soon according to some news articles. Seaport Village is a fun place that has many things to offer. I will also admit that Seaport Village is great and has lots to offer but it's not my number one go to place in San Diego but it still a fun place to visit.\n\nNow being a native San Diegan you would think I would give Seaport Village a five Star rating but my rating is due to some factors such as parking and pricing, The parking can be difficult here and some of the menu prices at some of the restaurants, mostly the smaller ones are a little expensive. Of course what tourist place doesnt have high prices at thier stores and restaurant.\nShow less"], ["Reviewed November 22, 2017", 5.0, "Reasonable parking", "We went to this area to do the Seal duck tour (thumbs up). If you park there and shop there, they validate and discount your ticket. Nice area to wander around. Restraunts, shopping, carousel, the Midway."], ["Reviewed November 22, 2017", 5.0, "Lovely place", "Several small houses with Shops in them right at th Harbour. Also several Restaurants to relax and have a good meal. Wonderful promenade along the seaside. It is just a minute away from the Convention Center."], ["Reviewed November 21, 2017", 5.0, "A really Nice Walking and Shopping Area", "Seaport Village has been in downtown San Diego since the early 1980's. It is near the Convention Center. It is a truly friendly and beautiful place to walk you or your dog, jog or shop and dine, near the waters of San Diego. You can see fancy yachts parked there, take advantage of benches in the sunlight, visit the Native American jewelry store, the soap shop and of course, the Tile Shop. A variety of walk-up window eateries or fine dining establishments, parking is off to the side, so you can safely walk between the shops. There is a rumor that it will be closed in the next year and the land sold off. So, visit while you can!\nShow less"], ["Reviewed November 20, 2017", 5.0, "Lots to see, hang out", "From Embarcadero Park to the shops, lots to see and do and just hang out. We ate at KC BBQ just on the other side, where Top Gun was filmed - GREAT food. Easy walk from where we stayed at the Pulse on 8th and A.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Awsome płace to visit with family, lots of small shops. Kites flying płace, you can bring your kite or buy up there.", "If you have some time this is recommended płace to visit and do your Specialty gifts shopping up there. Super płace for small kids, lot of fun. Good places with food."], ["Reviewed November 19, 2017", 5.0, "Waterfront strolls, dining, & family fun", "A defining piece of San Diego, there is truly something for everyone here whether it's couples or families with young children. Lovely waterfront seafood restaurants, cute shops, and of course the Carousel!\n\nStroll along the Embarcadero south along the marina and you'll see all sorts of boats passing by and under the Coronado Bridge. A short 10-15 minute walk north leads to the USS Midway, Navy Pier, & Waterfront Park. Great place to spend a day or evening.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Shopping variety", "We used even have our store there called Worldview Gifts - long gone. There are great variety of stores and some food stores and lots of restaurants sit down and some just food stands. Next to the water. Parking is free if you buy something. But, there is a store for everyone \"collection and a couple of nice art galleries. Compact area. There is commercial boat basin not far and next to that is the \"Fish Market\" my favorite place to eat. Get a place on the veranda. Watch the sailboats and sunset. Next to the Aircraft Carrier Museum \"Midway.\" At Seaport there is SPicy Hot Sauce store, Flag store, Travel Store, A coffee mug store, a wildlife store, a San Diego store. As I said a great variety. and it's right on the water.\n\nI hear they might be tearing down soon.. But they've been saying that for years!!!!!.\n\nEnjoy\nP\nShow less"], ["Reviewed November 18, 2017", 5.0, "Lots of Choices", "I love this place. There are so many things to do. Between the large number of restaurants and shops, there is something for everyone here. The location is great too. Sitting right by the water, Seaport Village is a wonderful place to visit."], ["Reviewed November 17, 2017", 5.0, "Great place to stroll after dinner", "We needed a place to walk off dinner and this is the perfect spot. Lots of cute shops . I especially loved the Turquoise store. The largest selection of turquoise in southern California."], ["Reviewed November 16, 2017", 4.0, "Ride the carousel!", "The Seaport Village is a lovely little place on the water. Little quaint shops selling all sorts of souvenirs are dotted amongst foodie places. There is even a working carousel which is a must, just for the sheer fun of the fair feeling."], ["Reviewed November 14, 2017", 3.0, "Could be so much more", "This is a great location, but is very tired looking. Needs an update and better eateries. Has an ample parking lot. Right on the water"], ["Reviewed November 14, 2017", 5.0, "Seaport village", "Love the seaport village. Lots of shops restaurant by the water. There are so many little shops with lots of souvenirs and unique thing to buy. The restaurant are so nice and so clean and friendly"], ["Reviewed November 13, 2017", 3.0, "Nice place to stop and browse through the stores or have a meal.", "Taking a walk along the waters edge is fun for all. Wide walkway to accomodate pedicabs, walkers, strollers or bikes....A few fancier restaurants and some laid back dining available. Shops suited to tourists. Best treat this trip was the fishing boats unloading their catch of the day early Saturday morning nearby. Fun to see them unloading, fileting and selling quickly! Great fish tacos being prepared dockside!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Such a great harbor!", "We went there yesterday after a short visit in old town San Diego. The time was just right for us to view the sunset, and the view was so wonderful. The weather was nice, and the water was not smelly. They have plenty choices of restaurants where you can sit or drink with this breathtaking scene. I will defiantly go there again and again with my family or spend time walking with my love one along the harbor side.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Lovely views", "There is a nice combination of things to see and do here. The shops are mostly tourist places. But there are some bars and upscale restaurants. There is also the marina with plenty of boats to look at. Validated parking is available."], ["Reviewed November 11, 2017", 4.0, "Beautiful Walk to Seaport Village", "This review is from Sept/16. This was a beautiful walk from our hotel along the water to the Seaport Village. Once at the Village there are many quaint shops to explore. From there you can keep walking along the water for a good long while."], ["Reviewed November 10, 2017", 5.0, "Seaport Village", "This is a very nice place and its like a quaint little village by the water with a lot of shopping stalls. There are also several restaurants and coffee shops to quench your thirst on a hot summer day. This is also near the Convention Center.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Waterfront precinct", "Seaport Village which we visited whilst in San Diego is a waterfront shopping and dining complex with views of San Diego Bay and is located in the downtown area.\n\nThe village contains buildings in an assortment of styles, including Victorian to traditional Mexican.\n\nWe ate a snack from the San Diego Burger Place in the lovely outdoor area with tables and chairs.\n\nthere is a waterfront walking path with lovely views over to the bay and the Coronado Bridge.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Place to spend the day", "This place offers so many beautiful settings. Great food, outdoor sitting excellent for small children.. place to spend a day with family and friends.. parking is expensive inside Seaport village. Avoid going on weekends during the summer months ( overcrowded)"], ["Reviewed November 8, 2017", 4.0, "A Must See While in San Diego by the Bay", "Many unique stores will greet you as you enter the shopping area. A food court and other restaurants are in the area. You can also stroll along the water and take in the beautiful scenery. Close to the convention center, the new stadium and the high-end hotels near the harbor. I highly recommend this attraction.\nShow less"], ["Reviewed November 8, 2017", 2.0, "Four stars but for parking.", "Lots of great things to do. on the water front and in the plazas. On the third Friday of the month, 'the Office' court yard, bay end of Pacific Ave. has a salsa dance night, with great music from Manny Cepeda Orchestra. Free dancing in the plaza till 9PM.\n\nUnfortunately this area has the worst parking of any place in town. Walk, take the trolley and its great.\nShow less"], ["Reviewed November 8, 2017", 3.0, "A lovely little tourist trap", "Clearly designed for tourists, nevertheless an excellent place to shop for presents for the kids back home. Very peaceful and a short stroll along the water to the USS Midway."], ["Reviewed November 8, 2017", 5.0, "A great place for an afternoon stroll...", "Whenever I have people come in from out of town, Seaport Village is a must! It is in a great location. It is walking distance to the convention center, the Midway and it has a beautiful view of downtown SD as well as Coronado. They opened up a new section that used to be a police station that is pretty cool. They left part of a jail cell so you can visit inside. My three year old loved going there and checking it out. Aside from that, it has some great places to eat and a lot of trinket shops for people who enjoy that. The Upstart Crow has delicious coffee and some good reads. The carousel is another fun little feature present there and it is located right by the Ben and Jerry's (yum). Honestly, it is just a fun place to spend the afternoon whether you are going on a date, with friends, or as a family.\nShow less"], ["Reviewed November 8, 2017", 2.0, "Getting Run Down and Loosing Shops", "I have been going to San Diego since 1976 and have visited Sea Port Village many time but I was very disappointed with it this time. There has been a lot of store leave and the whole village is in need of a face lift. If Sea Port village is to survive it is going to have to spend some money to update and attach customers back.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Great place for shopping and lunch", "While in San Diego stop here for your last minute suveniers or a great lunch before or after visiting the USS Midway."], ["Reviewed November 7, 2017", 3.0, "Fairky Standard Tourist Village", "It has the usual small shops selling tourist things and souvenires and a few small food stores in a pleasant village type atmosphere.It is pleasant enough but not that special."], ["Reviewed November 7, 2017", 3.0, "Lots of the same.", "First impression was good but you realize that it is more and more of the same thing. Restaurants and gift shops. A nice place to grab a lunch on the water tho."], ["Reviewed November 6, 2017", 5.0, "a trip to San Diego is not complete without stopping here", "Whenever we travel to San Diego, we always stop at Seaport Village. It is unlike many of other shopping experiences you will find. The sorry commentary is that this location is scheduled to be shut down within the next two years to construct a mall. What a shame! Just what the world needs is another mall. Seaport Village offers a truly unique shopping experience with beautiful walkways along the harbor. There are several nice restaurants to choose from with one-of-a-kind shops that offer a truly unique shopping experience. Shame on the San Diego city fathers for allowing this gem to soon disappear into the vast wasteland of of seen-one-you've-seen-them-all malls!\nShow less"], ["Reviewed November 5, 2017", 4.0, "Plenty of shops and restaurants", "For those visiting San Diego this area would be a nice place to go to shop and get a bite to eat. The views of the harbor and the features such as the USS Midway or excellent."], ["Reviewed November 2, 2017", 2.0, "Tourist mall", "Mall of tourist and souvenir shops and some restaurants. The location at the harbor is the most attractive part of this place."], ["Reviewed October 31, 2017", 4.0, "Seaport Village", "Really nice place to just take it easy and wander around. Lots of little stores to check out and see. If you go around late November you may run into a Santa Claus on a surf board to take pictures with."], ["Reviewed October 30, 2017", 4.0, "Quaint, fun, inviting", "What a cool little place in a big city on the water! Small local shops, food, and desserts. We truly enjoyed walking around this tiny gem along the Harbor walking area."], ["Reviewed October 30, 2017", 4.0, "Nice...Relaxing", "If your staying down at the south end of The Gaslamp District, this is an ideal half day of walking along the harbor, watching hundreds of sailboats, going to one of a few good breakfast/ lunch spots looking out on the water and poking your way through some admittedly touristy shops.\n\nAnd yes of course there's a salt water taffy shop...dah.\n\nYou can walk along the marina to look at these big beautiful 85-120 ft yachts that you'll never be able to own...but you can dream.\n\nSpent a half day doing the above together with my sweetie and it was very calming and relaxing.\n\nNice\nShow less"], ["Reviewed October 30, 2017", 5.0, "great shopping,nice location", "did some shopping,Cheese Cake Factory also,Harley retail store,sword swallower act also,downtown surroundings."], ["Reviewed October 29, 2017", 3.0, "Nice walk around seaport village", "Lots of little interesting shops to wander through. Some very good restaurants. On a nice sunny day there is lots going on: people flying kites, people making bubbles for the kids, boats going in and out of the marina. Validated parking if you buy something."], ["Reviewed October 29, 2017", 4.0, "Nice quaint facility...", "A lovely setting right by the sea, the shops are really interesting and the facility is really well looked after."], ["Reviewed October 28, 2017", 4.0, "Nice place", "Some nice shops and restaurants which are convenient if you are staying at one of the many hotels nearby."], ["Reviewed October 27, 2017", 5.0, "Seaport Village", "Great place. Lots of shopping and walks around the bay. Many Navy vessels to see and learn about. You could board the MIDWAY this was decommissioned but there were many helicopters and planes still on the deck"], ["Reviewed October 26, 2017", 5.0, "Unique shopping experience", "I walked down to seaport by accident and was pleasantly surprise at the treasures I found. they had just the kind of gifts I was looking for. with a hat, magnet and mug shop with gifts that I hadn't seen anywhere else in San Diego. I have a lovely time here.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Charming", "A charming grouping of shops and food. Great Ice Cream and local artisan shops. Easy parking, a charming place to walk around. Water front location with random small fountain locations. Handicapped friendly, paved, wide paths through the village."], ["Reviewed October 24, 2017", 4.0, "Good way to kill time", "Lots to look at and shopping is varied. You can get any type of food and the atmosphere is charming."], ["Reviewed October 24, 2017", 4.0, "Lovely little craft village", "This was located outside of my hotel and full of craft shops and restaurants lots of live music and great to spend time wandering around looking for goodies"], ["Reviewed October 24, 2017", 5.0, "Wonderful", "Very charming with lots of shops and restaurants. Located right on the bay. Walk along casually or for exercise."], ["Reviewed October 24, 2017", 4.0, "Much to see.", "Great place for taking photos, shops, sunny weather and long walks. Not too crowded, even on the weekend."], ["Reviewed October 23, 2017", 3.0, "A quaint liittle sea village!", "Right in the middle of down town is a sea village with quaint little stores and restaurants. Sit back with a beer or cocktail and some tacos or burger to look over the harbor or enjoying shopping for souvenirs at the stores. Don't miss the over 100 years old carousel and just pay $3 to take a ride and enjoy the piece of history.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Botique shops well situated to the water", "When I am in town I always stop to see what the locals have in their shops. You can find a great assortment of items and when they are not too busy get some great local advice on where to expand your visit. Last time I was there I got great advice on where to go to see some smaller local wineries.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Nice little area", "Visited on business and took a stroll through the village. A lot of nice little restaurants and shops. Something for everyone, including children. We went on a Sunday and we observed some live music where people were up and dancing. Worth a trip."], ["Reviewed October 23, 2017", 4.0, "Nice place to walk around, but dated", "My wife and I were looking for something to do while enjoying the weather. We decided to visit the Seaport Village and check out the shops. The shops were your typical touristy shops. There were a few unique shops that we found some fun things. The shops are certainly dated and could use a remodel, but, overall we are glad we went and enjoyed the beautiful view of the water and great weather. The food shops were good as well.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Shopping, food, entertainment", "Seaport Village was the perfect little area for a tourist activity. There are several shops for buying souvenirs and San Diego items. There's a few different food choices which was nice. We ate at the Greek spot and it was very good, pricey but good. There was some instrument playing entertainment in the middle of the village which was really nice.\nShow less"], ["Reviewed October 22, 2017", 1.0, "San Diego", "Tourist trap, stay away. Overpriced stores, I felt as if I was in. Ghost town. Price for a single scoop of ice cream was $5.40. You can buy a pint for less than that. Went I went to leave, the cost of parking was 60% more since I didn’t buy anything. Stay away!\nShow less"], ["Reviewed October 20, 2017", 2.0, "Tourist Trap.", "Typical tourist trap, with maybe a touch of class given the location. The dining at the village does have awesome views though. I wandered through while walking the whole Embarcado and marina waterfront."], ["Reviewed October 20, 2017", 5.0, "Staff in shops were kind!", "We really enjoyed our visit due to staff being so kind to our children! Everyone was nice and we enjoyed our afternoon! Come check it out."], ["Reviewed October 19, 2017", 4.0, "Time killer", "Beautiful walking area with lots of quaint shops and food places. Parking is available very close and it’s a little cheaper about a block away."], ["Reviewed October 19, 2017", 4.0, "Quaint place to stroll and enjoy the atmosphere.", "Aside from the parking nightmare, my husband I thoroughly enjoyed strolling through Seaport Village. Although the food was priced a little more expensive we ate some of the best fish we have had. The shops were touristy, but I really enjoy that kind of thing and had a lot of fun. We went back a second day and had some Greek fare that was out of this world. I recommend visiting Seaport Village it is a fun way to spend an afternoon.\nShow less"]]}}