{"SeaWorld": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "SeaWorld", "url": "/Attraction_Review-g60750-d102793-Reviews-SeaWorld-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/fc/c2/8b/blue-horizons.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "8734"}, "address": {"@type": "PostalAddress", "streetAddress": "500 Sea World Dr", "addressLocality": "", "addressRegion": "California", "postalCode": "92109-7904", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Fun and Educational", "My boys are three and five and they love coming to Sea World. Their favorite part is seeing all of the different sea life. There is always someone nearby who can tell you all you want to know about that certain sea creature and my boys love learning about them. Especially my five year old. It's definitely a family fun environment with quite a bit of education thrown in the mix.\nShow less"], ["Reviewed yesterday", 5.0, "Beautiful grounds, fun shows", "Be sure to wear comfortable walking shoes!! There's a lot of ground to cover. Be sure and ride the tower to get a wonderful view of the park and surrounding area. Unbelievably large parking area! I loved watching the very large flock of flamingos \"performing\" their daily march. Lovely to watch! The dolphin show was quite entertaining and enjoyable. I was a little saddened by the killer whales - the pools just don't look large enough to give such a majestic creature the room they deserve and the bent dorsal fin on one whale is something I've NEVER seen in the wild (I live in Washington state and have watched them in Puget Sound) even though the park would have you believe it just \"happens\" to killer whales. I believe it's more likely related to them being in captivity and doesn't look very healthy.\nShow less"], ["Reviewed yesterday", 5.0, "Sizzling seaworld", "We bought our tickets from the undercover tourist web page. We paid 64.99 per person above 3 years which gave us 7 day entry. Best deal. We saw all the shows but I probably preferred Sea lions and the small animal shows the best. Food was poor so best to bring your own\nShow less"], ["Reviewed yesterday", 4.0, "I love seeing my Sea Lion friends", "Sea World has really been working to up their game on many levels. It's a great place to spend the day and learn about the animals and fish. Show are entertaining and informative, and there is plenty to do to spend a whole day there. My favorite thing is always seeing the sea lions and their show. Go on a weekend if you really want to do everything because they don't operate some rides and food locations during the weekdays. It was weird.\n\nMy only complaint is that there are NO awnings or coverings over the bleachers for ANY of the shows so you just roast in the sun for the 40-50 minutes you are there before and during the shows.\nShow less"], ["Reviewed 2 days ago", 5.0, "Aquarium and great shows", "They have very well maintained aquariums. The animal shows are highlight especially Shark Attack, Dolphin show etc. Will be usually very crowded during weekends. Reach the spot where they will have conducting these shows very much earlier than time to get some good seats with nice viewing\nShow less"], ["Reviewed 2 days ago", 5.0, "Dolphin interaction has been one of the most wonderful experience of my life", "I went to Seaworld with my family and got a chance to swim with a dolphin which was my absolute favourite in the park but we also loved the sealions&otter show, the orca show and the beluga whale. The rollercoasters were incredible. I would love to come back someday.\nShow less"], ["Reviewed 3 days ago", 5.0, "Love it- every time", "We go to Sea World several times a year, and we love it every time. The best part is seeing and learning about all the amazing animals. It is incredible to see dolphins, orcas, belugas, sea lions, and more up-close. The dedicated staff works hard to care for the animals. I was surprised to discover how many wild injured animals are rescued, rehabilitated, and released behind the scenes each year. I believe the work Sea World is doing is important and good. Yesterday, we enjoyed the wonderful Lunar New Year celebration. It truly is a fantastic event with professional acrobatics and local performers representing several Asian counties.\nShow less"], ["Reviewed 3 days ago", 4.0, "Family Fun at Sea World", "We had a great day with the whole family, ages 2 1/2 to 52. The only drawback was the wait time at some of the dining locations. Seemed like they didn't have enough staff to handle the demands of those wanting to eat. Not enough cashiers to check people out, which cause too long a wait throughout our day. Loved everything else we saw/did. It was a fun day!\nShow less"], ["Reviewed 3 days ago", 4.0, "SeaWorld is a great day adventure", "Went with my daughter and her two children to SeaWorld in February. No long lines for the food (love the Shipwreck Harbor dining) never had a problem getting into any of the shows. A wonderful experience for kids to be exposed to the wonders of the ocean and learn about all the creatures that live under the sea. SeaWorld is helping to educate and expose children to our oceans which hopefully it is a platform to begin teaching them to respect mother earth (maybe adults can learn too). I can't forget that they have added some really great rides for each height level. This might be the only place a kid is ever exposed to some of these mammals or interesting and odd fish and ride a roller coaster!\nShow less"], ["Reviewed 3 days ago", 5.0, "Go to the Shows/Presentations!", "I'm 25 and went to Seaworld with my 20yr old friend late February. We wore sweaters and arrived at 9:55 AM to start the day with a ride from Uber (actually less expensive to Uber than to park). By checking the schedule/map we were able to spend the day seeing every show and enjoy the rides. I HIGHLY recommend attending all the shows, they're extremely entertaining, fun and overall impressive. Made it worth the price of the ticket.\nBUY YOUR TICKET ONLINE! Even if you're at the gate, open your phone and buy it online on the SeaWorld website, you'll save $20/ticket.\nWe also decided to leave SeaWorld and eat at In-N-Out Burger, then (with a stamp they give at the entrance/exit) went back into SeaWorld to finish the day. Go for the whole day, see all the shows and I promise you'll have a great time!\nShow less"], ["Reviewed 3 days ago", 5.0, "Fun day with teens!", "My family spent the whole day here last Friday. We bought our tickets on line and got the \"Eat Free All Day Passes\" which require a stop at guest services for wrist bands. We arrived at 10am and stayed until after closing to 5:45pm. My whole family enjoyed every show and all the attractions. I have not been to SeaWorld for 18 years and it was wonderful. Clean, staff friendly. Not sure if I would do the Eat Free passes again because the food was not that great but it did end up saving us money. There are definitely restrictions on what you can order though so if you are thinking of buying these passes you might call the park ahead of time to understand what you are getting and what the restrictions are. I don't feel that it is clearly spelled out on their website.\nShow less"], ["Reviewed 4 days ago", 5.0, "A Wonderful place to enjoy with family", "SeaWorld is the top most attraction of San Diego and a great place to visit. We had a great family time. The important thing is plan your day, and keep a track of time for different shows and activities. All showz are must watch."], ["Reviewed 4 days ago", 5.0, "Fantastic time for new or repeat visitors!", "Sea World is a great place to visit whether you have been there many times or you are going there for the first time. They have added rides and experiences so you can have fun in any corner of the park. There are so many animal encounter opportunities that you will want to come back over and over again. Our favorites have been the beluga whale and penguin encounters. Most months have a new theme, so there is a good variety throughout the year. While our favorite is the Food and Wine Festival during March and April, we hit as many of the themes as we can because it's a great way to get exercise, see some of the world's most amazing animals, and enjoy iconic vistas of San Diego. Definitely one of the must-do activities when visiting or living in San Diego.\nShow less"], ["Reviewed 4 days ago", 5.0, "Seaworld", "Enjoyed our day at Seaworld. It was very quiet as we were out of season but we saw all shows and had a great time. Highlight was journey to Atlantis which was a walk on with no line."], ["Reviewed 5 days ago", 3.0, "Fun", "SeaWorld is one part aquarium, one part conservatory, and one part theme park, a mashup of attractions coming together under the Southern Calfornian sun. You'll need an entire day to see everything (as well as the physical fitness and willingness to walk several miles across the sprawling park), but the target audience of the attraction seems to be 4-to-13 year-old children. This was reflected in the cheesiness of the dolphin and sea lion shows. The orca show was more informative, but the speeches of the presenters contained an inordinate amount of filler words and phrases, which distracted from their talking points.\n\nAs for the rides, the Manta was the only true thrill ride that was open when I visited (which was disappointing-I would have liked more excitement), and the Wild Arctic ride was completely pathetic. It is laughable that a ride that poor exists at a major theme park-look it up. The gondola and the Skytower did provide good views of the area, but I would not recommend either for those who fear heights. SeaWorld is a nice family adventure, but not a must-see, once-in-a-lifetime experience\nShow less"], ["Reviewed 5 days ago", 4.0, "See the world ! Sea world!!", "Sea world SanDiego covers everything you want to know about marine life. The time scheduled shows were super (Dolphin/Orca) . A days duration should be enough to cover the whole park and i recommend getting the fast queue passes to save time for the rides. Another thing to get is the all day dining at an additional price but is totally worth it as you can choose what u want to eat every hourly at participating restaurants . All in all , it was a fun and enriching day , definitely not to be missed\nShow less"], ["Reviewed 5 days ago", 5.0, "Get the Pass", "We got the pass for all day dining, souvenir photo, etc. Well worth it. We tried to eat every hour, but couldn't do it. It did work on getting bottled water though. Shipwreck reef Cafe was the bomb. We ate there twice. The baby got to Trick-or-treat and enjoyed it. So much fun. I was glad I could share this with my Friends. Reminded me of all the summers I went there when I was a kid. Great photos. Great memories.\nShow less"], ["Reviewed 5 days ago", 5.0, "February school vacation", "We visited on a cool, overcast day - so crowds were sparse. We have visited the Sea World in Orlando, but this was out first time here. It is a lot smaller, but still a lot of fun. We bought our tickets online via Sea World, and saved a lot compared to the ticket price at the gate. We also bought the meal package, which was well worth it. The average meal for us would have been about $100 for four... and we paid about $80 for the pass. Well worth it for our family with two hungry teenagers! We spent the whole day (10am to 5pm), and would go again.\nShow less"], ["Reviewed 6 days ago", 2.0, "Amazing park, but they're constantly milking you for cash and the ethics still need work", "The good:\n- It's an amazing park full of a ton of sea life, fun rides, etc. Read their brochure if you don't already know what they have.\n- They've improved the educational aspect of the park pretty significantly. It's not pure animal entertainment like it used to be.\n- They've made big strides in making the park more ethical after the controversy following Blackfish. It's a complicated issue, but overall SeaWorld seems to be doing pretty well now. They're AZA approved, and they agreed to stop breeding orcas (though they're keeping their existing orcas until they die naturally, since they can't survive in the wild).\n\nThe bad:\n- They will milk you for every cent in your pocket after you're in the park. E.g. I paid $185 to interact with their beluga whales, which was amazing and wonderful, until at the end of the experience I learned it would cost me $90 to get digital copies of the photos they took (which only come on a CD, as if anyone still has a CD drive...). Guys, just charge everyone $20 more from the start and give everyone free photos (rather than just the handful of people who shell out $90)--you'll earn just as much and nobody will leave feeling gypped. I'd also rather pay a modestly higher entry fee in exchange for having affordable concessions in the park. Abusing a captive audience isn't going to leave people happy with their experience.\n- A few of their animal enclosures still feel degrading to the animals, even if they aren't necessarily harmful to them. E.g. the sea lion enclosure allows people to feed sea lions from above with minimal supervision, and they're basically just begging and barking for food from everyone all day.\nShow less"], ["Reviewed 6 days ago", 5.0, "Wonderful", "We all had a wonderful time. My granddaughters loved it as did we. So many interesting things to see and the dolphin show was awesome. The park is very clean and the staff are very friendly and accommodating."], ["Reviewed 6 days ago", 5.0, "Fun Family Day", "We love to frequent Seaworld and you can't beat the annual pass prices if you're local. It's so convenient and they are constantly improving the shows."], ["Reviewed 6 days ago", 5.0, "Great place to spend a whole day.", "Had a great day here with the kids (11 & 14) and didn't leave till dusk. Plenty of things to see and do to keep you entertained. Get to the shows early to ensure you get a good seat."], ["Reviewed 1 week ago", 5.0, "Wonderful Time!", "Clean park with a lot to see and do. The shows are great. Love the Dolphin area. We did a Beluga encounter and I highly recommend it. Had a great day! Enjoyed our lunch with the Orcas too, and the buffet was great!"], ["Reviewed 1 week ago", 5.0, "Excellent time w/ free teacher ticket", "We went on Thursday of President's week and crowds were light. My kids got great views of all of the sea animals. We got great seats for all of the shows. When they say you'll get wet, you will! We could have use another half day here since we prioritized shows and not rides or exhibits. Check their website for deals before coming out. I got a free teacher fun pass, free ticket for one of my kids, bought an annual pass for my husband for one hundred dollars that included parking and 10% discount on food and merchandise and two free friend tickets. So anyway check out deals available before heading over. We are used to massive Disneyland crowds so for us this was just a wonderful day in every way. The orcas, dolphins, sea lions, and belugas were especially playful with us when we'd wave our hands at them through the glass. They seemed very happy. Every show was worth seeing. My kids, 7 and 9, were the perfect age for this visit.\nShow less"], ["Reviewed 1 week ago", 4.0, "Nice way to spend the day", "We enjoyed the shows, the employees were friendly and the park is well maintained.\n\nNot knowing what to expect, we purchased the \"all-inclusive\" tickets.\n\nHaving been there, I can see we didn't need to do that.\n\nThe preferred seating for the shows doesn't really get you seats any better than if you didn't have them.\n\nSkip the pre-paid dining too. After eating once in the morning, we were so full we couldn't eat the rest of the day so we would have saved a few bucks if we just paid for our meal.\n\nBecause our hotel was close to Old Town, we used the bus from the transportation center in Old Town and saved the hassle of driving and the expense of parking. $2.50 per person and the bus runs every 20 minutes or so.\n\nStill trying to figure out how they got the cats to cooperate with the pet show...... :)\nShow less"], ["Reviewed 1 week ago", 5.0, "Wonderful Family Experience!", "We took our grandchildren ages 4 and 7 and we had a wonderful time from park open until park close! It was a great combination of watching great shows (orca and dolphin); riding rides (Elmo's Flying Fish to Journey to Atlantis); interacting with sea life where the children could feed fish to the seals and touch sea life; and giving our grandchildren an appreciation for taking care of our oceans and the life it holds. We enjoyed all the special activities like the turtle \"game\" at the end of the sea turtle exhibit and our granddaughter will never forget meeting a mermaid. We can't wait to go back!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great time with family.", "Very nice day. Went on a Tuesday with light crowd. On rides within 5 minuets. Bought the dining pass, was well worth it. Just a few rides, but they were fun. Shows were great."], ["Reviewed 1 week ago", 5.0, "Great time!", "My family (children ages 8-10) had a great time a Sea World. A few things to note. The first Dolphin show of the day fills up fast! The \"Quick Queue Premier\" pass worked great for the rides (no wait at all) and not so great for the shows. You still had to get there 1/2 hour early to get a seat. We went on a holiday weekend, so that may be the cause for the crowd. The Orca show was amazing and informative. And, lastly, if it's noted a \"soak zone\" or \"wet ride\", they mean it!\nShow less"], ["Reviewed 1 week ago", 5.0, "Excellent displays of animals.", "Had not been here for 20+ years but still a great place to see all kinds of aquatic animals. Also, it looks like they are completing an awesome new roller coaster."], ["Reviewed 1 week ago", 5.0, "It was an amazing day!", "We love Sea World. I think this trip was the best experience we have ever had at San Diego Sea World. The marine life is amazing. We will be returning in the next month or so. By the way, as a teacher, I really enjoyed having my grandkids learn about marine life. Differently spark an interest in marine life. Thanks Sea World!!!!\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun and Expensive", "We went on Presidents Day weekend. The weather was great and plenty to do. Our only complaint is the amount of money you will spend."], ["Reviewed 1 week ago", 5.0, "FUN TIMES!!!", "Our visit to Sea World was filled with lots of fun and laughter. Employees are extremely helpful. The park is kept clean. We love the fact that we're allowed to bring our own snacks, especially when bringing the whole family :)"], ["Reviewed 1 week ago", 5.0, "Sea World Birthday", "Repeat visit: We have passes to Sea World and let me tell you it's the best money I spend. My entire family loves to go. This time we finally swam with Dolphins for my son's birthday. The trainers were informative, so enthusiastic and very nice. I enjoyed our time there and will return regularly for the wonderful experience.\nShow less"], ["Reviewed 1 week ago", 3.0, "A lot of offer", "I remember Shamu as a kid and hope my children have some sense of connection to this place in the future.\n\nOrcas, dolphins and belugas are by far the stars in my opinion.\n\nNothing particularly bad to say, simply nothing that makes it something to never miss with this past visit.\nShow less"], ["Reviewed 1 week ago", 4.0, "Always a good time", "Sea World has gotten a bad rap due to accidents and incidences involving their trainers, but I always enjoy coming here. I believe they do a lot of good as well. There’s no where else I can bring my boys to learn about sea life in an outdoor environment that also has some amusement rides. It’s gotten expensive over the years, but they’ve wonderfully continued to support the local military community by offering free tickets every year. The shows have changed where as now they offer more of a glimpse into what trainers go through to rehab and train animals instead of just putting on a show. They have become more educational, which for me, helps answers questions I’ve always had about what marine biologists do. It’s always exciting to see the dolphins jump out of the water and they look happy and healthy. I do wish they had a bigger pool because what we see looks extremely small compared to the freedom they would have in the ocean. Obviously, the ones born at Sea World, would never make it in the wild, so it’s safer for them to be at the park. I respect everyone’s wishes, whether you choose to come here or not, but my family enjoys coming here when we’re in town so I definitely look more towards the educational side of having these animals here. If you happen to be in the area, I wouldn’t completely write this place off, the whales are really amazingly beautiful.\nShow less"], ["Reviewed 1 week ago", 5.0, "Lunar New Year", "We have season passes and go almost once a month. On Sunday February 18, 2018 it was the busiest day I have seen in the almost five years! The line to get in the parking lot took us almost 25 minutes and then another 5 to get through the security. Once we were inside it didn't seem as crowded. We always enjoy our days at Sea World and today was another amazingly fun day. With so many people though, we stuck to watching the Lunar New Year entertainment, letting the kids play in Sesame Bay of Play, and looking at a few animals. We did want to ride the new ride but every time we have gone in the last year, it has not been working. We will be back next month for the Seven Seas food and beverage tasting!\nShow less"], ["Reviewed 1 week ago", 5.0, "I was skeptical after seeing Blackfish but was very impressed!", "I saw the documentary Blackfish and swore I would never go to Seaworld again. However, my kids begged me to go so I gave in. I was very impressed! Their Orca show is incredibly educational and quite breathtaking. Really enjoyed all the other educational programs and my kids loved the rides and the tanks in the entrance with the cleaning fish and sharks. Glad to see SeaWorld focusing on their rescue efforts and education. We ended up getting season passes.\n\nHighly recommend it!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Day at SeaWorld", "Went to see all they had for Lunar New Year. Had to stop and get our yearly passes first. Every counter had an employee and the line moved quickly. Great start to our visit. Our grandkids love this park for all that they can see and do. The park was busy but not super crowded. some shows were filled while we were there but everyone seemed to be having a great time.\nShow less"], ["Reviewed 1 week ago", 5.0, "Wonderful time", "The Chinese Lunar New Year is an amazing experience and especially the Chinese Acrobats. We had so much fun with children ranging from 4 to 18. We used our friends free tickets as pass holders and our guests had such an amazing time."], ["Reviewed 1 week ago", 5.0, "So much fun!", "We all loved Sea World! The shows, the rides, the animals. Everything here was just pure joy! Loved the Manta coaster, Race to Atlantis and Shipwreck Rapids. Dolphin show and Pets rule were great shows!"], ["Reviewed 1 week ago", 3.0, "Horrible crowds kind of ruin everything this park promises with ticket purchase", "Came to see the Lunar New Year special events but it all took place on a 15x20ft patch of grass that was overpopulated. Couldn't see the acrobats either as it was full too. Can't see the sea life because people don't seem to understand they are to look and then move along. The people movers were a great solution...essentially forcing people to move along. The shows were very good and great fun in the splash zone. Sadly feels like bait and switch when Seaworld sells so many tickets that those that purchased can't really see what they thought they got as a result of ticket purchase.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun visit", "My husband and I had a fun day here. Loved the dolphin show and seal show. Amazing stunts and comic relief. Also enjoyed areas where you can touch the animals -like sharks and rays. Neat! Also enjoyed the otters! We were there during feeding time and enjoyed the commentary from the specialists/trainers. Unfortunately many of the roller coaster rides were not running during our visit. Kind of felt a little cheated. But overall the day was a fun one and the crowds small in February.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great fun", "We had a great time at sea world. We had bracelets for food for the day when you buy them online only 20$ for the whole day of food. Food was good lines were not terrible. Would go again for sure"], ["Reviewed 1 week ago", 5.0, "Amazing time.", "Repeat visit for us. As usual, SeaWorld is an amazing time.\n\nGreat way to spend the day with kids.\nThere was something for everyone. From 3 - 10 in ages all children were entertained.\n\nMultiple places to eat. Pricey if you compared it to out in town, but comparable to Disney or Legoland.\n\nHighly recommend the Sea Lion show. That was the best bit for us.\n\nYou need to take a few minutes the night before to see how to structure your day there. Recommend you arrive the second it opens at 1000. Then get to the rides/rollercoasters first as those can get crowded. Lost of shows throughout the day to choose from. Many educational aquariums to choose from.\n\nAnd they have giant turkey legs! Yes please!\n\nWe will be back again as we couldn’t see it all in one day!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "It's SeaWorld", "Most people know Sea world and I won't say more. When we went there we few people and it was a good time. Two of the rides we down for maintenance and that was unfortunate. The kids had a good time with the shows. Especially in the front where you can interact with sharks and fish. Touching a shark was an awesome experience.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "worth the time -- emotional experience", "I was surprised how much I enjoyed the visit. It was clean, staff was friendly, was not crowded. The animals are amazing ."], ["Reviewed 2 weeks ago", 5.0, "Perfect Family Day", "I bought the dining pass for my kids and myself and it was absolutely worth it- the price included their favorite snacks (Takis!) and healthy sides (fruit cups and applesauce) with each meal. I don't think we will ever do SeaWorld without this pass- it's just THAT good.\n\nThere was so much to do between the great rides, activities, and shows (calm yourself, PETA- we just watched otters be adorable).\n\nThe day was wonderful for all of us- ages 7, 12, and 32 :)\n\nCan't wait to be back with our year passes (great deal and totally worth the extra money!)\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Loved the manta rays", "We visited SeaWorld as a family late January. The park was relatively quiet which was nice, but there were a few things that weren’t operating. I think there should be a discount when not everything is open, especially the most popular exhibits. Our son absolutely loved the manta rays, touching them and feeding them. We had to go back to them a second time just to satisfy his obsession! We have been to SeaWorld on the Gold Coast in Australia and I think that one is way better than the San Diego one. Felt super sorry for the orca, I think there pool area was way too small. Overall, a fun day, but could have been better.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Used to be great. Now just so so", "When Sea World was a conservancy for sea life it was great. The visitors could see the various animals in their habitat and appreciate nature. They promoted a love of sea life and protection. Now it's more rides. What a shame. I did like the fireworks they had in the summer but those have stopped.\n\nPhoto of tower at night.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "It is an education waiting to happen.", "There is a lot to do and see at Sea World and much of it is of an education nature. There are also some entertaining rides available and from the sound of it, the younger folks really enjoyed those. We enjoyed wandering, watching the life watch us. Having purchased a season pass, we have complimentary parking and other privileges such as discounts on food and gifts. Sea World seems to be making a serious effort at ecology contributions to counter some adverse publicity in recent times. It is worth the visit, and there is ample places to sit and relax.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Interesting and fun for both kids and adults", "My wife purchased tickets for my birthday as she wanted to take me here to see the Chinese acrobatic team and entertainment. The place was immaculate, the staff friendly and knowledgeable. The restaurants served good size portions as reasonably prices as compared to other theme parks. Of course, the prime entertainment venue was the dolphins and orcas which of course are very well trained and highly entertaining. Highly recommend for both adults and children.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "I love SeaWorld", "I always enjoy going to SeaWorld. The employees of SeaWorld San Diego are all quality people. They are very attentive and always eager to please the visitor and answer any of your questions. Before I moved here, I always went to the SeaWorld in Aurora, Ohio. I was sad to hear that it closed, but it was probably due to the hard winters there. They would have to move the animals to the Florida park or elsewhere during the winters. That had to be difficult. But, it got me hooked on SeaWorld and I couldn't wait to go visit the World Famous San Diego SeaWorld. I have not been disappointed and will continue to support them. I appreciate all of SeaWorld's efforts to rescue and care for all the animals. It is most admirable. Thank you, SeaWorld!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great during slow season", "Our family recently visited this February during the slow season. It was great, the park was completely empty. The only caveat is some of the rides are closed for refurbishment, like Manta. Major bummer but it is expected during the off season. Had lunch at Dine with Shamu as well. Very informative and the food was great.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Incredibly friendly staff", "If you put aside the discussion as to whether we should keep animals in captivity (whether for conservation, study or entertainment - or a combination of all 3), you can see Seaworld is trying really hard to adapt with the times and treat its animals / guests really well.\n\nAlthough a little dated in places (it is about 50 years old) it is still a good place to visit with a family / young children. It’s a 5 star review for me because of the great recruitment policy. F\nantastic staff - every interaction was a pleasure and will stay with us for a long time. Thank you.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Big rides were closed", "My adult son wanted to go as it has been a long time for him. Disappointed the roller coaster was down as he was looking forward to riding it. We got to the park at 10 when it open but keep in mind none of the shows start until 11 and the other rides didnt open until 11:30 to 12:00. Parked closed at 6 which is super early. The old Shamu show now known as Orca not even worth watching so boring. Seamore show was great and they had changed it up since the fall which was nice. Keep track of the show times as some like the orca show were only one showing. Parking is really expensive 25.00 which i thought was outrageous.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Never purchase the photo day pass", "The day at SeaWorld was great until you get to the whole Adventure Photo aspect of it. I purchased the day pass in the morning and I was told that my photos would be uploaded within 45 minutes to an hour..... I checked it several times throughout the day and nothing showed up. Before we left the park I spoke to Denise at the adventure photo stand just before the park exit and she said that she called the company and that their system was just \"slow\" and to give her another 48 hours before the photos would be shown. I waited for that and still no pictures so I emailed her back. She kept giving me the same answer about their system being \"slow\" and to give them another 48 hours. After getting the same answer over and over again I began asking for my money back. She never said she would give me my money back and insisted that I email the other company for my photos. That took 2 weeks and I got nowhere so I emailed Denise back stating I wanted my money back and she never responded. I then finally got to VIEW my photos after constant emails but I still think for the aggravation something more still could have been done. So I emailed Denise about my money back and she responded that she contacted the other company and as I can view my photos that if their was anything else I needed to let her know. I am still upset because at that point I was still telling her I wanted my money back or a refund and no email back. I even asked Denise for the name of her supervisor and still no email. I tried calling the customer service number for SeaWorld Orlando and they kept directing my call to email Denise. This is ridiculous. I am reporting it to my credit card company as nobody will respond to my emails.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful Visit", "We visited Seaworld San Diego on a Sunday in February, and there were a lot of people but it wasn't crowded. We were able to see all of the shows offered that day, which included Dolphin Days, Sea Lions Live, Pets Rule, and Orca Encounter. I loved how the shows were entertaining but informative as well, especially the Orca Encounter one. We enjoyed riding the Manta and Journey to Atlantis, each one had short lines that day. The Skytower and Bayside Skyride had amazing views from them. The only downside of going in the winter season was how early they closed (5pm). I wish we had more time to experience more of the park, so I actually recommend setting aside two days for visiting Seaworld.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "beautifull", "We went there february 2, 2018 and we did 2 encounter which we loved! we did the dolphin which was awesome and we also did the penguin encounter which was even better! Thank good we had that, because 2 rides that we were planning on doing (Journey to Atlantis and Wild Arctic) were down, and they had to cancel the whale show because they (the whale) did not want to do anything! Really disappointing! However the dolphin show was awesome! Feeding the ray was also fun!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "SeaWorld, Fish, and Rides", "It's been years since I've been here and I had just as much fun as when I was younger. In fact, they have more rides to offer and we went on a lot of them. You also get to see and watch a lot of sea critters and shows. Plan on spending the whole day there as you will need it and take Sun Screen for protection.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Nice time", "I like this park. It had rides and great animal attractions. My daughter got to swim with dolphins. This a good size park but not crazy big. Very clean. Nice views of all the animals. You can rent wheelchairs and power chairs. Lots of food and good deals on drinks.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "GREAT TIME!", "Great time with the family. The kids really loved it and can't wait to go back. I hadn't seen my baby girl so excited when she saw the dolphins. Looking forward to our next trip there."], ["Reviewed 3 weeks ago", 5.0, "Meals", "We enjoyed our day at Sea World with our grandson and his parents. The weather was perfect and the park wasn't crowded at all. We got to the park at 10:00am and stayed till close. Our only dissappointment was that we purchased the dining all day for four adults only to find out that certain speciality desserts weren't on the deal. When purchasing them online they didn't clearly state that there would be things at the restaurants that aren't part of the deal. Also people working in the restaurants were not very clear about explaining the deal either. We ended up paying 20.00 for pickles. Really?\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great time, No lines", "We had a wonderful day. It was Super Bowl Sunday, so the park wasn't so crowded. We rode everything we wanted to, and we were able to even see a show. I wish they would stay open later in the winter. That was the only bummer. I also enjoyed my turkey leg and roasted corn on the cob.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "awesome experience", "a lot to see in SeaWorld; excellent dolphin and orca performance, as well as the seal performance; novel ideas."], ["Reviewed 3 weeks ago", 5.0, "February weekday is the time to go!!!", "My wife and I went today Monday 2/5/18\nWhat an amazing visit. Got there about 9:30 and got GA parking and parked a 100 ft away from the gate. We were the first to get on Journey to Atlantis and we didn’t wait longer than 5 minutes at any of the rides. I HIGHLY RECOMMEND GETTING THE ARM BAND FOR DINNING!!!!! It’s $20 per person for adults and can be purchased when you buy your park ticket. You are allowed to go to 6 restaurants in the park and get an entree a side and a drink every hour while your there. We got 2 meals and a snack. Had we not bought the arm bands this would have cost nearly $130 dollars. More than worth the original cost and the food was surprisingly good.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "No lines in January!", "We needed to get away from rainy Seattle for a couple of days and decided to visit San Diego. One of our stops was SeaWorld. This is a great place for kids as there are tons of amusement rides and lots of pools for seeing fish up close. We were able to walk right into every show and restaurant (which is not the case during the summer) and had no lines at any part of the day. The killer whale show is extremely well done and the Beluga whale exhibit is really well laid out, giving you views of the whales from above and below. There is a great shark exhibit where you walk thru a glass tube located within the shark tank, allowing you to get views of these magnificent creatures from all sides. The price of admission was a bit steep, but there is plenty to do to keep you busy an entire day there.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Just love SeaWorld", "Such a fun and affordable park for our big and growing family. The little ones enjoy the Sesame Street rides and games and the rest of us enjoy seeing all the different sea creatures. The shows are pretty amazing too! Love it! I think the only issue is the Ship Wreck Restaurant the food was prepared in advanced and tasted cold :( not very fresh.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Day at Sea World", "We had a very nice day at Sea World on Friday,1/26/18.The park was full but not overly crowded. the topper of the day was dining with the Orca's. What a wonderful experience. Enjoying a meal & watching Orca's swim just feet away from us. The whole day was great & uneventful.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Really fun time!", "I was hesitant to go to Seaworld because of the whole Blackfish situation. I don't think orcas should have ever been captured and brought into captivity but since they are there now and can't survive in the wild on their own, the current management is making the best of the situation. We did the behind-the-scenes orca experience and it was beyond amazing. I would highly recommend it. It was a super fun day. The only things I would say to improve the experience would improve the method for getting photos back (if you purchased them). And if you buy multiple experiences, it would be cool to have all of those credentials on one card instead of having them on a million print out cards. Go and enjoy!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Family", "This is the best sea world in USA , you should have a fun day, also shopping and truly! Super games to enjoy. The animals are in very good condition, also you can feet some of them. The shark restaurant is so nice but coldest. Super shopping everywhere!! Love sea world. Don’t miss out!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A SeaWorld Visit with a Twist", "SeaWorld has been a family favorite for years (we live locally). Each time we try to do something different during our visit to the park, and this weekend was very special. It was called Inside Look. When entering the park, they gave us a \"passport\" for collecting a stamp at a variety of locations around the park. At each of the locations, trainers and park employees went into detail about such things as animal rescue, how they store the food they feed the animals, how they train animals, etc. Very informative and interesting. When all stamps were collected, a visit to the gift shop earned my grandson a special collectable pin. Unfortunately the weekends for this special event are over, but they have many special activities available at the park, such as Dining with the Orcas, for an additional charge. Be prepared to pay for parking ($20 and above), as well as for park admission and for food in the park (see website for actual costs). If you are a repeat visitor, they offer annual passes for purchase.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "fun place", "Fun place,get the year pass and save on everything,great shows been here many times over the years..The sham u show has greatly changed,,It was ok,not as good as it used to be"], ["Reviewed 3 weeks ago", 4.0, "Good family experience", "We took our grandkids there for a day and they enjoyed it. The park was clean and the staff we encountered were all friendly. The rides seemed new and the kids loved them. We did feel a little \"nickel and dimed\" with additional charges for lots of things. But overall a fine experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Grandma with 10 year old grandson.", "Loved it. The interactions were great. Especially loved the beluga whales. The dolphins and killer whales were fantastic as well. Well worth the extra cost. The trainers were informative, and took extra effort with any questions and information."], ["Reviewed 3 weeks ago", 3.0, "Losing luster", "Sea world is losing its luster since AB shed the outdoor parks. The shamu show is gone. Rides are fun yet not a draw. In all, not the destination the park was once. Only do if part of a package deal."], ["Reviewed 3 weeks ago", 5.0, "Friendly and Fun", "SeaWorld is a must see when visiting San Diego. Great for families and adults a like. The shows and rides are fun and entertaining. A bit expensive so plan accordingly."], ["Reviewed 3 weeks ago", 5.0, "Fun family day", "Took my daughter and her best friend for her birthday. The girls had so much fun, as always. I was amazed by how CLEAN the park was. They loved the touch pools and had a lot of fun interacting with the employees, who were always so quick to answer their questions. I love how interactive they are with the guests. Their favorite part of the day was the dolphin feeding time- look for that and stand near a trainer- you'll get to see the dolphins up close. We loved meeting Dottie, and learning about her.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Good mix of animal attractions and thrill rides", "Seaworld is still the place to be for cool animal attractions and exciting thrill rides. The Journey to Atlantis, Manta and the Shipwreck Rapids are all exciting rides and the dolphin and sea lion shows are very entertaining. You get some good views of the water from the Skyride. Overall it is an enjoyable day out for the entire family.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Disappointed in this SeaWorld and over priced", "Expensive to visit for what is there. Had to pay extra for many things. The main show was good but to take a family would be a very expensive day out. Looked a bit in need of an upgrade"], ["Reviewed 4 weeks ago", 5.0, "One of the jewels of San Diego", "Even if you visit San Diego for two days find few hours to enjoy Sea World It’s a wonderful experience for young and old, we sure loved all the rides and the shows It’s an awesome experience"], ["Reviewed 4 weeks ago", 5.0, "Awesome place and VERY handicapped friendly", "I have been a pass member since 2013 and have read some of the other reviews so here is my view point as someone who has gone several times. The park is handicapped accessible and Sea World is VERY handicapped friendly. When I visit Sea World I use a mobility scooter to get around. I have found I am able to get a round with very few problems (main problem is kids running in front of me) and there are several handicapped friendly bathrooms throughout the park.\nAs for the park it is always being updated and changed so the park and the shows are very different from when I started attending. There are also employees walking around cleaning up the park.\nAs for the employees ... Sea World employees humans and as human sometimes they have bad days. For the most part the employees I have interacted with are friendly and helpful.\nAs for the exhibits I read one review that stated there were to many turtles for the tiny tank they were in. As I states I have been there several times sometimes there are a large amount of animals in the different tanks and other times there maybe only one or two. I do believe that most of the exhibits have areas where the animals can go hide from the public. Also if you talk to the trainers you will hear in their voices how much they care about the animals in their care and how much the animal's personality plays apart in what each animal does there.\nI love going to Sea World alone or with others.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Family Trip", "We love being able to go and see everything in one day. Its great not having to fight large crowds like at other theme parks.. Great for the family."], ["Reviewed 4 weeks ago", 5.0, "Great family day at the park", "Sea World has always been a favorite of ours. We went during the week and later in August, so schools in California were already back in session. Park was practically empty. No wait time for the rides. Shows were terrific."], ["Reviewed 4 weeks ago", 5.0, "We miss the All Year Dining Pass!!!!", "We miss the All Year Dining Pass!!! When is it coming out? My family and I are pass holder members for 4 years now, so we've seen a lot at Sea World. Beautiful park, clean, organized, and great staff!!! Staff at Sea World is well trained, excellent customer service.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Gotta go once", "I haven't be to SeaWorld in about 35 yrs. We had a really great time with our 11 yr old. I wasn't sure what to expect but was really surprised by the park. We petted sharks, rays, horseshoe crabs, and a dolphin. The shows were ok. The Manta Ray coaster was fun. The exhibits were good. Lines for food and drink were short to non existent. Everything was laid out well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always enjoy coming for the day", "We live close and I have been coming to SeaWorld since the 70's - SeaLion show has really become a very good show....The dolphin show has scaled back a little too much We really enjoyed the Parrots in the show from the past but that didn't happen. All of the staff I asked a question of were wonderful. Only downside was the pretzels - $4 for a VERY stale, VERY stale pretzel...we won't do that again....\nI love the education of this place and the amount of work they do to save injured animals - Thank you Sea World!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Last minute idea", "Oh my goodness, we decided last minute to go to Sea World because we were at a retreat 45 minutes away! What an amazing day we had! We were able to take part in the behind the scenes, Inside Look. There was amazing staff that treated us with knowledge, respect and enthusiasm. I am a teacher and was able to get the Fun Card plus 2 admissions! Our youngest was able to purchase a Fun Card and we can not wait to get back!!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Perfect day", "Time your activities around the dolphin and the orca show, you shouldn’t miss those two. The shark encounter is great. Kids rides and playground are lots of fun."], ["Reviewed 4 weeks ago", 4.0, "Great Shows for the Whole Family", "The shows here are just awesome. The Orca and Sea Lion Shows were our favourites. The Dolphin experience was great and same with the sea otter session. Our 5 year old daughter loved the shows but especially loved the Sesame Street play area and the touch pools. The food was just ok. In realty though I’m not sure we should really expect fine dining at a theme park.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Poor Experience For Elderly Disabled at \"Pets Rule\" Performance", "Pretty good day until the final show which was the Pets Rule performance in the Nautilus Amphitheater at 4pm. We had my 91 year old disabled mother in law with us. Disabled seating comes along with a spray hazard (water) if you want to sit front and center. Not the best for a 91 year old woman. So we sat the closest we could in the corner. Would have been fine EXCEPT FOR THE CONSTANT STREAM OF PEOPLE WALKING IN FRONT OF US DURING THE ENTIRE SHOW. From her wheelchair, she saw maybe 20 percent of the show without people blocking her vision walking by. Makes no sense that Sea World does not close the seating bowl (entrance) once the show has started. Might even teach people to show up on time. Ruining that show for a 91 year old woman who loves dogs and cats left a very bad taste for us. WOULD NOT RECOMMEND that show for the elderly or disabled unless they are fine with people constantly blocking their vision. It's ok if you can climb the stairs to higher seating, but not if confined to a wheelchair or walker. Shame on Sea World for not caring.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Lots of fun in Seaworld", "I especially enjoyed the shows at SeaWorld. It is amazing what the sea lions, dolphins, and whales have been trained to do!"], ["Reviewed 4 weeks ago", 3.0, "Looking a little dated", "This was ok as theme parks go but is looking a little dated as I thought most of tourist areas in LA and San Diego are. Saw some shows went on some rides but it’s fairly expensive really for what it is....as usual the best looking rides are under maintenance or will open in the summer. I guess that happens most places for “off season”. It’s a trade off for no crowds I guess.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Worth the visit.", "Spent a whole day here with our granddaughter. Enjoyed the dolphin, orca and sea lion shows. The interaction at the explorers reef was great, able to touch small sharks, bat rays, nibble fish . Best experience was getting to see our granddaughter touch the Dolphins at dolphin point. We did not pay extra we went to the early show and saw where to stand and then went ahead of time to the next show to get our spot. She could have kissed the dolphin. Found the paid interaction programs to be very expensive for what you would get. Unfortunately a lot of areas and rides were shut down for maintenance but did enjoy the Manta roller coaster and shipwreck Rapids. Bring a picnic lunch and leave it in your car, get a hand stamp to leave and enjoy your picnic and a break from the park for awhile, picnic tables located just outside the gates.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The Shows are Still the Best Part!", "Took my 13 and 15 year old kids to SeaWorld recently. We had a fabulous day. The park is clean and the staff is attentive. The Orca, Dolphin and Sea Lion shows are still the highlight of the day, just like when I first visited 30 years ago. The Ray roller coaster was fun and we felt the food plan was a good value with our ticket.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Terrific", "We always visit SeaWorld because it is a fascinating park with interesting attractions all relating to the Sea."], ["Reviewed 5 weeks ago", 5.0, "Fun For All Ages!", "Super cool. The orca and dolphins are absolutely amazing. Petting the dolphins was such a fantastic experience. The bond these animals have with the trainers is so incredible to see."], ["Reviewed January 24, 2018", 5.0, "Family day", "It is so fun we bought annual pass. We really enjoy going there. Even though they can't ride Whales any more they still make it a good show.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Good family day", "We went on a january weekday with our daughters age 9 and 11. It was really slpw. Only line we waited in was for lunch and it was only 15 minutes. The fee rides we went on were fun. The shows were our favorite part. The aquarium s and animal enclosures were ok. Pur kids were the perfect age because they liked the big rides and kiddie rides. We bought tickets on line in advance for a discount. We also got dine all day on line ahead for $20 a person. Great deal.\nShow less"], ["Reviewed January 23, 2018", 5.0, "A good day of fun for kids and family", "There are a number of things to see, but if planned right, one day might be enough. You just need to make sure you know what you want to see and which shows you want to go to. Some shows are offered twice a days, others just once, so do you homework to make sure you see everything you wanted.\nOrcas and Dolphin shows where good. Shark feeding was ok. \"All day dining\" ticket was a good deal, but some locations get pretty long lines. Also while park is open till 5pm, some places are closed at 4:30, so make sure you have enough time to see attractions you want.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Fun! I would go back here before I would go back to LEGO Land.", "Loved it.... my daughter was in pure heaven! The employees were great, especially the ones at the pools where kids can feel the fish and rays."], ["Reviewed January 22, 2018", 5.0, "Fun family park.", "We had a great day at Sea World in January 2018. The crowds were way low middle of the week and we practically felt like we had the place to ourselves. The dolphin, orca and sea lion shows were spectacular. Many of the other exhibits were interesting and educational. The rides (especially Manta) were alot of fun. Be aware of off-season ride closures in January, however. Great place to spend the day with the family.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Clean goo fun but don't recommend the dining pass", "Family had a great time of the long weekend. The shows were good and the rides were fun. I do NOT recommend the dining pass due to the lack of clear communication of what you can or can't get with the pass. I tried to search as much as possible to understand what the restrictions were before buying it but i couldn't find any clear communication. Apparently it is not good for the entire menu on any of the specific eatery's you can select. When you ask they give you a small slip of what you can get. Basically a drink, a main dish and a dessert. But apparently some things aren't available for the pass like ice cream or funnel cake. It also didn't seem we were the only ones confused. Many folks in line asked multiple times what they can or can't get.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Amazing time!", "Thank you for my Fun Card! I was going with the mind set that I was going to wait in line for almost all attractions or shows, being that it was MLK Jr day. On the contrary, you had plenty of staff that help move things right along. We purchased the all you eat pass and that was also the best thing we could have done. The food was tasty, well cooked and there was a variety to choose from. My family & I had an amazing time.\nShow less"], ["Reviewed January 22, 2018", 3.0, "expensive day out", "we spent the day here the shows were good and exhibits interesting but I personally have problems with captive large mammals in small pools The entrance fee of $90 per person was too much"], ["Reviewed January 22, 2018", 5.0, "A great theme park for the whole family", "Seaworld is one of my favorite places to visit with the whole family. Their fun card is a very good value for fun and education all year long."], ["Reviewed January 21, 2018", 5.0, "Special inside look special during January", "SeaWorld is doing a good job in educating the public on all it does for sea animals. I was able to see them get a urn sample from an Orca. Impressive that they have been able to develop that close of a relationship to do this. They draw blood once a month. They feed them restaurant quality food. 3000 bs a day just for the mammals. The program offered insight into all the rescues they do and are on call 24 hours. They do this without funding. The shows are not that great but they at working on that.\nShow less"], ["Reviewed January 21, 2018", 5.0, "We absolutely LOVED Sea World!!!!", "We have been to San Diego several times but this was our first time to Sea World and my family and I absolutely loved it! Our children are 19 and 17 and we had a blast.....the Orca show was fabulous as well as the nativity play (from the animal's point of view). We are from Hawaii and we all purchased annual passes, which means we will definitely be back!!!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Loved it!", "I know but they have had some bad press over the years, but I truly believe that they are there because they love the animals. I also believe that they are conservationists. Our group had an absolute blast, and it was very educational!"], ["Reviewed January 21, 2018", 5.0, "A good time with family!", "We had a great time enjoying the animals and shows here. We walked a ton and stayed longer than we thought but we had a great time! If you have young kids bring a stroller for the storage alone but also for the kids! :)"], ["Reviewed January 21, 2018", 5.0, "Fabulous shows and prepare to get wet", "The whales and dolphin shows are a must see. they have lots of variety for all ages and a amazing rafting ride to go on."], ["Reviewed January 20, 2018", 5.0, "Perfect for the Family", "Went in January and the weather was perfect. Bring a poncho so you don't get wet watching the Orca Encounter. They only have so many showings a day, so plan ahead. Prices are reasonable, compared to other attractions. Get the drink cup and refills are free all day.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Christmas spirit", "We want to say this was a rare treat for our family during Christian season - they have a LOT Christmas decoration and they have a show on Birth of Jesus ! This was a GREAT show ! Thank you sea world for putting this show on during Christmas time .\nShow less"], ["Reviewed January 19, 2018", 5.0, "Dolphin Interaction experience is awesome!", "My daughter and two grandchildren did the Dolphin Interaction Experience and it was amazing!! They got to dance, hug and learn to give commands to several dolphins under the guidance of a trainer. Definitely a memory they will not soon forget!! The kids were a bit apprehensive at first, but quickly were so involved with the animals that they ignored the fact that they were in a pool surrounded by park visitors. My youngest granddaughter also loved the Sesame Street rides. We all have annual passes and will definitely be back often!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Awesome experience!", "Thank you Sea World for the free Teacher Pass! Myself and two other Adapted PE teachers from Murrieta, CA came down for the day over our winter break. We really enjoyed the Dolphin, Sea Lion/Otter shows and the Orca experience! The shows were amazing and the new Manatee roller coaster was super fun! We will definitely be back! I am hoping to do the dolphin interaction for my birthday in February! (I did it years ago when my now grown daughter was young) LOVE THIS PLACE!!!!\nShow less"], ["Reviewed January 17, 2018", 5.0, "Great family time", "Great time not overly crowded. Staff was very friendly and helpful. We purchased the annual passes as we plan on return. Also a great learning experience."], ["Reviewed January 16, 2018", 5.0, "Love this park! Great for kids with allergies", "My family loves Sea World, so I re-upped our yearly passes this year and we went over the holiday. My daughter is gluten intolerant, which makes for some difficulties in finding food at some parks. Add in that she is a pescatarian and it makes it even harder. But Sea World is great for kids with allergies and we go to Shipwreck Reef and our whole family has options for lunch (the salmon is delicious, by the way). The customer service at Sea World is always great and we love the shows. No matter how many times we see Sea Lions Live and Pets Rule, we still enjoy the performances! We're also big fans on Sea World's conservation efforts. THANK YOU!!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Must visit...great shows", "Loved the dolphins touching...and playful..great mighty orcas show... awesome.msut visit, great food...do take the all day eat food pass"], ["Reviewed January 16, 2018", 1.0, "Wish We Never Went", "The treatment of animals at this park is disgusting. I am no extremist when it comes to animal welfare but SeaWorld is just a barbaric money grab. For $100 per person (more than twice as much as the San Diego Zoo) you can walk around a tacky amusement park with a handful of rides that resemble lame versions from six flags. Now, I am no stranger to over done amusement parks but this is the first one that had the audacity to heap live animals in front of their rides. You don't have to be Dr. Dolittle to see that these animals are absolutely miserable and would be better off dead. Go look at the killer whales trying to bash their own heads in and tell me you don't want to put them out of their misery. Each exhibit fills you with more dread. 10+ dolphins swimming on top of each other in a pool that rivals a kiddie pool at a water park. Manta Rays at the bottom of \"The Manta\" roller coaster, 50+ in a small, shallow pool being poked and over fed all day by tourists. We must have walked through at least 15 gift shops, you literally can't avoid them. The intentions of this corporation are clean. Maximum profit, even if HUNDREDS of animals suffer. If I could, I would go back and take my money else where. Anywhere else. I would beg anyone considering visiting SeaWorld to try out the zoo instead or admire the beautiful outdoors and beaches San Diego has to offer instead. I can't imagine this place will be open much longer anyway.\nShow less"], ["Reviewed January 16, 2018", 4.0, "So Far So Good", "I haven't been since I was a child and just got season passes on special for a very good deal for me, my mom, and 2 younger siblings (11 and 13, boy and girl). My sister and Husband even decided to take advantage of the passes. The pass includes free parking and 10% discounts on everything and no black out dates. we've been twice this year and so far I'm excited.\nCONS first. FOOD is terrible. even with the discount I spent $70 on 3 meals and 2 souvenir cups, one with a dolphin topper. the food wasn't even very good. I forgot where we ate but it was barbq. chicken was dry, guy cut the smallest piece of meat over, and mac-n-cheese tasted like cardboard-inedible! eat before you go.when you leave, bring snacks or just stick to hot dogs. My sister said the Pizza place was good but I haven't tried it yet and i'm sure its just as pricey. Their starbucks do bake their own goods though so the cookies and sweets are really very good.\nWith Staff, only negative experience was a lady at a gift shop told us it being a Monday they gave away these kids toys at the Manta. sounds great BUT Manta was on the other side of the park, we had to leave, AND we had been at Manta first thing and no one in that area told us anything. So the kids were a bit disappointed. They also don't do anything for Birthdays when we asked at guest services.\nBeing January the Atlantis roller coaster is closed and one large coaster is being built. There have been no lines for anything and the park is mostly empty, which we love so we can talk to trainers and ask questions about the animals. staff are all super helfpul when we ask questions.\nHuge play place for the kids with a water fountain to run through and huge jungly gym to play area. so far we love it. next time will ask at the front of any specials/promotions going on and bring our own food!\nShow less"], ["Reviewed January 15, 2018", 5.0, "More than I could have asked for!", "An absolute must! Whether it is the dolphin show, feeding the sea lions (are they loud or what?), watching the pinguins swimming or the orcas slide on the stage - it is mind boggling.\nWe saw the \"behind the scenes\" with the orcas and enjoyed it more than what a show would have been, we learned so much!\nMake sure you arrive early - it takes at least the whole day. Wear comfortable shoes, take a change of clothes if you plan to sit close to the dolphins (you'll get wet). Plenty food concessions with a wide variety of choices. We took the day pass with restaurant - well worth it, as well as the upgraded parking to be in the first 6 rows.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Educational and Entertaining.... so much More!", "I am from San Diego so know of all the bad publicity that comes with SeaWorld but they are so much more than this. I go at least twice a year with my sister coming in from Arizona a good 6+ times to visit (her teenagers love the place). We were just there over the holidays, my first with them and it was great. Their holiday experience was so much fun with even real Reindeer (they come from a rescue place in Los Angeles) with a trainer to answer so many questions. If you aren't there during the holidays you won't be able to see their Nativity show... it was just a WOW nothing I've seen before and went twice, even my husband loved it and that says alot. If you miss it don't be worried. Their new Orca Encounter is just as exciting as before and really gives you the educational background of Orcas. Everywhere you go the people are friendly, the rides are fun and again there are staff on hand to answer questions on the Beluga Whales, Orcas, dolphins, Turtles... you name it. So you can take this as far as you want to be educational to learn about the animals as well as what SeaWorld does for them (I've seen first hand living near the ocean with how they help with the Seals) or just have fun with the shows and rides. I've seen bad reviews on the food, but I've never had a horrible meal -- I've done Dine with Shamu which is just great, had no idea as to what expect and didn't want to leave, most of the times go to Shipwreck where the food is good and big portions. I do love this place and cannot wait for the new roller coaster!\nShow less"], ["Reviewed January 15, 2018", 5.0, "Love Sea World!", "My husband and I buy season tickets every year for ourselves and our grandchildren ages 3 and 5. We all absolutely love it. Our grandchildren especially love when they can touch the sea life and usually spend an hour just there. The park is beautiful and they have added more rides. They constantly have special themes going on. The Christmas theme was enchanting. We also appreciate that Sea World is always rescuing sea life and taking care of them.\nShow less"], ["Reviewed January 14, 2018", 5.0, "We Love Seaworld", "Everytime we go to Seaworld it is a fun day. Our family has been going to San Diego Seaworld since the park first opened in 1964. We have watched it grow and change over the years and we have never been disappointed.\nI have been at local beaches when there has been a sea life rescue, I must say there staff of professionals have expressed such great concern for the wild life they have been there to help. I really feel that Seaworld is a great asset to have in our beatiful community.\nLast week we got to see your new whale show, what a must see! We all learned so much about whales in there natural habitat.\nThank you Seaworld staff, we are always grateful!\nShow less"], ["Reviewed January 14, 2018", 5.0, "Nice Day Trip", "It's been many years and I was impressed! The staff was friendly, helpful and knowledgeable. The exhibits were clean and the animals seemed well taken care of. As a former Zoo employee, I can tell when animals are lacking in care, and SeaWorld does a great job.\nShow less"], ["Reviewed January 13, 2018", 4.0, "Sea Creatures Galore", "A great way to see so many unique animals but tanks and enclosures did seem quite small. The kids had a ball watching the huge orca and their majestic size was amazing to see up close. They also have some hands-on areas to touch and interact with the creatures. Our kids loved it!\nShow less"], ["Reviewed January 13, 2018", 5.0, "Christmas Musical \"O Wondrous Night\" Great!", "Love SeaWorld...it's not so big and crowded (like some other amusement parks) where we feel claustrophobic. But then again, we don't go on summer Saturdays, so we can't speak from experience how the high season might be.\n\nWe just went over the New Year's weekend and experienced the Christmas musical. It was fantastic! We loved it--you'll laugh, you'll cry, you'll worship!\n\nRides and attractions are great--family friendly, fun and exciting for all ages (we have a preschooler and middle schooler).\n\nFood options are good, and we like the free refill option for drinks. Also, SeaWorld has THE BEST carnival games--fun, not too difficult and nice plush toys! Because crowds are smaller, parking is not intimidating or a long walk from the gate.\n\nBest of all, the fun card allows a WHOLE YEAR of visits for the price of one...can it get any better than that?????\nShow less"], ["Reviewed January 12, 2018", 5.0, "SeaWorld is great!!", "My family and I just went to SeaWorld and had a great time! The shows were entertaining and my daughters loved the rides and furry friends. Even though the killer whale show is different now, it is still fun and amazing to watch. The dolphin show was awesome! Looking forward to going back this year with our passes/funcards.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Sea World Visit.", "Absolutely loved the new Christmas show. It was spectacular. Can't wait to use my new annual pass as much as possible. I had a great time and I look forward to the new show next year. I hope the show is the same. as this year. Thank you, Sea World for this great show.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Seaworld is amazing!", "I have been going to Seaworld since I was a young girl, my family and I have always enjoyed the adventures we made in the park. This passed year my boyfriend, my cousin, my brother, and I all have decided to purchased an annual ticket. I have been to the park a number of times, and no matter the season I am still amazed by the entire experience. Everyone is so thoughtful, the shows are impressive, and the rides are actually pretty fun. I am very upset that the Shamu Believe show had been discontinued, but Seaworld has found an incredible way to provide what travelers around the world want to see, with the new Orca Encounter. We have decided to plan another trip for February, in which we have decided to swim with the Dolphins. No matter the show or tour you learn something new every time to enter the park.\nShow less"], ["Reviewed January 12, 2018", 5.0, "OMG!!!", "I visited during the Christmas holidays and just loved my experience here. Interaction with penguins and dolphins (separately bought) was an incredible experience that I will never forget. There is nice food and snack shops all over the place with a very good price. Also, different shows of dolphins, sea lions, etc was a lot of fun. Be sure to install the application on your phone before, helps you a lot to find your way around. Also check the weather before you go, sometimes it's warm in the morning and gets very cold after the sunset that you'll need a jacket. Moreover, be sure to have warm clothes with you if you want to take the penguin interaction tour. They take you to a room which is freezing cold\nShow less"], ["Reviewed January 12, 2018", 4.0, "Awesome", "We went in December street my son graduated Marines boot camp. I think its great that they value our military. Military families can get in free with active duty military personnel and id. Since it was just before Christmas they had it decorated with lights. It was beautiful!!\nShow less"], ["Reviewed January 11, 2018", 2.0, "Extremely disappointing", "I was at this park 4 years ago and more recently at the Sea World in FL and wish we had skipped this day on our vacation. The big roller coaster was closed, most of the shows were not listed on the day map, shows were only 1 or maybe 2 x a day and then you had to choose which one to see if it was at the same time as another one. We missed the whale show because we did not make it over there until the only one that day was over and we had no idea it was happening. The only way to see when the shows were was to go to the exhibit and see the marquee. The circus show, which was spectacular 4 years ago, was not running. The grounds were not kept up. We purchased food passes to eat all day and while the food was plentiful I did not eat one thing that was not STONE COLD. You think they would be able to keep the food at least a little warm. My 17 year old wanted to leave after about an hour. Do not waste your time or money going this time of year if they don't care enough to maintain the level of entertainment year round. I am sure we paid the same amount of money for a subpar experience.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Christamas musical was excellent", "We went before the Christmas musical finished for the season and it was so beautiful. Made you get back to the real meaning of Christmas, and just amazing!!! The dolphin and killer whale shows were just amazing with what they can teach the animals and educate the people who attend the park. As always my 3 girls loved watching Biff before the Sea lion show. The best deal around if you ask me. If you are staying all day check into their all day dinning deal, their food is excellent with many choices at each location that participates in the all day dinning.\nShow less"], ["Reviewed January 10, 2018", 3.0, "Family was not overly impressed", "We had been to Disneyland, Belmont, and the San Diego Zoo just prior. Overall was not overly impressed, cost of entry was high, there are a few amusement items, and very little relative to the sea and marine animals. The teenagers were bored after 3 hours, and we all spent less then half a day. The Dolphin and Orca show remain highlights. Would have liked more marine animals and information, and less amusement park. This placed a distant 4th out of the attractions.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Seaworld is amazing", "This was our second trip to Seaworld San Diego in the last 5 years and still find it amazing. Traveling with 13 and 11 year old daughters also a 1 year old son we all found plenty to do. Great rides amazing shows and my daughter's can't stop talking about their swim with Belugas.\nCan't say enough great things about Seaworld had so much fun had to upgrade to get a second visit in on our trip. Been to Orlando as well and same thing. Next summer going to check out San Antonio. Coming from the Canadian prairies we truly enjoy seeing sea life up close. Keep up the great work Seaworld looking forward to our next visit.\nShow less"], ["Reviewed January 10, 2018", 3.0, "Very good if you are there first time ...but tough to keep you enthused, or coming back", "With the killer whale shows out, there are hardly 3 live-shows that make it worthwhile visit the park. No doubt it that this is so good for millions, even sacred that annual passes sell in thousands but here it is - the dolphin show, Orcas live, and Sea lion/otter show are the only attractions. They get filled up so much so fast that only to see them people stay back to do 'something' to fill that wait time - that is how it is .. the map does not show the cablecar in it but DONT MISS the bayshore drive - truly worthy !! if you dont mind the cost per head, the interaction with Dolphins and Pilot whales might be a great choice.\nShow less"], ["Reviewed January 10, 2018", 5.0, "WE LOVE SEA WORLD!", "We have season passes and we go quite often. I especially love it during the fall and winter season, Christmas Celebration is awesome! It's fun year-round and my grandson loves it. It's always clean, the food options are awesome, the rides are fun for young and a few for older as well.\nShow less"], ["Reviewed January 10, 2018", 3.0, "Not what is used to be . . .", "There are fewer animal exhibits and more rides. I wish they were more focused on being and Aquarium or Marine Sanctuary. It seems to me they are more into becoming a Theme Park. We have Belmont already. The changes they have made for the animals seem to be good ones, I loved the Killer Whale viewing tank! They were all so lively, swimming around and playing naturally. The Penguin enclosure and Shark tanks are outstanding. More of those areas would be great!\nShow less"], ["Reviewed January 10, 2018", 5.0, "Educational and Entertaining", "Great for the kids and adults alike. Make sure you're really ready for the \"splash zone\" (i.e. bring towels, cover your cell phones, ponchos are useful). Sad to see the Orca show relegated to a lot of videos, but SeaWorld is trying to change to assuage the uniformed Blackfish proponents. Look forward to the new rollercoaster ride.\nShow less"], ["Reviewed January 9, 2018", 2.0, "I wish it was as great as I thought it was ....", "The park closes early in the winter 6pm. The whale show was great and so was the Arctic part of the park with the penquins, but other than that it was sub par at best. The rides are more for little kids and it leaves the older ones wanting for more. The park food stands (in the winter - half are closed) and the food is stale and cold. Clearly not worthy of the price they charge. The dolphins are always cool but the Christmas show with the dolphins was not great it needs work ...... the park needs a major facelift in every aspect, even the employees needed a better outlook. I came, I took my kids but if I never go back to Seaworld, I won't be upset. Kinda sad to say.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Great Place", "So much to see and do. We visited around Christmas so the park was Christmas themed and we loved it.\nOf course the Dolphin and Orca shows are a must, but you can feed seals and get up close with the animals.\nDon't go to the park for the rides,they aren't great if your kids are teenagers,more suited to little kids aged up to 10.\nMy only negative is some of the staff,they were rude and not very helpful when we asked for directions. Another negative was being told we could store our backpack at the Manta ray ride only to get to the front of the queue to be told no,we had to line up again after we stored the back pack.\nShow less"], ["Reviewed January 8, 2018", 5.0, "An educational family experience", "Sea World has gone to great lengths to emphasize their nature preservation activities, and their shows are more in tune with that than ever before. The educational opportunities are very good, and their animal rescue efforts are commendable."], ["Reviewed January 8, 2018", 3.0, "A little tired now!", "Seaworld was worth a visit but the whole complex is looking very tired and could desperately do with modernising. The animals were comfortable but viewing was not that great. I think there was not a lot of value for money for a family to visit here sadly.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Great to see their research efforts and cute animals.", "It was cool the emphasis they put on the research they do all around the park. Their big message of conservation hopefully inspires the younger generation visiting. I loved the new Encounter show. It really showed how magnificent orcas are and how important it is to do research on them in order to help the greater population against current and future problems us humans will cause them. Love watching the cute otters as always.\nShow less"], ["Reviewed January 7, 2018", 5.0, "SeaWorld is not your enemy", "We hadn't been here for 30+ years and heard of the improvements made following the documentary. Really its been SO long since we had been here I cant really remember the way it used to be, but Im told its very different now.. Clearly they are focused on the conservation angle and are working hard to turn the image around. They still do a Killer Whale show, its short and nobody gets into the water with them. When ever you have something like this, naturally people get upset, I DO NOT like zoos or aquariums generally, unless they can act as a sanctuary at the same time. One should remember the animals at SeaWorld are unfit to be released into the wild. With that I feel they are as well cared for as one could hope for any animals in captivity. With exception of places like the great \"Wolf Haven\" The shows are very well done. BY FAR are favorite show was the Pets! We had a REALLY good time! There is SO much to see and do here it really needs at least a day.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Thanks for the Tickets!", "Thanks for the free tickets, Sea World! As a local vet, they give us 1 free ticket a year for us and our families. Thanks - thats awesome!\n\nWe have been previous season pass holders, but we got burnt out when they had all that construction going on.. then the controversy with the whales and what not.. but this year when I saw the Vet thing, we signed up.\n\nStill a little unsure, even with free tickets, we literally waited until the last day to use them. We went at dusk..\n\n... All that construction was finished and it was beautifully lit up at night! Each palm tree wrapped and lit - there was still an area with construction, but not as bad as I remember it previously.\n\nOur whole family had a good time, we even are discussing getting family passes in 2018 again..\n\nThanks for the free tickets! See you in 2018.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Fun filled activities", "The park wasn't packed when we visited which made the experience better. There are multiple things to do such as animal shows, feeding the animals, rides and so on. Don't miss the sea lion show. Seamore and Clyde are the best entertainers."], ["Reviewed January 6, 2018", 3.0, "Low end amusement park", "Sea world is due for a major upgrade. At $90 per ticket you would think they would be cutting edge and have many new attractions but it seems they haven't spent a dime on the park itself since the 70's. One of the 2 roller coasters was shut down and they are building a new one. The artic exhibit was fantastic.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Day trip well worth while", "After 2 full days at Disneyland I thought this would be too much on the third day however as it was booked and paid for I hardened up and went along with my wife and 3 children.\n\nThe tour company bus and driver were comfortable and most helpful so this made the experience start and finish well.\n\nNo long waits for rides was a great and well accepted change from the previous 2 days and all exhibits allowed you to get up close and personal to all animals without harming them in any way.\n\nMost enjoyable day.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Great Experience, comparable to Orlando!!", "My wife and two teenage children went in December. It was a tad bit chilly but then when the sun went down, it was cold. I was glad I had my jacket. The food was great, the shows were great. Loved the tower ride that takes you up and around slowly that allows you do see all of sea world and some of San Diego. Also loved the sky ride that was great! Would have gotten on some of the water rides but because it was cool, I would not have dried off if it was hot. Loved the fact that Sea world had the meal plan which was well worth the additional $20 per person and then be able to eat for free at participating restaurants. Loved the Christmas decorations and the Birth of Christ from the animals perspective show. What a way to close the experience!!!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Fun Rides!", "My girls are starting to be daring with rides and who knew Sea World was the place to be. We did this 2 times during our week because we had so much fun. Our Go Card let us come back in our set price. Shows were great. Crowds were non existent in the morning and yet again later on at night. The Manta was a great thrill ride! I know it is not PC to like a place like this but we loved it!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Holiday SeaWorld!", "My boyfriend and I went for a pre-New Year's Eve vacation. We had a ball! The beautiful Christmas and holiday lights were so festive and fun. We felt like kids again. We're both in our 60's and still hard-working people. SeaWorld provided us the opportunity to enjoy our time together in a learning/viewing/experiencing venue!\nThank you, SeaWorld! Keep up the GREAT work. We appreciate you!!\nGio & Jim\nShow less"], ["Reviewed January 6, 2018", 4.0, "Great day to spend an entire dah with kids!!", "The Sea world is huge. Needs an entire day, of you want to do it completely. Take a stroller if you are with a toddler. The whole place was so vibrant and filled with all sorts of people. Lovely kids enjoying. The whole place was decorated with Christmas lights. So festive. Watch for the shows, especially, the Orca and dolphins.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Another great day at Seaworld!", "We visit Seaworld at least 6 times a year. The park is great, the staff are friendly and helpful, and there is plenty to do for everyone. The food is very good and you will have to wait in line sometimes so I do recommend the all day dining passes if you plan on staying all day. The rides are fun and we can't wait for the new roller coaster to open up this year.\nI miss the Shamu show, but the Orca Encounter is informative and educational and fun to watch. The other shows are awesome as well, but the award goes to Biff!! Always does an amazing job entertaining us before and during the show. My son and I will see the show at least 2 times each visit.\nSeaworld does so much for marine wildlife, its sad how so many people talk trash about this place because of that movie that was put out. They need to come here and see that these animals aren't mistreated and are given the best care available to animals in captivity.\nThank you Seaworld, keep up the good work!\nShow less"], ["Reviewed January 5, 2018", 5.0, "So grateful for sea word", "Every year sea world grants four admission tickets to veterans. It is their way of saying thank you. Every year we go and every year we enjoy ourselves. It is literally the highlight of the year for me. Rides, shows, fun and if one is fortunate, you could pet a dolphin. Awesome time for all ages!!\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great place for family and combination of education and entertainment", "I grew up with Sea World literally in my backyard. Feel it's gotten a bad rap lately due to the whales, and that its animal research and rescue have not been emphasized adequately. They are working on that. The botanical displays are as engaging as the sea life exhibits, and the animal demonstrations and shows are tastefully done to demonstrate the intelligence of the sea creatures. Plenty of rides and play experiences for young visitors. Wish they would return the pearl divers...made for a great souvenir of the day and was always fun to watch the dive and open an oyster for our out-of-towners. The place is magical after dark; recommend planning a visit to be there then.\nShow less"], ["Reviewed January 4, 2018", 4.0, "SeaWorld visit", "I went to SeaWorld this past Saturday and had a pretty good time. I rode on Manta which had a 20 minute wait when I went but over an hour later in the day and it was an awesome launched family roller coaster in fact it’s probably my favorite family coaster I’ve ever ridden. Journey to Atlantis was closed and Electric Eel is under construction as of when I visited so I couldn’t ride those when I went but both look fun. I also visited most of the exhibits the highlights other than the Orcas and Dolphins were the sharks and Sea Turtles. Crowds were not bad early but later they got worse as expected on a Saturday. Overall I enjoyed my visit but I wouldn’t return here without the San Diego Go Card.\nShow less"], ["Reviewed January 4, 2018", 5.0, "First time Grandma and the kiddos!!", "WE HAD A BALL! The place is just lovely. Clean and beautiful facilities! Friendly and wonderful staff! Great food and snacks. Easy to navigate. Fun shows! We just loved it!"], ["Reviewed January 4, 2018", 5.0, "Day at sea world", "The whole family went to Sea World 4 adults 1 child. Generally a very interesting place obviously the topic of the Sea. There were many areas of interest as we are all into animals and sea creatures the like. We saw all the shows from Dolphins,Whales, Sea Lions, Seals and Otters what amazing intelligent animals and although enclosed and performing you could see the animals enjoyed it as much as we did. The rides are generally aimed at the youngsters although there were a couple of adult rides like Manta and the Rapids. Plenty of restrooms plenty of staff and overall great experience. I'd say it's more a educational park than anything else and we enjoy that type of park.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Amazing shows", "My favorite is the dolphin show. Just amazing how well these guys can be trained. Good show to see while in San Diego."], ["Reviewed January 3, 2018", 5.0, "Granddaughter 1st Trip", "The Park was clean and fun! First trip for granddaughter and she had a wonderful time, enjoying the Otter Show and rides! Park personnel were helpful and friendly. Thank you for a wonderful day!"], ["Reviewed January 3, 2018", 5.0, "Beluga Kisses", "We did the beluga whale encounter and loved every minute of it! The water was nicely cold but as soon as the first whale approaches you forget all about it. It was an incredible experience and well with the money."], ["Reviewed January 3, 2018", 5.0, "Much Love for SeaWorld!!", "Don't judge by the extremist \"Blackfish\" noise makers. This is the second year that we've renewed year passes to SeaWorld. It is a beautiful place to visit and there is a lot to do, aside from the shows. Christmas decorations were gorgeous here, Halloween was fun and the few rides are worth revisiting (except for Ocean Explorer, which I can't even believe was given the go-ahead - so boring for even todlers!).\nThe $1 to rent a locker to ride the Manta roller coaster is kind of lame too.\n\nI hadn't come much since a kid in the 80s. Since then, SeaWorld has really cut back on the number of animal shows and really wants to get the message out of how much they to to preserve and save marine life along the California coast and elsewhere. Without SeaWorld, so many seals, sea lions and other cool animals in need of help would certainly be hurting.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Can't get enough of the shows", "Go to all the shows!! By far the best part. The sea lion show was my favorite, the behaviorists and animals were so entertaining! And here's a tip: show up early to this show because there is a pre-show that is too much fun!"], ["Reviewed January 3, 2018", 5.0, "GLAD I CAME BACK", "Yes, I saw the movie Blackfish and stayed away from SeaWorld for years. But I decided to venture back and was so glad I did. My husband and I went on a slow tourist day, the weather was beautiful and it was beautifully decorated for Christmas. We were there before it opened, got a very close parking spot and practically had the park all to ourselves. I don’t care for rides, so we focused on the shows. They were all terrific. I saw caring trainers and well maintained facilities. Living on a beach in San Diego, I have seen many times the rescue work they do with the sea animals showing up on our shores in need of help. SeaWorld is fun to walk around. Great displays, beautiful flowers and plants everywhere. The new display with the Beluga whales is fabulous. I love there are ponds where the kids and adults can actually touch some fish and get so close to nature. There is a great playground for the kids to let off energy and give the parents some down time. The only ride we did was the gondolas. It’s just a nice view of Mission bay. See the shows but make sure you heed the signs about getting wet. They aren’t kidding. Every show that includes warning signs about splashing had people running from their seats AFTER they got soaked. Don’t make that mistake. Decide first if you want to be wet, then carefully select the row in which you sit. There are restrooms everywhere, and they were spotless. Plan a day of lots of walking, but there are lots of benches to take a break. It’s a great day for all ages.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Take in all the shows!", "First of all, make sure and get the unlimited meal option. You're going to spend two meals at the park and for 2 people, one meal is at least $43. Second, plan your walk around based on the shows. They are magnificent! Our 10 month old loved the Shark Experience.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Serious conservation and rescue efforts plus educational experiences", "Visits to San Diego Sea World are a routine opportunity for us. We love visiting the belugas, walrus, penguins, flamingos, dolphins and orcas up close. The encounters remind us that we can see and appreciate wildlife that is cared for and protected close to home. The walkways and gardens provide peaceful walks among the crowds while also enjoying the beauty and fun educational experiences. As season pass members, we often drop in for a couple of hours to remind ourselves that excellent work is being done behind the scenes that impacts the world around us.\nShow less"], ["Reviewed January 2, 2018", 4.0, "Funfilled day. Must visit for family with small kids.", "We went to Sea world in Dec 2017 during the year end vacation. My family (wife and 2 daughters 8 and 9 years) spent a day. Thankfully the weather was great. For someone from east coast vacationing in west coast this was almost like summer . I was concerned about the crowd and queues. Was contemplating whether to buy the pass for front of the line or vip passes. But then decided we will go in and then decide. There was lot of crowd but we arrived early. Google search showed the timings as 10am to 5pm. But I thankfully checked on the website. It was open from 9 am to 9pm. So we knew we had enough time and we also told ourselves that we will take breaks in between. We arrived at 930am. The map and all the details they included in the handout they gave along with the ticket was very helpful. We noted the show timings and made sure we planned our rides to ensure we arrive for the shows 30min in advance. The sea lion show was getting filled up pretty quickly. Even though we arrived 30min early we got the last seat. I loved the manta ride and the orca encounter show the most. Food was expensive but felt much cheaper compared to Disney and Universal studios. When we arrived we saw boards stating that the Atlantis ride was closed for maintenance. So we had to start the day at sea world with that disappointment. If you are expecting thrill rides then Manta is good. I didn’t find any other ride as thrilling. My kids played around in several other rides. The lighting in the night and Christmas theme based performances were very good.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Awesome sea lion show: OUTSTANDING", "This place is pretty cool. The dolphins were awesome to watch, just as the orcas. However, the gold medal goes to the sea lion show. The hosts for this show were OUTSTANDING. I recommend attending his show if you attend only one show."], ["Reviewed January 2, 2018", 5.0, "All inclusive admission pass was totally worth it!", "Consider the all inclusive admission considering how expensive everything is here it's worth the extra money. A lunch easily costs $30. We reccommend the pizza restaurant. The desserts at the AI restaurants were disappointing. I was happy to see they only served cardboard straws. The free picture with the AI pass made great souvenirs.\n\nWe also upgraded our parking pass, for $5 more you get up front parking. Regular parking was expensive.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great place", "Sea World is a great place, it is educational and entertaining. The new killer whale exhibit is very nice, and it helps people to understand the whales and interactions with humans and the ocean.\n\nThe rides are fun but they need more of them.\n\nThe only bummer is $17 to park, on top of the ticket price, not frendly, I suggest Uber.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Magical", "the vast amount of animals to see - and get really close to - make sure you spend the whole day there!"], ["Reviewed January 1, 2018", 5.0, "Another all time favorite!!", "I have to admit, I was surprised how it has changed over the years! I am not so enamored with the rides they added to the park, but then again I was here for the animals! But for those who enjoy rides, there a some at the park!\n\nThey have a good variety of sea life at the park. Several exhibitions are \"hands on. You can touch several variety of small sharks in display, as well as sting rays, and other wildlife, which is great for kids of all ages! They have several different exhibits.\n\nHaving seen the film Blackfish I am aware of the huge controversy surrounding keeping wildlife in artificial settings, and especially having humans interacting with marine life. I am terribly torn. SeaWorld does a spectacular job of creating natural environments for the various creatures! Their Killer Whale show has been changed as a direct result of the attack by Tilikum. The humans no longer enter the water with the Orcas. It is still a spectacular and educational show that all visitors should see!\n\nPlease keep in mind, that despite the controversy , SeaWorld has done far more good than bad. SeaWorld has been responsible for the huge amount of public education involving marine life! A large amount of research being done today, a largely due to SeaWorld around the globe!\n\nA must see if you are down by San Diego!!\nShow less"], ["Reviewed December 31, 2017", 4.0, "Not what we remembered", "The dolphin and orca shows were fantastic. We got soaking wet and cold in one of them, but it was an unique and awesome experience.\n\nThe rest of the park felt small and rundown compared to what we remembered (we were here more than 10 years ago). It was the coolest of the San Diego destinations and we couldn't finish all parts of it in one day. It now resembles more of a county fair than a theme park and we were bored by sundown.\n\nDon't trust the posted ride times. Everything was a 5-min wait but turned into 15-30 min wait.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Lots of family fun!", "The map isn't as helpful as you might expect. We kept getting lost by walking in circles and had a hard time finding bathrooms when we really needed them."], ["Reviewed December 31, 2017", 3.0, "Everything Changes", "In the face of recent controversy Sea World has changed it's shows. Hopefully, it benefits the animals, because ti's not good for the people that pay the big bucks for a day here with the family. There were very few \" shows', two we went to, and they were more educational content than entertainment. The other attractions were nothing to write home about. Former large shows were non-existent. I've been to Sea World many times, both here and in Florida and this was the only time I've been disappointed. The Clyde and Seamore show was the highlight, it always is. Hopefully, that doesn't change.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Busy but not too crowded Dec 26", "We arrived early and were able to do most everything by 3pm. Some of the later shows filled up but we were never turned away. Sea World does a very nice job with decorations for the holidays. Two times we were turned away from the Atlantis attraction due to mechanical issues. Once around 3 and again at 530. We made it to the front of the line at 530!\nShow less"], ["Reviewed December 30, 2017", 2.0, "Dirty!!!", "I was really disappointed at how dirty it was. This particular park I think is more directed to toddlers. Not much to do for teenagers. The restrooms were dirty and disgusting. No staff cleaning them. I also think that the rides were a little unorganized and staff had no control.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Love me some SeaWorld", "I love SeaWorld and this was my first time visiting the one in San Diego. They don't do the Orca show anymore, but they have plenty of other attractions and wildlife to see."], ["Reviewed December 30, 2017", 4.0, "Fun place for all ages", "My wife and I enjoyed seeing the dolphin and orca shows, not to mention the sea lions and other sea creatures. We opted for the all day dinning for extra $20 each and it is well worth the price. From breakfast to dinner, you can eat full meal, including dessert and drinks (non-alcohol) every hour. The ribs at the Calyso Smoke House are quite delicious, shrimp tempura at Pineapple Pete's are quite tasty, and ginger soy salmon and shrimp cerviche alone are worth the money spent on all day dinning. The wait on the Bayside Skyride was a bit long but well worth the wait. Overall, a great place to visit for about $100 per person, including all day dining and parking..definitely recommend Seaworld.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Always a great time", "We are season ticket holders and live in Arizona. We really enjoy every trip to Sea World. It is a great educational experience for all of us. If you go during the winter being spare clothes in case you get wet. We are excited for the new Electric Eel in summer of 2018\nShow less"], ["Reviewed December 30, 2017", 5.0, "A Sea World that is actually by the ocean!", "Having been to sister parks in Orlando an San Antonio, we were pleasantly surprised by this park's close proximity to an actual sea. Several of the rides are in fact right on the bay. Like all the other parks in the chain, Sea World is immaculately clean and beautifully themed. There aren't a ton of thrill rides like at Disney, Knott's, or Universal, but the shows and aquarium exhibits more than make up for it. We bought the quick queue passes but didn't really need them except on the rapids ride. After a few days at Disney, the slower pace at Sea World feels like a vacation from vacation.\n\nThere are plenty of rides for small children and an adorable Sesame Street area. Older kids and adults will love the marine aquarium exhibits. As I mentioned there are few thrill rides but the quality more than makes up for a lack of quantity (plus they are adding one more coaster in 2018). A ride on Manta alone is worth admission. There are two very good water rides as well, a rapids ride and the incredible Journey to Atlantis which mixes a log flume ride with an indoor roller coaster.\n\nThere are a lot of cute shops, though the merchandise is pretty generic across all Sea World parks, nothing to really distinguish San Diego from San Antonio from Orlando. We didn't do any shows this time as all of the theaters are outdoors with very limited protection from the sun, something unique to this park.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Super fun- kids loved it!", "Kids had a blast. They loved seeing and learning about the animals. Lots of hands on activities Lots of food options- my kid actually ate their Mac and cheese! Holiday theme was fun."], ["Reviewed December 30, 2017", 5.0, "Highlight of our trip to San Diego", "If you have kids then SeaWorld is a must do attraction for San Diego. The rides and shows are truly amazing and our kids had a wonderful time. We bought a 3 day San Diego pass and visited the Zoo and Legoland too.\n\nTry to reach early in the morning soon after the opening time so you have enough time to cover all the attractions. Go to Manta rollercoaster in the morning when there is no rush, it is a fun ride. There is a Manta ray pool nearby where you can touch the rays. Another must do ride is Journey to Atlantis, make sure you are wearing a poncho or quick dry clothes, you will get wet. Shipwreck Rapids is also a fun water ride. Other rides are all ok.\n\nAmong the shows - Orca encounter is very informative, Dolphins show is a lot of fun and the Sea Lions is funny and entertaining. Do not miss any. We went around Christmas time and they had a new show called \"O Wonderous Night\", it was spectacular and definitely recommended.\n\nIn December, it was sunny throughout the day but became quite chilly in the evening, carry jackets if you're planning to stay after 5PM.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Plan your day around the shows", "We started out by riding the sky tower and then going straight to the Orca Experience early to get seats. By the time the show started, they were turning people away because the stadium was full. Same thing with the dolphin show and the sea lions. So unless you are just going for the roller coasters, check the times for the big shows when you get there so you don't miss them.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Seaworld’s cool", "Been to SeaWorld here and in Orlando before. As usual you get a great experience for your dollar. Great shows, great attractions, good shopping (if you like it) and good rides."], ["Reviewed December 29, 2017", 5.0, "Wavesofhonor! Military Thanks!", "Thank you SeaWorld for continued support of military and their families through the Waves of Honor program. You really make it affordable for us to visit your park."], ["Reviewed December 29, 2017", 4.0, "Kids favorite", "I felt little bit bad for dolphins and whales as they did not seemed to have enough space. But it was interesting to see those wonderful creatures.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Nice place", "Depending on the day and time you go it can be really crowded. There are lots of activities for kids to do. They now have a lot of amusement park rides but there are still plenty of animals to look at and touch. Like any amusement park the food can be a little pricey.\nShow less"], ["Reviewed December 29, 2017", 4.0, "CHRISTMAS SEASON AT SEAWORLD", "We took advantage of our Veterans Admission Program to again visit Sea World on 12/28 and the park was dressed in its Holiday finest.\nThe park was packed and made for a less than enjoyable visit. Starting with the entry into the park, which was miserable. All 12-ticket booths were open, but with allowing that many cars in it made for a bottleneck, All 12 lanes were funneled into one lane. From the time we arrived at the ticket booth to the time we entered the park was over 30 minutes. Sea World needs to work on the traffic flow if they are going to have all booths open.\nOnce you arrive at the entrance you must go through security, this time I noticed K-9’s being lead around, which I did not notice last year when we visited. After entering the park proper, there are numerous touch pools where the kids can experience sea life up close.\nWe were only in the park for a little over 3 1/2 hours but were able to see the following\nWild Arctic ride and exhibit (Polar Bear, Walrus and Beluga)\nPenguin Encounter (Penguins)\nTurtle Reef (Sea Turtles)\nShark Encounter (sharks)\nFresh Water Aquarium\nSalt Water Aquarium\nAquaria “World of Fishes”\nTide Pools\nAnd finally the rebranded Shamu Show now known as Orca Encounter.\n\nThere are also a couple of coaster rides that are available at the park, Journey to Atlantis (Closed when we visited) and Manta. There is also a water ride, Shipwreck Rapids, where you WILL GET WET. They are also building, to be open summer 2018, the Electric Eel, looks to be a large roller coaster type ride.\n\nWe did not eat in the park so cannot comment on the quality nor cost of the food.\n\nPros:\nPark is very clean\nTouch tanks for the children\nAnimal Encounters\nFriendly staff\nCons:\nCrowds – try going not around major holidays\nParking $17/vehicle (including motorcycles)\nNo outside food can be brought into the park\nOverall, still a pleasant way to spend a nice afternoon in San Diego.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Our USA honeymoon", "We enjoyed every single second of being here! Aussie honeymoon couple touring the USA and we absolute loved SeaWorld! We will be back ! 💜"], ["Reviewed December 28, 2017", 4.0, "Got the one year pass", "For $20 more than a single day pass, we got unlimited visits through 2018 - it was a good deal (although parking is $17/day).\n\nOur favorite ride is Atlantis & we also like Manta. The orca show is ok, dolphin show is good. Skip the Wild Arctic ride, but walk through the exhibits.\n\nThey are definitely nickeling and dimming guests ... pay $3-5 to go to front of line (one ride, one time) or $ to dine near orca’s or $ for an up close & personal experience.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Great Christmas Show!", "The O Wondrous Night show was great! We really enjoyed the use of puppets and live animals throughout the show. See it before it's gone! The use of colored lights around the park enhanced the Christmas Season theme. We just wish the park was open longer. Overall, we had a great day at the park!\nShow less"], ["Reviewed December 27, 2017", 4.0, "Christmas visit", "Had a great time only too cold after dark saw the sea lions whales dolphins otters show went on the roller coaster"], ["Reviewed December 27, 2017", 5.0, "Fun Place", "A great fun place for the family. A place where people will be made aware of nature and animals. This park is a place I love to visit over and over again. Don’t miss the Tower Ride in the Park. Awesome view from the top!"], ["Reviewed December 27, 2017", 5.0, "Better than I EXPECTED.", "Went here with the So Cal city pass. I wasn't expecting much from sea world. I just went because it was on the City Pass. I ended up having a great day. The shows were good and the rides were fun as well."], ["Reviewed December 26, 2017", 4.0, "Nice place", "If you care more about an amusement park type visit then this is a great place. If you care more about an aquarium feel then you should visit the Birch Aquarium. The food is really expensive so it was cheaper for us to buy the dining plan online. Our toddler had a great day exploring and feeding the different animals. It would have been worth the price if we could have ridden the roller coaster but with 2 small kids we only looked the fish.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Fun day with no crowds", "Given the time of year that we went (right after thanksgiving) it was a great time. There were no crowds so we could ride any ride we wanted with no lines, were able to see all the shows, which are really incredible and got to get up close and personal with the dolphins in the dolphin experience. This park is smaller than I thought and I would not want to be here when it is really crowded, but our experience was excellent.\nShow less"], ["Reviewed December 25, 2017", 3.0, "Attraction which is “dated” and more suitable for young kids like pre-schoolers. Not worth the tickets", "Brought my 8,10 year old and arrived with great expectations. The upside is that The Orca show was great and we can see that orcas are well taken care of. Love the white beluga whales as well in its own aquarium..\n\nNow for improvement areas : The rides - they had seen better days...Even my 8-year old finds the ride boring. This is Christmas so maybe they are understaffed. Each ride only has 1 staff manning the ride - including verifying the headcounts, doing the safety check on the belts then run the ride.\n\nAs for the rest of the exhibits and facilities, we feel it deserves more than new coat of paint. In order to catch up with other theme parks, SeaWorld has to rethink about how to attract visitors because clearly sticking with the same formula that used to worked 10++ years ago isn’t going to take them very far ...and certainly not worth the expensive tickets!!!\nShow less"], ["Reviewed December 24, 2017", 3.0, "Disappointing second visit", "Second and last family visit with two young kids. Food very overpriced and very long lines. Even if you get the meal plan, still adds up materially. Consistently long lines at all restaurants, e.g. half an hour or more. Restaurants were very understaffed despite holiday vacation season. I wonder if the long restaurant lines are intentional to deter meal plan holders from excessive consumption.\n\nThe shows are trying too hard to convey a \"conservation\" mentality following the Blackfish documentary damage on ticket sales.\n\nCompared to the total acreage of the park, there are few rides and too many shops and stands.\n\nThe shows are a bit sad. I bet that in 5-10 years there won't be any orca or dolphin shows.\n\nOverall disappointing visit and won't return. Save your money and attend one of the other fantastic parks in the area, e.g. Legoland.\nShow less"]]}}