{"Seventeen Mile Drive": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Seventeen Mile Drive", "url": "/Attraction_Review-g32172-d565016-Reviews-Seventeen_Mile_Drive-Carmel_Monterey_County_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/77/3e/60/oldest-cypress-tree-on.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2894"}, "address": {"@type": "PostalAddress", "streetAddress": "Pebble Beach and Pacific Grove", "addressLocality": "Carmel", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 3.0, "It's okay", "If you're from the South Island of New Zealand, you've seen it all before. But a nice drive to take nonetheless."], ["Reviewed 1 week ago", 4.0, "the Drive", "The drive is Beautiful drive; can be cold. We went on a Monday, cold wind and Parking at Lone Pine was hectic. We skipped it."], ["Reviewed 1 week ago", 4.0, "Worth the drive", "We entered from the gate at Carmel. Easy to follow road and interesting. Favourite stop was the Lone Cyprus. It was nice to view the homes. The beaches at the end toward Monterey were very nice."], ["Reviewed 1 week ago", 4.0, "Nice drive.", "Some lovely picture opportunities. You need CASH though to get in; we had to drive back into the town to get some out!! Great beaches and lovely looking houses."], ["Reviewed 2 weeks ago", 5.0, "Beauty and the Beach", "I haven't driven the 17 mile drive in over 30 years and my return was as awe inspiring as the first time I did it as a 14 year old girl. Every stop is worthwhile. This definitely proves there is a God."], ["Reviewed 2 weeks ago", 5.0, "Golfers paradise", "Drive down scenic drive to see famous Pebble Beach golf course, Spy Glass hill and Cypres point golf courses. Stop for lunch at Pebble. Great resaurant."], ["Reviewed 2 weeks ago", 4.0, "Beautiful drive", "We had a wonderful time driving the 17 mile drive. Be sure to download the online map so that you will know where the stops are and what they are all about. I believe they also gave us a map only paid our entry fee. There is an entry fee, I think it’s $10 but well worth the cost. The highlight of our trip was stopping at Pebble Beach and seeing the iconic golf course. Enjoyed going into all the little shops at the pebble beach resort and picking up some souvenirs.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "its 6 stars for view, 3 for level of busy and late of places to stop!", "Was there for the AT&T this past weekend - it has glorious views, and maybe on a quiet weekend (is there one in Carmel?) i would give it all 5 stars... but it was too busy for me"], ["Reviewed 3 weeks ago", 4.0, "BAUTIFUL VIEWS", "This is one of most beautiful drives along the coast, when you enter, you are given a handy guide that explains the \"turn out points\" and there are nice description signs for more information about the history of this stretch of coast....in addition to seeing the unbelievable homes. It's worth taking the time to enjoy the sights.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Worth Doing Once", "Beautiful views, amazing homes, classic Coastal California. Only downside is that it costs $10.50 to drive thru."], ["Reviewed 4 weeks ago", 5.0, "Best part of our trip", "We did not know what to expect but what a lovely surprise. What a beautiful place. The sea views are amazing !!! My husband was so happy to see the pebble beach golf course. We stopped along the way and took many photos. Don’t miss this ...\nShow less"], ["Reviewed 4 weeks ago", 5.0, "World class scenery", "17 mile drive is a spectacular journey along the California coast. There are plenty of places to stop and soak in the coastal views. Pebble Beach, Spyglass and Spanish Bay are all accessible for food, drinks and seeing how the 1%s live. Worth the time to explore this drive.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A look at the top 1%", "We did this drive after driving 80 miles of the Big Sur, so weren’t overwhelmed with views here, but they are very nice. It was fun to see the homes of the rich & famous."], ["Reviewed 4 weeks ago", 5.0, "Great drive, if you don't take the drive you will never know what you missed.", "Great view of the ocean, beautiful homes and two great golf courses. Stop for lunch at one of the golf courses and great bloody- mary."], ["Reviewed 4 weeks ago", 5.0, "A must", "We rented bikes in Monterey and biked most of the trail. Easy bike for families with great scenery. No coffee shops on the trail but there are facilities on the way"], ["Reviewed January 24, 2018", 4.0, "Nice drive with great views", "Done this drive many times and it is beautiful. Take your time and enjoy the scenery. Pack a lunch and do a picnic."], ["Reviewed January 24, 2018", 5.0, "one of the beautiful drives in california !!!", "Seventeen mile drive is a must do when in the region. It's a treat to the eyes. Great spots on the way to take the photos."], ["Reviewed January 22, 2018", 2.0, "Nothing spectacular- cost $10.25", "This drive is not that well marked and it's easy to get off track. Restricted viewing in most areas. Good way to see a little of the golf courses. So many other things to see where you can access the beach/water etc . Won't do again.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Always a nice drive", "Been on this drive a few times. Always pretty. Always relaxing. We were lucky the weather was just perfect. If you’ve never been on this road don’t hesitate. Try it. It’s worth the entry fee!"], ["Reviewed January 20, 2018", 5.0, "Sightseeing", "Gorgeous drive but very winding. Plenty of stunningly beautiful ocean view with pull-outs. Short drive from Monterey/Carmel/ Pacific Grove."], ["Reviewed January 20, 2018", 5.0, "Incredible", "If you really enjoy driving in picturesque routes, this is made for you. Don’t forget drive by this coastal route if you visit the Big South"], ["Reviewed January 19, 2018", 4.0, "beautiful drive", "we spent a late afternoon here this labor day weekend. it was a beautiful drive and we enjoyed seeing the houses and golf courses"], ["Reviewed January 16, 2018", 5.0, "Breathtaking scenary. worth the drive and time enjoying nature", "A fee payment is required at the entrance and map will be given introducing the sights. Worth visiting as the views are truly breathtaking. Recommend to take a leisurely drive or even bike or stroll around the whole length. We took many photos as each place is amazing.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Wow!", "This is a beautiful area with lots of \"oohs\" and \"aahs\". The ocean is mesmerizing. Take time to stop and enjoy the beautiful scenery...the water, sky, sea animals, landscaping."], ["Reviewed January 9, 2018", 4.0, "Iconic drive for a fee-Pros and Cons", "I had driven this drive before there was a fee (yeah…a while ago) so when back visiting the area it was (and is) a no brainer.\nPros- You can take it in all sorts of ways. You can bike (most of it), walk it, drive it, be driven in it, you can breeze through or take a whole day. It is easily marked and followed (part of the fee) and even provides an audio tour (part of the fee) and the roads and markers are well maintained (part of the fee-get the picture?) and the facilities were well maintained. The drive does offer a lot of Ooos and Ahhs even if you are not impressed with the golf course with people who pay one of my mortgage payments to shoot a round. The pics here are a good representation of what you get to see. Lastly, it really is iconic California and preserved to keep it that way.\nCons-OK…the fee. Yeah, it costs to get in but if you had thousands of tourists wearing down your streets you may want to share the load as well. Think of it like Jurassic Park, but instead of dinosaurs you have rich folk. We did not have any traffic concerns but saw all the stops for tour buses and such so I suppose it can get busy. It is pretty and all but most of it is “stop and look” kind of things. This can be nice but it can get a little boring if not allowed to explore a bit more.\nBottom line-If you are visiting and have the time to take it in…do so. While it really appeals to the tourists there is some real icons to be had here.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Spectacular and Gorgeous!!!", "I absolutely love driving around 17 Mile drive and even more, love to ride it. About 30 years ago I would ride my bike along 17 mile drive, stopping along the way often to take in the beautiful scenery. No matter how many times you're on this road, it's still awe inspiring around several turns. I would recommend taking the drive starting at the PG gate, traveling south towards Pebble Beach because it's easier to park, especially at places like Lone Cypress and the Ghost Tree. And when you motor along the drive, be mindful of cyclists and pedestrians, and take your time to stop, get out, and just sit..............you won't be disappointed.\nShow less"], ["Reviewed January 8, 2018", 5.0, "The views are fantastic!", "My husband and I took this Drive the first time on our honeymoon, 46 years ago! In December we made the drive again: STILL wonderful. The Pacific Ocean, the Lone Cypress, the Ghost Tree, it is ALL gorgeous. IF you are ever in the Monterey area, make a point of taking this drive! Make a picnic of it: The custom-made deli sandwiches at the Pebble Beach Market are so delicious!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Suer beautiful & breathtaking", "The no 1 must do list when you are in the area. marvel at the rugged rocky pacific coastline apart from the pretty houses owned by wealthy people"], ["Reviewed January 5, 2018", 5.0, "Miles of Fun", "A foggy January - probably not the best day for a visit... nevertheless, a stunning number of birds, together with seals and a deer added to the experience. All in all a wonderful 17 miles!"], ["Reviewed January 5, 2018", 5.0, "Instead of paying the gate go to the Bench for lunch and drive right through !", "Seventeen mile is gorgeous and that's no big secret... but instead of paying the silly gate fee ($17 bucks) go have breakfast or lunch in pebble beach... try the Bench for lunch and relax."], ["Reviewed January 5, 2018", 5.0, "A Must When in Carmel", "The Seventeen Mile Drive in Carmel is a must if you are in the area. It is beautiful. You will see some of Pacific Grove as well as Pebble Beach. It is just stunning. It is a drive you want to take slowly and it will take you about an hour, without stops, to see everything.\n\nThere are wonderful places to stop and take photos or a short walk or hike. Now, Point Lobos also has a great view and that drive is free, but I would still take this one, pay the entrance fee and stop in the Lodge located on the drive and you should be able to redeem your entrance fee for a meal--which is great.\n\nIt is very peaceful. During the summer it can be crowded with traffic, but you are not in a hurry so enjoy.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Lovely drive", "Just a beautiful drive by wild sea; rocks, birds, seals, several turnouts. Easy, short drive on coast."], ["Reviewed January 3, 2018", 5.0, "Adventures in Wonderland!", "Scenic drives are a fabulous activity to experience the local lifestyles. Pebble Beach, Spanish Bay and the surrounding Del Monte Forest offer breathtaking beauty of the Monterey Peninsula, by way of the 17 mile drive. Do drop in the Lodge to redeem the entrance fee for a delicious meal. I am a local Realtor and love this tour. Awesome nature at it’s finest.\nShow less"], ["Reviewed January 1, 2018", 2.0, "Touristic atractions!", "You can find the same view on Point Lobos and Asilomar beach for free and without traffic. So touristic!"], ["Reviewed January 1, 2018", 5.0, "Great views of awesome nature", "Took a drive here with family. This is a really scenic and iconic drive. I loved the coastline more than the forest and large houses. The coast is being shaped by the elements and is dramatic and colourful. We saw seals, sealions, sea birds."], ["Reviewed December 31, 2017", 4.0, "Nice views", "Nice to drive and stop along the beaches. Overall worthwhile; got better access and free in Santa Cruz West Cliffs Drive. The attendant wasn't very helpful. Quickly took our money and shuffled over some pamphlets. Took us a bit and a couple wrong turns to do most of the drive. Experience may have been better with a mini orientation.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Breathtaking doesn't really describe the views", "I'll start off saying that we only did the coastline portion of the tour. It took us about 1.5 to 2 hours with a few stops at Joe's Point, Bird Rock, and The Lonely Cypress. You can easily spend more time taking in the views, but we have a toddler. Bird Rock was a must for him to see wildlife. He was entertained by the large number of seals on the rock. We went on a perfect day with clear, sunny skies. The traffic wasn't bad at all and we were able to find parking easily. The points are well marked along the tour, and very much worth the $10.25 entry fee (not sure why many people complain, it's pretty standard for parks). If you fancy a drive with jaw dropping views (and houses), spend the time and fee to see them here.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Amazing drive and views", "This is the way to do Seventeen Mile Drive: wake up at 7 am to drop husband off at golf and then take private (uncrowded) tour of Seventeen Mile Drive by yourself. All kidding aside, the views are simply spectacular and architecture as well. Totally worth the drive. But seriously early in the morning is lovely.\nShow less"], ["Reviewed December 28, 2017", 5.0, "This is a must do if you are in Carmel or Monterey", "The view and the coastline from this drive is worth the money. There is a way to do it free, check out maps ;)\nThis world famous golf course and beautiful drive is worth the money, and you can go more than once for the entry fee. Enjoy!\nShow less"], ["Reviewed December 28, 2017", 5.0, "Gorgeous and easy deove", "You can’t go to this part of California and not do this drive. Bring a camera! A photographer’s dream! Never seen such big waves in North America like this."], ["Reviewed December 26, 2017", 4.0, "Wonderful Coastal Views", "A nice way to spend a couple of hours. The first half of drive was quite boring, driving through an older pine forest. Once you get to the coastal side, there were beautiful views of the rugged Northern California coastline. Also, this drive is a must for golf lovers, with views of several famous PGA courses. Towards the end of the drive, you can stop and wander around the Pebble Beach Golf Club, including several excellent restaurants.\nShow less"], ["Reviewed December 23, 2017", 5.0, "A nice drive", "Worth the $10. It's a nice drive with beautiful views and lots of opportunities to stop for pictures."], ["Reviewed December 19, 2017", 5.0, "An Instragramer's Delight", "Nice, low cost activity. Incredible views, plenty of places to stop for pictures. Highly recommend, however, going during non-peak travel times. I couldn't even imagine attempting to visit during the summer!"], ["Reviewed December 15, 2017", 5.0, "Who doesn't like a drive on a scenic road!", "On our way to the Pebble Beach Golf Club we indulged and took the scenic drive: the Seventeen Mile Drive. Now, this drive is not boring. Beautiful houses, and landscapes will have your head turning all the time. But what will take your breath away...is the Sea! Bring your camera, because you will take pictures to prove how beautiful this drive is. I recommend you take it either early morning to see the sun come up or mid day, when the crowd is smaller. There are places where one can get out of the car and do some picture taking. A wonderful experience!\nShow less"], ["Reviewed December 14, 2017", 5.0, "Beautiful suuny day for an enchanting drive", "The weather was perfect, and it was a delight to drive slowly along and stop at each viewpoint. We saw seals and many birds. The drive is a \"Must Do\" if visiting the Monterey Bay area."], ["Reviewed December 13, 2017", 4.0, "Fun for an hour or so, especially if you like golf", "Touring by the three golf courses is one of the highlights of the Drive if you're a golf fan. Plus you have the ability to walk in the clubhouses and buy a memento if you're so inclined. TIP: If you spend at least $35 at one of Pebble Beach Resorts restaurants, you will be reimbursed the $10.25 (cash only!) gate fee.\nShow less"], ["Reviewed December 11, 2017", 5.0, "A great way to spend a morning or afternoon", "The scenic tour is a fantastic way to spend a few hours surrounded by beautiful scenery. We started mid-morning and finished up at the Pebble Beach Lodge for lunch. Make sure to stop and explore along the way!"], ["Reviewed December 11, 2017", 4.0, "Breath Taking - BUT avoid golf tournaments and festivals!", "We should have done more homework before our visit. We toured Seventeen Mile Drive in our own car, on a weekend with a busy golf tourn AND fall art festival. Unfortunately, the tour buses, traffic and crowds hindered photo ops. You do NOT need to book a tour or get on a bus to see 17 Mile Drive. Our gate fee was only $10. The vistas were amazing. Mile markers were well described on the map. So much to see for all ages (golf courses, landscape, stunning homes, sea lions, celebrities, iconic landmarks, blue ocean waters). Bring food and plenty of water and use the restroom before you enter the gates.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Stunning!", "Worth the $10 USD. By far one of the best experiences we had in Monterey, California. Go earlier in the day or afternoon so you can see all the beauty around you. Watch out for deer! There’s quite a few of them."], ["Reviewed December 8, 2017", 5.0, "Gorgeous", "This drive was incredible. So many beautiful views. The Lone Cypress, Pebble Beach, cliffs, ocean, an Absolute must see."], ["Reviewed December 6, 2017", 5.0, "Pretty Amazing Place, cool driving around, great views", "We spent so much time on 17 Mile Drive we swore that it was closer to 50 miles long! Lots of beautiful homes, great golf courses to check out and several breathtaking spots to stop and pull over to take pictures of the ocean and deer wandering through everywhere!\nShow less"], ["Reviewed December 1, 2017", 5.0, "Lily birthday trip", "Seventeen mile drive is a must do.. the sea cliffs n Ocean views were amazing. Theres maps n easy points on the map to find. U can park n check out the scenic veiws n take pictures.."], ["Reviewed December 1, 2017", 5.0, "Beautiful", "Wonderful scenery and a nice drive. I have done this several times and it is always a wonderful experience."], ["Reviewed November 30, 2017", 5.0, "Spectacular", "Can't come to Carmel without doing this drive. Amazing views. If you want to eat at one of restaurants at Pebble Beach you may want to try and get reservations. At 5:30, they had no room for walk ins so we ended up eating in Carmel\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful trip by car", "This is a must see when in the area! We thought we could do by bike, but this is a better car ride, not much of a bike lane The views are spectacular!!"], ["Reviewed November 29, 2017", 5.0, "great", "Definitely a must to do if your in the area...There is a fee of $ 10.25 to enter on either end of the drive...Worth it"], ["Reviewed November 28, 2017", 5.0, "Classic Drive", "It’s simply beautiful and breathtaking, that’s why the private homeowner’s association has an entrance fee, but it’s worth it at 3 times the price. Gorgeous seaside and seascape scenery, now I understand why so many photo shoots and commercials are shot here. Plenty of places to stop and view. Enjoy!\nShow less"], ["Reviewed November 24, 2017", 5.0, "Definitely worth the small entry fee", "Spend some time around sunset driving along probably the best stretch of road within the United States."], ["Reviewed November 20, 2017", 5.0, "A ‚must‘ do - ideally with the bike 👍🏻", "We experienced the 17 Miles drive on the bike which is extremely recommendable! Pick-up Carmel and drop-off in Monterey, take a taxi or Uber back."], ["Reviewed November 19, 2017", 5.0, "The Grand Tour of Pebble Beach", "All tourists should make the Seventeen Mile Drive. I bring all visitors to California here. It is a must see. The entire Monterey Peninsula is gorgeous from Santa Cruz to Monterey to Carmel to Big Sur. The 17 mile drive just provides a glimpse of Pebble Beach and the lifestyle of the rich and famous.\nShow less"], ["Reviewed November 18, 2017", 5.0, "Beautiful", "The only way to describe nature Wow everyone should know about this place take your bike 🚲 and go Grateful or this area"], ["Reviewed November 18, 2017", 5.0, "17 mile drive", "Carmel, Pebble Beach and then onto Spanish Bay for the sunset bagpiper, was the icing on the cake!!!"], ["Reviewed November 17, 2017", 4.0, "Expensive way to see the Pacific", "Because the landslides had closed the road south to Big Sur, we decided to pay to catch the ocean on the 17 Miles Drive. It was a pretty ride, but you shouldn't have to pay to ride through a neighborhood."], ["Reviewed November 14, 2017", 3.0, "Hyped Up", "I can only agree with an earlier reviewer that for great sights you are better served by taking a drive up Big Sur. A big disappointment with one or two memorable bits but probably not enough to justify the fee. We started early to avoid crowds and as some vista points have restricted parking I would suggest that others do the same.\nShow less"], ["Reviewed November 14, 2017", 1.0, "Save your money", "Skip it. Basically you are driving through a neighborhood for 15 miles. There are a couple miles of scenic driving, but you can see that anywhere on the coast, without the neighborhood drive. Go to Point Lobos State Reserve instead- right down the road and WAY better and more beautiful.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Must See for anyone !!", "We have visited the Monterrey Peninsula 50 times, and always drive the 17 Mile Drive. It never gets old, and it is so Beautiful and Special!!"], ["Reviewed November 14, 2017", 5.0, "One of the Most Beautiful Drives in the World!!!", "This should definitely be on everyone's \"Bucket List!\" Fantastic views can be had around every turn. Such a delightful trip. And Carmel is like the pot of gold at the end of the rainbow!!! We have travelled quite extensively and this drive remains one of my all-time favorites!\nShow less"], ["Reviewed November 13, 2017", 5.0, "weekend get away", "A beautiful drive along the coast with lots of areas to stop off at. It's a must see when your in the area."], ["Reviewed November 12, 2017", 5.0, "Majestic, it stands the test of time", "Not to be missed, Seventeen Mile Drive is a treat! The beautiful houses, fresh ocean air, roaring sound of the ocean and the lone Cypress tree - makes for a very lovely and relaxing visit! Avoid the crowd and visit during the week, stop by at one of the restaurants for a sumptuous meal!\nShow less"], ["Reviewed November 12, 2017", 2.0, "Nice tourist trap", "Hard to understand the real value of the drive! More than the satisfaction of ticking One must and driving through the area of beautiful residencies and Golf paradises. Sea views OK, but..."], ["Reviewed November 11, 2017", 5.0, "driving through after failed surfing", "A friend and I, were hoping to take a SUP lesson on the spanish beach, but the sea and visibility conditions were too rough when we arrived at the beach.\nInstead we went on a drive through the 17 miles toward Carmel.\nThe scenes are exceptional, and I recommend stopping at every chance you have and admire the view and the nature.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Interesting", "My husband, son, daughter-in-law, daughter, son and myself are visiting from the East Coast. We had to see this as they love golf. The sights were great"], ["Reviewed November 9, 2017", 5.0, "Bucket-List Place", "If this isn’t on your list, I­t­ should be. Around every curve is another view, even more breathtaking than the last. Bring your camera, some snacks, and get ready to be mind-blown with beauty!!\n\nThere are several places to stop and take pictures along the way! And a few restaurants as well!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Tremendous views of the Pacific Ocean", "I took my time as I toured the craggy rocky coast passing up and down the 17 mile Road way. The scenery is unmatched in anything I've ever seen and I said to myself it'll be a short time and I'll be back to this very spot\nShow less"], ["Reviewed November 9, 2017", 5.0, "A Must!", "This drive is a must for first time visitors snd even repeat visitors to the area! We’ve driven along it twice, and walked along parts of it another time. The magical beauty never changes. Beware, oftentimes there is a swift ocean breeze that can be a bit chilly! So glad we were able to experience this beauty!\nShow less"], ["Reviewed November 8, 2017", 3.0, "Didn’t live up to the hype", "Heard lots about this ride; maybe because we live near the coast on the Atlantic, we’re harder to impress. But we were underwhelmed. Yes, the views are pretty but not amazing. The lone cypress was beautiful, and the Lodge at Pebble Beach was a wonderful spot, allowing vistas of the 18th hole and a tasty lunch. Worth a ride if you really just want to see Pebble Beach... spend $35 and you can have your $10 entry fee refunded.\nShow less"], ["Reviewed November 8, 2017", 5.0, "What a view!", "Excellent food and service with a view over Pebble Beach golf course to a stretch of the ocean/beach that will leave you breathless."], ["Reviewed November 7, 2017", 4.0, "Beautiful road", "If you have some extra time and you wish to drive a long a beautiful coast line.. the 17 mile will make you happy.\nI think many people say it is a must, but if you are in a hurry.. skip it. The idea is to relax from the view and stop along the way if you have the time.\nNotice the drive is very slow - 25 Mph limit !!\nShow less"], ["Reviewed November 7, 2017", 5.0, "A show of colors and views", "You can't just bypass 17 mile dr, for a moment in my trip, I thought I should skip it to save time. That would have been my worst mistake. The number of colors you see in both sides, ocean and houses. The numbers of amazing places you can stop for a picture or just relax for a while, are uncountable.\nGo for it.. And you won't regret.\nShow less"], ["Reviewed November 6, 2017", 5.0, "What a drive! What a view!", "I went on this ride by myself and I had a lovely time. The views are amazing. Can’t take a bad picture. Give yourself at least 2 - 3 hours so you can walk, sit, and take some pictures.\nMy only complaint is you have to pay attention when driving which is hard because the scenery is breathtaking.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Great morning deive", "Great opportunity to appreciate the natural beauty of the California coast. Great map guides you to numerous interesting stops. See deer, seagulls and maybe some things swimming in the water. Worth an hour or two."], ["Reviewed November 5, 2017", 2.0, "Nice drive but not worth 10 bucks.", "Nice enough drive but they charge you 10$ You to take it. Not the nicest drive in the area but worth an hour."], ["Reviewed November 4, 2017", 5.0, "Wow! What a beautiful scenic drive!", "We came North from Monterel and took this drive to get to our stay-over hotel in Carmel-by-the-sea; it is beautiful and I highly recommend you to take the drive if possible. It cannot be compared to the Big Sur, Highway 1 drive. It offers different, scenic, spectacular views and is really nice. You have various options to stop, sometimes there are restrooms, you can plan a small catering break as you pass along some resorts.\n\nIt is a paid scenic drive, but well worth the money.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Stunning", "Stayed at pebble beach and drove the 17mile drive stopped at most of the points amazing scenery wildlife and at spanish bay in the evening the sunset is gorgeous"], ["Reviewed October 31, 2017", 5.0, "There is a fee!", "A MUST when you visit the area. You will get vistas you can't get close to otherwise. But be prepared...there is Gate fee to enter the drive from any angle. But they give you a map and you can get the gate fee credited on any meal purchase if you eat at Pebble Beach. Recommend any place in Pebble Beach Golf Resort for lunch.\nShow less"], ["Reviewed October 30, 2017", 3.0, "Great signage!", "The route is well-marked and there are lots of pull-outs for picture-taking. We had a coffee at the Pebble Beach Market. Pleasant enough excursion. Fun to do it once, but not as a must-do. The $10.25 fee is redeemable if you spend more than $35 at one of the restaurants along the route.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Breath taking views", "Pack a picnic and a jacket, it can get windy! A beautiful drive worth the fee. Lots of photo opportunities and picnic areas."], ["Reviewed October 30, 2017", 5.0, "A different world", "Amazing views that explain the astronomical property prices. The lone cypress tree is a great photo opportunity."], ["Reviewed October 25, 2017", 1.0, "Rip Off!", "These fees must be the home owners association for people who can clearly pay their own damn fees. Skip it. Turn around and tell the rude guy at the gate to get bent. He's bored and rude. Skip the rip off."], ["Reviewed October 25, 2017", 5.0, "Scenic Drive", "This is def. worth your time. It is a beautiful drive which is scenic and has great viewing points! You will see a variety of nature including forests and ocean."], ["Reviewed October 25, 2017", 5.0, "Millionaires’ Row", "Yes, the views of the Pacific Ocean are great, but you’re likely driving along Highway 1, so you’ve got plenty more of those views to come, right? The real draw here is the chance to drive through one of the most affluent neighbourhoods in California....More"], ["Reviewed October 21, 2017", 4.0, "Gorgeous Scenery", "A beautiful drive along the coast and past various Pebble Beach golf courses. A diverse blend of nature and development."], ["Reviewed October 21, 2017", 5.0, "Unforgettable drive in our RV !", "This drive , around the Monterey peninsula is amazing . It is easily accessible and the $10 entrance fee was refunded from our lunch at the superb Lodge at Pebble Beach. There about 22 well signed stops along this route, explaining the points of interest....More"], ["Reviewed October 20, 2017", 5.0, "Majestic!", "Just make the trip....stop wherever you can for pictures and just take it all in! The beauty and power of the Pacific ocean and coast is something to behold, works of art complements of Mother Nature and the residences, estates, and resorts along the route...More"], ["Reviewed October 20, 2017", 5.0, "Awesome!!", "Not to be missed. Some of the most beautiful views along the coast and every stop along the way offers a different viewpoint."], ["Reviewed October 20, 2017", 5.0, "Must do", "One of the best part of our trip from San Francisco to Los Angeles, for sure the best views are there, also the seventeen Mile drive itself is a beautiful place to visit. I wish I had more time to spend there. I strongly recommend!!"], ["Reviewed October 19, 2017", 4.0, "Nice drive", "Beautifal drive fun to see Pebble Beach golf course. But there are certainly many other great coastal driver that are as good or better than this one."], ["Reviewed October 19, 2017", 5.0, "Relaxing way to see the scenery", "We paid the entry fee to access the outstanding views and a picture of the iconic Lone Cypress. Our fall visit allowed a less hurried drive and ample parking along the private coastline. We made a short stop for souvenirs at the resort at Pebble...More"], ["Reviewed October 18, 2017", 3.0, "Winding roads, views of some big homes but most were not spectacular", "We were expecting a drive by homes of the rich & famous, but we did not see that many spectacular homes and its a very winding road. There are some areas where you can see views of the coast and walk along the beach/rocky outcroppings...More"], ["Reviewed October 18, 2017", 5.0, "Well worth the entrance fee", "A great way to see the coast, the golf courses and the beaches. Would definitely recommend it as the route to take between Carmel and Monterey"], ["Reviewed October 17, 2017", 5.0, "Sunny day for exceptional drive", "No fog or clouds for our entire 17 mile adventure. Enjoyed many of the stops along the way for pictures and of course visited Pebble Beach for some shopping and lunch!"], ["Reviewed October 17, 2017", 4.0, "Beautiful drive with many photo ops", "We did this drive on a Saturday. It was fairly crowded. We were able to stop easily enough whenever we felt like we wanted to take pics. Was disappointed that Pebble Beach Golf Course was not easily accessible to view properly but I certainly know why. Folks pay a lot of money to play there and do not want to be bothered by photographers. I was a least looking for a proper sign for pebble beach but was unable to even find that to document our stop there.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Scenic Unforgettable seaside drive", "I highly recommend taking extra time to drive along the coast between Carmel and Monterey. Plenty of photo opportunities as well as stops to explore the rocks, beach and maybe enjoy a picnic. If you time it right, the sunset views are incredible and worth stopping for.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Very fun!", "Nice way to spend the day in a convertible!! It was worth it. Go experience it for yourself. 😊😊😊😊😊😊😊"], ["Reviewed October 15, 2017", 5.0, "Nice scenic drive.", "Nice scenic drive on a warm sunny day. Long drive but worth it. Stop often to take photos. Nice expensive houses along the route."], ["Reviewed October 15, 2017", 5.0, "Beautiful scenic drive", "Amazing scenic drive. Great markers for each stop and beautiful vistas! The Pacific Ocean, the wildlife and the greenery were amazing. Bravo!"], ["Reviewed October 14, 2017", 4.0, "The Required Scenic Drive when Visiting the Carmel/Monterey Area", "I’m sort of torn on my rating for this. It’s pretty tough to say that driving a gorgeous scenic ocean road could be average. We’ll just call it an obligatory coastal experience.It does give one the lay of the land and some spectacular views and there are stunning houses along the way (yes, people live within Pebble Beach and on the 17-mile drive). There is an entrance fee. Depending on time of day there can be a lot of traffic, including tour buses. There are many scenic points with parking areas, so you can stop and take photos (if you can find a spot to park). I ran into some visitors who got turned around and ended up doing the drive twice. I guess you really need to keep an eye on the signs and the little map they give you. I really think that a visit to Pebble Beach and its restaurants, bars, shops provides some equally spectacular views for the same admission fee (but once you spend money there, you get a credit for admission). If doing the drive, stop into Pebble Beach for lunch. Some kids could really enjoy the drive. Other kids might think they’re riding for 50 miles instead of 17 (that’s what I thought when I was a kid. Not my first 17 mile drive).\nShow less"], ["Reviewed October 12, 2017", 5.0, "Beautiful beach views", "The drive along the beach is incredible with great and ample pull offs for views. The forest part is nice- but go for the beach and lunch at Pebble Beach Was a beautiful sunny day. Total time without lunch is 90min to 2 hours"], ["Reviewed October 11, 2017", 5.0, "Beautiful coastal views", "Had a great leisurely drive stopping at the various points of interest along the 17 miles. There's a ton of other visitors so pack your patience and mind your common courtesy and driving skills."], ["Reviewed October 11, 2017", 5.0, "Beautiful coastal drive, well maintained with endless photo opportunities", "We did this drive on a weekday, so there was very little traffic. It was great weather, seals and sea lions were out, and the scenery was beautiful. There was road work past the Carmel Valley exit/entrance, and this part of the drive is inland, so if you don't have a lot of time I would enter/exit at Pacific Grove and leave at Carmel Valley.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Must drive", "Don’t even think of skipping this trip. Follow the signs, pay your $10.25 and then follow the red markers in the center of the road. Map provided gives you heads up what is coming next. Every stop is worthwhile so you need to plan your time or it will be dark before you finish. We like the trip from north to south so you end up in downtown Carmel.\nShow less"], ["Reviewed October 10, 2017", 5.0, "17 mile drive", "Worth much more than the ten bucks entrance fee. Lots to see and appreciate. Beautiful home to Pebble Beach golf courses."], ["Reviewed October 10, 2017", 5.0, "Fab fab fab", "If you do anything around this area then do this.\nTakes about half a day as you stop a lot.\nIt wasn't too busy and the stops around the drive were a decent size to get a good volume of cars in.\nThe views are spectacular and you get a bit of everything. Wildlife, sea crashing against rocks, amazing houses that make you feel like putting the lottery on.\nLastly we stopped at the Pebble beach golf course and shops and has lunch there.\nThe sandwiches there are the best I have had in all of my places we stayed. and reasonably priced.\nA must if you go to this area.\nShow less"], ["Reviewed October 9, 2017", 5.0, "There is a fee but worth it", "There is a small fee to do the seventeen mile drive but the scenery is well worth it as is a stop at Pebble Beach golf course and pro shop especially for the golfer ️ There is a hole that you can watch golfers tee off on a par 3 and with the wind there it’s difficult to not have your ball carry into the ocean. Fun to watch.\n\nPrices are high in the shop but good quality and good service\nShow less"], ["Reviewed October 9, 2017", 5.0, "Spectacular costal views", "The place to see the Californian cost along with a lovely drive through nth is wooded headland. A visit to Pebble Beach golf club is a must whilst here, especially to the Lodge for the view over the 18th green."], ["Reviewed October 8, 2017", 5.0, "Romantic drive filled with gratitude", "No words - if you are here don’t not go!!!\nLife makes sense when listening to the waves. Gorgeous! The ocean, trees, houses - all incredible...\nstop at Spanish Bay for the bagpiper playing at sunset. A spiritual experience regardless of your passion for golf or not.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Lots of reasons to Stop", "We got some very nice views as we drove along and we stopped at least 4 times. The Lone Cyprus tree has seen better days, but the parking and ease of stopping was good. Lots of housing construction going on along the way. The memorial cypress grove is worth the walk out to the point. Watch your footing here, though as there are rocks and roots. $10.25 to make the drive, however, there is an offer for a p$10 discount on lunch, unfortunately we didn't eat at the place offering the discount.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Wild Life Galore!", "What a beautiful place enhanced by the three whales, otters, porpoise and seals we saw on numerous stops!! WOW!! Loved this trip!!!"], ["Reviewed October 4, 2017", 5.0, "Put this on your must see list", "Set aside an afternoon or morning to take a leisurely drive to enjoy seeing a bbq d stopping at a number of sports to view the ocean, birds, cypresses, rock formations and other wildlife. Seeing the golf courses that you view on tv was also interesting. It costs $10.25 at the gate, but if you stop for lunch at the Pebble Beach restaurants and shops your entry fee will be credited against your meal cost.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Spectacular vistas", "It costs just over $10 to drive along this private road and worth every cent. Follow the red line and you can't go wrong"], ["Reviewed October 3, 2017", 5.0, "A must do when in the area", "This was an absolutely stunning drive. The coastline is one of the best I have seen. Dont miss this scenic drive"], ["Reviewed October 2, 2017", 4.0, "Simply the best view in the USA", "Traveling down 17 Mile drive, you get the sense of true beauty. There are special viewing areas to get great vista's. If you get a chance take it!"], ["Reviewed October 1, 2017", 5.0, "Fantastic scenery", "There are few places in the world that match the beauty of Carmel and Monterey. Seventeen Mile Drive is a must-see if you're visiting this area because it really does highlight that beauty. For me it's tough paying $10.25 because I remember when it used to be free, but the cost does seem to cut down on some of the traffic that can be a problem. There are many places to pull off and enjoy a picnic or to just soak in amazing views. You can just drive through non-stop and be satisfied, but for the best experience get out and experience nature at its best.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Golf and nature all the things I love", "Everyone goes on this nd it's worth it had lunch in pebble which was actually quite reasonable and staff were lovely then saw so many things deer squirrels seals and whales boom"], ["Reviewed September 30, 2017", 5.0, "A gret drive", "Drove most of 17 mile drive with a coach tour. Breath taking scenery and interesting housed of famous people past and present."], ["Reviewed September 28, 2017", 5.0, "Breathtaking!", "This is definitely worth the $10.25 charge. The scenery is fabulous and there were plenty of places to park. We did this on the spur of the moment and it was well worth it."], ["Reviewed September 28, 2017", 4.0, "Amazing vistas and beautiful estates.", "Take your time to stop at the featured lookout points! While the drive alone can be very interesting, the places where there are parking areas have stunning views of the coast."], ["Reviewed September 28, 2017", 5.0, "Lovely scenic drive", "Beautiful drive with enjoyable lunch at Pebble Beach Golf Club. Golf shop excellent for gifts for golfers."], ["Reviewed September 27, 2017", 5.0, "17 Mile Drive Pebble beach", "Having traveled to beautiful and exotic places and lived in Monterey County for over 60 years I can honestly say Pebble Beach and the 17 Mile Drive is one of the most beautiful places in the world. From its famed golf course3s to it luxurious hotel accommodations at The Lodge at Pebble Beach and Spanish Bay to the exquisite estates of the rich and famous. It’s location on the beautiful MONTEREY Peninsula is rivaled by few in the world.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Relaxing way to see beautiful neighborhoods", "What a great way to see the upper crust neighborhood, famous cold courses, beautiful scenery. It's well worth it."], ["Reviewed September 25, 2017", 5.0, "Well worth the time and money", "Beautiful views of the coast and golf courses, for $10 you can't beat it, and well worth your time. Just to be on the grounds of Pebble Beach and Spanish Bay were well worth it."], ["Reviewed September 24, 2017", 5.0, "The Lone Cypress is Never Lonely", "To see the Cypress rising from a rock is miraculous. To see it with the backdrop of the Pacific Ocean is like seeing the face of God! Joyce Kilmer said it best, \"only God can make a tree.\" Be patient when you go, parking is limited and the cars are endless. Everyone wants to see the tree.\n\nPebble Beach is gorgeous! Who knew it is a public golf course?\nShow less"], ["Reviewed September 21, 2017", 5.0, "Scenic drive thru Pebble beach", "Wonderful drive along the ocean and the golf clubs in Pebble Beach. Stopped several times to view the shoreline and also at Pebble Beach famous golf club where a senior tournament was being held"], ["Reviewed September 21, 2017", 5.0, "Gorgeous!", "We took our time for all 17 miles and lived the breathtaking views. We detoured at the end and rode HWY through Carmel and down to Big Sur. The views are simply indescribable and pictures can not do it justice!"], ["Reviewed September 20, 2017", 5.0, "Fantastic drive - so much beautiful and varied scenery.", "Wonderful drive - not to be missed. We ate at Stillwater restaurant overlooking the 18th hole of one of the courses. I would really recommend this restaurant; food and service excellent."], ["Reviewed September 19, 2017", 4.0, "Very scenic", "The seventeen mile drive is easy to do with clear signposting. Definitely worth doing we sea seals and Whales. Parking was easy at each spot. We visited in September 2017."], ["Reviewed September 19, 2017", 3.0, "Bad weather ruined the view", "Pretty disappointed we couldnt see much but glad we cycled the 17 miles and saw each of the points of interest."], ["Reviewed September 19, 2017", 3.0, "Lovely views but restricted to the car too much", "Not much to offer for walking trails but very nice spots to get out of the car and have a look. Lots of the same views at several spots but gorgeous non the less"], ["Reviewed September 18, 2017", 3.0, "Parts of this stunning, parts ho hum.", "There is an entrance fee of $10.25 to take this drive and there are three points of entry. They will give you a good map. For optimal viewing I would recommend starting at the gate closest to Pacific Grove and make sure you stay to the right as you progress along the water to keep the shore on your right hand side. It can be tricky at the first intersection so check your map carefully and head out towards Point Joe first. this portion of the drive has amazing shore views, lookouts, beaches to stroll, walks to take, homes you can only dream of. The second part of the drive is more or less through residential streets and no water view with little to commend it. Overall it is worth the ten dollars to see the shore and if you are a golf fan, visit the various courses.\nShow less"], ["Reviewed September 17, 2017", 5.0, "a must when in carmel", "this is a must for carmel. its lovely scenery and nice to walk around pebble beach golf course and pretend you are rich"], ["Reviewed September 16, 2017", 4.0, "Beautiful Views Through Pebble Beach Golf Community", "Spent a good four hours driving along seeing the sights marked by signs and eating lunch in the lodge. Lots of history and interesting accounts on the signs. Very beautiful views of ocean shore and a thrill to see the famous golf course"], ["Reviewed September 16, 2017", 5.0, "Vacation", "Very nice drive with parking for all points of view along the way. Drive with ocean on one side and the beautiful golf courses on the other."], ["Reviewed September 15, 2017", 5.0, "Well worth it!", "Well worth the $10.25! We spent hours on this drive taking photos and seeing wildlife. Whales, sea otters, sea lions, deer, squirrels and birds. So many beautiful places to pull off and take photos. We even picnicked at the beach! Beautiful scenery from high up all the way to the beach. Definitely a must do if your in the area!\nShow less"], ["Reviewed September 15, 2017", 5.0, "Highly recommended drive!", "This drive costs $10.25 and is well worth it. It took us over an hour, because there are so many places to stop and observe the beautiful view. Wonderful views of the water, seals and birds. We also enjoyed seeing the Pebble Beach Lodge and the 18th hole.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Wonderful ocean views", "We stayed at a house within 17 mile drive and really enjoyed driving and walking along it for the week we were there. Wonderful wildlife and it was fun seeing some of the residences."], ["Reviewed September 14, 2017", 5.0, "Pacific Coast, this is why it's so famous", "Ultra rich/wealthy people living among such pristine coastline....for us outsiders, you pay a small fee, I think $17 just to drive down the 17 miles.....nothing in return except the absolute most gorgeous views you mind can paint. many spots to stop, park/pull over and soak it all in. I do mean that. You will feel re-energized.\n**MOST importantly, stop off at either of their fancy Golf spots aka 19th hole type of establishments (remember dress appropriately...since you are not among any vagabonds) with a Reservation and take note of the Sunset times via a quick google search.....sit back with your favorite cocktail of choice and let the cranial recording begin.\n**additional plus: SAVE your entry receipt - if you spend over $30 for dinner, stores, etc, you get a refund ($17 entry fee) on the way out. we didn't notice until after the fact. :(\nShow less"], ["Reviewed September 13, 2017", 5.0, "Stunning views of California's coastline", "I live about 1 hour away from Carmel, and this is where we often take out-of-town guests when they are visiting. It is mainly some beautiful views of the California coastline -- it does not have beaches here, but you are looking out over rocky bluffs, waves crashing on the rocks, beautiful formations of Cypress trees, the golf courses of Pebble Beach, and California's prime real estate. There is a gate fee of around $10 per car, but if you have lunch, dinner, play golf, etc., the fee is waived or validated. There are many photos & paintings of the \"Lone Cypress Tree\" that grows out of the cliffs, just above the ocean. Spanish Bay (one of Pebble Beach's golf courses) is located here, and there are a few restaurants located within their resort (Roy's, Peppoli,...), as well as an outdoor seating area for drinks, some on patios surrounding fire pits, others on lawns overlooking the ocean, and you will often see weddings being performed there, as well. At sunset, a bagpiper walks by here, as Spanish Bay is a Links course, and it is just a beautiful, relaxing place to unwind. I'd highly recommend stopping here for a drink, or enjoy a meal (I prefer Roy's). There are also a few little shops in the resort there, and even the lobby feels luxuriously comfortable, with very cushy couches, you can order drinks here, as well, and snacks that include pretzels in the shape of golf tees. I have also bicycled along the Pebble Beach roads -- stunning views, lots of fresh air, although there are some hills, but it's another option. You can see similar views stopping along the coast in Pacific Grove, for free, but if you haven't been here, it's worth the drive, with many areas to stop, to unwind and enjoy the natural beauty.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Beautiful", "Give yourself a few hours and take the drive. $10.50 to get in, but the drive is worth it.\nStop at the Lodge at Pebble Beach and enjoy a nice lunch on the deck. Take in the view of the ocean, golf course, and golfers.\nDon't rush the drive. It quite different.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Whale viewing!", "What a drive!!! Amazing views along the coast...we even saw whales!! Golf course and homes looked nice too."], ["Reviewed September 12, 2017", 5.0, "Scenic Seventeern Mile Drive", "This is a must when you are in the Carmel area. It is so worth the time to do the Seventeen Mile Drive. Breathtaking views of the ocean, golf courses and housing along the way!"], ["Reviewed September 12, 2017", 5.0, "Pebble Beach is Fabulous", "If you're in the area this is a must do drive. As luck would have it we drove down to the Inn at Spanish Point. The clubhouse is an experience in itself."], ["Reviewed September 11, 2017", 5.0, "Beautiful Drive", "There is a fee to enter. About $10 per car. Recommend entering from the south and exiting in Pacific Grove. Lots of spots to pull over and see the views and enjoy some wildlife."], ["Reviewed September 11, 2017", 5.0, "Beautiful drive", "Nice drive everyone very helpful- beautiful scenery. Do not pay gate fee if you are playing golf. Do not stay at La Playa Hotel in Carmel."], ["Reviewed September 8, 2017", 4.0, "Panoramic views of the ocean", "and reasonably priced entry fee. If you are a fan of golf then this drive is a must. The only criticism is that there are very few road signs and it is easy to stray off the main route. Make sure you take a map!"], ["Reviewed September 7, 2017", 4.0, "Lovely vistas. Great drive.", "I was on and off this road as part of driving various cars during Car Week. There are many lovely places to stop and soak up the beauty of the area. Especially in a high end sports car."], ["Reviewed September 6, 2017", 5.0, "Scenic drive", "I have been driving this route through Pebble Beach since I first arrived in CA. It is breathtaking! It was my mother's favorite drive on her CA vacation. It is beautiful in all weather...sun, or storm!"], ["Reviewed September 6, 2017", 5.0, "Heaven", "Do yourself a favor and take this drive. Drive slowly. Stop. Take in the scenery. Stop again. Breathe in that sea air. Drive. Gawk at the mansions. Drive some more. Ponder at the beauty. Relax."], ["Reviewed September 5, 2017", 4.0, "Very pretty drive bordering the Ocean", "My wife and I rode the Seventeen Mile Drive during our visit to the Monterey peninsula and although my wife was scare of the many very steep hills and tight curbs the views were fantastic. We drove very slowly and stopped at a couple of points to take some photos. Certainly worth while experience even if it is a bit scary at times.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Amazing and beautiful scenery!", "Must do if in the Area. $10 for the car to enter and well worth it. My favorites were the \"Lone Cypress \" tree, seeing the beautiful golf courses with the massive sand bunkers, ocean clift views and the forest."], ["Reviewed September 4, 2017", 5.0, "BEAUTIFUL", "No words on how beautiful this Drive is ... a must on everyone's list. Worth beyond the $10 entry fee. Take a picnic, plenty of snacks and drinks. No availability of food. Worth your time and memories!!!"], ["Reviewed September 3, 2017", 4.0, "Beautiful but crowded", "The winding road is lovely, passing dramatic views of the ocean - when you can glimpse it between the tourist buses, cars and bicycle riders who seem to think that even if there is no bicycle path, they can take up the curving road without a qualm while you putter along at less than 10 miles an hour behind them, sigh.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Golfers Must Do", "This road to Golf Heaven is a must do for any golfer. I could spend a day at each golf course and still crave more. Well worth the price for the drive, and you can always bike. can't wait to go back"], ["Reviewed August 29, 2017", 5.0, "10 day RV adventure with the neighbors", "Totally worth it! Bring a blanket!!! We rented the Sea Cars and had a ball. The teens were bummed they couldn't drive due to liability issues; but the Aux Cord and music made up for it!"], ["Reviewed August 29, 2017", 5.0, "This is just as memorable as you hope it will be!", "All of us have seen pictures of the Lone Cypress, and heard about the remarkable 17-Mile Drive. We were initially irritated by the fee to get in, but realized it help filter out many people Try to go early or late in the day, when most of the other traffic will not distract you from this special place.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Spectacular Drive", "Seventeen Mile Drive is gorgeous and well worth your time! It cost $10 but the views are amazing! I really enjoyed this!"], ["Reviewed August 27, 2017", 5.0, "Beautiful Views", "Love this area of California. This drive winds along the ocean with plenty of stops to picnic, visit the beach, see the wildlife (pelicans, otters, sea lions) and the beautiful homes. Fantastic."], ["Reviewed August 27, 2017", 5.0, "Third Time But Still Love It!", "Third time to do this drive over a 40 year span. You can never get tired of the beautiful views. We took tons of pictures. Must be seen to be believed."], ["Reviewed August 27, 2017", 5.0, "Very cool place", "Lots and lots to see here. Did not understand the first stop, we found it had nothing to see. The rest though were stunning. You pay a small fee to enter and they give you a brochure with a detail list of the stops. There is good signage throughout to point you in the right direction and you can also follow the marked road. My husband loved the links and I think my favorite was Bird Rock and the Lone Cypress. Dress comfortable. Bring a pic nick lunch and enjoy the day. I would go back.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Awesome scenery and sea lions", "This is of course a famous drive through impressive trees and canyons, that goes down to the coast. Was a bit foggy but still beautiful views. The highlight was a sea lion rookery on a rocky outcropping just offshore. The lions were barking madly, and doing all kinds of tricks in the water. Watched for almost half an hour.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Amazing Natural Beauty", "This is a must see drive while in Monterey or Carmel. The scenery is spectacular with many photo ops. The golf courses that the road traverses are spectacular."], ["Reviewed August 23, 2017", 5.0, "Worth the small fee to do this fun drive", "I would recommend starting at the Pacific Grove Gate as you will have the water and all the stops to the right.... easier to exit for them and also you will not have to be looking over on coming cars and one lane of road if you do it in the other direction. Loved the stops and photo ops along the way. We also saw about 8 bucks in a wooded area of houses right before the lone cypress tree!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Family trip", "Must do !! Drive around and see the different points of view are amazing Take nice pictures of everything , we even spit some deers Best pictures take from diferents point"], ["Reviewed August 20, 2017", 5.0, "Scenic drive, worth the entrance fee!", "Unlike some other reviewers -- I feel like this scenic drive was totally worth the $10 entrance fee.\nYou get a map at the entrance booth, detailing all the major stops along the way. Everything on the drive is well marked and easy to follow.\n\nYou get to see some beautiful homes across from sweeping coastal views. You can stop at every stop or just pick and choose. Some of our favorites were Huckleberry hill, Lone cypress, Bird rock.\n\nBathrooms available along the way and are marked on the map\nShow less"], ["Reviewed August 20, 2017", 5.0, "Great trip", "For the small charge it's well worth it. Stunning views of coastline and golf courses. Felt safe at all times"], ["Reviewed August 20, 2017", 5.0, "So nice!!", "Its a really nice drive, the begining is the worst part, but after you reach the coastline it becomes amazing!! If you have the chance, do it without doubts"], ["Reviewed August 18, 2017", 5.0, "Even though you pay for the drive--It's worth the price", "It struck me as odd to have to pay for the privledge to drive this road--apparently the money goes to the homeowners association--at least according to the toll booth personnel. However, this really is a must see. Conspicuous consumption and socioeconomic considerations aside the views of the coast and the amazing homes make this a required side trip. Interesting comparing it to the old money east coast enclaves like Newport\nShow less"], ["Reviewed August 18, 2017", 5.0, "Beautiful trip to make", "The seventeen mile drive is really very beautiful (the brochure says it is one of most beautiful scenic roads in the world, and I found it a bit of an exaggeration but definitely worth it). Stop in as many places as you can, watch the seals and sea wolfs and even sea lions. My kids loved it!\nShow less"], ["Reviewed August 17, 2017", 4.0, "Fun drive", "Great drive along the coast line more or less starting in Monterey and ends (if you like) in Carmel. Usd 11 entrance fee. Along the way many opportunities to stop to enjoy the views. Watch out for crossing golf balls and carts ;-) A bit smelly here and there (seaweed?). Mondain Carmel is great place to have lunch. We were lucky that this week was the yearly Monterey Car Week and the Concours d'Elegance. Busy Carmel and Monterrey were just packed with the most beautiful old and brand new, but all very pricey, (sports)cars.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Make sure you stop at Peeble Beach Golf Club for coffee half way round", "Unfortunately three days in Carmel it was very foggy so didn't get full advance of the views/viewpoints whilst doing 17 mile drive (we did it three days in a row)!"], ["Reviewed August 17, 2017", 2.0, "Disappointing and expensive", "This was disappointing and definitely not worth it. Driving through some golf courses and catching some ocean views from not too special view points, the drive was a disappointment after the free highways and roads we had been on all day. The staff at the entry gate was unhelpful, the drive crowded, there were too few parking spaces and restrooms were nowhere to be found except in very few locations with misleading sign posts. While the lone cypress and the ghosttree were nice to see, this was definitely not worth it. I would recommend the Carmel scenic drive and the parts if highway 1 that are currently open: much more stunning and free!\nShow less"], ["Reviewed August 17, 2017", 5.0, "beautiful drive", "This was worth the price! What a nice, beautiful drive. We really enjoyed walking on the beaches too! We saw many dolphins in the water."], ["Reviewed August 16, 2017", 4.0, "Great for a sunset drive", "Nice place for a quick drive from Bay Area in ca. Has some amazing landscapes, palatial homes and of course the beach. Sunset is the best time. It gives some exceptional photo opportunities with sun rays peeping through clouds and the roaring sea beneath."], ["Reviewed August 16, 2017", 4.0, "Enjoyable Drive and So Worth It to See the Seals!", "My husband and I and our 2 daughters ages 13 & 19 enjoyed doing this drive. Some of the stops along the way were not worth stopping but Bird Rock was amazing. Not only is it covered in birds, but the harbour seals climbing the rocks and jumping in the water below the rock are so fun to watch. You can hear them barking and having a great time! We got great photos with our zoom lenses. We also enjoyed the stop at the Lone Cypress - such a pretty lookout. The Lodge at Pebble Beach is worth a stop as well, given the iconic golf course is located here, however we found the people quite snobby. I asked where the beach was and the woman I asked looked down her nose at me and said \"There really isn't a beach but if you are looking for the water and the 18th hole, it is down that way.\" I just wanted to see the view of the water since I figured it must be pretty. The 18th hole looked so beautiful with the water as the backdrop so I was glad we walked down to see it. The gift shops sold outrageously priced golf shirts and most of them were striped. My husband wanted to buy a shirt. There were a few more reasonably priced ones but we didn't like all the stripes and there were none in his size in solid colours. I don't think I would have paid the price to eat there but many people were enjoying a meal at the Lodge, out on the patio. The highlight was definitely Bird Rock on the 17 mile drive! Don't miss it!\nShow less"], ["Reviewed August 15, 2017", 5.0, "Not to be missed!", "Who would have thought you would have to pay to get from Monterey to Carmel along the coast? It costs you about $10 to make the drive, but it's worth it! You get a map and can plan where to stop. It was pretty crowded Saturday, so maybe a week day is better. But the weather was good and the views were fabulous! Parking was a challenge due to the size of the crowds, but I only stop0ped where I really wanted to and avoided a bit of the rush. If you have kids, you definitely want to see the seals. Really great way to drive the coast.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great scenic drive", "The time we spent on the drive was well spent, only the 17$ entrance is a bit exaggerated. The second part of the ride alongside the beach is stunning and made we want to play golf at this place :)"], ["Reviewed August 12, 2017", 5.0, "Must do if you are in Carmel or Monterrey", "I recommend to do this by car, and not by bicycle. It's quite a ride, up and down. And it can be very windy. In turn, you get a fantastic scenery, one of the nicest across the US probably. The cost-line is fantastic. No wonder that some of the most prestigious golf places are here.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Go here every year", "We do the drive every year even if we don't play golf. Took our friends who have not been before. Lots of photo ops. If you play golf it has to be on your bucket list. We stopped at Poppy Hills, Spanish Bay, Spyglass, and ended at Pebble Beach for lunch at the restaurant overlooking the 18th green and of course dropped some $$$$ at the shops.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Majestic drive", "After a beautiful stay in Carmel we took the Seventeen Mile drive along the coast which showcased some lovely homes along the water. We ended up at Pebble beach golf club and as an avid golfer I enjoyed it. Really worth the drive."], ["Reviewed August 10, 2017", 5.0, "So many amenities! With a price...", "I came here with my parents and this place is only accessible when you rent or have your own cars.\nAn absolutely charming place, it boasts spectacular views of the Pacific.\nSince you have to pay $10 to enter as this is considered a private estate, not many tourists come to this place. Although in recent years, as I came back to visit this place for my yearly visit to America, there's an increasing number to tourists also visiting the place. The $10 will be used to maintain the area.\nGood restaurants with a superb view, golf course and occasional deer sightings are part of the $10 package as well. :)\nShow less"], ["Reviewed August 10, 2017", 5.0, "Took the drive to see the tree.", "The scenic views are spectacular. Traffic can be a bit of a pain but if you stop often you won't miss much being the driver."], ["Reviewed August 10, 2017", 4.0, "Worth a drive", "Very nice drive, plenty of places to stop. A few views are really nice. Give yourself about two hours."], ["Reviewed August 9, 2017", 5.0, "Impressive nature!", "Second time we did this tour, again impressive nature. Strongly recommend this drive when you are in Carmel. The scenery is beautiful, go for it!"], ["Reviewed August 9, 2017", 2.0, "Not a must", "We didn't love this as much as the ride on ca1 toward big sur!!! If I had to do over I would not have spend my time."], ["Reviewed August 9, 2017", 5.0, "Yes, DO THIS ONE!", "Starts out a little lame, but don't despair; you will end up on the most rugged beaches you could encounter on this continent, with waves and wind coming in from all directions! AWESOME little self guided tour! Bring your camera, keep your hat in the car, and enjoy! Take your time, don't hurry, the actual little trip is well worth the couple of dollars you will spend to drive this incredible 17 miles.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Scenic drive", "Not too bad a drive, the first few vista points are ok only, comparing to other similar type of vista points, there are better ones. However after the first 5 to 7 stops, it starts to get better! There is also a very beautiful golf course.\n\nHave to pay an entry fee but well worth it and you can off set it with food within the 17 miles parameters.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Stunning views", "Wonderful views, definitely worth a visit if you are in the area. Probably the best Carmel has to offer."], ["Reviewed August 8, 2017", 5.0, "Awesomeness!", "Wonderful photo opps and views to last a lifetime. Definitely worth your time and some time it will take. Winding roads and slow speed limits keep you from blowing through, but then why would want to? Be prepared to spend some time here as there are numerous points to stop and get out. Wonderful areas for picnics and enjoying the breathtaking vistas. If you're close by, go out of your way to see this, you won't be disappointed. Sunset is particularly stunning btw.\nShow less"], ["Reviewed August 8, 2017", 5.0, "17 Miles of Pure Beauty", "One of the greatest drives in all of America. We always enjoy seeing Pebble Beach, tide pools, and wildlife along the scenic shoreline!"], ["Reviewed August 5, 2017", 4.0, "A must on any and every trip to Carmel", "Make the drive, start at the north end at Pacific Grove (Sunset and 17 Mile)...keep the receipt from the $10.25 entry as a restaurant credit at any of the Pebble Beach Company properties. You see something different every time you make this iconic drive...make stops at the Inn Spanish Bay (preferably around 530pm when the bagpipes are playing) and at the Lodge at Pebble Beach to grab a bite at The Bench...and do some window shopping for a dream home as there are a handful of those along the route too.\nShow less"], ["Reviewed August 5, 2017", 5.0, "17 miles of utter beauty!", "A fantastic tour interrupted every so often by a glass of wine or two at the beautiful golf courses which line the drive. I can't remember many afternoons that were better spent!"]]}}