{"Six Flags Magic Mountain": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Six Flags Magic Mountain", "url": "/Attraction_Review-g33047-d156956-Reviews-Six_Flags_Magic_Mountain-Santa_Clarita_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/36/ff/db/six-flags-magic-mountain.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "4712"}, "address": {"@type": "PostalAddress", "streetAddress": "26101 Magic Mountain Pkwy Valencia", "addressLocality": "", "addressRegion": "California", "postalCode": "91355-1095", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Riding rides", "I love Six Flags Magic Mountain! It is a great amusement park filled with some of the world’s scariest and most fun roller coasters."], ["Reviewed 4 days ago", 5.0, "Great coasters!", "We are avid coaster fans, and 6 flags did not disappoint us! It was nice to go in off season. We got to ride everything front row, and back row if we wanted to. HIGHLY recommend if you are into coasters! Not a lot of other rides, but a few.\nShow less"], ["Reviewed 1 week ago", 4.0, "An AMAZING Amusement Park...If You Like Roller Coasters", "I travel the world riding roller coasters for fun and I can tell you with authority that Six Flags Magic Mountain is THE best place in the United States to visit if you love riding roller coasters (tied with Cedar Point in Sandusky, OH which boasts 17 world-class coasters, including some current and former record-breakers). However, if you're not a big coaster fan, you may find yourself a bit on the bored side, as coasters are the major offering and draw for this park.\n\nMagic Mountain is a 262-acre park that is located in Valencia, CA (kind of out in the middle of nowhere, about an hour north-northwest of Los Angeles), just off of Interstate 5. As of January 1, 2018, it is open 365 days per year. Parking is plentiful, with HUGE parking lots and shuttle bus service to lead you from your parking spot to the front gate. It is a VERY busy park; crowds can be unbelievably overwhelming! The worst I have seen it is at 95% capacity, with almost no place to park and lines for all of the major rides running at 2-3 hours and everything else at an hour minimum, including kiddie rides. If you are going, I cannot recommend getting a Flash Pass (Six Flags' front-of-line system) enough. Seriously, depending on crowds, you may find yourself only going on 4-5 rides over the entire course of the day if you attend on an especially busy day. Crowds can be OUTRAGEOUS!\n\nThe park is built on the side of a hill; that means you will be doing a lot of walking uphill and downhill over the course of your day. Yes, it gets tiring traversing all of those hills if you aren't in decent shape! Good, comfortable footwear that offers plenty of cushion and support is an absolute MUST!!! You will likely find yourself walking upwards of 10 miles over the course of your day, so protect your feet! Walking paths are plentiful and easily traversable if you are on a scooter. Guests in a wheelchair are going to need people who are fit and able to push them if they don't have the upper-body strength to push themselves up the hills.\n\nMagic Mountain has NINETEEN roller coasters. Yes, NINETEEN (as of this writing in February, 2018). Let that sink in! And of those 19 coasters, many of them are outstanding and truly top of their class. You want to ride an incredible flying coaster? They've got it: Tatsu. Hungry for the best stand-up coaster on earth? Riddler's Revenge, Baby! Looking for hyper coaster (200' tall, non-looping steel coaster) with some fun air time? Goliath. Want to ride something super unique that you won't find anywhere else in the USA? X2, Twisted Colossus, Green Lantern: First Flight and Full Throttle. Got kids and you want to start their thrill rider training program? Magic Mountain has FIVE kiddie and family coasters that are perfect for little ones to cut their teeth on and transition to the bigger rides. However, if you're not the biggest coaster and thrill ride fan on the planet, you are going to find the ride offerings to be a bit on the weak side. Six Flags has been focusing their attention on building rides other than coasters over the past few years, including a 400+ foot drop tower, an impressive (and fun) interactive dark ride themed to DC Comics' Justice League, as well as some new and old school carnival-type rides. There are around 10 kiddie rides for your youngsters...but that's about it. If you're not into coasters or rides, about the only other thing for you to do (besides see some tacky shows) is spend your day in the water park, Hurricane Harbor, but that requires a separate admission and is not included with your Magic Mountain admission.\n\nMagic Mountain is a typical Six Flags park, so you are going to find things needing paint, trash on the ground and advertisements EVERYWHERE (eat a Nathan's Hot Dog, the Official hot dog of Six Flags!; come visit Fright Fest, sponsored by Snickers!; come ride the Full Throttle Coaster, brought to you by Corn Nuts!, etc. They even will wrap their shuttle busses and coaster trains in vinyl advertising wraps. It gets EXHAUSTING). Your admission is just the start of the money they want you to spend. Why would you park in the back of the parking lot when you can get PREFERRED PARKING for just $15 more! Why come for only one day when you can come ALL SUMMER LONG with a season pass for just another $30! Don't forget to add on a Season Dining Pass to eat all summer long too! And you would be silly not to add on Season Parking while you're at it? Why wait in line when you can get a Flash Pass today! Oh, you have items that you are carrying with you? You'll have to place those in a locker...and those lockers aren't free. EVERYWHERE you look, they are trying to charge you for something. This is something that Disney does at their parks, but Six Flags can't come close to competing with Disney and it just makes you feel dirty and violated as the day goes on. Rides are routinely closed, whether due to breakdowns, lack of staffing, or annual refurbishments. Rare is the day when you will find all of the rides open and operating. Disinterested and bored employees are everywhere and many are more interested in playing on their phones than paying attention to their jobs and their customers. The whole park--like all Six Flags parks--has a very rundown feel to it and that's a damn shame: Magic Mountain is actually a GREAT park! If they could just get on top of some of its shortcomings and round out some of its ride offerings a bit more, they could push it up to the best amusement park in the world. Don't get me wrong, I generally have a good time at Magic Mountain and it's definitely the best park in the chain, tied with Six Flags Great Adventure in New Jersey. Just be ready to shell out LOTS of extra dollars when you get there...or you're going to stand in punishing lines all day long and feel like a second-class citizen.\n\nCoaster lovers, Magic Mountain is your Mecca! Non-coaster lovers, there are better parks for you to visit. Spend your money on a day at Universal Studios Hollywood or Disneyland. Recommended...with concerns and reservations.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great park for roller coasters", "We went on Presidents' Day and had a great time. The lines weren't very long so we were able to go on all of the big coasters (except Green Lantern which was closed for maintenance) - several more than once -- and we didn't even stay until closing time. Thank goodness I didn't waste my $ on Flash Passes -- although they might be worth it for a weekend day in summer. There is a kiddie section which I am not familiar with, but this park definitely seems geared more toward the 54\" and up thrill-seekers. They have a great variety of extreme coasters -- they were all unique and fun. The staff seemed nice and to enjoy their jobs too (except one guy working at the chicken fingers & fries snack shack -- not friendly and I think he ripped me off -- didn't give me AAA discount -- and then wouldn't give me a receipt because the machine was supposedly out of paper and he couldn't generate another receipt). Anyway, overall, the park is what you'd expect of Six Flags -- fantastic rides and Looney Tunes cartoons and super hero trivia to keep you partially entertained while waiting in line. The last time I went to Magic Mountain was nearly 2 decades ago and nearly all of the coasters now have been added since then. I grew up going to Six Flags Great Adventure in NJ (and still go occasionally); while Magic Mountain appears to be a smaller park, it still has at least as many thrill coasters. If you like coasters, Six Flags is a must. Be sure to try X2, Twisted Colossus, Riddler's Revenge, Batman...pretty much all of them; Ninja was least favorite -- most boring of the bunch. Enjoy!\nShow less"], ["Reviewed 1 week ago", 3.0, "Good thrills, needs attention", "If you’re coming for the thrills, there are some great coasters. I realize we went during off seasons and refurbishments are to be expected but beyond that this park is in major need of some TLC. Boarded up areas and restaurants (not just those they were being currently worked on), areas and rides and queues in need of attention (cleaning, maintenance, painting). While we were there several restaurants and shops never opened (again maybe just because it’s off season). Rides closed often throughout the day, newer rides were closed (green lantern never opened and apocalypse did reopen the second day). Overall, the kids had a great time. I can’t imagine coming during peak days waiting in long lines and possibly experience frequent closures.\nShow less"], ["Reviewed 1 week ago", 5.0, "Another awesome day", "We had another great day riding coasters. Thank goodness we got a platinum flash pass. We rode every coaster and most of the thrill rides in under 6 hours! Lines? What lines. That flash pass was awesome. Can’t wait to use our annual passes on the next trip.\nShow less"], ["Reviewed 1 week ago", 5.0, "Better rides than most and no queues as out of season", "Great rides and no queues as we went out of season but on a nice sunny day. Great value for money compared to other parks with rides more suited to teenagers than smaller kids."], ["Reviewed 2 weeks ago", 5.0, "Brilliant and, best of all, quiet.", "We visited on Tuesday 13th February, and it was so quiet that we walked onto pretty much every ride. At 4pm we were the only two people on Riddler's Revenge! We're pleased that we took others' advice and went mid-week.\n\nDespite it being quiet, staff were friendly and helpful at all times, the vast majority of rides were running from opening until closing time, and many restaurants were open (though the prices in these are ludicrous, and I'd suggest eating a big breakfast before visiting).\n\nWe thoroughly enjoyed our visit, and found the rides well-maintained and thrilling. A great day out.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fantastic rides", "Wow, every ride is a little different, great experience and fun! The park is lacking a touch up in places but excellent value. A few rides did break down and closed for the day but heaps of options. I hate heights but did the Lex Luther drop and loved it. Go on a weekday!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great fun", "The rides are crazy fun something for everyone. Best time to go is not summer and on Sundays to Thursdays."], ["Reviewed 2 weeks ago", 5.0, "Awesome park for thrill ride seeks (adults and kids alike)", "Our family of three thrill seekers (two adults and one 13 year old boy) visited Six Flags Magic Mountain on Saturday, 2/3/18. My son has been looking at park maps, videos and reviews of each roller coaster for months and has memorized the stats of each coaster so we figured it was time to make the 2½ flight to LA to visit Magic Mountain. We visited during off-peak and based on reviews on Yelp and TripAdvisor, I expected rides to be closed and the park to be dirty but that was NOT the case. We had a very enjoyable yet exhausting day at Six Flags. While there is no way we would go during peak times (e.g. summer, school vacations, holidays), we will certainly be back again for another visit.\n\nPros\n+ Fantastic variety of roller coasters – standup (Riddler’s Revenge), flying (Tatsu), 4D (X2), hybrid (Twisted Colossus), strata (Superman), floorless (Scream), hyper (Goliath), inverted (Batman) and multi launch (Full Throttle)\n+ Short lines (most waits were 5-10 minutes; longest wait was Superman at 30 minutes). Pays to go off-peak.\n+ All thrill rides were open except for Green Lantern\n+ Park was very clean\n+ Staff members were helpful and informative. Gave great directions. Love that the Flash worker was honest about whether we would need the Flash pass on a quiet off-peak day\n\nCons\n- Food – standard park fare. Would have been nice to have some healthier and better tasting options\n- Would have been nice to have the funicular working. Climbing hills after walking 25k steps is tiring\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Adventure and fun, but it will cost you.", "Like most Six Flag parks, this one has plenty of amazing roller coasters and fun for the whole family. It's not cheap but if you live close, the season passes are definitely the way to go. They are always adding rides so if you haven't been in a few years, there is most likely something new to try.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great day for rollercoasters.", "We went on a Friday in February (which is off peak season).\nCouple of rides were shut - which we expected as they advertise that on the website which I think is good. However there was still plenty of rides for us to go on, the wait times were no more than five to ten minutes for any ride.\n\nWe made the mistake of not doing any research and brought the gold flash pass (Cost us $130 for the two of us) and there were hardly any wait times, so that was a waste of money. You can buy it on the day so in off peak season I would wait to buy it - apparently in summer/peak season it is a good investment.\n\nPaid for parking - $25 dollars I think? But I don't think there is anywhere really to park outside that is a reasonable distance.\n\nObviously being off season a lot of the shops etc were closed. So there was only like two main places to get something to eat from.\n\nFood and beverage wise - in comparison to Disneyland it was a lot more expensive. A large drink at Disneyland was around $5 and here it was a bit over $7.. We paid around $50 for a baked potato, burger with a tiny amount of chips, large soft drink and a bottle of water.\n\nThe park has wifi - which is a benefit for tourists with no international roaming plan.\n\nThe park itself was clean - I didn't see any rubbish lying around.\n\nDefinitely NOT a theme park and I wouldn't bring any young kids (probably under 10). There is no characters around and it is strictly for those who love rollercoasters. There really isn't much for younger children to do. I think there was maybe five child rollercoasters?\n\nLoved the Twisted Colossus and Full throttle! Goliath was pretty good too.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Thrill Capitol of the west coast", "I have been to Magic Mountain twice, and it has been a great experience both times! The park is loaded with world class coasters and will deliver the thrill if that’s your thing. This is a coaster-centered Park for sure, if you plan to come with kids or people who aren’t big on roller coasters, this park isn’t for you. But if you want to experience a world class collection of great and varied coasters then come! I have been on busy and slow days, and honestly the lines can be a bit long at times. The fast pass is a good investment if you come on a packed day. The food isn’t very good here, but it gets the job done. They are currently working on retheming some older areas which is good, because the park is a bit run down in some places. But the main thing here is the coasters. Be sure to wait for X2, it is worth it! Scream also was one of my favorite rides even though it’s severely underrated and is usually a walk on attraction. Advice would be clean the place up a bit and work on the food.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Christmas at Six Flags", "Went to Six Flags Magic Mountain Valencia with my grandson. Visited Santa Clause, enjoyed the holiday lights. Great rides for adventurous people. We loved it!"], ["Reviewed 3 weeks ago", 5.0, "Adrenaline!", "The park is located right off the 5 fwy about 35 miles north of LA. Parking is vast and trams run every few minutes to pick up and drop off from lot.\nThis is a fun place for those who love rollercoasters. Many to choose from at varying speeds and styles. One can easily ride all coasters in an off season day.\nThere are a couple of water rides so bring a poncho or spare shirt if you’re into that sort of thing.\nThere’s also a Looney Tunes section for the little ones with a handful of rides.\nCarnival style games are also featured for those who might like to try to win a giant stuffed animal or the like.\nFood court is OK, pretty average. If you’re looking for a sit down option there is also a “nicer” restaurant in te park.\nShow less"], ["Reviewed 3 weeks ago", 2.0, "Why is this place so horribly managed?", "Great rides, great location, just awful, awful management. Rides keep on breaking down, and the place is filthy. I dropped my iPhone off of one ride, and despite having find my phone on and knocking exactly where to find it, and waiting until after hours for management to retrieve, oops not retrieve it, and given incredible runaround, never got it back. The story kept on changing about why Six Flags couldn't do what EVERY other amusement park in LA does routinely: Keep a working lost and found. I understand all iPhones are put in a big plastic bag at then end of the day and are either collected, stolen by employees or sold for refurbishment. LA Times even wrote a story about how incompetent management was in lost and found issues, and now I've discovered that first hand. Sticking to all the other well run amusement parks in So Cal.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Brilliant day out", "We visited six flags with 2 teenagers in mid Jan. I’m not sure if we were very lucky or timed our visit perfectly. The park was busy enough to have a good atmosphere but not so packed that we spent all day in queues. We also purchased the basic flash pass which meant we didn’t have to stand in line and if you work it well meant we achieved around 13 rides in one day\n\nThe park is a little tired in parts and the food was very average but the rides were all superb and the kids loved it.\n\nIf I compare six flags to Disney on value for money six flags wins hands down that said it’s a roller coaster park not a theme park. If your little ones are under 10/12 I would probably give it a miss. Ours are 15 & 17 and they loved it\nShow less"], ["Reviewed 4 weeks ago", 5.0, "January Visit", "This park has a lot to offer thrill seekers. This is the first year the park was open every day of the year. I expected that the crowds would be light on the weekdays in January and they were. Most rides ran one train and that was adequate. No waits over 10 minutes. Been to several six flags parks and this one is the best in terms of what it has to offer.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Tired and in need of renovation", "This theme park is just tired and run down. The buildings and rides all need fresh coats of paint, the buildings need repair and to be updated, the landscaping is bland, and the food selection is boring. Every ride I rode today was filthy dirty, covered in rust, and looked neglected. I hate to be so negative but the park really looked as if it had been abandoned years ago. Most of the rides and attractions were closed today which was even more depressing. The staff were friendly, however. I just hope they can find a balance between their high school homework and working at a theme park. On a positive note, the new Justice League ride was fun! If all the rides were as nice and well cared for, the park would be amazing!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Not for people who loves theme parks", "THIS IS NOT A THEME PARK. I think this requires repeating as you need to know that there will be no (or few) themes or cartoons, or characters, around the park. This is a park for thrilling roller coaster rides and boy did I love it. No waiting for long queues just for a kiddy 1 minute ride.\n\nTips:\n1. Do not read any of the rides before going! You will be in for lots of thrills and have that shock value to boot.\n2. Go early before the park opens and ask if there will be a crowd (the staff will be able to tell given the early queues). Consider purchasing the fast pass if there is, and don't waste the money if there wouldn't! Buy the fast pass online as there usually is a discounted price.\n3. Don't be fooled by closed rides. The rides will close from time to time throughout the day and open up during the day too. However, to avoid disappointment, check online before going to see if there are any closed rides for the day.\n4. Download the app before going. There are wait times listed which allows you to plan ahead for minimum waiting. The map is also useful and you don't have to worry about carrying around a physical map.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Worth the drive for Discovery Kingdom passholders!", "My family buys next year’s Discovery Kingdom passes and meal plans over Labor Day weekend every year, when prices are at their lowest. The free upgrade to Gold status grants free season parking and makes all of these benefits (parking, entry, and meal plan) available at Magic Mountain and other Six Flags properties. We drove down to Six Flags Magic Mountain for the long MLK weekend. The park hours were short (10:30-6:00 everyday) which made the 10 minute early entry for Gold pass holders even more important. There were large lines at the entrance gates at least half an hour before the park opened. Once inside, the crowds dissipated significantly, but being in the park before the masses helped us knock off a couple of the big rides, like Full Throttle and Tatsu before there were lines at all.\n\nSeveral of the rollercoasters were out of service the weekend we visited, and we heard from staff that that will be a regular occurrence now that the park is open 365 days per year. Although we were disappointed not to ride some of the rollercoasters due to scheduled maintenance, there were still many rides if you are at least 48 inches tall. However, even my daughter, who is 42 inches tall, rode Ninja with one of us on what seemed like an infinite cycle, while the other parent escorted the two 48 inchers on the larger thrill rides. The other solid family entertainment ride for 42 inchers is the arcade-style shooting ride (Justice League: Battle for Metropolis), which everyone enjoyed, but which broke down several times during our three day visit.\n\nThree areas in which Magic Mountain has room for improvement are in (1) the entertainment programming offered (zero live shows scheduled for a holiday weekend? Really?); (2) the reported wait times in the Six Flags app (often WAY off, and inconsistently available, to the point of being almost useless); and (3) missed opportunities to capitalize on thematic elements (you can do so much more than just name rides after superheroes).\n\nAnother tip: be sure to wear earplugs— the comfortable kind you can wear all day. Many rides and even the park’s “background music” are ear-splittingly loud. It is much more pleasant with earplugs, and you can still hear everything you are supposed to hear.\n\nAlso, a caution: X2 in particular is quite rough. It slammed my daughter’s head into the shoulder restraint so hard she was in tears for the second half of the ride. So, just because you are tall enough to ride doesn’t mean that the restraints will fit you quite like an adult. Even if you are an adult, the ride can still be quite rough — the “padded” shoulder harnesses feel more like a brick than foam.\n\nStill, the trip to visit Magic Mountain for these Discovery Kingdom regulars was worth the drive. It was a way to get a lot more value out of our season passes.\nShow less"], ["Reviewed January 22, 2018", 5.0, "The best entrainment park ever", "I really love this park. Was our second time and was even better, because it was operating until 9pm!\nWe drove so many rollercoasters that our head was aching in the end and we needed to stop.\n\nWe bought the gold pass, and it really worth a lot! We were able to drive all the rollercoasters and some more than one time due to the time saved. We are vegan, and was kinda hard to find something to eat, but I read later that u can apply for an authorization to bring food in cases of allergy or special meal needs, so I'll try to do it before going next time (because we'll definitely go back again!).\nShow less"], ["Reviewed January 20, 2018", 3.0, "A Six Flags day", "I visited on Monday the 8th since my school had the day off and when I arrived it was raining but not very hard. As we wait for the park to open one of the employees comes out to say that with the rain not all the rides would operate and that if it rained hard enough they would have to close. Not exactly the welcoming I hoped for. So as for my experience in the park there was good and bad\n\nGood:\nPark was almost empty\n\nCoaster collection is amazing\n\nSeason pass was a short process\n\nViper was closed so no one had to endure the ride the day I went\n\nRode X2 2X in 7 minutes in the front and back rows\n\nBad:\nRunning one train on every ride open except for Twisted Colossus\n\nGoliath, Full Throttle, Tatsu, Superman, Ninja, and Drop of Doom never opened\n\nChop Six is awful compared to Panda\nExpress which was the only good food until they got rid of it\n\nVery little shelter from rain\n\nPark smells bad in some parts\n\nAwful restrooms\n\nBattle for Metropolis closed because of the automatic doors failing even though the ride is indoors\n\nThe only reason I keep coming back to Magic Mountain is because their coaster collection is much better than any other California park with my favorite rides being Twisted Colossus, X2, and Full Throttle. Outside of Roller Coasters this park needs help. Unless you really like roller coasters or you traveled a long way to get to magic mountain I wouldn’t recommend it for families or just those who want to go to an amusement park to have a good time because of how long the lines get and the lack of decent food.\nShow less"], ["Reviewed January 17, 2018", 5.0, "I'm a Roller Coaster Fan and Six Fags MM is one of the best parks for roller coasters", "They have 5 of my favorites rides in the world: X2, Twisted Colosus, Superman Scape from Kripton, Goliath and Tatsu. If you love thrill rides, you must ride them!\nFor me is an excelent park becuase I don't mind to walk all over the park, but one thing that this place has is that you walk a lot!!! Is called Magic Mountan for a reason! So be prepared for that.\nTry to go to the special event for Halloween, the decorations an the spooky houses are awesome!\nTalking about food, I tottaly recomend the flatbread pizza and the \"Chicharrones (pork skin) Nachos\" from the Metro Park Pub. Delicious! And if you are tired, the Sport Bar is another good option to eat and drink.\nAlso this place is famous for their funnel cakes! Thet are near the entrance. But if you go at the end of the day, you wil find a large line, so be patient.\nShow less"], ["Reviewed January 14, 2018", 2.0, "Poor infrastructure", "When you visit Universal Studios (Los Angeles) before Six Flags you feel the difference. They have good attractions, but infrastructures is very poor... bad maintenance ... no good options to eat, bad bathrooms. I also think that the chairs of the Coasters could be more comfortable and safe. I felt bad after playing in some. (pain in my neck).\nShow less"], ["Reviewed January 11, 2018", 1.0, "Worst experiencience ever", "At the entrance they said only 4 attractions were closed. We walked the whole park and there were like 15 closed. We walked the park in an hour. They don't make refunds."], ["Reviewed January 11, 2018", 3.0, "Great rides but the food is a let down", "We visited Magic Mountain just before New Years after having visited my wife's family in Ohio and returning to LA on the way back to Australia. We got there at opening and did the full day there and the rides were fantastic. My wife and son did Cedar Point the year before and they felt the rides week on par. Since we only had the one day we got gold flash passes and that certainly helped us zoom through the park. We probably could have done even more rides if we had pushed hard. The downside came at lunchtime. Like most parks of this type outside food is not allowed but as my wife has some allergies we were permitted to bring some snacks but we certainly didn't bring in a whole meals so we lined up like everyone else. The first issue is that there is only one spot to get GF/DF food in the park. The second is that they were sold out of almost all their options. Third the lines move horrendously slow. Wait times at the three windows spread out across the park since places only serfe one type of food were ; 35 min for 15 person line, 32 min for a 12 person line and 28 min for a 13 person line. Just crazy especially since each line had two windows serving and 3-4 staff. While the ride staff seemed switched on and moved with clarity and purpose, the food staff seemed to be zombies just ambling between tasks and needing to recheck each order item constantly.All parks have lines for the food outlets but they move. Clearly six flags can do better given how other parts of the park run - pity this aspect dampened an otherwise great day. Recommend you plan ahead if you decide to go\nShow less"], ["Reviewed January 10, 2018", 3.0, "Not Disneyland", "Had fun with our teenage kids. Lots of thrill seeking rides. They need to put more associates on cleaning up trash. Lots of trash around the ride lines and under ride tracks. Disappointing that ppl cannot seem to deposit their trash in the proper place."], ["Reviewed January 7, 2018", 2.0, "Park is not sympathetic", "We were having a good time until we got to the Riddler’s revenge - my son got his arm crushed in one of the seats (and was screaming in pain) and the worker - Diana - started yelling at him making the situation worse. We were seen by their EMT 20 min later. This place is probably not a repeatable experience.\nShow less"], ["Reviewed January 4, 2018", 4.0, "X2 is awesome", "Magic Mountain is a superb place to get your thrills. Love the rides and the experience. I will travel back here again. A few tips at for me when I do go back. One, get here early. Two, buy a flash pass for the day, worth the extra money. Three, get a dining pass. Four, if you go back twice get a season pass. You will thank yourself and have a great time.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Bloody Awesome!!", "Attended in a group of 3, we all decided to buy the Flash Pass... The only line we had to wait in all day, apart from buying food. Yes it was expensive however enabled us to smash out all the rides, some even twice in our only day! What an awesome day indeed. We didn’t hire a car, so we just Ubered there and Ubered back to Santa Monica. Would have been better if there were a few healthier options for food not in just one area and food places staying open until the park closes. Would have been nice to have better lighting directing fellow riders to the exit as well so we all weren’t walking around blindly.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Roller Coasters!", "This is NOT Disney! This park is full of various types of roller coasters that are thrilling to ride. Yes, there is a kids area with their own rides (including a few junior roller coasters) but for the most part this park is for people who are 48\" or taller. We opened and closed the place. Some of the buildings are a bit worn, but you can easily look past that because you're looking for the next ride. We highly recommend the Flash Pass. By mid-afternoon the lines for some coasters were past the 90 min. wait time. The Flash Pass got us right to the front. Tickets, Flash Passes, and a lot of other things can be purchased online ahead of time. Do yourself a favor and do that before you arrive. Then, you can enter more quickly and wait in a short line for your actual Flash Pass. Otherwise, it could be a lengthy entry wait.\nShow less"], ["Reviewed January 3, 2018", 2.0, "Flash Pass Sucks", "We bought the lowest level of flash pass, SO NOT WORTH IT. Granted it was the cheapest of the 3 levels, but we hardly used it (wait time was not too long - we went early on Dec 26). When it did get busier, we cued up a ride and just about the time we were to go on, the ride shut down, This happened 2x for the same ride. We only used it for 1 ride. It was a pain in the butt.\n\nAs for the roller coasters, it's super rough - felt like I was having a concussion especially on the Viper. X2 was rough as was the Revolution. We went to Knott's Berry farm a few days later the the high speed roller coasters were WAAAY more smoother and you didn't feel like you get banged up.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Great attractions, but not like Disney o Universal", "Six Flags Magic Mountain is an amazing theme park, with great rides, but mostly for adults.\n\nThe only complain is that the security is not like in Disney or Universal parks: in many attractions (including coasters) you get into the ride and you have to PUT AND CHECK yourself that the seatbelt or bar is well secured. That really surprised me.\n\n\nAlso, I think this is not a theme park for children and mostly for roller coasters lovers.\n\nPLEASE, IF YOU GO, GET ON THE SUPERMAN SCAPE FROM KRYPTON RIDE.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Fantastic Rides", "Firstly these rides are unlike anything I have seen in the UK. For the rides alone this is my favourite theme park but there are some things that need to be addressed in order to make this a 5 Star theme park.\n\nWe found the lack of time wait boards frustrating especially when the app was not correct with wait times. Some queues said 2 hours and they were more like 30 and some said 10 and were more like an hour. It just couldn’t be trusted. This made it hard when planning the day! As I am from the UK I wanted to get as much as possible done so having wait time boards would have really helped as I ended up running out of time and missing rides I really wanted to do.\n\nPro’s\n\nIncredible rides, Superman, Tatsu, Full Throttle and Twisted Colossus particularly stood out for me.\nChristmas theming\nCar park close to the theme park.\nLong opening hours.\nGreat choice of merchandise.\nMerchandise not as expensive as other theme parks.\n\nCons\nIn 2017 it was only open during weekends in December.\nInaccurate queue times on app\nInaccurate schedule on app\nFood and drink quite pricey (but to be expected at a theme park)\nSeveral rides such a Lex Luther drop of doom shut.\nThe VR on the new revolution was poor and not worth the wait. Being in the queue for very frustrating and it was badly organised.\nNo single rider queue and rides often going with empty seats.\n\nI feel if the lack of organisation was addressed this would be a top class theme park. It’s a shame as the rides are brilliant but we nearly walked away from Full Throttle as we were just left in a queue quite a way from the ride with a rope across and no member of staff to explain why we were all waiting. We were just left there to wonder. I found the staff in the day were a lot better than the staff in the evening. The staff were very cheery in the day but seemed disinterested and fed up by the time the evening came.\n\nI was also disappointed by the lack of characters walking around the park. The app said there was a justice league meet and greet and after waiting at the meeting point I asked staff how long it would be before they came out and I was told that there was no meet and greets today.\n\nI know they have already addressed the days shut by 365 days of opening in 2018 but I think accurate wait time boards would be a great start, along with the famous attractions being open (it seems Lex Luther drop of doom was a planned closure). Just having a bit of communication during ride queues would be fantastic too.\n\n\nShow less"], ["Reviewed January 1, 2018", 5.0, "Christmas Vacation", "I really enjoy the park. They have awesome roller coasters. We really have fun, is good for any age, and is so beautiful the way is decorate for Christmas."], ["Reviewed December 30, 2017", 4.0, "Top marks for the rides, not so much everything else", "There is a fair bit of criticism on here about the food, the queues and the staff at Six Flags Magic Mountain. I loved it - but I only went for the rides, probably the best coasters on the West Coast and didn't try the food etc. We went over Xmas when it was very busy and lines went up to 2 hour waits. Didn't bother us as we paid for the line-cutter pass and never waited more than 5 or ten minutes. Goliath, Twisted Colossus and Tatsu are all amazing rides. We managed to do all of the major rides with the express pass within about six hours. A truly exhilarating experience. That said, a couple of rides were closed suddenly without much explanation, leaving those who had waited a long time in queues uncertain what to do - whether to wait or leave and return to another long queue. Can't speak for the food, though did notice it was hard to find staff on the rare occasion we needed them within the park. Signage could be better too. Not a cheap day out, especially with the express pass and the parking. There is even a charge if you use the lockers - unlike Universal. But well worth it if you love rollercoasters. I'd have scored it a 5/5 for the coasters and a 3/5 for everything else - hence the 4/5 verdict.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Perfect for thrill seekers", "Having been to most theme parks in the area including Disney, Universal, Sea World, Knott's and Six Flags Great America, SFMM has to be the best in terms of roller coaster thrills on the West Coast. Sure the park is a bit dingy, employees aren't the most friendly nor educated, and the lines can get long BUT... c'mon, our family was here for the world class thrills and unique coaster rides. For that reason alone we got more than our share of white knuckle adventures. A pass holder friend of ours got us tickets for $25 a person the week before Christmas and we were thrilled to get that bargain. Lines were short but not all cars were in operation. Our shortest line was 5-10 minutes at Viper. Lines do increase as the day goes. For instance, Twisted Colossus tends to have a long line due to the length of the ride itself and only one side of the queue was open. Full Throttle was not a bad wait at 35 minutes on the week before Christmas. MM seems to be making a nice effort in playing up the holiday family environment, especially in the entrance/exit and around the backside of Revolution, up to Tatsu.\n\nOur favorite was a clear winner for all family members and that was Tatsu, the flying coaster that has riders suspended almost lying down with the track above. We were absolutely cracking up the entire time because of the unpredictable nature of the track and the unexpected forward under-loop! (It was our first time on Tatsu) Returning to the station on the belly reminded me of hanging off a swing in the playground, with pure childlike joy.\n\nI took off one star (or circle in this case) because some of the food was overpriced and caused one of us to run to the bathroom. Do not get the jalapenos from the grilled chicken salad at Food Etc.! Those things probably have sat out too long. Among the other disappointments was the ride quality at Viper. Simply no. Viper was amazing long ago but this old ride had our heads banged up on those crusty old headrests and harnesses. It should be updated or removed. Our trip could have been better if X2 was open too but we will go again and give that one a shot. Come here for the rides, not the food!\nShow less"], ["Reviewed December 27, 2017", 3.0, "Great rides - some unnecessary terror", "We had a great day with thrill-seeking teens and the rides don’t disappoint. But my son had his harness lose a notch on Goliath - a coaster with upside-down bits - and the staff was remarkably dismissive of what could have been a serious safety issue. Really scary.\n\nAlso, the park seems not to have invested in more than the minimal staff - at almost every restaurant by the evening, there was trash strewn and the bathrooms seemed not to have been cleaned literally all day. Not the kind of stomach turning one looks for in an amusement park...\nShow less"], ["Reviewed December 27, 2017", 5.0, "Love the THRILLS", "My husband, three young adult daughters, and boyfriends went on Christmas Eve and had a fantastic time. We had given our daughters season passes last Christmas so we thought we'd go one last time this year. Since it's the holidays, the park was decorated everywhere. Santa Claus was there so we took a family picture with him. There were toy soldiers on stilts and carolers, music and lights all over the park. The lines for the rides were not long so we got to ride most of them. Twisted Colossus is such a THRILL ride, my favorite of them all. We all had a great time. It wasn't our first visit and will definitely not be our last.\nShow less"], ["Reviewed December 26, 2017", 2.0, "Great if you don't like rides", "Stood in multiple lines for LONG wait times only to find the ride broken. Speakers don't work and employees are too lazy to walk to those far back in line to let them know the ride was broken. The employees response when questioned was oh well, they will just think it's a long line. Seems like there is no employee pride. Oh, did I mention it took over 30 minutes to even get in the park?\nShow less"], ["Reviewed December 24, 2017", 4.0, "Fantastic", "If you love rollercoater you will love this place. However, the line is quite long so prepare some game to do while waiting for in the line."], ["Reviewed December 19, 2017", 5.0, "Great Selection of Rides", "This is personally my favourite of the Six Flags parks I've been to. They have a really great selection of roller coasters and rides here.\nI especially recommend Riddler's Revenge and Twisted Colossus. They keep the park clean and looking nice. They are open all year round too. The six flags gold season pass is a good investment if you might come visit six flags multiple times in a year.\nShow less"], ["Reviewed December 18, 2017", 2.0, "Nothing Special", "I have to say I used to be a big fan of Six Flags Magic Mountain. After 25 years I decided to come to Six Flags Magic Mountain. So I decided to come Six Flags Magic Mountain with some out of town guests. After you arrive to valet parking you are not even greeted with a hello or welcome.\n\nWhen you get to the gates to enter you are greeted with a welcome. After getting into the park the employees could been much more helpful and nicer. I have to admit Six Flags Magic Mountain is not the same as before. When you have people how don't care about there jobs does not make it fun for the people who come to Six Flags Magic Mountain.\n\nAs we all know Southern California is filled with amusement parks for all your entertainment. After spending ten hours at the park I was ready to go back home. If you are a person who loves roller coasters then Six Flags Magic Mountain is the place for you.\n\nThe biggest negative for me about my experience at Six Flags Magic Mountain was the rude staff members who should care about the customers who spend a lot of money at Six Flags Magic Mountain. If I don't come back for another 20 years I would be okay too.\nShow less"], ["Reviewed December 16, 2017", 3.0, "December Visit", "I think if I had paid full price for this park I would have been angry. The roller coasters were randomly closing and opening so it was hard to plan where we were going to go and a little disappointing as some of the coasters we really wanted to ride never did open. On the plus side the wait for the rides was minimal and the young people running the rides were more than helpful and professional. If you can get a deal on tickets than this is worth it if you have to pay full price I think I would skip it.\nShow less"], ["Reviewed December 11, 2017", 4.0, "Good place for fast rides...got repetitive", "My adult children begged for a visit to 6 Flags, so we indulged them on a recent CA trip. In general they really like the fast rides. Most of the lines on a Saturday were not too long, and the rides were generally fast and adrenaline inducing. The $25 fee to park seems excessive. The food prices were also pretty high. The top 10 fastest rides are pretty thrilling though, and mostly my kids liked it alot. I think X2 was their favorite ride of the day. They were disappointed that the New Revolution VR had no VR during our visit. a few of the best rides were shut down for maintenance. In general it was a successful day for the family; personally once there is enough for me, but my kids likely will go back again one day. Tip: buy tickets online in the parking lot - instead of $85 they were discounted to $51.\nShow less"], ["Reviewed December 11, 2017", 3.0, "Family outing for roller coaster lovers with grandkids just reaching the required height for the coasters", "While I am a \"senior,\" I still love riding roller coasters, and that is what this park is all about. As in all amusement parks, there is lots of walking, climbing stairs, and waiting. At the end of June, there were some lines, but not horrible ones. We started early in the day, which helped reduce the wait for many rides. My rating went down to a \"3\" due to conditions in the loading zone for Tatsu, which makes the area an accident waiting to happen. Between the rows of cars, the concrete forms a downward \"v\", with just a narrow strip of flat concrete in front of the cars to load. Bags or purses must be left on a rack on the far side of the ride cars, which then makes them accessible when existing down the stairs. I fell when I accidentally hit the edge of the \"V\" as I rushed to reach the purse rack. Some kids thought we were leaving and started to take my daughter's and my seats. As I turned quickly, I fell and banged my head, landed hard on my forearm, and twisted my foot. My family helped me up and over to a small sitting area by an elevator. A medical tech did come and check me out. Since I didn't lose consciousness, I was deemed OK and agreed that I was not in need of emergency assistance. I waited in the seating area with my grandkids while their parents took the ride, as I wouldn't let them leave without their ride. My surprise came when it was time to leave. I was not permitted to ride down the elevator (from which some people had earlier exited). I had to negotiate the stairs to the ground floor, where a staff member was waiting with a wheelchair. I was informed he would take me to the park exit or another location. After that if I needed a wheelchair, I was informed that I could rent one. I remain amazed at the lack of concern over a person injured on their property. I finished the day at the park, leaving at 9 p.m. or so, and it took approximately two months for the injured arm to stop hurting. I decided to write this review so that people can know to be careful loading and unloading on Tatsu and to not expect much care or concern from staff following an injury not considered life-threatening. There were radios in use after I fell, so I have to assume that higher up park officials determined the minimal \"care\" I received. Will I go back to the park? Probably. Am I likely to ride Tatsu? Probably not. If another park were to be built in the area, you can bet I would try it. For any readers who happen to visit the Great Lakes area, I highly recommend Cedar Point Amusement Park, located in Sandusky, Ohio.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Great rides, expensive food.", "I went there the Sunday after Thanksgiving. The park was alone! We went into 14 rides (twice to Tatsu, X2 and Twisted Colossus!!). I was scared of the rides at first, but it was pretty fun after the first scary ride :). Twisted Colossus felt way harder than I thought but it was pretty fun. Tatsu looks way scarier than it feels. And X2 is pretty intense, but it was over pretty quickly. The food was really expensive ($25 for a cold hamburguer, even more than in Disneyland and Disney World IMO) and it tasted pretty bad.\nShow less"], ["Reviewed December 5, 2017", 5.0, "No lines and tons of fun!", "My family did a week trip to this Six Flags and it was incredible! There was zero wait to get on any of the attractions and theres good comfort food for in between. The only downside was one of us got vertigo from being able to ride the rides repeatedly without a break so be careful. Also, getting the season pass was CHEAPER than the day pass! Plus you can bring a friend along for free with the season pass. It’s like a weird triple win!\nShow less"], ["Reviewed November 26, 2017", 4.0, "Holiday visit", "Visited 6 Flags Magic Mountain, here from Washington state. Parking was fairly simple, though, with the cost of the passes, food, etc., the $25.00 Parking does seem a bit steep. We opened the park, and I appreciated the staff coming theough the lines asking demographic information for business purposes. They were friendly and entertaining.\nI will pause here to say, the Sunday following Thanksgiving is apparently a great day to visit, as the crowds were minimal.\nI did notice right away the great Christmas music and some decor. It looked very festive. But within a few mi it's of my visit I did notice that there is a lot of litter scattered along the paths, under the rides, and in common areas. I do fault guests....THROW YOUR TRASH AWAY....in one of the many, many provided cans.\nThere was also a little disrepair, paint that needs to be touched up, dirty windows, just looked a little run down.\nThe cost of food and beverages seemed high compared to other theme parks, and the quality was just average.\nHowever, the staff was great. They were fun, friendly and well informed. The rides were great, and we were able to ride repeatedly do to the lack of crowds.\nI definitely will come back, I just hope that a little more effort goes into a few areas that should be fairly simple fixes.\nShow less"], ["Reviewed November 26, 2017", 1.0, "1/2 the rides closed and long line ups", "I went to Six Flags in February of 2017 with my two teenage boys. It was my first and last time I will go there. When we were there, 1/2 of the rides were closed and the line ups were enormous. It took 2-2.5 hours wait for each ride. We were there the whole day and only did 3 rides! Terrible! Never again!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Great Adult Fun", "Want thrill rises? Then come here.\n\nWife and I love roller coasters and this place has them!! We spent the entire day on roller coasters accept for when we rode the Lex Luther Plunge of Doom.\n\nWe rented the Flash Pass Platinum device which was worth every dime. It’s $120 per person but you don’t wait in line. You reserve your spot in line and when it’s time to ride you go to the Flash Pass Entrance and you are right there. Some lines would have taken 90 minutes otherwise; Twisted Colossus for one.\n\nSome of the newest rides like Full Throttle shoot you off at 70 MPH over a gigantic loop and then spin you around and then shoots you over the outer part of the loop. Never have I seen anything like it. Talk about an adrenaline rush.\n\nLex Luther Plunge takes you up 400 feet or 38 stories and you free fall that distance until just at the end when you stop just before the ground; wild\n\nNot a place small children. Height requirements average 48” and some want 54”.\n\nGoliath is their tallest roller coaster with a drop of 285 feet and goes 85 mph. If you every wondered what driving off a cliff is like then ride here.\n\nOnly ride I would not recommend is The Viper. It is older for one, and has seven loops but one caused the car to jar hard to the right on one and you slam you head into the safety bars. Everyone on our ride all shouted ouch at the same time.\n\nTatsu has you ride while hanging off the cars. Do this one at night and you cant even see where you are going which adds to the thrill.\n\nBuy everything on line and your in the park in no time. Have a great time!! Mom and dad are entitled to some fun too.\n\nHelpful hints:\n\nParking is $25.. Valet parking is $40.. pay for valet , the extra $15 nearly gets you door to door service.\n\nFood is plenty to buy but the lines are long and Flash Pass doesn’t work there. Plan the time.\n\nThe Flash Passes are available near the lockers nd you will get a full demonstration. It’s very easy once you learn how.\nShow less"], ["Reviewed November 20, 2017", 4.0, "I thought I was going to die on Twisted Colossus!", "I hadn't been to Magic Mountain since Goliath opened in 2001. I thought I could handle Colossus as I had many times in my youth. Well let me tell you, they changed it in 2015 and I had no idea until I was upside down hanging on to nothing sure I was at the end of my life. This park is for Thrill seekers for sure! Anyway after I survived that I didn't go on many rides. My husband did though. It was weird walking around the park seeing some old attractions just abandoned. Then there were others that I assumed were abandoned but later saw others riding like the scrambler and Gold Rusher. I didn't get to go on Jet Stream or the Rapid ride as both seemed to break down about the same time that afternoon. I did get the nerve to go on Tatsu, the laying down roller coaster and that was a pretty awesome ride, would try that again.\nThey had some sort of meal deal bracelet that we purchased. It was a good value, but at the same time, the first location near the entrance didn't have any bracelets upon opening, and the other locations didn't open on time. It was going on 11:30 am and I just wanted my souviner cup and first soda to drink. There were plenty of food choices that were included.\nWe were also there for Halloween Horror Nights. That was good fun. We had an express maze pass that made waiting in line a breeze. The mazes were good and spooky.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Jelly birthday", "Anglican 5 year birthday we stayed at hilton garden inn the park was great looking beautiful for Christmas all the staff were great the lines were not long at all this was a great vacation on Thanksgiving week"], ["Reviewed November 19, 2017", 5.0, "Truly a Great Amusement Park!!!", "Visited in early August with the Family. This was my first time to this six flags location. If you love Roller coasters you will love this six flags. Please keep in mind that we went in August and this location is in the High Desert of Califronia so the temps were in the upper 90's and very hot when we visited.\n\nWe went to the park for 3 days. We are not locals, but we still bought season passes as it piad for itself after the seconf visit. I would highly reccomend the season pass if you are going to go go for more than 1 day as you will save a ton of monry by getting the season pass.\n\nThe park is big. Not Disneyland big, but big enough where you likely can not ride everything in one visit. Be prepared to wait in long lines, but then again it's an assument park.\n\nThey do serve the DOLE WHIP at this location which was awesome.\n\nThe food is expensive so I would highly reccomend going online prior to your visit and purchasing the meal deal which will save you some money at the park.\n\nAgain, my wife and 2 kids loved it. Be aware they do have a Kiddie Land, but if your looking for a park for the younder kiddos I wouls day Lego Land is your best bet.\n\nParking is $20 per day, and if you don't get there at least a half hour before the park opens you will have a long walk to the front entrance. They do have a parking lot shuttle, but it takes forever for them to come around, so get there early at least 30 minutes prior to opening and you will be able to find a secent parking spot and be able to walk to the front.\n\nI'm very satisfied with the visit and Highly Recommend this Six Flags.\nShow less"], ["Reviewed November 13, 2017", 3.0, "Good rides, terrible ammenities", "The rides at this park are good and purchasing the Flash Pass was a good buy as we never waited more than 5-10 minutes (premium pass is $120pp plus gate fee or $85).\nSecurity staff entering the park were rude, they made us throw out our newly purchased starbucks beverages which is a complete joke! Lines for food were 20 minutes long (selection sucked) and the sports bar was hot and stunk like B.O., we ended up leaving early just to go get something to eat! If they are going to ban outside food and drink they could at least offer decent food and drinks inside the park....which they clearly do not!!!\nShow less"], ["Reviewed November 11, 2017", 1.0, "Couldn't Even Stand The Security Line", "Saturday Memorial Day. Security didn't open until 10:30am, the same time as the park.\n\nThe security line is not a line... it's a mob... people pushing to get ahead.. no organization.. meanwhile you stand in the heat suffering.. got there an hour early and the security line is well over an hour.\n\nWe couldn't take it. We flew all the way from Canada for this and the heat while waiting for security was hurting my kids. They just wanted to go back to the pool so we left.\n\nI'm sure Six Flaggs isn't the kind of company to return the money given they won't even hire people to open security a little early and let people in.\n\nOf course if you waited, once you are inside then you could have waited for the ticket line... Then the long ride lines.. so maybe 2pm before you get on an actual ride.\n\nFrom reading the reviews here from yesterday sounds people all saw the same thing.\n\nWhat a joke. I will go back to Disney where they at least care about their guests. I wish I could rate this a 0 out of 5.\nShow less"], ["Reviewed November 10, 2017", 3.0, "Fantastic rides, humungus lines", "Went there yesterday, a friday in november.\nWe were there for 5 hours, didnt eat, and only got to ride 3 rides.\nThats friggin crazy!\nI can always cope with 45 mins-1hr, but 1h40 average- thats just bad.\n\nAll that put aside, the 3 rides we rode were top notch\nShow less"], ["Reviewed November 10, 2017", 1.0, "Poorly managed theme park - Don't go!", "Here on memorial Friday. It's criminal, only 54% of the rides are open. The fast rides are over 1 and 1/2 hours wait time. They obviously have not staffed the park for a holiday weekend. Only one car per ride is running at a time. 4 tickets + parking $300. For this misery. They should be ashamed of themselves. Avoid this park like the plague. Totally mismanaged\n\nAverage wait times on their app are misleading because they average it across all the rides. Of course the small child rides aren't busy. 27 rides closed!\n\nThis place is a rip off. Don't waste your time or money it's shameful\nShow less"], ["Reviewed November 10, 2017", 3.0, "Great ride but bad on a busy day!", "There were some awesome rides - Tatsu for example. But also some that were very similar to each other which left us a bit disappointed.\nIt's only open Friday-Sunday off season which sucks so we were stuck visiting on a Friday (always a big theme park no no!), it also happened to be Veteran's Day where many business and schools were out so the park was packed; you're not allowed to bring your own food or drink in which results in a VERY expensive day, especially when a slice of pizza starts at $10.99! For the drink option we decided to get the unlimited refill ($17 after tax!)...as did everyone else in the park, which meant that the queue to fill was a good 20 minutes minimum. Also lots of the food places were shut which meant lines we so long for the remaining opened ones.\nThe app was useless in informing you of queue times, although discovering one line is shorter than stated is a bonus!\nThe staff weren't very efficient at ensuring the lines moved quickly as many seats were left empty on a number of rides per round. And the rides are on a loop around the park with no cut through paths so walking from one side to the other takes FOREVER!\n\nAfter all the moaning, we did have a good time, but it would have been a better time if things were a bit more organised.\nShow less"], ["Reviewed November 10, 2017", 1.0, "Operating like it’s going out of business", "Went on Veterans Day. Should’ve known something was wrong when there weren’t any parking attendants and everyone was parking however they saw fit. There is only one bus to transport guests from the parking lot. Not enough employees at the gate. Concessions were closed. Ride wait times weren’t posted. The employees look like they hate their jobs. The ninja was operating one car. The queues weren’t organized. There were empty seats and no one was asking if there’s any single riders. People was skipping the lines. The restaurant Chop Stix went from open to close in a matter of seconds with no explanation. They should just throw the whole park away and save us all wasted money. I will NEVER go back or recommend it to anyone. Save your money and go to a real theme park like Cedar Point or Universal Studios Florida.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Lots of fun!", "I'd been wanting to visit the park for a few years and finally did last month. I wasn't disappointed! The rides were thrilling and fun. ITA with another reviewer, who recommended getting there early to be among the first into the park. The lines were LONG for some of the rides and I had to miss a few of them because there just wasn't enough time in one day. Also, it is EXPENSIVE but I think getting the Flash Pass is totally worth it.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great fun", "What a great place Magic Mountain is...wonderful rides many of which will get your heart pounding fast. Great park filled with nice people. Enjoy"], ["Reviewed November 8, 2017", 5.0, "Include this in your LA trip!", "This park is a great day out if you know how to do it! We travelled from Ireland and knew that we definitely wanted to have a day out at Six Flags and it did not disappoint. My advice to you...GET THERE EARLY! If the park opens at 10:30 get there for 9am. This might seem extreme but trust me you will thank me. You will avoid HOURS of queues and be the first into the park. For example we got there at 10:45 and it took 90 mins to get through security and that’s before you hit the queue to get into the park or pick up your tickets! We left and went back the next day for 9am and got parked right at the front, got straight through security and we’re one of the first into the park.\nAnother piece of advise I would recommend especially on weekends is to get the Platinum Pass. Now these are pricey but for a once of annual visit they are worth the money. We skipped every queue, even the ones for the top rides and went straight to the top! We saved hours of queuing.\nThere is free WiFi and prices for food and drink are around expected for theme parks.\nShow less"], ["Reviewed November 6, 2017", 2.0, "Needs work", "Disclaimer: I am a former employee of Six Flags Magic Mountain, but this was six years back. This review is regarding the experience I had as a tourist many years later.\n\nSix Flags Magic Mountain has the most roller coasters of anywhere in the world. This is accurate, but a few caveats:\n\n1) The number is inflated by an abnormal amount of small childrens' coasters (four in total)\n2) The collection is not as well-renowned as say, Cedar Point\n3) This park is miserable to be at\n\nDespite its idyllic mountain setting, this Six Flags takes its famous status and uses it as an excuse for poor maintenance, capacity, appalling upkeep and refusal to provide good service. Waits for food are unbelievably long, and despite sweltering heat only two places on property (near each other) offer escape in A/C. When I went into one of the large gift shops towards the front, the cashier had no idea where else I could find somewhere to relax and cool down. I then spotted a corner of the store where people were actually squatting, and I joined them in an attempt to not suffer from heat stroke.\n\nThe coasters are obviously the reason to go, and while the park has plenty, there are only a few highlights: Twisted Colossus, an insanely fun and quick RMC redo of an old classic; Full Throttle, a smooth launch coaster with a massive loop; Tatsu, an amazingly intense flying coaster. The rest are either clones of past B&M coasters (Scream, Batman), bizarre unique coasters (the mind-obliterating X2, Superman) or ones past their prime (Apocalypse, Viper, Goliath, Ninja). The combination of rough, intense and gimmicky (Revolution's VR, for example) attractions, a hilly, expansive terrain and humid temperatures can create for exhausting experience.\n\nA minor respite would be the new Justice League: Battle for Metropolis, an indoor 3D interactive dark ride that's admittedly impressive and on a Disney-ish level. Even better, it provides 15 to 20 solid minutes in beautiful air conditioning. There is also a small Cirque-like show in A/C as well.\n\nYet these only improve your time there by minimal leaps. The restrooms are dirty, the buildings are in poor shape, tacky with advertising and frankly it doesn't feel like the employees care about your existence whatsoever. It's the prime example of coasting on its own bravado and not caring about anything else. Come for the credits, and just... don't after that.\nShow less"], ["Reviewed November 1, 2017", 2.0, "FRIGHT FEST 2017", "I usually go to knotts and Universal Horror Nights for halloween. Since Universal has been dissapointing in the past years i chose six flags this year. You need three things before you think your ready for this night.\n1. Regular ticket for the entrance. I got the season past since i come here at least twice a year for the rides. $80 (season pass varies from $85-$270)\n2. Maze pass $17 fast pass $27 (DON'T RECCOMEND)\n3. Parking ticket $25 or (exception you get dropped off/Under) $65 season parking.\n\nOnce there if you get the season pass you need to go to the pass holder office to get your pass. If you purchase the maze pass online, DON'T forget your maze pass which you can only get near the stroller/lost and found building. If you did not purchase your maze pass online then you can purchase your maze pass at any shop. THIS WAS NOT TOLD TO ANYONE.\nThere is an app to better help guide through the park but i uninstalled it soon after, it was unless confusing and it did not have the fright fest maze map to help me out. When i finally found a maze about an hour or so later im told to show my wrist maze pass? I had the ticket on my phone for the maze but i was told i needed the wrist pass. I was told to go to the shop all the way down the tiring downhill road (the maze was next to the superman ride) only to be told when i arrived that the only place to get a wrist pass that was purchased online is by the main entrance/lost and found. Unless i wanted to buy new maze pass tickets! WHAT! I didnt feel as bad when i realized i was not the only person not enjoying this night, there was several people also confused on the lack of organization. After three hours wasted i now had my wrist pass and was now all the way back in the main entrance. It is now 10:00pm and i have about three hours to enjoy what i can. I only got to attend two mazes and one freefall ride. The food and atmosphere is the same as a regular day at six flags.\nIn conclusion, I spent more money coming here, I honestly DID NOT have a pleasant time here for fright fest. I will come here once in a great time during the day just to enjoy the rides. But i gave this a chance and it was bad. Perhaps the Queen Mary next year. Im yet to find my yearly Halloween there park.\nWISH YOU GUYS THE BEST OF LUCK!\nShow less"], ["Reviewed October 31, 2017", 3.0, "Fun, but tiring", "Went with wife and 11 yr old. 1/2 of the coasters were just plain too much for us. So we stayed on the more moderate ones. If they had a Singles line, we took full advantage of those and skipped the 1hr+ lines. We rode one of our favorites about 5 times in 30 minutes. Place is a bit run down. Food lines are ridiculous. And $14 for a slice of amusement park pizza is a bit over the top. $5 Cokes as well. And $84 tickets to get in. Just too expensive in general. Go to Knott's Berry Farm for a more quaint park, smaller lines and considerably more affordable. I think Six Flags is more for the local teens who have season passes and meal/drink plans who go there every other Saturday...\nShow less"], ["Reviewed October 29, 2017", 3.0, "Season Pass Visit on Halloween 2017", "went here for the two nights before Halloween to get in the coasters and all the Halloween. Friday was great as the Park was not overcrowded and lines were short. easy to get to all major rides. Saturday was another story and leads me to give them a mid range rating. sorry we got here afternoon as all rides were now long lines and on avg. took over an Hour to ride with the heavy hitters in excess of 2 Hrs think X2, Twisted Col & Goliath., Full Throttle the really bad ride was the New One Justice League and the way it was designed to not move lots of people very fast. this ride is in three parts and the first two are designed to kill time and then you actually board the 3D ride simulator for the shooting part. the movement of the line is really slow and snakes outside beyond the Que. Beware as they just don't seem to care at the park. Saturday also had all the Headaches of too many people waiting for food & drinks in long lines and park employees just don't care as they are under staffed to handle the hordes of people who want their cup refilled and food to get energy. The entertainment was the best part of the night and loved the actors and Music next to Full throttle. all in all it was fun but tiring to wait in long lines, as Fast Pass is way too expensive for a family of 4!!!! I won't be renewing for 2018 because of frequent park problems with crowds and management lack of planning\nShow less"], ["Reviewed October 29, 2017", 3.0, "Not the best", "Thankfully we had a season pass from the Chicago Six Flags so we didn't have to pay on the day. Also at the end of August it was extremely quiet. We went on a Monday and Tuesday and the longest queue was about three minutes!!!\nA fantastic collection of very very good thrill rides and good children's rides too.\nHowever, most of the staff look incredibly bored and uninterested, the place desperately needs a coat of paint. In my opinion they need to stop building new expensive rides and concentrate on improving the ones they already have.\nThis place is very very expensive.\nTake water inside and leave your picnic in the car. Get a hand stamp and come back after lunch.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Fright fest Night", "This never gets old. Roller coasters galore and during fright fest even better. Have fun all day and make sure to get your season pass that you can use at any Six Flags in the USA !!! Next up San Antonio TX six Flags !!!!!!!!!!"], ["Reviewed October 28, 2017", 1.0, "What a dump!!!", "Seriously I’m surprised people don’t die here on a daily basis.\nThere are young young untrained kids working the ticket booth and they couldn’t care less about customer service.\nPaint is peeling everywhere, sticky everywhere you touch, and just flat out rundown.\nDefinitely not a wholesome family day.\nFood is SO expensive and you can’t bring one thing in.\nJust gross.\nShow less"], ["Reviewed October 27, 2017", 1.0, "Six flags is a DUMP!!!!!", "Half of the roller coasters were closed!! It’s all up hill walking, and dirty!!! There was no soap in any of the bathrooms and a small bottle of water was $4.95, ridiculous…considering a 24 pack is only 3 something The parking lot is full of potholes and all of the asphalt is crumbled. Parking is $25.00/ car! Would definitely not recommend this park!\nShow less"], ["Reviewed October 26, 2017", 4.0, "Intense!", "We had a blast at Six Flags. Just walking around the park hearing all the coasters around you is enough to get your adrenaline going. Staff didn’t keep lines moving like they could have and things didn’t flow as nicely as they should have but we didn’t wait too long for most rides overall . Food and drink was a little pricey but comparable to other theme parks.\n\nGreat roller coasters, lots of fun for thrill seekers. Not quite as clean and organized as other theme parks.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Great roller coasters", "Come to this park if you love roller coasterws, there's loads of them. The ones on the right of the park are better than the ones on the left, as you come in, as they are newer. They still appear to be expanding the park into the car park. Food and parking are expensive.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Best Amusement Park!", "If your are looking for thrills this Amusement park has it all. Had an absolute blast and would recommend to anyone. *** Bring ibuprofen and motion sickness pills!!"], ["Reviewed October 20, 2017", 5.0, "Not for the feint hearted!", "We went on a Monday (about 28th) in late August; if you intend to go in late August, check on the website that the park will be open - as we were planning our californian trip earlier in hall year, the website said it was due to be closed during weekdays in the last week of August.\n\nQueues - none at all! If we'd have bought a flash pass it would have been a waste of money.\n\nRides - brilliant! Mostly full on, scary roller-coasters that were absolutely brilliant. X2 is the scariest thing I've ever been on and the green lantern is the most jerky I've been on. Colossus and Goliath were simply brilliant too.\n\nFood - not bad, queues for food and drinks were longer than those for the rides!\n\nThe park was very hilly though, and it was an incredibly hot day. It was really tiring as the result.\n\nWe all loved it and I strongly recommend it if you are a coaster fan - this is not a Disney type theme park. It's a pure coaster park.\nShow less"], ["Reviewed October 20, 2017", 4.0, "If you like Roller Coasters then this is your park!", "We have annual passes to our local Six Flags in Georgia and we decided to visit the California park. As you know, each Six Flags has its own special focus and this one is definitely coasters. There are several coasters in every kind of configuration you can imagine! If you love coasters then you have to go on The Twisted Colossus. I still have flashbacks from that ride. Wow! There is also a kid's area. There are also a few intermediate rides like the Ninja. There is a water park right next to the main park for an extra fee.\nShow less"], ["Reviewed October 16, 2017", 5.0, "FRIGHTFULLY good around Halloween!", "My review is second-hand, since I am not into scary mazes, but my teens LOVED Fright Fest at Magic Mountain! They were able to get through all 8 mazes and a couple of thrill rides from 7:30 PM to 1 AM last Friday night. Yes, the mazes are a separate price, but with the special Six Flags had for Annual Passes (get the rest of 2017 and all of 2018) and a family of 4 getting an upgrade with free parking (usually $25), it was a SCREAMING deal (see what I did there?)! I admit that I made a bee-line for the Sports Bar where I plugged into my laptop to catch up on work, but was able to amuse myself with some snacks and the street entertainment beforehand. The decorations, wandering monsters and special effects are great fun! I normally love Tatsu, Goliath and the Riddler ride for a good time, so I am looking forward to returning for the Holidays with my free parking (and without my laptop).\nShow less"], ["Reviewed October 16, 2017", 2.0, "Disappointed!", "During my visit for the first time ever my car was keyed while I was visiting the park and was told it was my fault for visiting the park and assumed the risk when I went to complain about it to park officials. And I have yet to hear from anyone\nShow less"], ["Reviewed October 16, 2017", 5.0, "OMG thrill central", "We love thrill rides and this is thrill central, in the middle of no where this park is an oasis of steel mountain coasters - the park gates open and you see thrill seekers running to their early morning rush! We bought the flash pass which I highly recommend the park has long opening hours but the queue didn’t get smaller as people flood in all day some rides had queues of 90mins+ we waited 10 max with flash pass,and ride every ride at least once so worth the money. The X ride was the best coaster I’ve ever ride and I’ve rode a lot!! The park gets very hot as not much shelter but we love the sun just a warning for families, we stayed for the scare fest mazes and once again these get very busy queue jump pass an extra $30 but again we did all the mazes so worth it good thing about this park you only need passes for the mazes you can enjoy the scare zones that were really good with just park entry tickets so no extra cost and unlike Universal they don’t close the park so we’ll done!! Ride the rides in daylight-then for an extra thrill in the dark !! Amazing theme park but in the middle of no where will recommend and I will be back.\nShow less"], ["Reviewed October 15, 2017", 3.0, "A bit disappointed", "My husband and I are in CA to celebrate my 40th birthday and Six Flags MM was our first stop. With tickets already bought we head for the first line which is security. It was ridiculous the organization of how this process went. We had bought a season pass (good for any sf) so we got in that line. While in line my husband went to the bathroom. He shared for the park to just open how nasty the condition of the bathroom. We get our seat pass processed and get into the gold member season pass line which got us in a few minutes early. We ride X2, which was great and head to another ride. We couldn’t tell if it was open and ended up on accident going through the fast pass line where we were told wrong way. All the bathrooms were nasty as I used one 30 minuets after park opened and of course they got worse as the day went on. I can’t imagine what they are like in summer time. All the food lines were absolutely packed so you were going to wait at least 30 mins in line. I skipped food bc I wanted to ride. We were in line for Goliath and had been for about 50 minuets when 5 people broke in line. We were still about 15 minuets to ride. Not sure how they made it through the whole crowd, but they did. I was going to say something, but for safety reasons my husband said no. There was disorganization at the rides and most of staff unfriendly. A good note, on Superman, a worker saw my bday button and had the ride sing to me. It was a fun day and I have good memories, but this Six Flags needs some help.\nShow less"], ["Reviewed October 14, 2017", 1.0, "Not worth it", "A lot of rides were closed. Pricing is absurd for what's offered. Several rides down or 'delayed'. Book a full day at Disney and enjoy your day more. It's a big no-go!"], ["Reviewed October 13, 2017", 5.0, "Ideal for Thrillers", "Looking for roller coasters in LA?Cant find them?Go here!This is one of the best theme Parks in the world.Ranging from SCREAM,Twisted collussus and MANY MORE.You will sure have a wonderful and scary time there.I think that if you bring small kids along,You would have to leave them at corner,since those roller coasters are only meant for 13+Aged year olds.Therefore,If you have kids,Just go to Universal studios Hollywoods.They are sure going to have a fun time there!\nShow less"], ["Reviewed October 12, 2017", 5.0, "Roller Coaster Capital of the WORLD", "Have been a season pass holder for this park for over 7 years. Best rides in American, they have over 12 high speed roller coasters that are just to die for, X2, Goliath, Scream, Tatsu, Superman, etc.... This park is a must for any roller coaster fan.\nMy favorites are X2 and the new Twisted Colossus.\nSave time and energy if you go on a weekend by the flash-pass for head of the line no wait thrills, cost from $50.00 per person extra up to $100 per person for the Platinum flash pass which lower wait time to less then 10 minutes and allows you to ride twice on some of the rides. This cost extra on top of the admission or season pass.\nShow less"], ["Reviewed October 11, 2017", 5.0, "October is the best time to go!", "Bought our tickets online for $55...much cheaper than Disneyland! Only a few of the rides in the park were closed, but there were a majority of the roller coasters available. What a great time to be in the park...no lines at all, and the weather was great. Some of the roller coasters here are crazy fun...and very fast. If you are a thrill seeker, this is the park for you.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Good rides", "The rides are amazing! Lots of thrill rides that are insane!\n\nOnly real complaint is they need to get the people who budge in line under wraps. So many times there was one person in line and all of a sudden a handful of people would push their way through and meet up with that 1 person. Other parks have no tolerance for this and Six flags should be the same. Let me clarify these are teenagers and adults. Not someone who had to take their kid to the washroom.\n\nShow less"], ["Reviewed October 10, 2017", 4.0, "Fun family outing", "This was our first time with our boys (10 and 5 year old) to Six Flag Magic Mountain. We had a blast! Many roller coasters to ride, even for our youngest (42 inches). The park is huge, definitely wear comfortable shoes and clothes (quick dry for those wet rides). We got to experience Freight Night, music and character was great. Overall the park was clean. We may have started an annual trip since we are members\nShow less"], ["Reviewed October 6, 2017", 5.0, "Had a blast!", "Everyone was so nice!! Very professional and informative! The park was clean! Lines were not long. It was a pleasant atmosphere! We also went to fright feast it was amazing. They did put a scare in me! We will be going again (soon)."], ["Reviewed October 3, 2017", 5.0, "Not real impressed", "The place was dirty, unfriendly miserable staff , high prices for under mediocre food. One bathroom we went into was like walking into a swap . The grounds were unkept, real weedy and trash everywhere. Peeling paint on everything. Just rather gross."], ["Reviewed October 3, 2017", 3.0, "Thrill ride park", "Thrill ride park That is really geared towards teens and 20 somethings. Tons of energy and lots of fun but it can get a bit rowdy on weekends. It is my understanding they are now going to be open year-round"], ["Reviewed October 3, 2017", 5.0, "Awesome place", "We were lucky enough to go on a quiet day so no queues and got loads of rides in, Twisted collosus and superman are stand out rides. great place"], ["Reviewed October 2, 2017", 5.0, "Thrill Central", "Despite some reviews reporting that the park is rundown and out of date, we found that couldn't be further from the truth. This park offers something for everybody, however if you are a thrill seeker this park is a must! From standing roller coasters to twisting, turning, looping and insanely tall swooping coasters that will leave your heart in your mouth, we could not recommend it enough. The park opens until 11pm or 1.00am depending on the time of year, with most coasters running until close. If you are lucky enough to be there in September and October over a weekend, you'll experience the fright nights from 7pm, which are quite terrifying but good fun!\nShow less"], ["Reviewed September 30, 2017", 5.0, "Amazing!", "Six Flags is the best theme park franchise in the world. X2 is the best ride in the world. Period! If you like your rollercoasters to be extreme, this is the place to visit. Per square foot, there are so many thrill rides, it takes more than a day to ride them all. Buy your tickets online to save a few dollars and be careful not to get ripped off by the food outlets. Expensive! Other than that, it's a perfect place to have fun. I say again, X2 is the greatest rollercoaster ever. One ride on it was worth the entrance fee alone.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Lots of fun", "My daughter and I had a great time at Six Flags. The rides were a lot of fun and the staff were,on the whole, very helpful and friendly. The only problem we had was with the breakdown of a mobility scooter. I had an ankle injury on the day of our visit and the scooter broke down and it took 30 minutes to get a replacement. Other than that, the visit was great fun.\nShow less"], ["Reviewed September 29, 2017", 1.0, "Don't bother.", "As 2 young adults, 25 and 30, we came to 6 flags reading about an awesome theme park with great roller coasters.\nWe stayed for 1 hour and left.\nIn this time we managed to go on 2 rides and wait in line for one that was broken down.\nAfter being to Disneyland and Universal Studios the 2 previous days, this was an extreme disappointment.\nThe park is run by kids who look like they should still be in school. Not very confident on safety protocols.\nIt was extremely hot in the sun and the X2 had broken down with people on it in full sunlight.\nNone of the kids knew what to do or how to help the poor people who were strapped into the ride out in the sun. On top of this, the peanut on the microphone spoke over the PA so that not one person could understand him.\nThis place hasn't had any maintenance in at least 5 years and everything is extremely run down and unsatisfactory.\nI didn't care about spending the money as it had allowed me to write this review.\nYou would have a much better time at the local playground.\nDon't bother to waste money buying flash passes as the rides are empty and they are well over priced.\nI can't see this place being open for much longer where it is and the state that it's in.\nSave your money and go explore something else in LA.\nThis place is rubbish\nShow less"], ["Reviewed September 29, 2017", 1.0, "Run by kids and rides malfunctioning", "Today we went to @SixFlagsMagicMountain\nWe left after 20 minutes and 2 roller coasters. They were pretty fun and scary but the scariest thing is how run down the park is and it's run by kids!! We lined up for the x2 ride and it malfunctioned and ppl were stuck on it in the sun for ages!!! Fk that. The place is creepy AF. It's got a horrible vibe and the staff/attendants are rude.\nWhen we asked if there was a problem with one of the roller coasters (which there clearly was) all we got told was 'awww there's gonna be a delay, experiencing technical difficulties' NO WAY! Just be honest and tell the ppl lining up that the ride is not gonna work for at least another 45 minutes with poor ppl stuck on the ride, in the sun!\nI cannot believe that every ride at the place is literally run by 16 year olds. Don't even bother. It's a s#it hole.\nShow less"], ["Reviewed September 28, 2017", 5.0, "no lines", "it was a pretty great day to be at the park. when i got there only the first parking lot was being used so i figured lines would be pretty short. but when i got in i found there were no lines at all with so many rides for everyone to be spread around. was really glad i didn't spend money on the flash pass with no one there on a tuesday in sept. didn't get a chance to eat much food while i was there, just had a funnel cake and beer. prices are as expected at a place where there is a captive audience. all the roller coasters i got to get on were great, 3 or 4 rides weren't open that day. that's alright with me, it will leave something new for my next visit. my favorites out of all the coasters i rode were x2 and the drop of doom. the drive from lbc only took an hr to get there and an hour and a half to get home at 6 pm. overall, a great trip and we'll be back.\nShow less"], ["Reviewed September 26, 2017", 3.0, "Ghetto Disney", "Last time I was here was in the 70's, so things have changed quite a bit. I was there on a Saturday in September. It was busy, but not crazy. I should have purchased a Fast Pass to avoid the lines. Wish there would have been a Fast Pass for the food & drink lines. Those lines moved slower than the ride lines. Nothing like seeing one person working the counter and two others just hanging out in the food shack doing what looked like nothing. The food is very overpriced for what you pay for. If you like coasters this is the park to go to. Overall it feels like a ghetto Disneyland. No mirrors in the bathrooms because there would be graffiti scribbled all over them. The Fright Fest was fun, wish they would have done more with that.\nShow less"], ["Reviewed September 26, 2017", 5.0, "So many rollercoasters", "Massive park with 15+ massive rollercoasters. So many that even a rollercoaster enthusiast had to tap out and miss a couple! Park is very very large. Lots of walking and can get very hot. Good value for money."], ["Reviewed September 25, 2017", 3.0, "Fun", "U have to love fast twisted dropping fast rides. Half of the people are great, the staff are great but the other half are problem people. Cut in lines because no workers/security around, lack of respect to others- not on open rides. Example- Batman ride u go through a enclosed cave and that is where problems occur. Very expensive to eat there\nShow less"], ["Reviewed September 25, 2017", 5.0, "Check wait times before buying flash pass, check for online discounts", "Visited on a Monday in September. Wait times were close to zero (5min or less on most rides) except for X2 (still only 15min). That made the day a great after reading about wait times of up to 2hrs.\n\nMake sure to check online for tickets. We scored $30 per person discount for direct online booking 3 days in advance.\n\nOnce you book tickets expect to get several follow up emails with offers for food/drink advance purchase discounts plus the Flash Pass. This is their front of line/express pass equivalent but with 3 different categories which can add up to $100 extra per person. Before you buy the Flash Pass make sure to check third party web sites of current/forecast wait times. We were ready do spend the extra money until we checked and could see the day before wait times and forecasts were saying 5-15 minutes. So glad we checked and saved $400 - would have been very annoyed to pay that and then find there was no wait anyway.\n\nIf going outside peak season it is also worthwhile checking ride closures in advance. About 4 rides closed during our visit.\n\nMany reviews comment about the park being run down. I would disagree. Sure, it is not as perfectly manicured as Disney/Universal but then not much is.\n\nThe rides are fantastic. We always be remembered as where our daughter abandoned all previous fear on rides and went on everything.\nShow less"], ["Reviewed September 24, 2017", 3.0, "Great for thrill seekers", "Magic Mountain is a great place for people who love roller-coasters. We went on a Thursday because it is the only day during the week that they are open past 6:00pm. I was glad that we went during the week because we were able to get on the rides fairly quickly. My daughter was able to walk right on a few rides, but no ride lasting more than 30 minutes. It cost $25 to park which, unfortunately can be expected. I heard that the weekends are always crowded which I think is because they offer annual passes for the same price as day passes, so all of the locals are there on the weekends, so highly recommend going during the week. They say no food or water, but everyone had food and water. I highly recommend that you bring some with you because there was not one thing in there that was less than $11,not even a slice of pizza. (Which was not at all impressive looking) The souvenir cup was $30. They offered a discounted rate if you bought 2 or more, but $30, really!? My daughter and I ended up splitting the chicken strips which came with fries which was plenty to get through the day and eat somewhere else when we left the park. There are food places throughout the park, but it is very dependent on when you get hungry on which luck spot you will be on what food you are stuck with purchasing, but everything seemed to be $11, $12, $13 on up. And not very impressive food either. It is very hilly place, which hence \"Magic Mountain\" so we got a great workout. lol. The rides were great if you love roller coasters. I was surprised that there were no place to charge your cell phone. I was on a constant lookout because I do not like roller coasters, so spent a lot of time waiting and nervous that my phone was going to die. So again, biggest recommendations, go during the week and bring snacks and water.\nShow less"], ["Reviewed September 18, 2017", 1.0, "Terrible Membership Program/Customer Service", "I have gotten a membership fall 2016 with some friends since I was going to be visiting the theme park a couple time in 2016 and 2017..! I was being charged for an overdue payment that wasn't correct there was a misunderstanding.! Yet to be notified, I was just being charged more .! Thats why I decided to call customer service and was talked to right away in a bad tone then bringing up my situation I was being talked to wrong and not helpful at all .!! Felt very disrespected.! Never get a membership at six flags don't recommend it ! Unless wanna be having issues with them .!\nShow less"], ["Reviewed September 18, 2017", 3.0, "The Magic is gone", "Magic Mountain what is going on? How did you become so run down? I grew up in Santa Clarita and this park has let itself go. I am shocked. Does the park have a Gardner because there are weeds growing through the sidewalks as if nature is trying to reclaim it's space. The bathrooms are in disrepair and dirty. There are nails and sharp objects sticking out every place. No VR headsets for the all \"New Revolution\". Worker claimed they are updating the video for Christmas and won't be ready until November. What about a Halloween theme? Not very crowded. Probably the last visit I will be making. Spend some money on maintenance of the park.\nShow less"], ["Reviewed September 14, 2017", 1.0, "Security Team and Customer Care Complaints", "Good afternoon\n\nI would like to register my complete discontent and disappointment regarding the professionalism the security team of Six Flags Park in LA , as I was there with my family on August 19, 2017 we were Expelled and put out of the park by the security team Without any reason for such abusive behavior regarding the security team of park.\n\nI was just smoking a regular cigarette in a reserved place and allowed by the park when Mr. Luiz and Mr. Xavier( Security team responsible) approached to me and for my surprise… advising and they are saying that I could not smoke in that place ... without any questioning from my side .... so immediately I was trying to find a trash to put out the cigarette…again, immediately I went through to a trash looking for to play out the cigarette .... when I returned to them, the security team Luiz and Xavier , they immediately said that I needed to leave the park ...... so many times I was trying to explain this mistake and saying …I apologize and I did not understand the reason or act I had committed for that bad behavior and Power on the part of the security team sides .... I tried several times informs them that I was looking for trash to throw away the cigarette, I swear , promise , I had not disrespect the Mr Luiz and Mr Xavier any time .... They can not to do this with me and my family, because the visit was a great dream and we could not be interrupted for such a futile reason on the part of a team.\nSecurity team is totally unprepared, abusive , unexpected and they can´t have these behavior and power for decision with the tourist and customer ....I and my Family are facing a great bad feelings and physiologic disturb with this situation., It´s not Fear, do not combine with the USA people behavior that I visit your country so many tomes and I love there\n\nI demand the full action and necessary measures of the administration of the park, beginning with the reimbursement of Tickets and Fast Pass that we bought, + Flight tickets and Hotel costs, as well as the retraction by the security team to my family ..... reinforcement Neglect and lack of education and total , aggressive behavior, uneducated, are totally unprepared ... we were treated with threats, insults, aggression .... I ask once again the management of SIX FLAGs a correction and apologizes of the fact to my family as well as an immediate solution of our reimbursement and retraction of excuses .... I know very well our rights just as I will not rest until I have solved this great psychological disorder And financial assistance that the security team has I really want to resolve it in a friendly way, without involving the newspaper, TV as CNN, New York Times , Websites complaints , Consulate, or whatever is necessary, but I will not leave this matter aside ... at all costs\n\nWe are really disappointed with SIX FLAGs, even I sending a lot of emails and registering at Six Flags Complaints, they had not reply nothing until today, I really would like to get a help, as per the Legal department, Lawyers , Justice , I have to resolved it, Brazilian community can not accept it, I´ll spend so many time to get our rights repaired\n\nRegards\n\nFlavio\nShow less"], ["Reviewed September 13, 2017", 2.0, "Awesome rides but ticketing & passes very poor", "I visited Six Flags today and I originally bought a Platinum Flash Pass and 1-Day dining pass. Both of these passes were not worth the money at all.\n\nFirstly the Flash Pass was not needed as the park was not particularly busy so I could've gone on rides with slightly more wait time and not have to spend a fortune. They should not be selling this Pass to use at this time when park management would know it is not needed.\n\nSecondly, I purchased the dining Pass beforehand and was disappointed with that as not every restaurant accepts it and it was extremely difficult finding an open food place for dinner even with 1 hour left of the park opening. The employees at the food shops also did not know how the dining Pass worked.\n\nUltimately I was disappointed spending so much money on tickets & passes that were clearly a waste of money. I would recommend people research heavily the time that they're going before buying any of these add ons.\n\nI'm giving two stars just for the roller coasters as they were great fun.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Great for thrill rides", "Visited in mid September 2017 and the place was practically empty - no queues! Rides vary from old rickety wooden coasters to newer (taller) hyper coasters and some interesting ones in between.\n\nThe proportion of proper thrill rides is larger here than somewhere more family oriented like Universal. So hardcore thrill seekers should be satisfied with the choice. Also recommend the rock 'n' roll crab sushi if you're eating at the park. It's delish.\nShow less"], ["Reviewed September 11, 2017", 1.0, "Not a Safe Environment (No Parking Lot Security)", "For being a large company with as many guests per day that they do, I am shocked that they don't take guest safety seriously. There is no security in the parking lot. They also make it almost impossible to make a complaint, not only do they do nothing about complaints but they also act like you are an inconvenience. They also claim no managers are ever available. I do not recommend anyone that values their safety and the safety of their family to visit SFMM. Note: I am not referencing ride safety, I am referencing personal safety from other guests on their property.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Another great day at Six Flags Magic Mountain", "One of my favorite places to go and hang out and have fun and reasonably priced with more big roller coasters than any other park around"], ["Reviewed September 7, 2017", 5.0, "Thrilling", "We only went for like 3 hours in the evening, because we had the go passes, so the lines were very short. We did most of the most thrilling rides and let me say that they indeed are very thrilling, a little scary at some time, but worth it. We had a great time!!\nShow less"], ["Reviewed September 7, 2017", 4.0, "Excellent for six flags", "This area is rural and there is very little around to do but six flags is a 5 minute drive from this location which is excellent if that is why you are visiting, great areas for feeding but that is all. The hotel is excellent and great value for money, well furnished and comfortable sleeping.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Rollercoaster Heaven", "This may be a bold statement but i can honestly, genuinely say that Six Flags Magic Mountain is THE greatest theme park i have ever been to. I travel the world for at least 4 or 5 weeks a year visiting theme parks and riding roller coasters and Magic Mountain has been on my bucket list for a long time. Unlike other bucket list parks like Cedar point, Magic Mountain more than lived up to the hype. I was supposed to go once, i ended up going 3 times because it is really that good. The roller coasters are amazing, there is something for everyone and the rides are all different with each offering a different experience or sensation. I have ridden over 250 roller coasters around the globe and at least 2 (possibly 3) of the rides here make my top 20. Twisted Colossus and Full Throttle are among the best rides I've ever been on and i genuinely had a heavy heart as i left the park for the final time. If you get chance to go, do it, you will not be disappointed\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great rides, expensive food and slow staff", "The tag line says it all, if you love rollercoasters then this is the park for you. The thrill rides are out of this world.\nHowever, the staff are slow it took us an hour to pick up our tickets to get into the park after spending half an hour in the wrong queue. Then another half an hour stood in the queue where there was only one member of staff.\nFurthermore you can't take any food and drink into the park at all and the park charged a lot of money $15 for a slice of pizza and a drink.\nWould still go again just be prepared the the food is expensive but the merchandise is more reasonably priced than other theme parks I've been to.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Went in late August - did not queue once", "We went on a monday. The park was dead in terms of visitors. It was great.\n\nWe got there at 10:30 and left at 4pm. We went on all the rides bar 3 as our day was cut short sue to rain and lightning.\n\nThe park has some brilliant rides. Water rides don't appear to get you as wet as you do in the UK. Thats my only observation which is a negative, if you call it negative.\n\nSome of the rides are the best rides I've ever been on. Much bigger and faster than the UK.\n\nIf you like rides, go here.\n\nFood is a little expensive, so bear that in mind. Drinks wise, I'd buy the all you can drink package on line before attending.\nShow less"], ["Reviewed September 4, 2017", 5.0, "ooo loved it", "if your into rollercoasters then this is your place, it was too hot on the day we went but i loved this palce, could spend all week here if it never made me feel sick with the rides, would deffo go again"], ["Reviewed September 3, 2017", 3.0, "Roller. Coaster heaven", "If you like roller coasters this is the place for you\nThere is nothing else really here other than roller coaster after roller coaster\nThe heat was intense on my visit 106 degrees luckily the park was quite so we didn't have to queue otherwise you would have collapsed in the heat as after 15 min wait time there was no shade\nI also think the parking at $25 dollars was really expensive especially as we had paid $85 per person to visit the park\nWould only visit if you are a avid roller coaster fan we took an elderly gran and there was nothing to do for her\nBetter bet would be universal\nShow less"], ["Reviewed September 3, 2017", 3.0, "Does Season Passes flash deal worth it for 1 visit ?", "Does Season Passes flash deal worth it for 1 visit ?\n\nI saw the offert for 80 USD maybe it worth even for one single visit (1p) because parking fees are offered, if anyone join maybe a regular ticket is better. I am not sure you can invite a friend without returning to it.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Amazing day......very low attendance day", "Family of 5 who enjoy roller coasters had a fantastic day at Six flags!\nI pre booked tickets online for $59 saving $20 per person and paid upfront for parking. Tickets were for a period of time so we retained flexibility even though travelling from the UK.\nIn the entrance queue (line) I spoke to a local asking what rides are best to start with who advised that the park would be a \"ghost town today\". The park, I guesstimate was 10-20% full and therefore we did not queue for any ride all day except when we tried to ride X2 which was working on/off all day and was the one ride we did not end up riding. We visited on a Thursday at the end of August.\nFavourite rides, Goliath, Full Throttle, superman and Twisted colossus.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Rides, Rides, Rides", "Lines were not so long, but when it is a low volume day there are less food options in the park. I like the rides. Overall a decent Park."], ["Reviewed August 29, 2017", 4.0, "Blew me Away, all the way from the U.K", "This park was outstanding. It's my second visit to a Six Flags park and this one really excelled itself, better than Six Flags Great Adventure, the only other Six Flags park I have visited after this one. Loved the collection of coasters. The staff seemed decent. Park was clean and lots of food options and gift shops for all tastes.\n\nFortunately I found water fountains by most restrooms so a tip is to bring in an empty water bottle(since you cannot bring in your own food or drink) and fill it up throughout day, necessary as you will be walking a lot and in the heat it's crucial to keep hydrated, saves 4-5 bucks. I enjoyed the sandwiches by Twisted Colossus- my favourite roller coaster.\nThey have a Cold stone for cold shakes smoothies and ice creams. Prices what you expect, but I found $20 (a meal, decent portion size and ice cream/shake/smoothie) was enough to keep me full and hydrated (- helped with the water fountains) all day.\n\nNow for the cons\nThe wooden coaster, Apocalypse was down which was a small shame but plenty of rides to turn attention to.\n\nI did not enjoy all of the rides but there is such a huge range.\nDo not recommend; Jet stream, quite uncomfortable to ride as is Viper and Green lantern,but that was my personal experience.\nNo virtual reality glasses on New Revolution available/ready so that defeated the point, I assume there has been issues with this aspect/dimension.\n\nI am personally not keen on the super heroes aspect/theming and feel Six Flags is losing touch with its original branding but I suspect that's the idea, it was hard to find any original Six Flag logo merchandise in the gift shops. I think the superheroes aspect is an attempt at theming and mainstream appeal. But the general quality of the rides speak for themselves.\n\nRide operations were good on all rides.\n\nI particularly recommend Tatsu front row, a must for a flying coaster of this magnitude!\n\nThe park is massive and well laid out, with the palm trees and mountains it's quite aesthetic in parts. I got pretty tired of walking around so recommend the helpful honda express which will take you up and down the park.\n\nQueues were reasonable and I am glad I visited at the time I did- Aug 20-22nd. I was there 3 days in a row because I am a bit hardcore like that, but 2 days would have been adequate.\n\nSeason passes are incredible value when visiting for any more than 1 day in a season.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Awesome park", "We very enjoyed this park. A lot of roller coaster. You have to buy the flash pass if you want to do all the facilities."], ["Reviewed August 28, 2017", 5.0, "Best park hands down", "Born and raised in Santa Clarita, However i am not being biased i have been to over 20 amusement parks and I must say Sx Flags Magic Mountain is the best one ever, the rollercoasters are suitable for everyone the kids park is great for the little ones, And if you go at night you will have amazing views of the cities, GO GO GO GO you won't be disappointed, but come early or go multiple days to much to cover in just one after noon\nShow less"], ["Reviewed August 28, 2017", 5.0, "A brilliant destination for thrills", "A day at Magic Mountain is sure to leave you with a fantastic memory!\n\nWith the world record for the most number of roller coasters in the one park there is literally a ride for every thrillers taste!\n\nWe managed to get there on a Monday when school was in so the lines were short! Weekends and holidays can get hectic from previous visits!\n\nWell worth the time and effort to make a journey here!\nShow less"], ["Reviewed August 27, 2017", 5.0, "The third capital of the world", "One day not enough for amazing rids Awesome experience Great feeling Nothing like it all over the world"], ["Reviewed August 27, 2017", 5.0, "Best park I've ever been to", "I got the 90% faster flash pass and did not regret it. I got on all the open rollercoasters at least once and it was absolutely spectacular."], ["Reviewed August 25, 2017", 4.0, "Great rides", "There's a reason they call it the thrill capital of the world. The extreme rides are awesome and a lot of fun. The bad things were that the wifi sucked and on the ride Tidal Wave the line never moved because they only had one boat that took between 5-10 minutes to do a run through.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Great day at Six Flags Magic Mountain!", "Our family of 6 (kids age 11-17) had a great day at Six Flags. We used Is It Packed web site to pick a good day to visit while in S. California and it was accurate. Amazing how many different roller coasters they had to experience from sit, stand, recline. I can't imagine being there on a packed day, the lines would be difficult to bear, but the longest waits were 20 minutes (only a couple of times) with many rides being walk-ons throughout the day.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Low budget visit", "Is it possible to enjoy Six Flags with low budget?\nIt is.\nBook your ticket in advance and save up to 20$.\nParking is 25$, but you can park your car in McBean Regional Transit Center and take bus 3 or 7 for 1$ (have a change with you).\nFood is overpriced, two ways are possible: 1. Prepare something in advance and hide it in front of the entrance. You can leave the park and come back without an issue.\n2. We bought fish and chips for 15$ inside. Quality of food was less than average but if you buy three pieces instead of two, it's a full lunch for two persons (note: We are slim couple from Europe, we are not used to huge portions here in US)\nThere are water fountains at every restroom (at least four of them). If you don't need to drink soda, you can fill your bottles (which you bring with you in backpack) without any issue and don't spend 4$ for one cup of soda.\n\nIn the end, you can spend just 62$ for a day visit and still enjoy all amazing thrill rides which this park offers. Enjoy.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Seasons pass worth it", "Got a seasons pass here and it was awesome! The rides are fun with new ones all the time. Nice days spent here."], ["Reviewed August 23, 2017", 4.0, "Rides are great, Flash Pass helps, but the park needs some TLC.", "We decided to take a day to go to Six Flags since school was starting the next week. We booked our tickets 3 days in advance and had a discount as well so we saved 30%. We also decided to spend the extra money for the Flash Pass Gold, as we were not sure how crowded the park would be and since we were only going once we didn’t want to wait in long lines. However, the park was not crowded when we went, helped by the fact we went on a Thursday and LA schools had started the week before we went. The longest wait time without Flash Pass was 40 mins for X2. The rides were all great fun and terrifying at the same time. Tatsu, X2, Full Throttle and Twisted Colossus being the ones most thrilling. The Flash Pass was great but not sure when we went it was worth it, if it had been a busy mid-summer day then yes.\nAs far as the Park goes it really needs some TLC, many buildings, railings and rides need to be cleaned and or painted, most looked like they had not been since we were there 20 years ago. Waiting in line for X2 there was a lot of trash down below the lines that looked like no one had picked it up in years, you could see overflowing dumpsters not far from the ride. The plants in the planters entering the park were brown and dying. Never saw anyone going around picking up trash or making an effort to clean anything.\nOverall it was really fun, but if you expect a Disneyland clean and polish you will be disappointed.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Incredible rollercoasters!", "If you are looking for a big thrill this is the place to come! Rollercoasters like I have never experienced before. Queuing wasn't so bad, although could reach up to an hour for some of the more popular rides.\nUnfortunately we did arrive later than we had hoped to the park which meant we had to be very selective with choice of rollercoaster but we still all managed to enjoy it. The younger of the two children was too small for many of the bigger rides but still plenty there to entertain- we split off into groups so everyone could enjoy what they wanted.\nOnly negative to the park was the process for getting in. We had an LA go card and after queuing at the front gate were directed to a gate past security. We got into this queue for 45mins (although only 3 people in front!!) it didn't move and not enough staff on the windows. Seems they team up the queue for la go passes with the annual passes which take much longer to process- if you have one of these cards then arrive earlier to make the most of the day- other than this slight issue it is definitely worth the visit!\nShow less"], ["Reviewed August 21, 2017", 5.0, "Don't get the complaining", "We arrived at 10.30 and left at 5.30. We experienced ever rollercoaster, the longest wait was Lex which was only 20 minutes. The various coasters are amazing so much better than England. X2, Tatsu, colossus, full throttle & Lex were amazing. My 9 & 11 year old's absolutely loved the experience. Best park we've experienced. Well done LA. Well done USA.\nShow less"], ["Reviewed August 21, 2017", 4.0, "Good Times!", "Took my boys to the park and because the local kids went back to school we had virtually NO wait for rides midweek ! So we had a reasonably Good Time. Went on Superman 5 TIMES IN A ROW! Heck yea! All rides were wide open and the weather was mild!!!\n\nNow for the Bad News and B.S.\n\nGlad we didn't have to BUY that ridiculously stupid FLASH PASS that cost a small fortune. The tickets are expensive enough then if the park is crowded that have a SCAM to go ahead of the line if you pay a Large FEE with 3 Different options ???? What a VERY STRANGE Marketing Idea!!!\n\nWe travel from a distance away and need to stay at a hotel that cost money. If we need to buy a FLASH PASS along with $25.00 Parking (What the Heck) and then forced to purchase Terrible food a Dried out Hot Dog, Hamburger or 3 Crappy Chx Tenders for $10.99 -12.99 with stale fry's. Magic Mountain becomes a LOSS and disappointing vacation option!\n\nThe Park is OLD and SOME rides are closed. Then there are a couple of rides like Go Karts and a Sky Swing you have to pay Extra $$ for. What is that B.S.?\n\nAnyway overall NOT a G8 value! If you add up all the a family of 4 with all the fees, charges & 1 one lunch and a couple of drinks it can cost $126.00 per person for a day!\n\nAnd you have to wait for rides when crowded the Value is NOT worth going.\n\nFortunately we bought a discount Multi Park pass and a discounted Food Plan last year so it was an OK value. I feel sorry for the family that travels there for the 1 day it is a Bad value!\n\nHope you found this review helpful.\n\nNote Hurricane Harbor food is hit and miss we had to ask them on 3 occasions for Fresh fry's and Burgers.\n\nGood Luck with your visit!\nShow less"], ["Reviewed August 21, 2017", 4.0, "So much fun Love the thrill rides", "I have been to Six Flags in Vallejo, CA and they did not have a lot of thrill roller coaster.. Valencia Six Flags is huge with LOT's of Thrill rides. We did not wait in line for more than 30 min which is great considering we went on a Sat. Highly recommend getting the dinning pass: you get a souvenir cup with unlimited refills all day, lunch, snack and dinner it is a good deal and saves money.\nBIGGEST Recommendation: GET a Locker at the start of the day or it is $1.00 each roller coaster\nShow less"], ["Reviewed August 20, 2017", 5.0, "Always Fun", "Always love going to the mountain. Been going since a kid. Now I bring my family and we have a great time."], ["Reviewed August 20, 2017", 5.0, "Incredible", "The best theme park we have ever experienced!\nIt's like all the rides have been super sized .\n\nIf you like thrills then this park is for you.\nMassive drops, loop de loops , standing, laying , sitting rollercoasters .\nKids need to be 48 inches for some roller coasters and 54 inches for the insane rollercoasters .\n\nIt needs a whole day there to ensure u do every ride!!!\n\nFantastic\nShow less"], ["Reviewed August 18, 2017", 2.0, "Few good rides but mostly dissapointed", "I am not sure how paying so much money to enter a facility means that once in you have to pay even more to go on a ride? Also, rides were not available as well as most of the out dated booths around the park. I could not believe that I had to pay $5 for a bottle of water and i saw one water fountain which was located out in the sun and was not working. As for the rides, most were exciting apart from the '4d' ride which did not even give us head sets and had no advertising that it was not available.\n\nIf you have an extra $400 laying around that you dont mind using then it can be an amusing day out - but dont expect to get what you pay for.\nShow less"], ["Reviewed August 16, 2017", 4.0, "thrill ride", "if roller coasters are your thing..you have arrived.put on your big boy pants because this might test your man card.while long lines may sometimes rattle your good nature,this adrenaline park rivals any of its kind west of the mississippi."], ["Reviewed August 16, 2017", 5.0, "Brilliant rides", "This park is amazing for the thrill seekers looking to go on daring rides. For most of the rides that I went on there was no queue and I was straight on the rollercoaster. Very good theme park overall and worth paying a visit to."], ["Reviewed August 16, 2017", 5.0, "Summer Trip August 2017", "Visited with our TX Season Passes -- best deal was snack at Cold Stone Creamy. Rides were thrill rides - twists & turns. Lots of good roller coasters. We did get stuck on a ride & the staff did not offer any fast passes to compensate us for our time. Additionally, we informed staff of line cutters & nothing was done. All photos downloaded onto our photo pass require us to pay $14.99 for downloads.\nShow less"], ["Reviewed August 15, 2017", 5.0, "A-amazing EVERY TIME!!", "What could possibly be bad to be said about 6 flags!!! Have a blast every time we're here. We get really lucky when we're here...never have to wait long to get o rides except this time for 1 ride...the Tidal Wave...don't bother. Super short ride that you're supposed to get soaked on. We didn't get 1 drop of water on us. Got in and long wait. Go stand on the bridge at the exit and you'll get soaked there instead to cool off. Otherwise the park is a MUST for anyone that has never been!!!\nShow less"], ["Reviewed August 15, 2017", 3.0, "Deals for eating at Six Flags", "You are not allowed to bring any food into Six Flags which I think is wrong. Besides the cost of the pass, parking is $25 and since you'll be there all day you have no choice but to purchase food. We found the pizza deal good as we had two teenage boys with us. The pizza is made fresh and service was fast. Best bang for your buck.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Fun but too hot", "I love the rides here. This is the place if you seek thrill rides. However, the wait times are long and ridiculous especially for the water rides. If you go on a hot day expect the wait time for the water ride to be 120 minutes!! So lame.\n\nI ordered a turkey leg and it was delicious. My bf got a chicken sandwich with kettle cooked chips. He didn't like his sandwich because it was too dry. The chips were old and tasted like it was burnt meaning that they probably didnt change the oil from the previous day.\n\nMost importantly, couples do not get scam from this hotel company that promises free travel gifts ;)\nShow less"], ["Reviewed August 14, 2017", 3.0, "OUTDATED", "There is a massive lack of air conditioning and choices of food. It advertises Coke free machines yet only has 2 in the same place at the start of the park. It takes forever to get there as LA has extreme traffic. This park is mainly filled with rollercoaster 15 to be precise its outdated and needs updating. There is although a brilliant kiddie park for 3-7.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Outstanding day out", "Take Dramamine if you have a nervous disposition. We got a Flash Pass and managed to get on over 20 serious rides a day. Place was busy but did not seem overcrowded. Our favourite them park in the states by far."], ["Reviewed August 12, 2017", 5.0, "The roller coaster parks of champions", "We visited on a Friday and I think other than a 2 hour queue for the Samsung VR coaster all other queues were less than 30 minutes.\n\nWe actually had platinum passes but we could have not bothered, that said it was 105f so anything that made it smoother was good.\n\nThis is a hard core coaster park that pays only lip service to other rides. The park has 15+ coasters, I have to give it 5 stars for that alone. I don't know why they bother to license the DC comic stuff, they really don't do it very well and are very poor in comparison to Universal or Disney.\n\nThe food outlets were a bit old and tatty. In fact the whole park is a bit tired, people not riding struggled to find shade or descent wait seating.\n\nBUT this is a coaster park, this is hard core coaster heaven, by the end of the day we had ridden so many coasters that they blended in to each other.\n\nThere is a small kiddy ride park located near the entrance and my five year old enjoyed it, but she had to wait all day to get there.\nShow less"], ["Reviewed August 12, 2017", 3.0, "Good rides, grotty park.", "We went to six flags a few years back. The ticket prices were extortionate but we couldn't resist! We had the platinum flash pass which was very good. However, X2 is and extra charge on top of the pass itself which I feel is ridiculous considering the amount of money already spent. The rides are ok! Viper and apocalypse were dreadful although apocalypse has been re-tracked so it's probably better! We went on the new twisted colossus which was outstanding! As was full throttle! However, I count help but feel the park was tired and grotty! The rides were not up to the quality of those that I have ridden at universal or any of our theme parks in the U.K. The area of the park by viper was also very worn down so maybe some work on this wouldn't go a miss. Considering the ticket prices, I thought they could've cleaned it up a bit. We did have a good day but the quality let's this park down. The rides that are good are really fantastic and I would recommend the park but the rides that aren't are about as bad as rides can get! I'd love to return but I'd hope for some TLC on park appearance!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Six Flags MM - It doesn't get better", "Another thrilling visit at Six Flags MM. This time my two boys 12 and 14 came with me. They were unstoppable. This is the absolute best roller coaster park that you can go to. The rides are world class - some are scary as hell and the rest are even worse/better. Just the way they have to be. The Security level is high and the staff is helpfull. This park is worth the travel no matter where you start.\nShow less"], ["Reviewed August 10, 2017", 1.0, "rubbish", "The price of the food and drink is ridiculous and u can't bring in any of your own. The only vegetarian option was chips or onion rings which was a massive issue for me as I found it extremely difficult to eat. I went on the ride called x2 and smacked my head on the seat meaning i had a headache for the rest of the day!\nShow less"], ["Reviewed August 9, 2017", 3.0, "Its fun on weekdays when kids are at school", "Rides are nice and fun for the first experience.\nX-2 probably my favorite because of the thrill.\nCustomer service is horrid though excluding people near the admission gates.\nFood is expensive as ever but who can I blame.\nItll be hot so bring some sun lotion and bottles of water.\nShow less"], ["Reviewed August 9, 2017", 3.0, "Amazing Coasters, Mediocre Park", "Let me start off by saying that the roller coasters in this park are fantastic. If you are a teen or older and you don't come here for the coasters, then why are you even here at all? The coasters make this park come on top, but not as a park itself. There are so many problems with this park outside of the roller coasters that extra preparation is definitely recommended.\nFirst off, this park is huge, but not only is it huge, but it is also very hot and a lot of the park is placed right on the slopes of a large hill. This wouldn't be so bad if there would be a much better convenience with shade and misters, so before you enter the park, make sure you have a plastic water bottle so you can refill all day long without having to worry about paying for a regular or souvenir cup.\nSecondly, this park feels pretty ghetto, even without the crowd of LA teens. An amusement park should feel like another world, but many places in the park felt cheap, dirty, unkempt, etc.\nFinally, the food. I've been to dozens of amusement parks across the country, but this park is definitely in the bottom 3 when it comes to food. They normally serve the food either cold, stale, undercooked, or just bad.\nOverall, I recommend this as a coaster-only park as the roller coasters (and some other rides) are absolutely the only reason to keep coming back.\n\n(Note: Ride Twisted Colossus. It's one of the best roller coasters out there)\nShow less"], ["Reviewed August 9, 2017", 4.0, "Great theme park for a nice price.", "By far, I can appreciate a theme park that does not cost over $100. There should not be an amusement park that cost so much. Thank God for magic Mountain. Our students had fun and a great time. Now we had some problems with the picnic lunch, but other than that it was a nice place.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Family Friendly Fun", "I'm a Southern California resident and have been to the park many times. Magic Mountain was cleaner than I've ever seen it, the staff was more professional and friendly than ever, and the lines were wonderfully short!!! We fit 2 days of fun into our one day trip and it was fun for all of us from ages 10- 43. The 10 year old was tall enough for all the rides and we all enjoyed the thrills and fun.\nShow less"], ["Reviewed August 7, 2017", 3.0, "Great theme park. Just not for me", "We visited on a Sunday and it was not crowded at all. Food was super overpriced, even for a theme park. It seems like a fun place for a thrill seeker, but I wouldn't visit again."], ["Reviewed August 7, 2017", 5.0, "The best theme park I have visited ever!", "Needed a fun get away for my 13 year old. We have done Disneyland, Disneyworld, etc. etc. He has been bugging me to go to Six Flags for the last couple of years so I finally gave in. OMG! Sooooo awesome. This park has the best thrill rides ever! We stayed at the Hampton Inn Santa Clarita (also recommend) so were only a couple minutes away. Now one guilty admission. We did get the platinum \"Flash Pass\". Yes it is expensive as hell. Was it worth it? Every penny! There are three different levels of flash passes but we went for the best one. The longest wait we had was 8 minutes. Most rides were instantaneous entrance. Because of this we were able to hit every main ride we wanted and even some bonus smaller ones with no problem. We loved all the rides. X2 was our fave and is truly worth the visit in and of itself. We had no issues anywhere, staff members were helpful and friendly and grounds are clean and well kept. Trust me, if you have to choose a theme park to go to and you like roller coasters and great fun rides go here. We will definitely be going back. Enjoy!\nShow less"], ["Reviewed August 6, 2017", 4.0, "Six Flags Magic Mountain (rides, flash pass, heat, noise)", "Six Flags Magic Mountain is a brilliant place to go to if you love all kinds of rides, in particular thrill rides, such as roller coasters, its main attraction. Six Flags offers so many rollercoasters, all cool, scary or unique in their own way. My favorite rollercoasters were Tatsu and Superman: Escape from Krypton. Tatsu is the longest and tallest \"flying\" rollercoaster in the world. Whilst riding it, I literally believed that I was flying through the air. I loved Superman because the ride was so fast and the acceleration was just unbelievable: On Superman, you accelerate from 0-100mph in only seven seconds!\n\nOther than the awesome rides, something else worth mentioning, is the flash pass. When my father, sister and I last went to Magic Mountain, we had flash passes. And honestly, we didn't regret purchasing them, even if we spent more money. They can make your visit at Six Flags much more exciting, especially when the park is crowded with loads of people! Thanks to the flash passes, we could ride 10 rollercoasters in a couple hours, and waited much less than most people did.\n\nOn the other hand, what I disliked the most was the heat. In the theme park, the temperature was really high, about 90F (35°) and we always had stop to take a break in between and drink lots of water. Another minus: the volume of noise was quite loud and can give you a headache after a while. Although, that's not such a big deal, I guess that belongs to a theme park, and if it bothers you, I would recommend bringing with ear plugs...\nShow less"], ["Reviewed August 5, 2017", 5.0, "My throat hurts ...", "... because of all the shouting. There are nearly 19 roller coasters. Yes. 19! And all of them unique in their own way.\nTatsu, Batman, Twisted Colossus, each and every one of those rides is just amazing. You'll feel thrill like never before. Also, expect the unexpected since each ride isn't just linear.\n\nTips:\nWould recommend coming in early in the morning (right when the park opens) with an empty stomach and starting from the end. Also, make use of single rider lines to sail through easily. Also, buy the whole day soft drink package. It's really hot out there. Go for mex food, really cheap and filling. Try completing all the main rides before lunch. This would help you make the most out of your visit.\nShow less"], ["Reviewed August 5, 2017", 5.0, "The best rides ever", "if you like roller coasters, that is your place. Lots of rides, one better than the other. I spent one of the best days of my life. Almost cried when I saw the Hall of Justice (from DC attractions). You can´t miss the Super man, Green lantern and X2 attarctions! They are insane!\nShow less"], ["Reviewed August 4, 2017", 4.0, "Brilliant but needs more shade", "Six flags is NOT for the faint hearted. The roller coasters are BIG and frantic. If you don't like roller coasters don't go. If you love them then six flags is for you.\nFast passes are too expending. About $350 for a family of four (including two teens) but fast passes (available in the park) cost about the same for gold fast passes.\nJuly is HOT HOT HOT and the park needs MORE shade and rest spots.\nGreat fun!\nShow less"], ["Reviewed August 3, 2017", 5.0, "Adrenaline boost on rides (excellent).....skip the food though, expensive and very very bad", "This park is purely and adrenaline boost, so if you like quick, fast and scary rides this is where you should go. In that sense, it beats Disneyland 100%. They also provide a fast pass system, which is rather expensive but we opted for it. In hindsight we probably would have gotten the same amount of pleasure without the fast pass, it's very convenient though and you never know how busy it's going to be.\n\nOne note, the food in this park is horrible. So I suggest you enter the park with a full tummy (not too full so that you will get sick on the rides) and maybe live on soft drinks the entire day, they have a cup that you buy once and you can have unlimited refills. Burgers are very very bad, expensive and without taste. If you are really too hungry, probably chicken fingers are your best bet.\n\nAgain, rides are awesome, it appears as some of the surroundings of the rides lack some maintenance, however the rides themselves look all very well in order.\nShow less"], ["Reviewed August 3, 2017", 3.0, "Great for teenagers", "It is no doubt the place for crazy rides and thrill. Very hot(not enough shaded place) and noisy(music blast at every corner). Long queue for food and drinks. Not enough healthy diet options."], ["Reviewed August 2, 2017", 5.0, "The best park in the world", "You must arrive early because in the summer the park is crowded. The cooler rides have long lines so you should buy the platinum pass which will save you a couple of hours. If you are mad about roller coasters like me this pass is needed. Me and my family were able to go to all the roller coasters we wanted thanks to this wonderful pass. It's a little bit pricey but totally worth it.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Fun ! Fun!", "Great Family Park ! Rides for the adults and kids Great Restaurants and Customer Service Clean and a lot of areas to rest"], ["Reviewed August 1, 2017", 4.0, "Did not need the fast passes", "We spent a fortune getting the fast passes that cue queueing down by 90% however we didn't them. There wasn't many queues at all. Even X2 didn't have a queue longer than an hour.\n\nThe park is very hot. We're English so we struggle with the heat anyway but coming to six flags after disney and universal we found it to be so so hot. There was shade if you wasn't on a ride e.g the benches but the queues etc were stifling.\n\nThe rides are huge and lots of them go upside down. Some of the biggest rides I have ever ever done.\n\nWe got the $16 refill drink which really really came in handy.\nThe $25 photo pass was very good, lots of rides offered photos.\nWe found one resteraunt (the sports bar) that had air con and my goodness we needed it!\n\nI wouldn't return but I am sure glad we have done it.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Great weather, fun rides", "Day 1 of our trip. Quick lines, averaged about 40 minutes. Hot day so everyone was at the hurricane harbor. Got on the goliath, full throttle, twisted something or other don't remember, roaring rapids, scream, X2, and apocalypse, and they were all awesome. Price for both of us was 95.00 with special tickets. So keep a look out.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Excellent roller coasters but not very clean park", "For thrill seekers, this park is a dream come true - lots of roller coasters, many of which I have never experienced before! Lots of innovative rides and definitely well worth a visit. The fastpass service is definitely good value too - even on quieter days, I believe you would get value and we found it extremely beneficial and we bought the cheapest option at $50 per person. I wouldn't recommend buying a photo pass - there are few rides that actually take photos and there are no photographers around the park itself to take photos. The main negative point I would make is the standard of cleanliness. The toilets were extremely dirty and smelly - even early in the morning when the park first opened. I was surprised by this as every other theme park I've been to in the USA has always had very high standards of cleanliness. We even saw a staff member attempting to clean the toilet floor area, with water only - no evidence of cleaning fluid - and all that happened was dirty water just go spread around even more! There is no wifi in the park either which was disappointing and the water fountains were not shaded, meaning hot water was coming out of the fountains rather than cold. Six Flags could learn a lot from Disney in terms of cleanliness and shading the water fountains! Overall a good day out.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Fantastic park - read the negative reviews at your peril!", "I was dreading our day at Six Flags 40C (100F) forecast, just after 4th July long weekend and the negative reviews ingrained in me about wait times, heat, etc. We had a brilliant day. Firstly, I'm not sure if people are planning on taking in picnics or coolers but we took our own water in and refilled at the many drinking fountains around the park. It's huge, there is plenty of shady spots and misters and we may have got lucky but the crowds weren't as crazy as I had expected. We brought the fast passes which of course helped but it pains me to say it but we may not have needed them. Sure for the super popular ride we felt like celebs cruising past everyone to hop on the next ride but the queues weren't that long that we walked past! There was plenty of food options, the rides of course were fantastic and the park itself was nicely laid out. We had been tossing up between visiting Universal Studios and Six Flags and bang for buck, our day here won by a mile. We stayed in Santa Clarita $132USD for night (compared with the $600 USD for same hotel chain in Santa Monica if going to Universal studios) , our tickets were almost half the price of Universal Studios and the rides sounded like they were so much better. I swear we saved about $1500USD by choosing this theme park. And we got to see another part of California. So ignore the doubters, go prepared for a long, hot day, but it's all doable and instead of having a stressful day as I'd expected, we ended up having a blast!\nShow less"], ["Reviewed July 29, 2017", 5.0, "Very little wait compared to other parks", "So far my boyfriend and I have gone to Six Flags New England (Massachusetts), Great Adventure (New Jersey) and America (Maryland). We plan to go to Six Flags Over Georgia and La Ronde in Canada this year as well. We pay for memberships - his includes parking which is one less out of pocket expense every time we go to any park in the USA.\n\nThis Six Flags had amazing coasters but minimal wait times compared to other parks. My favorite rides were X2 and Twisted Colossus. Those 2 were unlike any other rides I've been on.\n\nBatman The Ride here at Magic Mountain looks like the ones in New England and New Jersey but is more exciting and unexpected that those are. Also, Green Lantern First Flight is exactly like The Joker in NJ. We didn't get to go on The Riddler's Revenge since the line was always 2 hours long when we were there but it appeared to be a stand up coaster similar to Green Lantern in NJ so we didn't feel like we missed out. Justice League: Battle for Metropolis was having problems and closed both days we were at Magic Mountain but we received an email from Six Flags the day after we left the area apologizing for the closure and promising exclusive ride time loaded to our membership cards. If we were still around we would have taken advantage but we had plans to leave on the day they promised ride time.\n\nThe 20-40 minute wait times were really pleasant to stand in. During the day I wish they sprayed mist above the lines like they do in the east coast parks or used fans in areas like the MA and NJ parks do to keep those in line cool but other than that no complaints. Really nice clean park! Also - I appreciated the dual language ride explanations in English and Spanish. None of the other parks we've been to have that.\nShow less"], ["Reviewed July 29, 2017", 3.0, "Don't ride X2! The line is not worth it", "We made the terrible mistake of getting into line for X2 as one of the first things we did. Really wish we had done our research. The lineup said estimated wait time, 30 mins. We walked into a seemingly short line as it didn't really start until well past that sign. We figured 20 mins, worst case. 2 1/2 hours later....\n\nAnd X2... It's violent. That's the only way to describe it. We went for big thrills, big coasters, G-forces... All of the above. But X2 is a different beast. Jarring and violent.\n\nThe rest of the coasters were as advertised. Our favorites were Tatsu, Goliath, Batman, and Riddler's Revenge. Aside from X2, lineups were almost a non issue. Don't waste money on Flash Pass on a weekday. Just do your homework and avoid the 2-3 with the big lines.\nShow less"], ["Reviewed July 28, 2017", 1.0, "Membership management hung up on me", "In September of 2016 we visited the park and was sold an annual membership. Upon entering the park we soon realized that all rides we wanted to go on were closed due to rain. Mind you that we planned this trip in advance met people there from distances as far as 6 hours away. Went to guest relations and told them we were leaving the park due to ride closure and inability to use membership. Requested refund and was told to contact technical support management at 321-249-0110 because we were under contract. We had no choice but to leave, no one was able to help, I followed up with an email, a letter, and several phone calls. I've been told that I could have visited on other days and that the membership is valid. Ironic that a company in the business of enjoyment and amusement has no regard for customer satisfaction nor the fact that I requested an immediate refund. It is July 2017 and my PayPal account is still being charged a monthly fee, so dissatisfied that I refuse to visit. It has been unresolved and huge frustration.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Killer coasters", "Fun, fast lines, not for faint of heart, pickup line a bit messy. My teens had a blast. Had to beg them to leave. Some of those rides are crazy fast"], ["Reviewed July 23, 2017", 5.0, "Thrilling", "Brilliant rides for older kids and adult,we were very lucky on a Thursday in mid July .Very little crowds at most of the rides ,less than an hour on most and none on some,one of the gate staff kindly gave us an unofficial hint not to buy the fast pass and glad we didn't.Definitely the past theme park we have been to.\nShow less"], ["Reviewed July 23, 2017", 5.0, "It was fun", "We had a great experience with the online purchases and the ease of redeeming our pre ordered meals and sports bottles. The employees were very friendly and knowledgeable."], ["Reviewed July 21, 2017", 5.0, "Kids had a fantastic time!! The best day we have had as a family!!!", "It was hot we bought the 3-day advance ticket and we also recommend you but the bottomless / refill sport bottle drink for $16. Also paid for the 50% flash pass which saved a bit of time in queues.\nToo hot but a great time was had by all!\nShame the battles of metropolis ride was not working whilst we were there and annoyingly it started soon after we left!!!\nShow less"], ["Reviewed July 21, 2017", 5.0, "One of the best of the Six Flags parks", "SFMM has some of the best coasters on this planet - period. Unlike the other parks the rides are mostly not clones, but original rides specific to the park. It is also a rather pretty park and nice to visit. Be warned - as the name implies, there is a mountain so visiting some of the rides requires a bit of a climb. There is a funicular that can transport you back and forth.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Friends Trip", "Not sure what it's like other days but we had a perfect day in the park. There was almost no lines for the rides and all the rides were open. We were able to get on everything. The extreme were just that, EXTREME. The thrills were memorable. It was extremely hot that day so we were greatful for the food and beverage locations around almost every corner. We ate at the sports bar. The service and food were both really good. We were just as excited about the air conditioner in the sports bar lol. I'm currently planning another trip to the park before the summer is over. Good times.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Excellent rides but...", "This is a really great Six Flags park and they have really high thrills rides but the park itself lack of something. Difficult to say, is it the way the configuration of the park is... Not sure, but they defenetly have some pretty high octane rides :)\nShow less"], ["Reviewed July 16, 2017", 5.0, "Worth every penny!", "I can honestly say that if you like rollercoasters you will be in heaven. I do suggest purchasing the refillable cups that were always welcomed at the different concession stands. The sushi was amazing but I don't suggest having a spicy chicken Chinese lunch before a day of high speed loop, dip, twist, drop, and roll fun.\nShow less"], ["Reviewed July 16, 2017", 5.0, "My favorite amusement park, hands-down!", "I've reviewed this park before, but I wanted to do so again since I visited for three days instead of one during this trip and got to ride several other rides. I was visiting while being in Los Angeles for a book signing and was so impressed when I'd been in town two years before that I planned to definitely spend more time there.\nI am a huge coaster nut and rode almost every coaster during this more recent visit. I purchased a membership, which is a low monthly payment that allows the holder to visit the other Six Flags parks. Very good value.\nMy body gave out before I could come close to riding everything last time, so I planned three days of shorter visits. I went on a Wed., Thur. and Mon., with the last visit being on July 3rd. They had a promotion where passholders could bring a Coke product and ride certain coasters early. That was really nice. I got to ride Twisted Colossus twice in a row with practically no line. But the lines weren't horrible. I believe I visited on a Sunday in October the last time and the lines were far longer then.\nI rode X-2 during that previous visit, but that was enough for me. It's pretty much the only coaster I really don't want to get on again, but other thrill seekers might love it.\nThe ride that scared me the most this time was Green Lantern First Flight. It was fun, but not like a usual coaster. It's kind of like a ribbon folded on top of itself and it does bounce around and toss the rider around (the seat does spin completely around). I was a little intimidated but I was glad I did ride. Make sure you're secured tight because it threw me forward hard and I felt kind of wedged in the tiny bit of space left. That final spin when it drops the last time is an extreme feeling.\nI rode Tatsu twice--one of my favorite coasters ever. You life face down, and once you get over the fear of that harness opening up, it's like flying. The G-force in the big reverse loop (I say reverse since riders face the opposite direction) are like nothing else I've ever experienced. I did get to ride it before and was anxious to ride again.\nScream wasn't running the last time I was there, but this time I rode it four times. It's a long coaster with a lot of surprises...just a lot of fun.\nTwisted Colossus is my favorite coaster in the world (tied with Canada Wonderland's Leviathan) and I think I rode that five times. I'd also ridden it previously and was dying to get on again.\nI also rode Batman, a suspended coaster, which delivers plenty of thrills, again.\nRiddler's Revenge wasn't running, which was just a little disappointing.\nThe new coasters I got to ride:\nApocalypse - A wooden coaster that was filled with twists and turns. The car even runs through the boarding station over waiting riders' heads. Set up like an escape from the end of the world\nNinja - Suspended cars. Reminded me of Vortex at Wonderland. A lot of fun; rode it twice.\nSuperman - Big thrill. Rode this three times. It shoots you backward 100 mph up 450 feet. Short ride, but a big thrill\nGoliath - A big drop and thrilling twists and turns. A must-ride. Rode twice\nI think there was one called Gold Rush. It looked like a kiddie coaster, but definitely was not. It ran along the ground a large part of the way, but the speed and twisting track had my heart racing.\nFull Throttle - Never been on a coaster quite like this. The loop seems much bigger when you go over the top of it than when you're looking at it from the ground. Riders are shot out of the station through the inside of the loop. You drop around a corner and stop inside a tunnel which then shoots you back halfway up through the drop, and when you come back through the tunnel shoots the coaster super fast over the outside/top of the loop. The coaster brakes very hard coming down the side of the loop into the station. When you experience this ride for the first time, you don't know what to expect and it's quite thrilling.\nGrand American Carousel - A very nice carousel I really enjoyed riding.\nThe New Revolution Galactic Attack - This coaster was a new experience also. Riders can choose to wear a virtual reality helmet. It has a Samsung phone over the eye area that plays out a galactic scene while the coaster is in motion. I thought it was super well done. Riders could turn their heads in the direction they wanted the coaster to go. It was an experience like I've never had before. I really enjoyed that one.\nViper - I believe this is one of the older coasters in the park, so I wasn't too nervous, but this one is no joke. The drop is pretty thrilling and the tight loops deliver an exciting ride. It lasted longer than I expected too. A lot of fun!\nI really did love this park. The rides are exciting and the merchandise is quality. The have super hero capes in every color (even pinks and purples). I sent my nieces and sister Batman capes and got a Superman shirt and cape for hubby. I found a very cool \"Daddy's Little Monster\" shirt, but beware. The XL sizes are quite tight (I like a loose-fitting tee). Both my Harley Quinn shirts had this problem. The staff throughout was friendly.I didn't eat here a lot, but raised an eyebrow when Coldstone Creamery staff told me ALL the ice cream contained gluten. At another food place right outside Tatsu, they couldn't tell me if the fries were gluten free and I consider it dangerous when food service workers are not provided this information. I wouldn't say this is a safe place for people with a gluten allergy to eat and that is extremely disappointing. I didn't not eat in the park, save for a little ice cream after I'd checked Coldstone's website. There's such a variety of things to do here. I'm already itching to return!\nShow less"], ["Reviewed July 15, 2017", 3.0, "Awesome Roller coasters, Poor park.", "The roller coasters and rides at six flags are great, heaps of fun for my partner and I. However, the rest of the park is lacking. There is no shade for the majority of the queuing, limited access to water, and sprawling concrete. Given the heat of the day this was so poor compared to other parks and desperately needs addressing.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Fantastic day", "This park has something for everyone. We went for the fast and bigger rides as we have older teenagers.\nI would suggest visiting on a weekday ...obviously less busy. Buy tickets online in advance it's cheaper. Don't buy a fast pass until you get there and see how busy it is.\nWhen the park opens head to the far side and work your way back. Most people will get in line for the rides near the gate.\n\nWe went on a Friday in July and there were hardly any lines. We had considered buying the fast pass but it was not needed. So glad we didn't.\n\nIn all a great day . Lots of really big rollercoasters if that's what you're after this is it.\nThere is a water park there as well. I believe you can buy a joint ticket. I didn't go myself.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Unreal fun", "My husband and I visited May 2017, on a Sunday.\nWe must have got there at the right time, as we never had to wait more than 20 minutes to get on a ride. Later that day wait times were over 45 min but we never had that struggle (except with Full Throttle, but it was worth it).\nWe had so much fun. We loved Goliath, Superman, Batman, and Full Throttle. The other ones were good, but some knocked my head around too much and i got a headache.\nWe had the bonus of visiting with friends from Cali, so they apparently can bring a friend for free every so often, so we didn't have to pay for our tickets. Lunch was good enough, as theme park food is. Expensive and greasy. But overall this was the best theme park visit i've ever had. I can't wait to go to more Six Flags!\nShow less"], ["Reviewed July 11, 2017", 5.0, "Good Value", "I went on a hot Friday in June with my teenage sons. The crowds and the lines/queues weren't too bad, even though the car park was mostly full when we arrived. For a couple of the rides, the waiting time was c40-45 minutes, but most were less than that, and some were as short as 5 minutes. The rides are all terrific, particularly Tatsu and Goliath. There's also an older-looking wooden roller-coaster whose name I have forgotten, and while it doesn't look as spectacular as some of the others, it's every bit as enjoyable. Over the day, we got to go on maybe 11 or 12 of the rides, which meant the entrance fee represented good value. One or two of the rides were closed for maintenance, which was a pity, though to be honest this didn't detract from the overall experience. I'd suggest you try to get there for opening time, in order to park closer to the entrance. Food and drinks are expensive (eat a good breakfast before you go!). Overall, though, this is the best park of its kind that I've ever been to.\nShow less"], ["Reviewed July 10, 2017", 5.0, "real fun", "we enjoy it very much, they do not allow food inside ... !!! the queues were not so bad. go and enjoy."], ["Reviewed July 10, 2017", 5.0, "Greatest roller coasters.", "The park has the best collection of roller coasters. There are rides for small children up to those who like to push all limits on roller coasters."], ["Reviewed July 9, 2017", 3.0, "Fun but lacks atmosphere", "We purchased a flash pass platinum which was $130 per person plus entry fee which got cheaper by going to Santa Clarita visitors page and clicking the link. About $50 each and parking was $23. So pretty expensive day at over $743 USD. In saying that if u can afford it definitely get the flash pass. We never waited anymore than 2 minutes whilst normal question were minimum 60 minutes per ride. Pretty good rides\nI felt it was missing atmosphere, I also noticed not many signs to show where rides where.\nWhen we first entered we needed to find the flash pass office and found the entry staff not very helpful but flash pass office was good.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Super fun", "Great rides some of the biggest I have ridden definitely for older kids but super exciting. Make sure to keep your phone in a secure place."], ["Reviewed July 9, 2017", 5.0, "Fabulous!! Flash pass is worth it!!", "My teens loved this park! We did purchase \"flash pass\" to go to the front of the line. That was such a great idea and made the day even more enjoyable. There is no way they would have been able to ride all of the rides, without the flash pass. The park was very crowded and it was extremely hot. It is a great park for thrill seekers!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Amazing park but not quite as good as Cedar Point", "Being a coaster enthusiast this was a must visit park for years. Its a brilliant park but not quite as good as Cedar Point, Where they both have the quantity Magic mountain lacks the quality. But I had an amazing time over 3 days, the 3rd 4th & 5th of July. 4th of July was dead. I didn't use a fast pass once and I rode every coaster 3 or 4 times. The only thing I bought in the Park was a meal and there was plenty of choice. X2, Tatsu, Superman and Twisted Colossus are the best rides, only thing I didn't like was that the park was very Hilly (i guess the name of the park gives that away.)so by the end of the day my legs were tired from walking up and down, but then you can always get the Orient Express train up the hill. I'f some of the coasters weren't clones of other rides in six flags parks this would be rated the same as Cedar Point in my Honest Opinion.\nShow less"], ["Reviewed July 5, 2017", 4.0, "Summer vacation", "The one thing I suggest is to stay closer than we did because the freeway it is located off of seems to always be busy. When we went the waiting times for rides weren't too bad all in all. Unfortunately it is very warm there this summer. Was around 100 + degrees every day we visited. My son really liked all the rides. He was disappointed because the Riddler was closed off due to them building another ride close to it. Maybe you could have it open during peak months and work on it in the fall/winter when less people are there.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Great coaster park!", "I went here with adult only group. We went on a Friday and surprisingly the park on the rides side was not that crowded. I think it was in part due to the recent heat wave. The X2 was the most intense of the coasters. Drinks and food a little on the pricey side as expected in these parks. Overall the group had a blast and would go again.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Mom", "Excellent trip, the lines were short, the rides were great and the sandwich by kwerks delicious. The show at kwerks is amazing."], ["Reviewed July 3, 2017", 3.0, "Great rides but let's itself down by poor management", "Came here for three days as part of our holiday. The difference between 6 flags and say Disney or Universal is the lack of detail. It's functional. If 6 flags was a room then the curtains would have no tie backs, and there'd be no cushions on the settee!\nThe good points are that if you like rollercoasters this is the place for you. There are 19 making it the largest number in one park in the world and obviously some of them are right up there as great rides. The staff generally we found to be good as well, polite, helpful and on our last day the staff at twisted colossus were doing their best to get the trains going as quickly as possible so that you can duel (i.e. Two of you go round separate tracks at the same time) Another staff member offered us water proof bags for our phones on the roaring rapids which she'd bought herself!\nNow the bad points. Very little else other than roller coasters. No single riders queue (line) plus the staff seem unwilling or not allowed to organise the people to fill up the empty seats. For example the log flumes can contain 6 people but often just 2 occupied each one even when the queue was up to an hour long. The Flash pass people (pay to jump the queues) go straight to the front of the line and so tend to take the front or back row seats. The park doesn't open until 1030am most days, even in the height of summer. The season pass, whilst better value if you're visiting three or more times runs for a calendar year and not for a year. I.E it expires Dec 31st regardless of when you buy it. They sell a day/season photo pass but most of the rides don't have a photo option on them.\nOverall, some great coasters, but little else\nShow less"], ["Reviewed June 29, 2017", 1.0, "Bad Experience with Customer Services", "I will just post the letter I sent to this company but I never got a response!\n\nDear Sirs, I want to help you improve your quality service with my complaint. Today (May 29th, 2016) I bought two Flash Passes to enjoy my day at your park. In general your service is good. But today, after making a reservation to ride on Ninja at 4:27, I arrived 5 minutes before. The ride was supposed to leave before my due time, I was asked to wait patiently for the next ride. I said ok no Problem. There were other clients complaining that about the lack of information about the rules and so forth. I just waited there. At 4:35 after waiting the other ride of the common clients, I was allowed to get in to sit. In the meantime, your employees (Leslie, Destiney and another lady) were chatting. I supposed they are your representatives who are responsible for guiding customers, right. Here comes the problem, I was sitting on front row but only after everyone was sat on their places, your employees told me I was not allowed to sit on those places. I was sitting there with my son. I was asked to get out to my surprise all seats seemed to be taken. I said that was not proper work and that I wanted to register a complaint. At this moment your employee tried to ignored me and move along side.\n\nOn my fault I extended my arms and touch her lightly with my arm. Lesley invented that I hold her by the shoulder and all your employees hide behind a lie to call security to removed me from the place. They asked me to wait until security arrived. I waited to explain the event. After talking to security, I was advised to keep my day riding other machines but not the Ninja. I was so upset that I then went to Guest Relations to make a complaint.\n\nYour other employee Tracy pretended to hear my case saying that she will record my complaint. When I went back to read the complaint then she said it was not done. Requested my ID to register the complaint but then I said I will just send you an\ne-mail. I am writing this because your people are just not treating people properly. Good luck with your park which by the way is amazing.\nShow less"], ["Reviewed June 29, 2017", 2.0, "Needs Help", "First they are able to change the time that the park opens at their leisure. We looked on line that the park opens at 10am., however, they didn't open until 10:30am. The first two rides we went to ride were closed. This park seems run down. Junky store offerings. While waiting in line for rides in the areas that are off limits to riders; there is trash everywhere. It looks terrible. We have been all over the United States to amusement parks and this is the trashiest/dirtiest park. They need to take time before and after the park closes to clean up the grounds. Also, I have never been to a park where you have to park your vehicle behind the park and walk all the way around the outside to the gate. Very strange. But, there is a shaded tree area with picnic tables where your family can have lunch,a snack or relax for a moment before walking all the way around the park again to go back in.\nShow less"], ["Reviewed June 28, 2017", 2.0, "HAVEN'T BEEN THERE IN A LONG TIME", "We went 2 a funeral in Avenal and were coming back, we were going 2 spend the night at Casltic Lake so we decided 2 go 2 Six Flags....we forgot how expensive it was, forget about the food, but wat they charge extra 2 get on the rides ..loved the funnel cakes, and taking pictures with the characters\nShow less"], ["Reviewed June 28, 2017", 5.0, "Thrilled", "I really do like this kind of parks! This is one of the best you could find! Very clean, friendly people and many rollercoasters! We bought flash pass, but there weren't so many people so we almost didn't use it. We had fun all day long and we'll remember this day at Magic Mountain as one of the best of our holiday.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Girls trip", "It was a fun filled HOT day...105 to be exact. Due to the heat the lines were not that long. Haha with exception to the heat it was an amazing day. The water rides were definitely a hit with us."], ["Reviewed June 27, 2017", 2.0, "Not worth it, in my opinion", "We came to Magic Mountain intending to go for a day but ended up leaving early. When got there, it was $23 to park. The lot is located quite far away from the actual park entrance. We got there early so we had to wait at the entrance gate and things were quite disorganized for getting people into the park. It was quite hot out as well, which we expected; however, there weren't a lot of shaded relief areas and many of the misters did not work. On this particular day, the line ups were quite long. We waited about 45 minutes to ride New Revolution which in my opinion was not worth it. The graphics were shockingly poor with the VR headset. The food and drink was very expensive (a vending machine soda for $4.50). It seemed like this park had seen better days and could use some TLC and cleaning. I would not return again; I would much rather go to Disneyland when I'm in Southern California based on this experience.\nShow less"]]}}