{"Six Flags Discovery Kingdom": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Six Flags Discovery Kingdom", "url": "/Attraction_Review-g33212-d648022-Reviews-Six_Flags_Discovery_Kingdom-Vallejo_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/15/80/09/discovery-kingdom.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1570"}, "address": {"@type": "PostalAddress", "streetAddress": "1001 Fairgrounds Dr", "addressLocality": "Vallejo", "addressRegion": "California", "postalCode": "94589-4001", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 3.0, "Meh", "Dirty, unorganized and slow operations but a few good rides including the amazing Joker. Food lines are horrible!"], ["Reviewed 1 week ago", 4.0, "Lots of rides closed, but still had a blast.", "We came here on a Sunday in the winter so we were expecting some of the rides to be closed. There were probably about 5 or 6 closed, which was more then we expected.\n\nRegardless, we still had a blast. We still got to ride the Joker, Medusa, Kong etc. It was my kids first trip to a real theme park and the loved the rides. Much more exciting then what they are used to at the county fair.\n\nThe most we waited in line this off season day was about 30 mins, but other than that every ride was less than a 5 minute wait.\n\nFood was disappointing in that the options are all junk food. Some healthier options would have been appreciated.\n\nAll in all a great family visit!\nShow less"], ["Reviewed 1 week ago", 3.0, "One of the weaker Six Flags parks", "I recently visited Six Flags Discovery Kingdom and I didn't have the highest expectations for this park. I came primarily for the roller coasters so this review will be primarily based off of that. I would say their selection of coasters was just ok. Joker and Superman Ultimate Flight were fun but nothing mind blowing. Medusa and V2 were also good. Boomerang and Kong however were just awful experiences. Every coaster had one train operations besides Medusa and despite low crowd levels lines were still longer than they should of been especially for Joker and Superman.The park overall looks nice but is littered with ads. The themes are very minimal on the rides, in the Joker line they were playing the Superman theme which doesn't make any sense at all. The animals were a unique touch to a six flags park but some of the exhibits were kind of dirty. The Shark exhibit was littered with fly's by its entrance as well. Food options wern't very good. Everything was overpriced but they had a ok variety. Overall if you need a day to kill and your in the bay area I would reccomend it but if you had to choose between this park and California's Great America I would recommend you go to Great America instead.\nShow less"], ["Reviewed 1 week ago", 3.0, "Okay after the long wait of confusion", "We were planning a great day at the park with the kids, bought tickets online at the hotel we were staying at as a perk price. The hotel front desk screwed up and got us tickets for two weeks away. We sat at the ticket booth for nearly 2 hours for the supervisor to figure out how to fix our tickets. They ended up refusing our tickets and then charging us for daily tickets, which did not reflect the discount we should of got. So they cancelled those tickets and started over, in all charging our card 4 times. Once it was all done, we were finally able to enjoy the park, but the rudeness of the staff to begin with just really made it hard to enjoy our trip. We'll try again another time, hopefully without the confusion.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Family Fun", "Discovery Kingdom; is a nice place to visit, it has good attractions and offers an array of things to do. The location is not very good (I grew up in the area and it is too close to residential homes in my opinion), but it is a good get away.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Pretty fun", "We only had 1 day to go and a few rides were broken down most the time. We only rode 3 rides the entire day. It was rainy but, was a great time with family and hoping next time all the rides are up. Has sea lions and other cool things to feed. The roller coasters that were open were fun and we can’t wait to go back!!\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Great coaster collection but gets boring pretty quickly", "I visited this park once in October 2015 and a second time in January 2018. The first time I spent only a few hours and managed to get on 3 roller coasters - Medusa, Kong, and Superman: Ultimate Flight. The second time I spent the entire day so I was able to ride every roller coaster minus 2 that I chose not to ride. Here are some brief reviews of the coasters:\n\nMedusa: Very fun floorless coaster that can be a little rattly but it's not an issue. Has a massive vertical loop and a few fairly intense elements.\n\nKong: A terrible inverted roller coaster. DO NOT RIDE. Gave me a headache and a several bruises. This ride will beat you up. Don't put yourself in pain.\n\nSuperman: Ultimate Flight: A super fun launch coaster. Highly recommended. Very intense and delivers great hangtime and airtime. Didn't have to wait at all.\n\nThe Joker: Their newest coaster. The Joker is a very fun roller coaster with insane airtime. I recommend that you ride later in the day after it has warmed up since it can run pretty slowly towards in the morning. *Although this looks like a wooden coaster, it is not. It is a steel coaster.* Shoutout to one ride operator who ran to check every restraint and interacted with guests waiting in line; I didn't get his name.\n\nV2: AMAZING launch coaster. Very underrated and unique as the layout was altered due to the park's height limit. Had no line.\n\nBoomerang: Smooth for a Vekoma Boomerang but might hurt your back (only for a short amount of time). Line was nonexistent.\n\nCobra: Didn't ride; train wasn't even on the tracks.\n\nRoadrunner Express: Tiny children's coaster, what more can I say?\n\nThey have an alright flat ride collection however I didn't ride many. Wonder Woman is brand new and is pretty fun but almost made me sick. Tasmanian Devil almost got me sick as well. Don't ride after eating. Hammerhead Shark is a very sketchy ride but pretty fun. Ride Thrilla Gorilla; it's hilariously weird. Arctic Adventure, their 4D theater, is laughably bad. The pre-show has nothing to do with the ride and the ride itself is super short. The movie is awful - the animation is grotesque and the theater itself smelled like garbage. A very outdated system. Mass Effect at California's Great America about 1.5 hours south is MILES better.\n\nI didn't see many animals but from what I did see, I was somewhat impressed. The penguins were cute and the stingrays are cool to look at. They also attracted many small children. The butterfly exhibit was very well done. The sharks were pretty cool as well.\n\nThis park is extremely dirty and littered with advertisements, but hey, that's Six Flags.\n\nI did not buy food at this park since I didn't want to spend too much money but the food court overlooks a lake which is quite nice. There was also a fair bit of merchandise so I spent a few dollars on a shot glass to add to my collection.\n\nThis park gets boring quite fast. We found ourselves wandering around the park not knowing what to do.\n\nThe parking lot is very far away from the park but luckily there is a free shuttle bus to the park itself.\n\nOverall an alright park. The best thing about it is the coaster collection. If you come to the Bay Area and are deciding between California's Great America and this, choose Great America, even if you are a roller coaster enthusiast like I am. You'll enjoy that park much more.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Very entertaining, can use some minor work", "It is fun to spend the day at Six Flags, we have annual passes, and we actually bought the annual cards for photos and for food, but never seem to find them.\nSince the cards has to be with you, and can not just be added to your annual pass, we practically lost the value of what we paid for.\nIt is not their fault that we lost it, but it would have been nice that when we purchase something annually, just add it to our card.\nThe Dolphin show is very nice, one of the most attractions along with the tigers show that my son enjoyed.\nThere is a piece of the place we were never able to find, it is somewhere to the west south end, near the giraffe, but we couldn't find it (maybe it was always closed when we are there?) It is kind of a river and water game, I know this based on the images on the brochure and online.\nSignage could use some improvement, I have been there at least 3 times, and I still can't find that place.\nAll in all, a good place to spend the day at.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Outing with Family and Friends", "Six Flags Discovery Kingdom is fun for family and friends to go to. Fun rides for older and young kids. Food is just ok. The animal show are fun to watch and educational."], ["Reviewed January 8, 2018", 1.0, "Overrated.", "The only thing this place has is rides and shows. The whole place is falling apart, literally... benches, fences, gates, doors, everything is falling apart. They don’t keep up on maintenance or general grounds keeping. The bathrooms smell horrible and are wet.\n\nMy family and I waited 45 minutes in a food line with 20 people ahead of us. The food was ok but way overpriced for what we got and waiting around was ridiculous.\n\nI can see why this place went bankrupt and I expect it to go bankrupt again unless they actually put some effort into it.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Holiday in the Park", "My wife and I had an enjoyable day with the Holiday decorations and seeing all the animals. While we didn't go on any rides, we were able to have a relaxing day after the rush of Holiday preparations."], ["Reviewed December 27, 2017", 3.0, "Not that great for the prices paid.", "Had a lot of expectations for Six Flags, but experience there was just so so. We went the day after Christmas. Overall, the wait wasn't so bad. The area for smaller kids looked really fun; but other rides looked somewhat rundown. One third of the rides were closed, as well as some of the eateries. Would not recommend eating inside the park, unless you like poor quality fast food and sodas. Staff was courteous in general.\nShow less"], ["Reviewed November 19, 2017", 4.0, "I Can't Believe It: I Actually Had a Fun, Enjoyable Day at a Six Flags!!!", "I've been to almost every Six Flags \"theme\" park in the US, and many of them I have been to numerous times. Every single time, I find myself wondering why I wasted my time/money to go to Six Flags. First, I pay a TON of money to park my car (as much as $35 to park in the Preferred section of the parking lot), then I pay a hearty amount to get into the park. After that, I usually buy a Flash Pass, because the length of lines at Six Flags can get to be absurdly long. To rub salt in the wounds of paying for that Flash Pass, they often tell you which seats you can sit in after you pay that princely sum of money for the Flash Pass....and it usually excludes the front and back seats. Then I pay a fortune for greasy, cold, gross food and over the course of the day, I just get bombarded by advertisement after advertisement, and constant, endless attempts to get me to spend more money. Jake, get a season dining pass! Jake, upgrade today's ticket to a season pass! Jake, get a season parking pass! Jake, come ride the Polar Springs Plunge, sponsored by Polar Springs water...and then come ride the Merry-Go-Round, sponsored by Skittles! Don't forget to eat this (brand I've never heard of) because it's the Official Ketchup of Six Flags!!! Jake, will you be requiring oxygen during your visit today? Get a Season Oxygen Pass so you don't have to hold your breath all day long! After all of this crap, I have to endure ridiculously slow dispatch times on the roller coasters and thrill rides and put up with the bad attitudes of a bunch of lazy employees working in the park that don't want to be there. And don't forget that the hottest ride in the park is closed for the next few weeks/months because Six Flags doesn't keep many of the basic spare parts for its rides on hand like it should...or because they decided to do the annual maintenance on the ride in the middle of the season, instead of during the off-season when the park is closed or attendance is low. Oh, and did I mention how dirty and run down the park is? It just gets EXHAUSTING.\n\nAll of that went away on my first visit to Six Flags Discovery Kingdom 9 days ago. Yes, parking was INSANELY expensive. Yes, the park was busy. Yes, it wasn't the cheapest price to get in for the day...especially for the short time period the park was going to be open. But this time, something was different. The employees were all AWESOME. I mean that. They were AWESOME. They were friendly, quick to check restraints and dispatch rides, they had great attitudes and all acted like they were actually happy to be there and having a great time. The park was clean. CLEAN!!! I didn't see any trash anywhere the entire day I was there, and the trash cans weren't overflowing like they often are. I visited a few of the animal shows and was pleasantly surprised with the quality and entertainment value they presented. My Premium Flash Pass got me on almost all of the rides I wanted with not more than 5 minute wait times (for lines that were easily running an hour or longer)....and best of all, I was allowed to pick the seat I wanted!\n\nRide selections at the park weren't bad. Since this is a smaller Six Flags (and not a HUGE Six Flags like the ones in LA, Chicago, Texas or NJ) and since they are subject to 150' tall height restrictions for their rides, they didn't have some of the extreme rides as some of their sister parks. That being said, their ride selection (especially coasters) is pretty solid. There's plenty for the thrill-seekers, and 2 smaller coasters for the kids. It's seriously a well-rounded park for all ages and is perfect for families. Don't like the rides? Go see one of the animal shows! Bored with the animal shows? Go ride the big coasters!\n\nI did have a few gripes about my visit to the park, and they are gripes that I see other reviewers mentioning too. I didn't eat during my visit, because the lines for the dining establishments (even quick-service food stands) were HUGE. I wanted to get in line for a burger/fries at Johnny Rocket's and was told the line was 1.5 hours long. TO GET FOOD. Those lines NEVER died down, either. EVERY food establishment had HUGE lines for the ENTIRE DAY. Because of this, Six Flags missed out on money from not only me, but from lots of other people that gave up too. Also, a few of the major rides were closed for refurbishment. Okay, I understand that early November is the off-season, but why would you close these rides for 4-6 weeks with the holiday rush coming up? Why not wait until January to close them and do the necessary off-season maintenance?\n\nGripes aside, I had a wonderful day at the park and I would definitely recommend it to anyone thinking about making a visit. Shop around online and look for deals on entry tickets and other coupons from Six Flags to save money. And yes, the Platinum Flash Pass is worth every penny if you're going to ride and you've got the money to spend on it (which tends to be higher than the cost of admission to the park).\n\nBravo to the management of Six Flags Discovery Kingdom. I don't know what you're doing that's different than your sister parks, but it needs to spread chain-wide. I had a great time and congrats on a job well done!\nShow less"], ["Reviewed November 15, 2017", 3.0, "Good rides / Greasy cold food", "I visited the park this past Sunday with my wife and two kiddos. We had a lot of fun on the rides as the lines were relatively short. The park was clean and, for the most part, the staff was helpful and friendly.\n\nMy gripe is the food! We spent over $100 for lunch and had awful pizza, lukewarm Chinese food and hot wings that tasted more like vinegar wings. The lines for the food were exceptionally long. We split up so everyone could get what they wanted and we each waited about 30-40 minutes in line. The park food service staffing seemed to be out of sync with the size of the crowd. (I’ve been to this park on much busier days and not waited as long for food.)\n\nAnyway, not sure what happened Sunday but the food experience was not ideal. I still do think the park is fun and great for families but, with some small tweaks, it could be much better.\nShow less"], ["Reviewed November 12, 2017", 3.0, "Rundown", "This park was a lot smaller than the Six Flags in Southern California. There was a few big thrill rides, and lots of smaller rides for the kids. We mostly were there for the zoo, but a lot of the exhibits were shut down though. The few that were open, were really run down and needed updating. Felt really sad. We got a great deal on tickets, so I thought it was worth the $33/person (included lunch) I paid. But I would’ve been upset if I paid much more.\n\nWe did see two shows, the tiger and the dolphin show. Those were really fun. The dolphin show was especially amazing. We also really enjoyed the Butterfly Grove.\n\nIf you go to this park expecting it to be a spectacular zoo, or an amazing amusement park like the Six Flags in Southern California, you’ll be disappointed. If you have a lot lower expectations, and expect something a little bit smaller, like Gilroy Gardens (which I think is way better), then you’ll probably like this place. But even still, overall, it felt really run down.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Family friendly park", "We had a great time visiting as family with small children, teenagers and a senior on a wheelchair. We planned well ahead, got dated tickets from Fathers´ Day sale, including parking ticket and tickets for Dolphin discovery for children. Printed all at home, no need to stand in line for tickets at the gate. The dolphin discovery was a blast for the kids, the park delivered all they promised on website including dolphin feeding, petting, training and a dorsal fin ride, all under close supervision of a number of friendly staff. The park itself is extensive and the shows perform one after another on a tight schedule but quite far away from each other. You need to really plan your visit ahead at home so as not to waste time during your day of visit. You need to decide how much time you want to spend at the shows and how much on the rides - be prepared to split the family as many rides have age and height limitations AND you must put all your bags and purses in lockers (paid) or leave them with non-riding family members. Most family rides are wheelchair accessible and the staff is ready to help with getting on and off the ride.\nWe chose a Friday in August for our visit and the crowds were relatively small, the longest wait for a ride was about 10 minutes. We think that the park could use a better orientation system, there are many small winding paths and we got lost even with a map.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great time during \"fright fest\"!", "We spent a couple days at Six Flags Discovery Kingdom in October while the park was doing \"fright fest\". A couple things, fright fest is pretty cool, the park is decked out in halloween, and packs of \"zombies\" roam the park scaring patrons. There are areas that the dressed up staffers hang out as well which are constantly \"haunted\" as you make your way around the park. We had a 2 and 3 year old with us, and a couple of the staff members warned us that the zombies were about to start roaming so we could prepare/evacuate the kids. Lines weren't bad, parking lot is quite a distance from the park but they do operate a shuttle that drops at the main gate if you don't feel like walking. We bought season passes so we'll likely be back again. We were surprised at the amount of rides they have for little kids!\nShow less"], ["Reviewed November 9, 2017", 4.0, "Fun even for the little kids", "We had not been there since it became a Six Flags. We had a 7yr, 6yr, 3yr and 1yr old. Not knowing what to expect on the rides, we thought the animal shows would be fun. The shows were fun and we were pleasantly surprised that there was a whole area with rides and activities for the little ones. The lines for rides are long, the food lines and prices are ridiculous, but that seems to be the norm are amusement parks....\nShow less"], ["Reviewed November 5, 2017", 4.0, "Had a fun time.", "Six Flags Discovery Kingdom in Vallejo is a fun place for everyone. There’s lots to see and do. There’s a Dolphin show and entertainment. Lots of kid rides and games. They do have a few roller coasters. The new Superman one is awesome and fast. Had a fun time. Wish there were more roller coasters.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Had a great time!", "The lines were incredibly long but we were there on fright night We are looking forward to going in a slower time of the year on our next trip I definitely recommend this park just maybe not on a special event night"], ["Reviewed October 29, 2017", 1.0, "waste of time and money", "had a season pass and was excited about going to fright fest not knowing that it did not include the haunted houses, but decided to go anyway thinking it will still be fun, WRONG!!! 1st off when i parked my car and went to the tram they stopped the tram from picking up people because it was so overcrowded with people so i had to walk all the way to the park and then when i got there, i couldnt even find the end of the line to enter the park so many people, and the lines to the food and drink places was so bad took about 30 to 45 minutes in those lines there was also alot of food places that werent even opened because one of the workers said they were under staff, umm you need to have lots of workers to accomodate that many people. it was definatly not well planned for a saturday fest, the showes wasnt all that great, hardly seen any zombies walking the grounds, probably because they were understaff there too,the lines were so long for the rides so we waited in them any way hoping to get on a couple of coasters, so after waiting in line for about 30 minutes( we were only half way there ) when they announced the ride is haveing technichal issues, we waited for awhile anyway to see if it gets back running soon, but no it did not, so we left, there was a lot of rides not running thru out the park and seems like thats an issue everytime we go to discovery kingdom so nothing new there, we just did a lot of walking could not get on any rides, not fun at all and i will not be going to fright fest ever again or even buying a season pass, that was my 1st season pass i ever bought there, went to an amusement park last year for halloween which i wont mention but its in santa clara :), the season passes are so much better which it included the haunted houses with the exception of a couple and we had a blast, and the rides didnt constantly break down so now i know where to go and where not to go,\nShow less"], ["Reviewed October 25, 2017", 2.0, "Mediocre amusement park", "There are significantly better Bay Area attractions available if you aren’t specifically looking for roller coasters. We have lived in Vallejo for nearly 10 years and visited Discovery Kingdom on a few occasions when hosting out of town visitors. The park is dirty, the staff is usually unfriendly and the rides are constantly having mechanical or technical difficulties. I personally feel that it is not worth my time or money, however children and teenagers seem to be able to ignore the filth and rude staff members and still enjoy the rides and attractions.\nShow less"], ["Reviewed October 22, 2017", 1.0, "Dont go...unless", "Six Flags doesn't care at all about the individual family's experience. They will herd as may people as they can into the park and, in the case of Halloween, be prepared to wait one hour for every good ride and, if you want any form of food or beverage, that's another hour...or more. WORST WORST WORST family place I have ever been. This is a greedy business culture at its worst. I will never ever spend another dime at this wretched organization.\nShow less"], ["Reviewed October 21, 2017", 1.0, "Poorly managed theme park", "We had season passes on the past and after a couple year break decided to purchase again. After visiting this park twice within the last month, I almost wish we didn’t buy passes. I have been to many theme parks and this seems to be the most miss managed. First, on Oct 21st the web and app sites showed park opening at noon. We arrived at 11:30 to discover the parking lot 2/3 full, and the park already open and crowded. We also purchased the deluxe dinning pass - which I do not recommend. It is a good value price wise if you visit more then 3 times. However food management at this park is horrible. Three of the food restaurants were closed. The open ones only had one or two, if lucky, open windows and were under staffed. The cashier would take order, wait for order to be made, then serve before taking next order. Very slow and inefficient. Food wait times were from 60-90 minutes. Management doesn’t seem to care as dining pass holders have already paid their fees upfront. People are better off leaving the park, eating nearby, and returning. Its cheaper and takes about the same time.\nShow less"], ["Reviewed October 21, 2017", 1.0, "the complaint sent to guest relations", "I would not recommend this park to even the most desperate of people! I have been going to this location since i was a child and it was marine world. Here is a tiny bit of what's been going on just since our last visit on Oct 7th and 8th. LITERALLY a TINY bit of our experience......complaint sent to cust relations and membership site....\nI am disgusted with the customer service I have gotten from your guest relations department let alone with the park itself.\nMy sister and I have called 9 times since Oct 8th to speak to George and every single person who answers the phone says he's not in or he's not available! My sister said she was able to speak directly to him on Oct 8th (I was hysterically crying while she called) when the security guard had to get involved due to our upset with the park and it's employees especially since the person at the guest relations building outside the park gave us the WRONG NUMBER the first time, to call to speak to the manager of the park \"George\".....\nGeorge had said we would be receiving an email showing that our memberships for our family of 5 people had been cancelled and the refund of the initial payment would be sent.\nI have NEVER had this hard of a time getting a hold of a MANAGER of CUSTOMER RELATIONS in my life!!! I am sick of being LIED to by your call center representatives saying they have taken all the notes regarding why we have made the complaints and demanded the cancellation and refund and no one has, because every single time my sister or I call we have to explain the entire horrid experience every single time and I am sick of it.\nWhen I called on Tuesday, the lady i spoke to was the ONLY one who seemed remotely concerned with us canceling and did everything in her power to change my mind. I am sorry to say it didn't work and I still want this \"George\" person to return my call or send me confirmation that the membership I purchased for my 5 family members is cancelled and refunded!!!\nI expect some kind of response from someone who is supposed to be IN CHARGE of a customer service/relations department. I was told by the lady I spoke to on Tuesday that they wouldn't be open again until Saturday. I called this morning approx 30 min ago and the recording said to call back during normal business hours but doesn't state when the \"normal business hours\" are.......is it when the park opens for business at noon now or what???\nSo far it's been the poorest customer service I have ever had the displeasure of dealing with. I will go to the better business bureau, yelp, angies list, craigslist, facebook, twitter etc and voice my displeasure with the trips we have had this year in the hopes it would get better, AND our absolutely horrid experience on oct 7th and 8th and how lousy the customer service department has been in, not only this year but especially now that we are trying to deal with someone who is supposedly in charge of the department!\nNeither one of us has even been able to speak to a SUPERVISOR and the excuse as to why has ALWAYS been \"One isn't available\" What in the world are your people doing??? Absolutely nothing from what I can tell!! Do you even employee these positions or are they just ghost positions and your poor call center people who I doubt you pay much of anything at all, get to deal with the disgruntle people who call in????...\nSOMEONE GET THIS \"George\" person to DO HIS JOB and return a call or do what he said he would do and return my money and cancel the memberships!!! The confirmation number is 249189683....George doesn't even have to call!!! I don't give a damn if I ever find out his last name since no one would give it to me anyway! Do what you said you would do!!! Make this right!\nYour discovery kingdom park has gone downhill very fast, it's understaffed, rides are always broken down, the majority of the employees that are there, don't appear to be happy to be there, the employees in the restaurants we went to took a disgusting amount of time to do anything from refill the cup we paid $17 dollars for to spending 15 minutes to put a scoop of ice cream in a cup making the WAIT for ANYTHING agonizingly long....there were no characters dressed up around the park at all, even in the kids areas, if there were, they weren't there when we visited any of the times we came in from RENO NEVADA...we came from Reno NV!!! just under 200 miles away!!! Been coming to that park since it was marine world and my sister and I would just young kids and NEVER, I mean NEVER have been treated so horribly or have had such a bad experience as the one last weekend....SOMEONE DO SOMETHING to make this right!!!\nShow less"], ["Reviewed October 12, 2017", 4.0, "fun to visit a different six flags", "we came here because we have free admission for most six flags theme parks. it was very different from the one we are used to [Valencia, ca]. the rides weren't too intense but still fun. but it was also a joint zoo . I enjoyed the animals and butterflies more than the rides to be honest! it was more quiet than I'm used to a theme park being. there were also many quiet seating areas. the only downside to this theme park is, that there is no point in arriving early. most of the rides are not done testing. they don't start opening until almost an hour after the park opens. also many food places were closed.\nShow less"], ["Reviewed September 30, 2017", 3.0, "Exhausting.", "We bought season tickets. This first trip of the season was a little confusing. There were long lines for everything. There are not as many animals as there were 4 years ago. We walked a lot. The kids seemed to have a good time. Plan to wait a long time for food. But we will be giving it a try again and hope it goes better.\nShow less"], ["Reviewed September 30, 2017", 4.0, "Alumni Outing", "My alma mater held their homecoming here. What a beautiful day to enjoy the festivities. I do not do rides but the whole experience was beautiful. I like the layout of the park, the attractions and the food. Enjoyed my outing."], ["Reviewed September 28, 2017", 4.0, "Fun day", "It was a fun day with some great thrill rides. At the end of the day it's just another theme park so expect lines for rides and expensive food etc. But hey, it's just a bit of fun!"], ["Reviewed September 25, 2017", 4.0, "I can't see what everybody's talking about!", "I visited on Sunday, 24 September and had a great time. I thought the park was clean and the staff courteous and professional. Those that review the choices and length of lines for food seem mistaken or there's was a far busier day. Lines were manageable or short and there were healthy options throughout as I found multiple stands selling fruit and even a salad. There was one roller coaster truly down for repairs but did not take away from the overall experience. Even Fright Fest was enjoyable with the various attractions set up throughout the park. The thrill rides were great and the animal attractions add positively to the experience. I would definitely go again! I agree with others that it is not Disneyland but you're not going to Disneyland, you're at a Six Flags.\nShow less"], ["Reviewed September 24, 2017", 2.0, "Locker hell", "We love amusement parks. This park has some rides but always there are rides down which makes me feel unease along with staff is pretty disengaged. It is impossible to cane to a park all day with out a bag and I love the rides that have storage cubbies. This park made me leave line to get a locker when they had a storage bin on the platform. Plus food is outrageously expensive.\nShow less"], ["Reviewed September 23, 2017", 2.0, "I thought the food service would inprove as the season went on but I was wrong & why are lots of rides closed?", "We returned for another visit to Six Flags for the beginning of fright fest & found they had limited service on rides and also the food service had changed for the worse with longer slower lines each venue we visited for different food checking to see if we could find a shorter line for food without success and finally just settled for the shortest line which after watching the crew preforming at their best but I think they are just under staffed for the amount of people attending the park each only had limited staff and I didn't see any managers anywhere in the park except around the front gate or at the extra charge venues which had lots of staff so they could take advantage of charging more for haunted house things which I would have thought would be included in the price of admission! If they would have had these extra people helping at the food court and elsewhere in park it would be nice but they are just looking to cash in on Halloween haunted houses which they had closed other ride down for this event which made other ride lines longer I had waited just to ride the joker over 1 hour and they only had 1 car going why? We were told it had mechanical problem why would this be they are only opened on weekend you would think with all week to fix things they would be going.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Amazing", "Super enjoyed all the rides with full of joy joker ride is amazing all new rides went well with lot of crowd"], ["Reviewed September 10, 2017", 2.0, "Rides are fun. Food options and service are horrible", "The rides and dolphin show are great. Although, it is sad to see the dolphins in a small facility.\n\nThe Saturday I visited with 2 adults and 3 kids - the lines for all of the food options in the main pavilion were extremely long; the food served was disgusting; and the price was extremely high. People were waiting in lines for a minimum of 45 minutes and up to 2 hours. The smaller food venues also had long lines, poor service, limited options, and high prices.\n\nI think it is unfair to not allow people to bring food into the park. It is horrible business practice to not provide adults, families, and children affordable, delicious food options and not provide well-run, properly staffed venues.\n\nI was extremely disappointed and I hope Six Flags make changes to the food service and quality of food.\nShow less"], ["Reviewed September 10, 2017", 3.0, "LONG LONG LONG LINES FOR FOOD", "My kids enjoy the rides and so we invested in the yearly pass because it sounded like a good deal. We went today and I'm really hoping it isn't like today all year. The lines for food & drinks were ridiculously long & the food service places seem to run so inefficiently. The workers are friendly enough but they look overwhelmed & under trained. Six Flags really needs to a page out of Disneyland's book! I get that waiting in some lines is a part of theme parks, but today was ridiculous.\nShow less"], ["Reviewed September 7, 2017", 1.0, "Dolphins In a Bath Tub", "First of all, this \"park\" was built on a NINE HOLE golf course. They tried to cram too much into too little, and it gave me claustrophobia. Add to that, they have captive Dolphins, who should be in wild, not in a space the size of a bath tub.\nShow less"], ["Reviewed September 6, 2017", 3.0, "Costly For What You Get", "If you are truly into roller coasters and rides that hang upside down, then Six Flags is a great place -but overall I've been to better. To begin the parking fee is outrageous! Even if you book online - it's $25. And the walk to the park isn't too bad, but if you struggle with walking, or pushing a stroller, it's wiser to take the shuttle because there is no parking close to the entrance. You'll walk further than from the parking lot of Disneyland to the front entrance. The shuttles are marvelous and you don't wait but maybe 5 minutes at most. If you book tickets online you get a GREAT deal by requesting tickets at least 2 days in advance. Tickets are $70 ($69.99) but you can get them for $45 ($44.99). There's no discount on parking fee and there's no discount beyond the $44.99 for kids, veterans, students or seniors. There is a cheaper fare for kids under 48 inches tall if you buy at the park.\nGetting through the entry gates was a challenge, and it was easier with our confirmation paperwork from the online ticket sales. The park offers a lot of variety - BUT there are not a lot of places to sit, unless you are a smoker. And my experience with the park gift shops was less than satisfactory. Let's just say, if you don't like your job go find another one.\nFood is pricey as well, but it's expensive everywhere.\nShow less"], ["Reviewed September 1, 2017", 2.0, "Nothing Opened for Little Kids", "We went to Six Flags Discovery Kingdom while on vacation in California. We chose it because we have a toddler and it seemed to have a variety of age appropriate rides, animals to see, and shows available. Upon getting there the teenagers were apparently back in school so they had no staff and they had no kiddie rides opened. This was an expensive activity, tickets were not cheap and we couldn't do anything. No toddler rides opened and adults can't ride adult rides if theres no baby sitter! The dolphin show was awesome, that was about it. I won't go back ever and I will be very cautious going to any six flags in the future. We complained along with other parents with little ones and they simply kept saying the kiddie rides were not a priority and they didn't have enough staff... well hire some! They wouldn't refund us either. Poor customer service and poor people skills\nShow less"], ["Reviewed August 25, 2017", 1.0, "Not worth it", "My husband and I visited recently and left very disappointed.\nWe were there prior to the park opening,it wasn't long before they opened the car park and we paid extra for preferred parking.We shouldn't have bothered because we could have saved money by not buying it and just parking one section over,it would only have been an extra 30 seconds walk.\nWe spent ages in the queue waiting to get it and when they opened the gates they only let you into the entrance where the shops are and not to the rides which don't open for a bit afterwards.The paths to the rides were cordoned off and we felt like we were being herded.\nYou are not allowed to take bags etc on to the rides (for obvious reasons) but unlike other theme parks I have visited they don't provide bag drops by ride but they charge you AGAIN to use lockers. The ticket price to get in is expensive enough so that should cover locker prices!The lockers are terrible too,not allowing us to lock/unlock them.\nWe paid yet more money to get an unlimited refillable drink,again it was expensive.But why do they advertise this when refill stations are closed??!We had to use normal restaurants and booths to get it filled up and at one booth the woman behind the counter - who was only serving pretzels,popcorn and drinks - took ages to serve customers,again,we were in the queue for about 20 minutes.\nThe food we bought was not pleasant and my husband spent about 40 minutes waiting to buy it.\nThe rapids broke down whilst we were in the queue and with people still on the ride!Lots of the rides were closed as well.\nWe spent so much money to get in,park,eat,drink and store bags,but I wish we hadn't bothered now.\nShow less"], ["Reviewed August 23, 2017", 2.0, "Your average amusement park", "Only roller coaster / thrill rides at this park. My teenager loved it. I only was able to ride one ride (the kiddy train).\n\nI really, really regretted the money we spent to buy tickets to this park ( 2 adults, 1 teenager). The adults rode nothing. I wish they had a no-ride ticket.\n\nThe food was quick service - mostly not as good as your local McDonalds. Eat outside if you can.\n\nParking is horrible. Long lines. Very expensive.\n\nPark is dirty. None of the benches or tables seem to be ever cleaned. Bring your own wipes.\n\nIf you have to go, stop by the AAA office nearby the park entrance and buy your discounted tickets - this will also save you the wait in line to buy tickets.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Fun day; poorly maintained", "We had a good day. Enjoyed the dolphin joys and water rides. The park could use some maintenance and cleaning. Acme Fun Factory has awesome ball shooting machines, but almost none worked. We had to go to several stands to get the all day drink deal, because some were out of ice, others were out of the cups.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Really great park", "Animals are great and park is well kept. Roller coasters are great especially joker and medusa. There is so much to do in this park. If you like rides and animals go here."], ["Reviewed August 15, 2017", 3.0, "Fun rides for all ages", "The reason for the average rating, getting into the park is bad. Parking is terrible at the start of the day. Only a few lanes to get in, can back up onto the hwy. Check Waze or Google fo back roads. Once you park you walk down hill, to a shuttle line or walk about 3/4 of a mile to the gate. Then at the end of the day reverse, the long walk up hill is long! More shuttles. Walk way over lake or ferry to a rear gate.\nBesides this the park is fun for all ages. Big rides are fun and thrilling. Many rides through out the park near bigger rides for younger kids, which is nice for entertaining the whole family. Shows are nice to see, animals are neat, lots of activites near each other. The park needs to be open a little longer during the week, like 8 pm. With the long lines to get in, hard to do what you want in the short open time of closing at six.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Good rides and not too crowded", "Went to Six Flags on a Monday in August and got there when it opened. It filled u during the day but need got too crowded. We had a fast pass which is recommended unless you enjoy queuing. The rides a good - Superman being especially shriek-inducing!\nShow less"], ["Reviewed August 14, 2017", 1.0, "poor service", "1 star for poor service. I have many examples of this, but just as one example: they sold me Soft Drinks All Day for $17 at around 6 pm not mentioning that all concession points with drinks starts closing at 6:30 pm while park is open till 8 pm. So in half an hour most of them were closed, few that left were selling food and had looong lines, and those are closed by 7 pm as well. That day I had the most expensive soda drink in my life.\nShow less"], ["Reviewed August 12, 2017", 4.0, "loved the ocean mammals shows", "weve gone to all sixflags all over the nations and discovery kingdom was our last one. we like it so much. the weather always nice and cooler in the summer compared to sixflags texas or the magic mountain. we watched most of the sea creatures shows in one day. my teenagers loved the big rides and my little one enjoyed petting the sting rays.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Great fun for all ages", "I have had season tickets for 5 years now. As my grandchildren have grown, they went from kiddie rides to the thrilling roller coaster experiences. We also have lunch/snack passes, so we can all eat wherever we choose and don't have to carry a lot of extra money.\n\nWe meet family from Grass Valley, Folsom and Rocklin (we are from Oakdale) and spend the day together 3-4 times a year. The group is 13, the ages are 2-68 and there is really something for everyone. We always go on a weekday, which means short lines and room for the kids to run and play.\n\nWe let the older kids go on their own to the rides they love, and the rest of us walk with the younger kids to the children's areas and take in at least 2 or 3 animal or character shows. They have two large areas for the younger children (one on each side of the park), with lots of rides and a nice playground at each. They also have little water spouting areas in both sections for the kids on hot days.\n\nThey have lots of restrooms and they are always clean.\n\nYou can take strollers all over the park, and outside each show they have areas to leave them. We have never had a problem with things being taken from our stroller.\n\nThe staff has always been friendly and helpful. They are great with the younger kids helping them on and off rides and getting them excited to ride.\n\nChristmas in the Park is great, we go every year. They dress everything for the season and have a small snow hill. They also have a good live show with dancing reindeer in the plaza. It is a must.\n\nHalloween in the Park is awesome, with zombies and other scary people walking around, as well as a good live show in the plaza. The only problem is it is only open on the weekends, and the lines for rides and food are really long. We have decided to skip this trip in favor of 2 summer trips.\n\nI plan to buy season passes again next year.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Day of Fun w/ Friends", "I recently went to Six Flags Discover Kingdom in Vallejo, California for a birthday celebration / work retreat. We had a great day of rides, sun and theme park eats! Considering that we went on a Friday during the summer the wait times weren't bad, and we didn't have a problem getting on the rides that were of interest to us.\n\nI am always a big fan of water rides, but not so much a fan of being drenched for the rest of the day - I was happy to see the addition of a dryer that you can pay $5 to have hot air blow on you. Unfortunately on the rapid ride I got soaking wet and the dryer didn't even make a dent on my clothes. It did however blow my hair into a crazy frizzy explosion so that was cool.\n\nThe food - though pricey - was surprisingly good! I enjoyed a hand-dipped corndog, roasted corn on the cob, an ice cold Shock Top, and an amazing funnel cake. They do not use those gross packaged funnel cakes -- they make them fresh and they are so good!\nShow less"], ["Reviewed August 9, 2017", 1.0, "Worst vacation", "Non smoking property. Immediately stopped after walking all the way from the parking to the entrance of the property. I have a disability and was immediately discriminated against for walking from my vehicle (which was parked farther away than the bus stop where my fiancé and I asked an employee for directions while smoking *cough* not informed even then) to the entrance while smoking and told to present my I.D and leave the property after obvious stalking. I am a prop 215 patient. I was not informed of this no smoking policy and was told 'there were two apparent signs' stating this information. I did not see them. I requested to speak to a supervisor and the gentlemen became defensive, claimed his supervisor was unavailable and that he was the only one who could assist me. I work in hospitality and this was by far the worst customer service experience I have ever witnessed in my years as a service provider. No other options were presented to me and I am HIGHLY dissatisfied. I should have taken pictures and asked for names but I was so dazed by the level of service and hostility that I simply walked away in total shock. Save yourself the money. Go see Muir Woods instead.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Fun if you have a Season Pass", "I always love visiting Six Flags parks, but this park needs some TLC. I am giving it 4 stars because my kids had a great time, the rides I rode were fun and I was able to enter the park with my Southern California Season Pass. My problem is a lot of the park is unkept and my family members who didn't have season passes paid way to much to get in.\nShow less"], ["Reviewed August 7, 2017", 3.0, "Family theme park fun", "As part of our season pass benefits for six flags we visited another Six Flags Park. Another benefit is that we get parking included with the season park pass. There was plenty of thrill rides and roller coasters for the teens. Also they have many educational and hands on exhibits for sea life interaction. Love the butterfly collection and the sharks. Lines weren't too bad and we didn't need the flash pass for any rides as most lines were under 10 minutes and I think the longest was the joker at the busy time of day where my phone decided to leave my secure waist holder and fly out to the below. The most frustrating thing was waiting till the park closed and trying to get them to get it and return it to me as I had the gps location and could direct to the area. Another point of service was about an hour before the park closed the stations for food and drinks were closing down for the day and we could not get our refills for our expensive reusable cups refills except at the entrance of the park. While the day was overall fun, the park was showing it age for the secondary things and could use some maintenance for vending machines and facilities. As with all theme parks with a high concentration of young adults as employees that were more intent on talking and less intent on service they were many gaps in the level of service. Thanks for a good day\nShow less"], ["Reviewed August 3, 2017", 5.0, "Vacation", "We had 3 adults and 2 children in our group. We had a very wonderful experience. Customer service was excellant and the kids out lasted the adults. I wish we had more time and could of stayed longer. Next time. Can't wait to go back."], ["Reviewed July 31, 2017", 4.0, "Expensive but the Kids Had Fun", "Took our youth group to the park, based on their feedback, they loved this place. The rides were significantly challenging for the daredevils in the group. Prices for food were high but not as bad as other theme parks I've been to (Disneyland, Legoland). Plenty of options for families with children off all ages. We will be back!\nShow less"], ["Reviewed July 27, 2017", 3.0, "Bay Area Prices", "This park is overpriced...parking, tickets, food and some of the attractions even cost extra. And then you can't take your purse or backpack on the ride so you have to rent a locker. Seems like everywhere you turn you had to pay $. Food options are limited and expensive! Trying to find gluten free food was a challenge. Otherwise, the park felt clean. The dolphin show was enjoyable. And our family had a good day.\nShow less"], ["Reviewed July 24, 2017", 1.0, "Broken Down Rides All Day", "What an embarrassment to call this place Six Flags. There was at least 2-3 major rides closed at all times throughout the day. According to the employees it is always like this all year long.\n\nHave been to five 6Flags and this is this is the worst, hands down. The others were all fantastic!\n\nThe rides are old and very bumpy. Mark my words, one day there will be a bad accident here due to the quality of the rides. I've never seen anything like it.\nShow less"], ["Reviewed July 24, 2017", 5.0, "If you haven't, you must!", "The staff is awesome, the roller coasters and rides are over the top and there are a lot of them. You can conquer a lot in one day but a second day makes it great!"], ["Reviewed July 21, 2017", 3.0, "So many things to be improved", "My first impression started before even entering the park. They charge $25 to park here. I am from Orlando they don't even charge that much at the Magic Kingdom! We then rode a public transportation bus (no room to sit) to the front. We had to get our passes from guest services. The line was very long and they only had two windows of the four open and operating. While waiting in line we had to use the restroom so we took turns. The restroom that is provided before you enter the turnstiles are in a trailer style bathroom which was disgusting. I was so disappointed and this was all before even getting in. I honestly would have just left at that point if it weren't for our 7 year old who was really looking forward to the park. Once we got our tickets and headed to the entrance our bag was searched which is normal but we were told no snacks or food of any kind allowed in the park. We have a 7 year old who likes to snack throughout the day on healthy foods those are sometimes hard to find at parks we were told we could get a $12 Locker at the front of the park or we had to throw the stuff away. Again being from Orlando none of the parks care if you bring snacks in.\n\nOnce we were inside we discovered that the park is just very old and in need of a remodel. Several rides were not operating which was disappointing. We were lucky enough to go on a day where the lines were very short so the things that we did want to ride we were able to do so without waiting very long. There are a lot of dead ends around the park and the signage is not very good. One attraction stated that you could not be taller than 42 inches tall. Our son is 54 inches. I saw taller kids coming out so I asked an employee. She said \"oh yea he can ride that sign is just old\" huh? Really?\n\nOverall this is a below average theme park.\nShow less"], ["Reviewed July 11, 2017", 3.0, "Slow start impacted the entire day...", "We came early hoping to beat the crowd, but much to our disappointment, many rides weren't open or they were under some kind of maintenance....\nThis resulted in long queues at the rides that were open and we only had 3 rides in 2,5 hours....\nBy the time we left, most rides were open and queues were not long.\nApart from that, it's a great place with some thrilling rides that will challenge most...\nBuy the tickets online and beat the lines when entering the park - also often some good discounts available online...\nShow less"], ["Reviewed July 10, 2017", 5.0, "Childhood Fantasy", "If Ever In Your Widest Dreams, You Could Have Even Imagine, That A Park From You Childhood, A Place Close And Dear To You As A Child, Would Become Even Bigger And Grandeur, Than That Of The Magical Place You Experienced Growing Up, Then This Is The Place For You!\n\nMy First Experiences With Marine World Was In Redwood City, With My Family, Back In The 60s, 70s And Early 80s Before Marine World Would Find A New Home In Vallejo. That Would Be The Sadest Day For All Who Lived Near MW Growing Up.\n\nFrom What I Can Recollect From My Experiences Were The Orcas Show, Skiing Elephants, Stunt Men Skiing & Boat Shows And Let's Not Forget Those Chimps, Everything About It Was Terriffic As A Kid And Will Never Forget That Experience.\n\nThe New A Improved Marine World, I Guess You Could Say...It's Out Of My Time...But Stil Holds That AWE-som Magnetic Attraction For Those Who Are Still, Young At Heart! I Stil Visit From Time To Time With My New Family, Just To Take In A Few Attraction While The Youngsters Enjoy The Rides.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Family with teens and young children", "Of corse we love six flags. We have season passes. We live in Oregon but the 6 hr drive is worth it. The teens love it the Tweens love it and the little ones love it. I my self live the animals as rides are not my thing.we will be purchasing passes again in 2018. There are 16 of us total\nShow less"], ["Reviewed July 8, 2017", 5.0, "Weekday trip, mostly short lines, discounted tickets", "We enjoyed a Friday visit to Six Flags, Vallejo, CA. Arrived at 10:30 a.m. Purchased our tickets a day in advance, and received $20 discount per ticket. Parking fee is $25. Keep parking receipt if you leave the park for any reason and you can return and park the same business day. If you don't the free parking shuttle, it is a 10 minute walk to the park entrance gates. You can't bring outside food or beverages, but you can bring an empty personal size water bottle which you can have filled with ice cold water at the many food and drink stations in the park. The water ride and the Joker were not opened when the park opened, but they eventually did. The water ride at approx. 1 p.m. and the Joker at approx. 2:30 p.m. Glad we waited for the Joker to open. V2, Medusa, and the Joker were our favorite.The lines were mostly short except for Superman and the water ride. With the exception of one foul-mouthed adult who appeared to be a parent, the lines were orderly. Check your bags at the locker stations, $5 for 2 hours, transferrable to other lockers. You can't carry your bags or loose items on the rides or leave them with the ride operators. We had a great time, and left at 3 p.m.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Great day of fun with our granddaughter!", "We had a terrific day! We particularly liked Kong, Cobra, Wave Swinger and the rock wall. The park was well landscaped and very attractive and clean. We were disappointed there were no healthy food choices. It's a great place to take a family -- lots to do for all ages!\nShow less"], ["Reviewed June 30, 2017", 2.0, "Six Flags Discovery Kingdom", "Visited the place on a friday, though its summer vacation most of the rides is a short wait. We tried rock climbing and water guns and won prizes. Rode the joker and the cobra. Prepare to get soak if you go on the Lagoon ride. The Wonder Woman ride look fun but scary. Food and snack kinda pricy but you can bring chips, snacks and water inside. What i hope is that all the animals (penguins, dolphins and others) will be return back to their natural habitat and not caged in the park as an amusement. These animals does not belong to the park, the rides will be enough to entertain the guests and visitors. 4 stars for the rides but a zero to the animal show/attractions.\nShow less"], ["Reviewed June 28, 2017", 2.0, "Last time ever going", "We come once a year (Read to Succeed free ticket from the school-the ONLY saving grace). Every year it seems to get worse and worse. The showtimes are such that you can't really see them all. The shows are offered ony one or two times a day ( I remember back in the day they were offered at least 5-6 times). Food is expensive and not good. Animal enclosures were closed. Rides were closed. The park opens at \"10:30\" but we found that a lot of things didn't open til after 12 or 1. Staff not helpful/friendly. Really disappointing. Will not return.\nShow less"], ["Reviewed June 26, 2017", 3.0, "Fun rides, mediocre food.", "Visited here on a Friday. It wasn't as crowded as I expected. We didn't see any of the animal shows (I think just a dolphin show). Some of the rides had really long lines while others had none. Our group rode Superman over and over. There was no wait. There wasn't much of a wait for Lasso of Truth either. It was super hot! We bought the refillable mug and I would definitely recommend it! We filled it up several times. Worth every penny. The food wasn't great and we waited a long time for it. I think they needed more people working the food so more windows could be open.\nShow less"], ["Reviewed June 26, 2017", 3.0, "Took the kids for the day", "I would pack snack and dont plan on eating a good meal. They need to have a sit down restaurant with quality food . They only have outside picnic area's and the food was not good. The price was around $30 for dry chicken and under cooked fries. The kids had fun on the rides and we enjoyed the dolphin show.\nShow less"], ["Reviewed June 22, 2017", 3.0, "Excellent roller coasters, confusing paths, very busy on weekends", "The last time we visited this park was 2002 so there were a few new rides to experience when we visited on our driving tour in 2016. We visited on a Saturday in late August and the park was very busy, which limited the amount of riding possible.\n\nThe car park was very busy and because of the distance to the park entrance they provide shuttle buses, but there was quite a wait for a bus and it was very crammed. My wife decided to spend the day seeing the marine life and watching the shows, but had a frustrating time as she found the paths a bit confusing and struggled to find some of the things she wanted to see, which added to her annoyance on a hot and busy day.\n\nI spent the day riding the coasters (there are eight to explore) and really enjoyed the Joker. Medusa, Vertical Velocity and Superman, however the long lines meant I only got one ride on four coasters and in the whole day only managed to get five rides in total, so not good value for the $50 admission and $25 parking fee. To add to the frustration two of the rides suffered long periods where they were closed, so I ended up wasting time waiting for rides to reopen, and the delays caused problems with my all-day locker as I was running out of time to ride things before the locker time expired.\n\nA tip - If you want to get photos of the best coasters the ideal place is actually outside the park entrance. In summary, it was a day marred by ride breakdowns and long lines, which is a shame as the coasters here are largely superb and I would have wanted to ride much more than I did.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Wild Family Fun - Don't take a lot of stuff", "This place is heavy on coasters. I noticed a small kids area, but we didn't hit that. The weather was hot and it was a week day, so the lines were short for most rides. I'd recommend the Flash Pass to get on rides quicker if it was a busier day. The rides are GREAT! The staff is friendly. The food was our least favorite part of the park. And, don't take more than you can fit in your pockets. Most of the big rides will require you to put your bags into a locker which cost $1 for 2 hours or $5 for the whole day and you can move your stuff to lockers in the area where you are going to be (only for that $5 all day price). We loved it overall and stayed from opening until it closed.\nShow less"], ["Reviewed June 21, 2017", 3.0, "This will be our last visit.", "We won't return. This is no Disneyland!\nWe had been to Six Flags several times while we lived in CA. As the years went on we saw the park atmosphere dwindle. (Where did the ski show go?) There is so much profanity from guests AND employees of the park! Half the rides were closed at alternating times. The animal shows are lacking. The animals....where are they? Where are the elephants? The employees were so ill spoken and so incredibly slow it was amazing. Service counters would have such long lines and only one window open. Lasso of truth....my daughter's seatbelt popped! Was a fear as her mother sitting next to her that I cannot put into words! Buy the unlimited beverage cup! That is the best deal. Such a dirty filthy park. Gum trash and various varieties of smoking. No thanks!\nShow less"], ["Reviewed June 17, 2017", 5.0, "Six Flags Good!", "Let me tell you now, thrill seekers to young ones to senior will enjoy Discovery Kingdom. Plenty of under 42 inch rides Superman and Wonder Woman Lasso of Truth are major hits. I found the meal deal to work out great."], ["Reviewed June 16, 2017", 3.0, "Don't pay full price", "We ended up with an extra day on a recent trip to California and took our five and ten year old to the park. It was a Saturday in June so we knew to expect crowds. But, my husband and ten year old son waited 45 minutes for one roller coaster and an hour for another. Many rides were closed. It gave me an uneasy feeling wondering if they were severely understaffed or if that many rides were broken. My younger son is an adventurous five year old who was less than an inch too short for the bigger rides. He enjoyed the smaller roller coaster and Rapids ride, but there weren't too many fun rides for him. In other words, there weren't many intermediate rides between the baby rides and the big rides.\n\nEthics of dolphin training aside, the dolphin show was impressive and my sons loved it. My younger son also enjoyed seeing the giraffes.\n\nGiven the number of rides that were closed, the long lines, and the lack of intermediate rides, I wouldn't pay full price.\nShow less"], ["Reviewed June 12, 2017", 4.0, "Butterflies", "We visited Discovery Kingdom mostly because we love the butterfly habitat. The park is well maintained and the rides seem modern and relevant. The parking is overpriced at $25- higher than Disneyland. There are plenty of food choices and activities. Overall nice family attraction."], ["Reviewed June 10, 2017", 2.0, "Half the rides were broke down", "I took my family here because they all love to ride all the rides. Half the rides were not working do to malfunction and they were so under staffed some rides were just closed. We waited an hour in line to ride the Joker only to get almost to the ride and find out the people a few before us were stuck on the ride, the lap bar would not release. Very disappointed with or family time and money spent at this park.\nShow less"], ["Reviewed June 3, 2017", 4.0, "reasonable priced amusement park", "I took my family here on 05/31/17 to celebrate my son's 13th birthday. I spent about $250 for 5 tickets plus parking. Everyone enjoyed the day. There were just a few rides down. Lines were not extremely long; maybe because it was a weekday and we came in fairly late - around 2pm. A few schools were there and were leaving as we were coming in. Medusa was the only roller coaster I rode and it was fast and fun. I mainly had to ride the kiddie rides because of my 6 year old son. He had also had fun just wished he could get on the roller coasters. He was just unfortunately too short. Food was expensive just like in any amusement park. Overall, I like the park and would come back.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Must go place with friends, costly but worth it", "I found superman as the most thrilling ride. Rest were cool and fun. Joker is super fun! I like dare devil too! I sat on both of it thrice. We took flash pass to skip the line but before buying it do check if its worth it. There were just a few places where we found the need. The zoo is worth going too.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Something for everyone.", "We had a great day at Six Flags. There are so many things to do and see there. Our group of 60 to 3 years old all found something to enjoy. Get tickets ahead online. The park is clean, spacious and fun. The staff were all very professional and personable. Parking and food are expensive in my opinion. We found the animals well cared for and living in good conditions. Shows were enjoyable. Would recommend.\nShow less"], ["Reviewed May 28, 2017", 1.0, "Animals do not belong in a theme parks", "Mistreatment of the animals behind closed doors. Investigation underway. I am an animal right's activists. We will be making frequent visits to obtain evidence to give the animals a better home."], ["Reviewed May 27, 2017", 1.0, "Don't waste your time or money", "Arrived at 11 am and did not get through the turnstile until 12:45. Parking is $25 for an unmonitored lot. Spent an hour in line for guest services to get our go san Francisco card exchanged for admission. Only two of the four guest service windows were open. The opened the other two just after we completed our transaction. Every person at the entrance had a problem with their ticket and management was non existent. Needed a beer after the long wait for entry, but there was another long line at the sports bar, one register open. Thank goodnesd for Tia! She restocked serveral empty kegs by herself as the rest of the staff was too busy hanging out. The wait for food was 30 minutes plus, so we went to Johnny Rockets, another mistake! Park is dirty and severely understaffed on a holiday weekend. Many of the best rides were down. Do not waste your time or money here! Glad we did not pay full price. Had no other problems with the go san francisco pass with the exception of six flags. Staff overall is poorly trained and surly. This is a management / training problem. Will NOT be back.\nShow less"], ["Reviewed May 26, 2017", 1.0, "Horrible, poorly managed, inappropriate security", "My wife was asked to take off her skin tight yoga 1/4 zip at the gate. We said no. Then another bully security guard said it's just like the airport. Unbelievable. There were rides that were only open to season pass holders and many parts and restaurants were closed. We paid full admission. All of the sea exhibits were hidden behind dirty, cloudy and scratched glass. Poor animals! Teenagers were jumping in line in EVERY LINE for rides. Zero exaggerations here. The President Don McCoy should be held responsible for this pathetic Six Flags location. Btw, there is no way to call the business. It's all automated diversion phone lines. Pathetic.\nShow less"], ["Reviewed May 22, 2017", 1.0, "Skip this park: long lines, broken down rides, closed areas, poor value", "We came on a girls' trip for the U2 concert in San Jose. We decided to add the Six Flags Discovery Kingdom Park onto our itinerary. When we arrived before the park opened we saw that there was MILES of students from schools lined up to get in. We also had to pay for parking and then walk a mile because the shuttle was not working. Then it was massive lines and waited one hour plus just to get our chance to ride and be told the ride was broken down. This happened over and over. We only went on 3 rides the entire day. The park closed at 6 PM because it was a \"school day\" and they didn't have enough employees to staff the rides. There were long lines to get through security to make sure you didn't bring food in only to have massive lines to wait for food or food shops not opened at all. The entire kid area was closed so we couldn't even get onto a kids ride. The show times were poorly spaced so we also only got into one show as it was the only one repeated at a time we were able to go. It was a very lame experience and I would not recommend. Go to Santa Cruz boardwalk amusement park or Great American Park instead. Skip this place. They should make patrons aware of these problems before they pay for expensive park admission.\nShow less"], ["Reviewed May 21, 2017", 1.0, "Refund requested but not being responded to...", "We are 2017 annual pass holders of six flags discovery kingdom, 6 for our family. Recently, Six Flags merged with Concord Water world. Before the merge, I prebought 2 annual passes to Waterworld before it opened. Before we can use the tickets, they announced the upgrade of our annual Six Flags pass to include waterworld. I upgraded all 6. I've contacted Waterworld and Six Flags to refund my 2 unused season passes to Waterworld but we have not gotten a response. I don't understand why they wouldn't refund it as we are annual pass holders and have upgraded. Also, the 2 annual passes were unused!\nShow less"], ["Reviewed May 19, 2017", 1.0, "Worst run theme park ever", "Half the rides were closed resulting in 2+ hour waits for all roller coasters. Tons of teenagers cutting lines with no staff control. Flash pass riders bypass everyone else in line meaning if you don't form out 100s of extra dollars to get flash passes you don't get to do rides.\n\nHorribly run park compared to other six flags or Disney parks.\nShow less"], ["Reviewed May 15, 2017", 4.0, "Mothers day weekend", "Soooooooo, took the family here this mothers day weekend at it was a lot of fun. Ive found that if you treat people good, then you get it back. I saw people complain about the service and the security being to strict. We were able to bring food in for our 3 1/2 yr old with no problem. The security was very friendly and were just doing there job. Upon entry they kina of coral you into the center which was kind of weird as the rest of the park didn't open for another 35 minutes. The park was dead until about 1, so we walked on all the rides and got good seats for the animal shows. The park was very clean but defiantly looks in need of a sprucing up. Some areas were closed off til 1 on the back side of the park which didn't make sense, since they did open at 10:30? The joker and medusa were our 2 favorite rides and only 5 minute wait time. They really need to get rid of Kong and boomerang as nobody was ever on them. They are very old and painful rides to ride. Its no Disneyland but it was a very fun time to be had\nShow less"], ["Reviewed May 8, 2017", 2.0, "Disappointing", "Too many attractions were closed. The ones that were opened would close from time to time during the day. It seems like the park ir being managed by teens who are more into playing with the mic to entertain people waiting in line than paying actual attention to the line. A lot of kids cutting the line in every attraction, not talking about the flash pass. We tried telling the employees but they didn't seem to care. Has a burger at JOHNNY ROCKETS that was probably sitting there for the last hour or so.\nWe left early because it wasn't worth it.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Fun day", "We have season passes so decided to go hang out ... it was during spring break so some of the restaurants weren't open we were guessing because of lack of staff .... it was disappointing but it won't keep us from going!!! The new Joker ride is amazing\nShow less"], ["Reviewed April 17, 2017", 3.0, "understaffed, fun rides, 2 hour line + wait to order food", "We attended the park on April 14th & overall had a good time. The rides were fun. There were several rides that were broke down when we attempted to ride them. We had purchased an advanced on-line meal plan at Johnny Rockets. The line to put in the order was atrocious, we had to wait 2 + hours just to put in our order. The manager was standing around doing nothing but picking her teeth.\nShow less"], ["Reviewed April 13, 2017", 4.0, "Family Fun", "This place is great if you can buy the annual pass and make a few visits during the year. I feel like if I just bought a 1day pass I'd feel super disappointed because there really is a lot to see/do here and 1 day isn’t enough. By the time you wait in line for a few rides and food, your day can be gone. Plus, if you upgrade your annual pass you can have free parking at each visit.\n\nWe have a 4 year old son and there are a ton of rides and attractions for kids his age. They have little waterpark-type fountains they can play in on hot days, the dolphin show, other animals to see, a huge playground, train rides, carnival games and amusement park rides. It doesn't have to be all about the big scary roller coasters.\n\nI think my main complaint is the food lines. All of the food lines are so insanely long and SLOW. The last time we went we waited in line for over an hour to get the nachos. They were delicious though, I'll admit. It’s pretty annoying since we spent the money on a food pass…we’re now basically forced to wait in these line to get our money worth out of the pass.\nShow less"], ["Reviewed April 10, 2017", 1.0, "Service is poor at best and the food service is worse slow and cold food!", "We recently bought a season pass and also purchased food package which included lunch snack and dinner we have just started going to the park with our family a couple times and the fist time thought the service and food would improve so we let it go and returned another time and tried again we were met with disappointment again as we tried other food spot within the park and had to wait in long lines which in the real world would have only taken 10 to 15 minutes but that took about 30 to get through about 15 people ahead of us in line which was the Johnny rocket just to get their meal of burger & fries & onion rings which I would have thought would go quick boy was I wrong.\nSo on our final trip I had it as we just wanted to get a meal before the dolphin show which we had 45 minutes until show time and that was not enough time to get lunch so we missed the show again as it took well over an hour to get meals for our family of course their was a line and it moved slow who would have thought getting 25 to 30 people ahead of us would take such a long time after getting to counter and placing my order I found out the problem they didn't know how to use cash register to place order and kept redoing and re asking me what I wanted as it would not take order and one of the other people behind counter finally came to the person from the back which they went over how to work cash register. I would have thought they would train people before the park opened also would think that someone would be looking at wait times for food but that didn't seem to matter.\nMost of the ride lines weren't to long but this was not the busy time yet but with everyone waiting for food I understand that we didn't get to ride many things.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Fun afternoon!", "A friend and I went on a Saturday afternoon and we couldn't have had a better time! It was so much fun and we were able to easily ride everything in one day. It's a great way to spend a sunny day in Vallejo! The Joker and Medusa are the best rides!\nShow less"], ["Reviewed April 9, 2017", 4.0, "Fun day out :)", "Travelled to Six Flags from our hotel in San Francisco. Very easy to get to and only took about 40mins (approximately 26 miles).\nThe park was $64 for adults which was not bad value. Was disappointed by being charged $25 as well to park the car!!\nHowever, they have some great rides, my favourite was Medusa and Superman! The animals and other attractions, especially the butterflies made for a great day out. Definitely worth a visit :)\nShow less"], ["Reviewed April 7, 2017", 5.0, "Great family fun", "Our family had so much fun during our 7 hour visit at Six Flags.\nOur 10 year old found many rides he was tall enough to ride.\nWe all enjoyed the Joker and Medusa roller coasters. The rides were intense!\nGlad I had my camera, to capture pictures of so many beautiful animals around the park.\nI especially enjoyed the butterfly habitat.\nWe were able to toss fish to the sea lions and even pet a stingray.\nWe will be back again.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Great place to play! Wonderful animals.... loved every minute", "We spent 2 days at 6 Flags.... loved the Butterfly bldg. I went with my granddaughter, great grandson and my granddaughter's friend. I am a senior so the hills and steps were a bit challenging. I started walking up the handicapped ramp the second day. We loved the interaction wth the characters. On the second day we went on the behind the scenes walking tour! I highly recommend it! There is an extra cost, but well worth it. We really didn't go on any of the big rides, just some of the smaller ones that my 7 year old great grandsono could handle. We got season passes on sale so we will be back. We live in the South Sam Jose are so it is less than a 2 hour drive. Loved the animals!\nShow less"], ["Reviewed April 2, 2017", 2.0, "Rides Not Manned or Broke", "You would expect all the rides to be open on a Saturday 4/1 to kick off the season but I was disappointed several of the rides were not manned and some of the rides broke down during the 5 hours we were there. It would have been a much better experience of ALL rides were in service. I would probably go back because we got a great deal on tickets and the need to ride Superman. The fact that Superman was broke was a bummer but as we were leaving it was working again.\nShow less"], ["Reviewed April 2, 2017", 4.0, "Fun", "Fun place to spend the day. We especially enjoyed \"Splash\" dolphin show, the tiger show and the bird and small animal show. The regular park is clean and the staff friendly. The eatery situation in the park continues to be a problem with long lines, longer food wait times and filthy eating areas. We couldn't beg a cleaning rag off anyone. After getting several other to complain about the dirty eating area, someone showed up with a wet rag to wipe it down. Don't know if it had bleach on it or not, but oh well. The rides are great for the kids, is old farts not so much. We will come back several times this season.\nShow less"], ["Reviewed April 2, 2017", 2.0, "Very Poor Man's Disneyland", "This only gets 2 stars because of the animals, The dolphin show and trainers were outstanding, Tigers, penguins and stingrays were good exhibits too.\n\nDon't come for the rides, they break down all the time, We went on a hot saturday and naturally the 2 main water rides weren't operational. And staff like to waste time between rides while people wait, talking amongst themselves, doing more security checks than I've seen to land planes.\nAs an example and this is very irritating, we were waiting to go on bumper cars and the staff had to \"get us ready\" by making people in line whoop for excitement and then explain \"rules\" which took literally 3 mins, completely unnecessary for a ride everyone has been on at some point in their life.\nYou get Nickel and Dimed the moment you turn up, $25 parking and then the really cool stuff like Go karts and bungee dives cost extra, I was roped into paying $5 for a balancing game you couldn't win.\nOh and Food, its atrocious and like eating plastic and the waits are longer than rides, you can wait in line for 45 mins, the \"service\" is unbelievably slow and if you're ordering by an animal attraction, they dont give you straws or lids for drinks, really tricky if you have kids in your group.\nAnd sorry to say it but quite a ghetto crowd also, you never say never but I'm not coming back anytime soon.\nShow less"], ["Reviewed March 30, 2017", 4.0, "Fun for All Ages!", "This park is BOTH an amusement park AND a zoo! We saw bears, wolves, lions, so much more! The rides ranged from little train rides (perfect for my two-year-old) to thrill rides that my husband couldn't complain about :) And i loved how they had animal attractions mixed in with food venders and rides! My son and I watched the penguins splash and play while dad ordered food. And best of all -THE DOLPHIN SHOW. Those trainers obviously love what they do, and the dolphins adore them. This was the cherry on the cake -do not miss it!\nShow less"], ["Reviewed March 29, 2017", 1.0, "Closed Fab Waterski Show, closed misbehaving Orca show yes?, so is Butterfly House and Camel Ride still open?", "Lots of rollercoasters in huge parking lot, but not for post-college kid like me. Seems to be dying,,, Overpriced food !! Suggest they do a Major Water Park, like declining Great America in the South Bay."], ["Reviewed March 28, 2017", 5.0, "Better than Expected", "Our family had a great time. The rides were thrilling and lines were small and reasonable. The park was the cleaner than the LA location, staff was friendly and all the rides looked safe and well maintained. We cant wait to return to this park and visit more Six Flags locations.\nShow less"], ["Reviewed March 20, 2017", 5.0, "The family park vist in San Francisco", "I see the sixflags annual pass bought in Mexico and I was a little bit worried since the Mexican annual pass is significantly cheaper than US one.\nBut I can see that six fags annual pass is worth every penny\n\nThe only but i would say is that this park only opens Fri to Sun\nI'm a fan of ride parks and some in California are open the whole week.\n\nThe rides are spectacular and safety is quite good so you feel safe when riding those 360 round roller coaster\n\nPark souvenirs are quite un expensive compared to sixFlags México's prices on souvenirs\n\nThe overall of the park is that is smaller than I was expecting but ok for a day long visit.\nShow less"], ["Reviewed March 19, 2017", 3.0, "Not how I remembered it!", "Very dissapointed. Animals are old, bored, in poor condition :( don't look well fed or taken care of. 75% of rides closed. No good entertainment. Staff is rude!"], ["Reviewed March 17, 2017", 4.0, "Dolphin Swim and Animal Shows were great!", "Our whole family ages 9 to 60 really enjoyed all of the rides and the animal shows. Three of us did the dolphin swim and had a wonderful time. Rest of the family was able to watch and get a private dolphin show! A great value because most places charge more for this than what was charged here. Other places that do this don't provide the wetsuits, towels, and showers, charge more, and don't let you be with the dolphins for as long.\nI would give the park 5 stars except the food lines were terribly long and slow. Waiting for an hour in a food line for lunch is ridiculous!\nShow less"], ["Reviewed March 11, 2017", 4.0, "Great place to enjoy.", "This is an amusement park with lots of rides. We can enjoy the place with kids & teens. It's having lots of eateries too and one can spend the whole day enjoying. We can see few wild animals like Tiger, lion etc. There is a giraffe park where we can feed the giraffe by paying a nominal amount. It's a great experience. The rides are breath taking& gives full entertainment. With family & kids a nice place to spend entire day. But the entry fee needs to be lowered to the middle class . With 2/3 kids in a family entry fee becomes a burden.\nShow less"], ["Reviewed March 8, 2017", 5.0, "GREAT TIME NO RAIN", "had a great time at the park no rain nice weather great rides cant wait to go back trip well worth leaving reno"], ["Reviewed March 7, 2017", 4.0, "Good roller coasters for Teens, plus fun animal shows", "We've enjoyed going to 6 Flags in Vallejo since my son was 5. When he was younger, he enjoyed all the fun rides in the kid part including Thomas the Train, etc. Now as a teen he enjoys all the crazy roller coasters, they have 6 or 7 (Joker, Superman, Kong, Medusa, etc) that are great for teens and brave adults. We still enjoy the tiger show and seeing the walruses, dolphins, etc. Be aware it's a long walk from the parking lot to the park entrance; there is a free shuttle though. Be sure to visit the giraffes, lions, and other animals that are not in a \"Show\".\nShow less"], ["Reviewed February 20, 2017", 2.0, "Animals", "I was disturbed to see the tigers pacing in a small open enclosure with a very loud roller coaster roaring over their heads every minute. They clearly looked agitated and depressed. I would be too if I had to listen to that all day! Not good planning of the park, in my opinion. I will not be going back.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Fun place!", "I love this place and so do the kids. Great value if you buy a season pass and there are some really fun rides. I love that you can buy a food pass and go often for nothing out of pocket."], ["Reviewed February 14, 2017", 5.0, "FUN TIMES", "I love this place. I have Season Tickets and have been there 4 or 5 times in the last few months and can't wait to get back there. The animals are great, the food is great and it's such a stressful park."], ["Reviewed February 12, 2017", 4.0, "Took the Grandkids", "We live in San Joaquin county and this is the closest amusement park. We are new to the area, (from Hawaii) and wanted to do some fun activities with our grandkids, 6 & 7 years old. This probably was stretching the limit for them as far as a day trip goes, but they sure had fun. We enjoyed watching them ride the rides, and we even were able to ride some with them. We all liked the Dolphin \"show\" very much & learning about them. For us, next time we will find another attraction close by and make it a weekend trip.\nShow less"], ["Reviewed February 1, 2017", 5.0, "Great time!!! Super fun!!", "We had a great day at Discovery kingdom!! We did the wildlife discovery tour and it was amazing!! Great staff!!"], ["Reviewed February 1, 2017", 4.0, "Fun for the entire family", "I love to visit the shows and animals in the zoo. Everyone else love the rides. Go early, you can wait a long time for rides."], ["Reviewed January 17, 2017", 4.0, "The kids like it!", "The park is fun with fun and exciting rides. It also has shows aquarium and animal attractions. This is my favorite! Not too big either! Really good for younger aged kids!"], ["Reviewed January 13, 2017", 5.0, "Christmas Eve visit", "Our family visited on Christmas Eve. We were there when the park opened at 11. There were so few people there that we could stay on some of the rides without having to line up again. There were lots of thrill rides and we rode them so many times and without lining up and waiting that our stomachs felt a bit funny. All the park employees were very friendly and the park was very clean and tidy. We also enjoyed seeing the walruses and the shark exhibit. The walk through tunnel was better than the one at Aquarium by the Bay in San Francisco. We bought a season pass which we used twice- once here and the other time in San Antonio. It included free parking.\nShow less"], ["Reviewed January 10, 2017", 4.0, "Awesome", "I wouldn't say the best but it's really good.\nThe \"Medusa\" was a bit too overrated and overhyped but still, it was good.\nIf you're going in weekends, stay ready for super long lines, other than that the place is awesome. All the ride operators were cool and cooperative. They were nice and were making sure we had fun.\nIf you're going for roller coasters and other rides with pictures, make sure to ask where the camera is so you can get super cool pictures...\nShow less"], ["Reviewed January 9, 2017", 5.0, "Great place - amusement park and zoo", "This was a fun place to visit and take the kids. Can be very busy so try off season. What I enjoyed the most is that it did have great amusement park rides plus it had a mini zoo with shows. Get a schedule when you arrive and plan you day accordingly. The rides are fun but it was equally enjoyable to watch the tiger show.\nShow less"], ["Reviewed January 5, 2017", 5.0, "Great Amusement Park", "This park has plenty for little kids to do, they have two areas that are perfect for my four year old daughter. The food is just the normal stuff that you find at these places. It's not a huge place, so you can easily ride everything and see the animals in one day.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Always a must-do for our family", "Compared to other theme parks, DK might feel modestly sized but it is still a super fun stop for Bay Area visitors. We were able to save $15/tkt by purchasing our tickets online while driving there. We often go in Oct or Dec when there are zero lines. The park is super clean, the staff go out of their way to help you and there are enough attractions for everyone in your group. I highly recommend this park!\nShow less"], ["Reviewed January 3, 2017", 5.0, "Something for everyone", "Six Flags is a great place to connect with your kids. From thrill rides to the great animal shows, we had a great time. We now have season passes and plan to make several more trips."], ["Reviewed January 1, 2017", 4.0, "Six Flags Discovery Kingdom", "Good collection of coasters plus a sea life park rolled into one. A good side trip when visiting the Bay Area."], ["Reviewed December 31, 2016", 4.0, "Fun day at Holiday in the Park", "Since we became season pass holders this year we figured we should check out Holiday in the Park. Such a fun day with out teens, riding rides, drinking hot chocolate and making memories;"], ["Reviewed December 28, 2016", 2.0, "Trip with 3 kids 3 adults - Won't go again.", "Expensive; grandparents didn't ride anything and had to pay same price. Food very expensive. Parking excellent, bus ride into park excellent. Employees very nice. Confusing lines to get into park. Not well marked. Park also not well marked, map confusing. It was Dec 27th and the holiday lights etc still going, that was very beautiful and dancers/singers entertaining. Not packed the day we were there so ride lines not too bad but had Flash Passes for kids. They enjoyed the thrill rides. It was very cold that day and only a couple places sold hot coffee, tea, cocoa. While every path was wheelchair accessible some were straight up or down, not so friendly :(\nShow less"], ["Reviewed December 24, 2016", 5.0, "Fabulous Christmas Eve Visit", "We visited Discovery Kingdom today for Holiday in the Park. I figured Saturday, Christmas Eve, there would be a lot of families there. I was wrong!\n\nIt was not busy at all. We arrived at 12 (park opened at 11). Rode Medusa 2x, Kong, Superman, Joker and V2 all with no wait. Done with headliners and a pretzel by around 2.\n\nAll the key rides were working. The new arctic adventure movie / ride replacing Pacific Rim was great fun! We watched 3 times in a row. It is more like a ride than a movie. Tanner, the employee handing out 3d glasses and collecting them at the end, was friendly and professional all 6 times we interacted with him.\n\nWhich leads me to another point. The employees were all very friendly and overtly helpful. They were also much more devoted to safety than I have seen at a six flags park before. My youngest daughter was measured for every ride where her height was close, and our restraints were tightened and checked thoroughly on every ride. In previous visits I have seen employees just tap the restraints rather than really check them.\n\nReally, the helpfulness of the employees was good disneyland quality. I was wowed.\n\nWe are thinking of going back for new years eve. Maybe it will be light again!\nShow less"], ["Reviewed December 20, 2016", 4.0, "First time season pass holder!", "We purchased season passes for the first time. I wish California had more than 2 Six Flags parks. Discovery Kingdom is our closest and very small. It is nice because we are not exhausted from walking, but small usually means crowded. We love the option to walk the waterfront, see the animals and have some breathing room. The rides are great. Joker is the newest and now one of my favorites. Medusa felt rough for the first time and I think she is showing her age. Or maybe it is my age showing?? Dare Devil is controlled by a human and was waaayyyy too long. Our shoulders really hurt and I don't think we will ride it again. This trip was a quick one and we did everything we wanted.\nShow less"], ["Reviewed December 20, 2016", 5.0, "Getaway weekend", "It was my first time here and I loved it!!! I was amazed of all the different things you can find here! Can't wait to go back!! #fromLAtothebay"], ["Reviewed December 9, 2016", 4.0, "Fun Family Day", "We visited with our kids and about family. Arrive there early and try to get close parking.. we arrived early and still had to walk a ways. Once inside it was overload of stuff to do. I have been to many parks and this one the way its set up was confusing to me lol. Over all a good day though. Kids loved it. Glad I took a light coat for the evening as it cooled down.\nShow less"], ["Reviewed December 7, 2016", 5.0, "My awesome birthday present", "I been telling my wife I want to go to Six Flags...so for my birthday she took me... it was a blast we rode almost all the rides I wanted to go on except I think the Joker it was broke down... Actually the food was good, a little high just like every else these days...miss the boat show gotta say, but love the rides...\nShow less"], ["Reviewed November 30, 2016", 1.0, "It's located in Vallejo. What more can I say?", "Every time I've been here, I'm amazed at the number of teens smoking dope in plain sight, broad daylight. My Vallejo PD friends say I have no business taking my family there, as it's crime-ridden."], ["Reviewed November 27, 2016", 4.0, "Good park, but food quality and parking is poor", "This park is much smaller than Magic Mountain, but it does have nice animal exhibits and shows. The food unfortunately is not good. Many of the food vendors are out of ingredients so they offer substitute ingredients such as rice in place of beans. The food is also usually under cooked, almost raw. The parking is awkward, with people crossing roads where cars and buses cross simultaneously. They should relocate the parking ticket gates for cars to the opposite of the parking area so cars and buses don't cross areas for pedestrians. An accident in the parking area is bound to happen the way its structured now.\nShow less"], ["Reviewed November 23, 2016", 5.0, "Fun!", "We live going to Discovery Kingdom.. The best way to plan a trip is to go at opening of the park and also to buy a season pass if you live in the area.. Totally worth it!"], ["Reviewed November 20, 2016", 3.0, "Six Flags Discovery Kingdom", "For this being the second week of the parks opening season there were quite a few rides that were closed or in the process of being repaired. These rides should of been repaired before the season started. This park should be attended by families with children as they mostly cater to them. They do have adult rides but it is more of a family park. The cost is high but that is expected with any amusement park.\nShow less"], ["Reviewed November 15, 2016", 4.0, "Still call it marine world", "Variety of packages geared towards season pass holders. Drink and food packages. Lots of Pokemon hunting"], ["Reviewed November 15, 2016", 5.0, "Very Interesting", "My wife and I took our 2 year old grandson and were joined by her sister and also 2 year old. Wow, did we have a blast. The live animals weren't only fantastic to the kids but also to us adults. There are guides stationed at each attraction to answer questions (ie I didn't know tigers were territorial). The young ones seemed scared of the rides until we took them on them but after they they were clapping they're hands and laughing. The food is decent but theme park priced. The best moment was when my sister in law and I got to jump on the Joker roller coaster. At first only being strapped in by your ankles and a waist bar didn't seem so bad. Then the first crazy magnificent drop and 4 or 5 cork screws later you know you messed up by choosing this crazy, scare you to the bones ride. Your upper body and hands have nothing to hold on to. Ride if you dare.\nShow less"], ["Reviewed November 9, 2016", 5.0, "Dolphin Discovery is incredible!", "We went to the Dolphin Discovery at Six Flags and it was a thrill of a lifetime. The Education Instructor Chelsea was so engaging and personable as was Austin the Dolphin Trainer, both made the whole experience so much more special. Skip the wine tasting in Napa and treat yourself to an experience that you will NOT forget!\nStill smiling just thinking about it a week later! Get the souvenir photos also! You get I free per person and then we bought 3 more for only $21. Do it, you won't regret it.\nShow less"], ["Reviewed November 6, 2016", 5.0, "Fun and not crowded", "We visited the park on a Sunday and arrived as it opened. We had no wait times for any rides and hit all of the coasters twice in a row, just for starters. We walked right on to Medusa, V2, Superman, Joker and more!\n\nAs the day went on, we saw the penguins, sea lions, walrus, dolphins, rays, took in the tiger show, had some pretty decent (but spendy) lunch, and then re-rode more coasters. After more than four hours in the park, we decided to ride the new virtual reality experience on Kong, that was about a 30 minute wait but well worth it. We even jumped back on three of the big coasters and the only slight wait by late in the afternoon was the new Joker.\n\nJoker is the re-done Roar roller coaster... WOW, what a difference!! It went from being a jarring ho-hum wood coaster to one of the top two thrill coasters in the park!\n\nSo much to see and do at Six Flags, my family LOVES IT!\nShow less"], ["Reviewed October 30, 2016", 4.0, "Overcrowded theme park!", "Maybe it was Halloween weekend but still the lines were so long and parking lots full. Many unsatisfactory remarks were heard from customers there who expected to see a themed fest but were unaware that the cost was additional. The general feeling was that it was over priced. I needed a good coffee shop but didn't find one. There should be an area for adults to relax too because the drive is long and park is loud! There should be more restroom options too throughout the park.\nShow less"], ["Reviewed October 30, 2016", 2.0, "Very disorganized & over priced!", "We bought season passes a few weeks ago as we like to go to Magic Mountain & Fright Fest and always have a blast. We decided to use our passes to go to Discovery Kingdom & try their Fright Fest since it's closer to home & we have the season passes. We were very disappointed in the lack of organization & signage showing where the haunted houses were, where the lines started, etc. Their website was confusing & didnt state the hours of the Fright Fest & buying the wristbands was just as confusing at the park, no signs showing where to buy them. We paid $20 for the mazes at Magic Mountain which was way worth the money, it cost $30 for the mazes at Discovery Kingdom which was NOT worth the minimal mazes & the lack of scare zones & characters compared to what Magic Mountain had to offer. They definitely need to hire more actors for haunted houses which were very bare. They also need a separate REFILL line for people with season sports cups to get their refills without having to wait for others getting food. Very disappointed with the whole experience & will definitely be driving the extra few hours to enjoy Magic Mountain next time.\nShow less"], ["Reviewed October 30, 2016", 5.0, "Kind a great food very rare in today's amusement park world", "We where on vacation and happen to be in the San Fran area . She have season tickets and travel the u.s to many theam park 6 to 8 a year . And discovery kingdom knocked my socks off . Employees acted like they cared park was clean . And did I say the employees cared. They stopped us to ask if we needed anything . They don't do that any where else most try to avoid you and not make eye contact. And the food well same every where just ok except here they let an outside vendor in to sell tacos and nachos and omg they where the best and priced right other parks could take a lot off lessons from here . GREAT JOB EMPLOYEES AND MANAGMENT . Value was right on here and the animal shows and animal interaction was off the chart . Better than sea world and Busch gardens\nShow less"], ["Reviewed October 25, 2016", 3.0, "Go see a movie.", "very disorganized, waited in line 2 hours to get food. It seems as if they want to operate without many employees. The ones that were working didn't know anything nor care to."], ["Reviewed October 24, 2016", 5.0, "Great place for kids!", "We brought our kids (6 and 3) this summer, and honestly weren't expecting too much from the park. Let me just say how wrong we were - this place is fantastic! There are so many rides that my kids can do by themselves, and the lines are generally very short. The staff is super friendly and helpful, and the animal attractions are icing on the cake. I highly recommend this as a destination for families with young children!\nShow less"], ["Reviewed October 16, 2016", 5.0, "Get the passes online!", "We get our passes online and save by getting food pass as well so we have it all taken care of for many trips to ride the roller coasters and learn about conservation and wild animals. The park is safe, clean and up to date"], ["Reviewed October 14, 2016", 2.0, "Expensive Food, Long Lines", "I visited the park on the first day of Fright Fest and Deaf Awareness Day, It was unusually hot for the day, making the long lines for food a bit unbearable. The park management did not have the Discover Card Members entrance open, and when I requested the line to be open to security staff, a very rude person stated it would not be opened. I then asked for Management and in about 10 minutes the gate was opened, but Management never arrived.\n\nThe park had several food places closed due to it being close to end of the season, which made the lines at the remaining places long. Our season pass had the Dining option included on it, and we did get the Lunch and snack options as well as our drink, but took a total of 2 hours just for those two lines.\nShow less"], ["Reviewed October 14, 2016", 5.0, "great time with family", "nice people that work there. all of the family loved going on the rides and haunted houses. food and drink is pricey but that is to be expected."], ["Reviewed October 13, 2016", 1.0, "Terrible. Will Never go there again and I will warn everyone I know", "So we went there for the first time very exited to see everything including the animal attractions and what they had to offer. With only being there a couple of hours by 4 pm (had to go on some rides with the little ones first) almost all of their animal attractions were closed. Some of the bigger rides too. the animal attractions that were open (three that i could remember) you couldnt even see inside because of how scratched and dirty the windows were. the sea lions were very aggressive and I learned that it might have something to do with people being able to buy fish to feed them so they have obviously related food with the people who come to watch them. On one of the kids rides the man acted as if the ride was broken which would have been funny if he didn't act upon it for 5 min. and even pretended to call for help scaring the parents and children. All of the employees were very immature and unprofessional. My first encounter asking for a refund to this mess they call an attraction the girl told me I could get a refund and send me to the booth for guest relations. waited in line for 20 minutes only to be told the don't do refunds and that I couldn't talk to a manager \"because he was busy.\" gave me corporates number and told me they could help me. When I called I had to leave a voice mail and than I would get a call back from a vallejo number which I missed. they didn't leave a voice mail and when I would call back it was the general line with no way of knowing who called me or how to follow up. I did this 3 TIMES only to get no where. finally I made a complaint on the website again, got an email response but no name or number attached to it I only know it came from guest relations email, they offer me complimentary tickets I could pick up in the booth but I didn't want that and asked for a refund again was told I could do refunds when I was told corporate could give me a refund all this person did was give me corporates number, I expressed that I wanted a name of whoever I was emailing and I contact for a manager which they never responded to.So back to square one I called corporate again and got the receptionist Ruth she was very helpful send an email explaining the situation to whoever is in charge of that and told me to live a voice-mail when she transfers me but again NO RESPONSE FROM ANYONE. they are obviously a money hungry corporation who don't care about there customers. Stay Away!\nShow less"], ["Reviewed October 7, 2016", 1.0, "Terrible! Zero courtesy and problem resolution!", "First time visitors here from BC, Canada and bought seasons passes at the gate only to learn that my husband was too big in the chest area for the safety mechanisms to close properly on the roller coasters. After only 1.5 hrs of embarrassment and wasted time looking for a ride that he could go on we decided to give up and get a refund. Yeah right!!!! We were basically told there was nothing they could do to help us. $300 US gone just like that and they could care less!\nShow less"], ["Reviewed October 2, 2016", 2.0, "Not a good Six Flags . . . AT ALL.", "I have a pass for Six Flags Magic Mountain in LA county, but live closer to this one in Valejo, CA. This is not a good six flags experience. One should take Bart or the Ferry and then shuttle to the park, because when you drive, after the bridges and parking fees it just becomes a VERY expensive trip. Way too expensive for what awaits you. There's not many good thrill rides. The Pacific Rim 5-D attraction has got to be the WORST attraction on the planet. Why are my seats rocking? There's no coordination with what is happening on the screen. Why is it so loud? What IS happening on the screen. Why did a spurt of water just hit me in face? I think it's pouring rain on the screen, but I really can't tell, so what was with that drop of water in the face? Even though my season pass is also good for this park, it's not a good enough park for me to ever return too, even if my pass gets me in.\nShow less"], ["Reviewed September 30, 2016", 1.0, "Not worth your $$$", "I bought tickets for my birthday specific day tickets. Priced at full price a month prior to my visit. Upon arriving we found the park closed!! There was no notice during purchase or at any time after about the shorten hours and closed exhibits. It opened at 4pm with no animal exhibits available and more than half the coasters closed for repair and so forth. It was my\nBirthday. I know I shouldn't be complaining at my age but for over 70$ per person this wasn't worth any of our time. I feel so screwed over. All I wanted was a giraffe to feed\nShow less"], ["Reviewed September 30, 2016", 3.0, "Two Words: The Joker", "This was my first time visiting Six Flags Discovery Kingdom. OK OK so I visited once before when it was called Six Flags Marine World. That was about a dozen years ago. I honestly don't remember everything about that trip (like did I even ride Roar?), but I do remember the crowd was pretty light and that was also at the same time of year during Fright Fest.\n\nSince my last visit, the park has made some excellent additions and the crowds sure seem to have swelled. Just pulling off the I-80 there was already a line of cars. We probably should have arrived earlier, but I underestimated the drive from Sunnyvale and the size of the crowd on this warm Saturday in September.\n\nBy the way, $25 for parking? Good thing we have gold season passes. It's a little weird that I was able to get our 2017 gold passes from SFDK's web site for only $50 (gold includes parking). Something about that ratio seems off. Granted I purchased during their flash sale.\n\nPro tip: The price you pay for season passes depends on your initial SF park. That's the park you have to visit first to process your pass. Since we already had this trip planned, we saved $22 per pass by renewing through SFDK instead of SFMM (gold passes are valid at all parks).\n\nI was tempted to splurge for the Flash Pass but it just didn't make sense for the rides I truly cared about. The catalyst for our trip was The Joker and to a lesser extent Superman Ultimate Flight. As the Flash Pass attendant explained (and this seems to conflict with their web site), the gold/platinum pass gets you a one-time use at Joker whereas SUF requires platinum and it's also one-time use. I didn't want to pay $90 for essentially two rides.\n\nAnyway, despite a fairly crowded day, we had a pretty good time highlighted by Joker and Superman. Sure I would have liked a lighter crowd in order to ride Joker more than once. But that's what happens when you practically give away your season passes. OK on to the rides.\n\nMedusa - This was the star attraction on my 2002-ish visit. It's still a fun ride and my favorite of the two floorless roller coasters in California. I love the straight drop. We were assigned to the second row but luckily ended up in the first row.\n\nSkyScreamer - As a coaster nut, I tend to ignore the flat rides, but we rode this since I've never been on a Star Flyer before. It was fun. Definitely worth it if the wait is decent.\n\nDare Devil Chaos Coaster - Not really my cup of tea and we both walked away with a bit of nausea. I mostly rode it because, although these Larson Fire Ball rides are a long time staple at carnivals across the country, I don't think I've actually ever been on one. We found it interesting to watch the ride operator since she actually manually controls the ride for the most part.\n\nDolphin Harbor - We grabbed a couple of frozen strawberry cups and caught the dolphin show that happened to be starting soon. It was a nice way to take a break in the shade and let the nausea dissipate.\n\nPacific Rim 5D - This just happened to be near the Dolphin Harbor rear exit. Wow was this terrible. In stark contrast to Mass Effect New Earth at California's Great America, the picture quality was horrible. They basically took a battle scene from the movie and shoved it into a 4D type of experience. I'm glad it was only showing in 2D when we went.\n\nThe Joker - Like I said, this was the reason for the visit and it did not disappoint. We lucked out and were assigned to the front row of the last car. From the top of the lift to the brake run, Joker is all kinds of awesome with airtime galore. It's only my second Rocky Mountain Construction creation and it reaffirms the fact that I must travel to ride them all. Do yourself a favor and seek out your closest RMC stat. The Joker alone is reason enough for me to come back here one day.\n\nSuperman Ultimate Flight - This was my first time (finally) checking out a Sky Rocket II. It's a fun coaster and as a fan of Premier Rides, it was a great way to end our day at the park.\nShow less"], ["Reviewed September 29, 2016", 5.0, "Great fun", "The thrill rides are awesome, this is the first time I visited and really loved it. I would recommend this to those who are looking for safe and enjoyable thrill rides."], ["Reviewed September 28, 2016", 4.0, "Fun for locals, tourists could skip it", "Bottom line: Lots of fun for Bay Area families, but time would be better spent elsewhere if you are visiting from out of town.\n\nFor tourists: Magic Mountain outside of LA is a much more substantial coaster and thrill ride park. Universal Studios in LA and, of course, Disneyland are the other two California amusement parks that are truly outstanding tourist destinations.\n\nFor teens: There are basically six coaster rides, all six of these rides are great.\n\nFor families: Kids love the animal shows and there are lots of rides appropriate for 5-13 year old kids.\n\nGeneral qualify: We found the staff very friendly and helpful. The park and the restrooms were very clean and well maintained. It was easy to get into and out of the parking lot. It's always better when attending a theme park to arrive at the parking entrance 60-90 minutes prior to the announced park opening time. Food lines are long and food is of a quality and price you would expect at an amusements park (high fat/high price).\n\nTip: Before buying a pass that allows skipping the lines, try arriving early and see if you can ride the six coasters before the crowds swell and the lines get longer. You may be able to ride the major rides without a substantial wait or a line skipping pass that costs extra.\nShow less"], ["Reviewed September 27, 2016", 4.0, "Great Animal Shows", "We have had season passes for several years. We enjoy all of the animal shows and the go carts. One year we went sledding in the winter which was great fun. Lines can be long for short rides, but when its not busy we enjoy the rides.\nShow less"], ["Reviewed September 25, 2016", 2.0, "Poorly Run", "This is easily the worst Six Flags I have been to. The park was run down, employees disinterested and less than helpful, short staffed, parking is a mess, and overall disorganized. We happened to be there while five different, large events were taking place. More than half the restaurants and snack stands were closed because, \"too many people called in sick.\" It was over 90° out, and the lines to get a refill were 30-45 minute wait, minimum. When trying to get help from employees, they would literally roll their eyes like you were inconveniencing them.\n\nThe positives, and reasons for two stars instead of one: the dolphin show was fantastic (only one was running, so it filled up pretty quickly), the newer rides are so much fun (just don't bother asking how long the wait is. Every employee we asked answered with, \"I dunno.\"), If you wait in line long enough, the sports bar has good food and one employee who understands being nice is a good thing (Latesha I think). The app is user friendly and handy to have, download before you go. It does not show park capacity, so you can be waiting in long lines without a heads up.\n\nOverall, I would recommend skipping out on this park and heading down south to Magic Mountain. We will give it another shot before our season passes expire. I hope it was just a poor oversight on the management team's part for such awful service!\nShow less"], ["Reviewed September 25, 2016", 4.0, "Birthday celebration", "There is a lot to do and see. The parking lot could be more organized to move in and out faster. Give yourself extra time . Plus there is a security line that takes forever!\nThe rides were great. Lines moved at a good pace. Just be prepared to stand in line, exposed to the sun .\nWe came knowing about the Fright Fest Halloween extras. But the cost to go in the haunted house was way to much. Then there are all the extra attractions that cost individually. Like the human swing and the Elephant rides. All the carnival prize winning games cost extra too! So come with a large bank account!\nOur dinner for four cost $100! It was good food, but the lines were long. It took over an hour to get our dinner.\nIt's a fun place to come if you have patience , lots of time and money.\nWe are now season passes holders with a good internet upgrade.\nIf we come here again we will understand how it works and probably enjoy it more.\nWhat the heck, it's just money!\nKids had a good time!\nShow less"], ["Reviewed September 25, 2016", 4.0, "Great ride selection, especially for coaster fans! Queues bad though...", "Visited here weekend in September 2016 and had an overall great day! The good stuff first...\n\nThe rides (if you are a coaster junkie like me!) are excellent. From classics like Superman, through the short but excellent V2, and the simply stunning new Joker ride. The park is pretty compact and we easily got around all the \"big\" coasters in the morning without any real queues to speak of.\n\nHowever we then got caught up in a painfully slow queue waiting for the White Water Safari. It was excruciating to watch boat after boat (each of which takes 12 people) being sent off with 2, 3 or 4 people. The teenagers in charge simply could not fathom that you need to group people together to get as close to 12 in each boat as possible. The queue which took 45 minutes could have seriously taken 10 or 15 if they just managed loading better.\n\nAfter that sadly the park had gotten busier and there are no displays or indicators of queue times which is highly frustrating as a customer. Disney/Universal have long learned to do this better, and Six Flags needs to modernize. Even our tiny theme parks in the UK have electronic queue time boards!\n\nSo after lunch we didn't get to ride much more - after an hour queuing in the sun for a second Superman ride we gave up!\n\nWe did go round some of the animal exhibits. While they were all decent in general terms (and the dolphin show was one of the best I've seen) I now have a moral objection to these kinds of exhibits. It simply isn't fair to the animals unless they are rescue animals which can't be released back into the wild. Without any obvious way to verify this I felt uneasy in these exhibits.\n\nI also felt the multi-layered \"flash pass\" offerings are capitalism taken much too far. Regular (which is just a reservation system), Gold and Platinum are available with Platinum an incredible $110 per person. I truly believe reservations should be free - parks make more money while you \"virtually\" queue in the park itself, it simply doesn't make sense to charge for this level.\n\nSo overall a good day out, however I'd hate to visit when it's actually high season, the poor queue management would mean you'd have to invest as a minimum in the $65 Gold flash pass, which starts to get expensive quickly...\n\nOh and ditch those animal exhibits, unless they truly are rescue animals (in which case make this clear so customers who care about animal welfare can visit the park without feeling morally dubious!).\nShow less"], ["Reviewed September 25, 2016", 4.0, "Season pass… Buyer Beware", "We bought a great deal on season passes on Labor Day weekend 2016. $52 (approximately) for 2017 season pass, plus season pass for the rest of 2016, which includes their Fright Fest admission and Holiday Lights extravaganza. Also free parking every visit.\nBut buyer beware, the Fright Fest has separate entree fees for the haunted attractions. $30 to $45, depending on whether you want VIP or not. This would have been $120 for the four of us, and our fourth party was a six year old. These attractions are not recommended for children under 12, so it probably would have been a waste of money so we did not partake in the haunted attractions. But there are plenty of zombies and other scary displays that are among the general admission areas.\nThe extra entree fees aren't bad if one buys the season pass, because if you plan to go several times a year, you will save from the season pass. But when you buy the season pass, they don't mention that the haunted attractions are separate.\nAlso, food and beverage is pricey. $4.49 for a regular soda, both in the restaurants and at the vending machines. So the Dining plans may not be a bad choice. But you are also limited to the times you can eat lunch, and also dinner.\nOverall the gold season pass is fantastic.\nShow less"], ["Reviewed September 24, 2016", 5.0, "Fun for Everyone", "I recently visited this park and was pleasantly surprised by the amount of rides and activities. There are thrill rides that the adventurers will be sure to love, especially The Joker! There are also small rides for little ones and also carnival type rides and games as well. For all ages there are several animal exhibits and shows that are a lot of fun.\nShow less"], ["Reviewed September 23, 2016", 5.0, "Is a great place to go. Combination of Zoo and attraction park", "Nice place to visit. They have several animal shows to enjoy and the rides are awesome. I loved the Guason and the Medusa."], ["Reviewed September 14, 2016", 5.0, "Great Family Fun", "My son is at Travis AFB. We visited and all went to six flags. My granddaughter loved it. I've been to Six Flags in Missouri and Texas. This Six Flags had several unique things that made it very much worth the trip. I was afraid I would see 'same old, same old'... but we didn't. We all had a great time and ended up purchasing season tickets.\nShow less"], ["Reviewed September 11, 2016", 4.0, "Overall an awesome weekend", "Personally, everything was reasonable. Bought a gold season pass with a dining pass add on and after spending the first day sorting it out, our weekend went by very smoothly. Lines were reasonable, only complaint was the slow food service. Everything else was great.\n*the joker is by far my new favorite ride, it's awesome!*\nShow less"], ["Reviewed September 8, 2016", 4.0, "Nice park!", "We enjoyed our visit to Six Flags very much! The staff was pleasant and accommodating to our mobility needs. We paid the extra for preferred parking which was so worth it! So glad for the tram from the parking lot to the front gate. The ride lines were quite long but as to be expected on a holiday weekend. Wish there were additional trams running at the closing of the park because the wait was quite long for that also. Overall was a nice visit and enjoyed the animal encounters very much!\nShow less"], ["Reviewed September 7, 2016", 3.0, "Lines lines everywhere.", "We spent most of our day in line. Everything from parking, waiting on the shuttle, entrance, customer service, season ticket purchase, shows, drinks, food and of course rides."], ["Reviewed September 7, 2016", 4.0, "Really fun day", "Everything aligned this past Laboratory Day weekend and we got an upgraded gold pass with free parking and bring a guest for free. While the check in wasn't that smooth, the shuttle did come quickly and there were very few people for the majority of the day.\n\nThe overall running of the lines was so disorganized and barely functional, many ridestudents went out with half a dozen empty seats, which kept the wait times high for no reason. When the park closes at an unfathomablyou early 6PM over a holiday weekend, every minute counts! Almost every ride had technical issues and shut downs for maintenance, but the ones we did manage to ride were fun.\n\nVery few of the thrill rides had the pictures to buy after, which was a letdown, but the gift shop had plenty of trinkets and souvenirs at a decent price with coupons and sales. It was my first time to Magic Mountain and I'm really glad we made it. Make sure to go on a quiet day so you can maximize your time.\nShow less"], ["Reviewed September 7, 2016", 5.0, "S U P E R B ...", "(If you're visiting from the UK - think of Alton Towers, Thorpe Park, Lego Land, Light Water Valley, even Blackpool Pleasure Beach and BIN all that you know. 6 Flags is a totally different level. First of all...its clean. Scores of people at all times are tidying up. It's well organised - staff talk to you and explain if there is a delay. Queues are managed and staff inject humour on most rides, and the rides..WoW. The rides are amazing. We called on the Saturday prior to Labour day, and it still wasn't anywhere near as busy as any of the UK (or French) parks. It does get busier later on around 15:00/16:00 but still not unbearable. Most queue times were between 5 - 30 mins. The water type attractions are busier.\nGo on the BIG coasters early. Waiting time for the Joker was inly 15 minutes.\nNo food or drinks allowed inside and bag check ARE carried out. Fast food can be bought inside and it is a little pricey $4 for churros and pretzels. Various drink options available + water fountains.\nCar parking (are you sat down?) is $25 and a brisk 10 min walk (free bus available).\nPark opened til 20:00 (from 10:30) near end of season.\nAnimal shows (dolphins) and viewing (penguins/sea lions) towards the rear of the park. Dolphin show was (short) good.\nDefinitely recommend.\nP's Halloween decorations were up.\nFor those familiar with Disney - the main difference is that there are no covered/dark coasters/rides. They even had various characters to meet (Warner Bros).\nShow less"], ["Reviewed September 6, 2016", 4.0, "Family Outing", "Overall we had fun just a few events that if allowed could have ruined it. After the initial line of scanning we entered an opening with seeing a ticket line being that we purchased our tickets online we assumed we needed to pickup our tickets there after waiting in that line we were directed to another line that we had to wait in, just to meet a robotic agent that offered no assistance but just kept saying the same thing over and over again. Why pay him just buy a machine. Finally \" I \" ask to speak with someone who was able to assist us, but still had to wait in the line again. Wow, just for the hard copy ticket......They need better directions and or more agents directing the lines.\nShow less"], ["Reviewed September 5, 2016", 4.0, "fun place.", "A fun place to bring the family, lots of rides and shows for all ages. My kids espacialy like the dolphin and the loony toon shows."], ["Reviewed September 3, 2016", 3.0, "It was just OK", "A long walk from the $25 parking lot. 1 of the roller coasters not working. Expensive lunch menu and minimal staff at concessions which equates to very long lines and a long wait. The park is clean and the staff is fun and friendly. The park can be done in 4-5 hours.\nShow less"], ["Reviewed September 2, 2016", 2.0, "Not impressed", "We have had season passes for two years now and the only reason we kept them for a second year is because they cut the price in half to keep us. Even then, it was a waste of money. The lines are always long, the rides are often down because of maintenance issues (we have had a number of them go down while standing in line), the staff is usually rude, the food is over priced and just getting around feels like grand central station. We are cancelling the season passes this week. Wish I had something good to say, but I don't.\nShow less"], ["Reviewed August 29, 2016", 5.0, "Super Fun", "Brought my grandkis and god sons here and it was the greatest adventure for them. Cya again!!! Great place for us to connect with local family"], ["Reviewed August 27, 2016", 2.0, "Not impressed", "When you read all the ads for food you would think its a restaurant with a theme park in it, wrong! There are some places that sell food it's expensive as hell and lines for food are longer then rides for rides. The animal attractions are lame! Let the poor suckers go please! If your into rides rollercoaster that's a different story they have like 3 that are worth something. Kick it up a notch six flags, right now you suck!\nShow less"], ["Reviewed August 26, 2016", 4.0, "Kids Fun / Adults not so much", "Let's start with the parking. Nightmare. If don't want to wait for a tram, the walk is long. and add that to the inside the park walking and you will be worn out.\n\nThis is for kids - teenage through physically fit 50's. Some of these rides could get a confession out of any prisoner, they are torture, beat you up and slam you down. For the kids, yeah, not so much for others.\n\nThe specialty shows were interesting and a good time to take a load of the feet.\n\nAs with many parks, it is expensive so save up some bucks.\nShow less"], ["Reviewed August 24, 2016", 1.0, "Not great", "Disappointed in this park. I felt bad for the animals in small spaces. The seals were overcrowded in not much more than a backyard pool. The Penguins were overcrowded in a small area. The elephants looked tired having people riding on their backs for 15 bucks each. That is cruel. A couple of big roller coasters, but the day we went on a Sunday, half the kids rides were closed which after overpaying to get in and to park, the day's lasted only 4 hours and we felt literally robbed. 40 dollar pizza?? Come on...\nShow less"], ["Reviewed August 22, 2016", 5.0, "Awesome!", "The whole family loved this place!It is a place for all ages.Kids rides and adult rides.The water rides were the families favorite.There was very short lines.The animal part was like a sea world in my opinion.They had penguins,sea lion show,dolphin shows ,lion,tons of stuff to see and do.Lots of food choices like mexican ,pizza,barbeque..The price was very reasonable.Hope to come back in the future..\nShow less"], ["Reviewed August 22, 2016", 2.0, "Drugs in open public!", "Went to Six Flags the past Saturday with whole family incl. little kids. Our last visit was several years prior and things have visibly changed. After parking our car at the parking lot we walked the mile or so to the park entrance. We observed several people doing drugs in broad daylight at 12:30 PM in their car right in the parking lot, ranging from a crack pipe to a big fat joint. I heard the City of Vallejo went bankrupt several years ago and obviously does not have a police force. Judging from what happens in the parking lot without any control I wouldn't want to dig any deeper. One thing is sure: Do I want to expose my kids to any of this? No way! Do I want to be exposed to this and pay for being exposed to it? Hell no! Solution: Stay way until this is a family friendly place.... again!\nShow less"], ["Reviewed August 22, 2016", 4.0, "Super Fun Daddy Daughter Date", "We haven't been to this Six Flags park before, decided it was worth a try for a Daddy-Daughter date to try out these roller coasters... my daughter just turned 14 and is getting brave enough to want to ride on them now. Had a great day with perfect weather and we went on a Thursday and the crowds were just right. The longest we waited in line was about 20-25 minutes is all. The Superman ride was a new favorite... it is great! The newest Joker Roller Coaster is quite fun as well, as is V2 and Medusa. We also enjoyed many of the animal shows (Penguins, Dolphins, Seals) and the Shark exhibit was OK to see that huge aquarium. They have a large kids area that looked fun as well, but we were pretty much there for the roller coasters and we rods them 2-3 times each. The park is pretty well maintained and the employees seem to work hard to get you to have a great time so we really enjoyed this park and the fun roller coasters.\nShow less"], ["Reviewed August 22, 2016", 4.0, "Great Six Flags Experience!!", "We loved Six Flags Discovery Kingdom! We went on a Thursday and there were virtually no lines, we rode many twice and one three or four times! The only thing is that we were looking forward to the Joker, which had mechanical difficulties for most of the day, we did not get to ride it until the very end of the day when it opened back up. Nice to take a break from the rides and see the animals as well! Expert tip: park across the street at the fairgrounds if there is an event going on...their parking fee is cheaper and closer than most of Six Flags parking!\nShow less"], ["Reviewed August 21, 2016", 2.0, "Not what it used to be", "Every ride stop working we spend more time waiting on maintenance than actually riding shows aren't as they used to be. Probably won't return kids didn't really like it. Needs a lot of improvement."], ["Reviewed August 21, 2016", 5.0, "Fun, Fun, Fun", "This place is so fun. There is always something to do or see. You can't see it all in one day so the Season Pass and Dining Pass are the way to go and well worth it. I am in my 50's and still had a great time with 2 little ones. We will be back soon.\nShow less"], ["Reviewed August 20, 2016", 4.0, "Great combination of rides and animal shows", "Lots of great roller coasters. \"Joker\" was my favorite. Medusa was good too. If you're going multiple times in a year, the season pass and the food pass are the way to go. They'll pay for themselves in about 3 visits. Animal shows are a nice break from the rides.\nShow less"], ["Reviewed August 19, 2016", 4.0, "Great place for young children", "We are season pass holder and go to the Six Flags in Valencia, CA. We went up to Vallejo to checkout Discovery Kingdom and we all loved it. There were attractions for the entire family. Our favorite was the butterfly house!\n\nThe park does need to work on providing more shade. They have benches outside of the bigger rollercoasters but they are directly under the sun. Make sure you wear sunscreen and wear hats because the sun is intense.\nShow less"], ["Reviewed August 19, 2016", 4.0, "So much fun!", "Always look for deals. Be prepared for lines. There are rides that you have to store your backpacks and purses in lockers which cost $1-$2 for 2 hours I believe and $5 for more hours. We were bummed because we were first in line for the new ride the joker and were told it would open soon that they were doing maintenance, waited an hour and then left. Went on all the rides the rest of the day and came back later only to find out that the ride never opened and was closed. The Kong ride was SO uncomfortable. It hurts, jerks you around, we smacked our heads, I do not recommend children going on this even if they reach height. There are a lot of Food choices but be prepared for not the best food at all and waiting in lines for half an hour to an hour. They have so much to offer here. From rides to aquatic animals, dolphin shows and more!\nShow less"], ["Reviewed August 17, 2016", 4.0, "Go on a Thursday", "We couldn't have chosen a better day to come to Six Flags Discovery Kingdom. It was the day after the local schools started, so there were no lines. In the matter of an hour I was able to ride Boomerang, Kong, and Medusa. Earlier, I was also able to ride The Joker. It was one of the most fun rides I have ever been on. What made it even better was that I was able to experience these rides while the family was doing character drawings. I thought I wasn't going to even get to ride a roller-coaster and ended up on 4! If I lived in Vallejo, I would buy an annual pass in a heartbeat. Such a great park. The kids loved the sea lions, giraffes, lions, and elephants as well.\nShow less"], ["Reviewed August 16, 2016", 4.0, "Great time of year to visit", "We missed the summer crowds by visiting yesterday. Park hours were shorter(11-6) and there were a few rides not operating but there was plenty for us to enjoy. We were able to eat before entering and saved $$ on food. A couple of waters and dipping dots made grandchildren happy. We saw the dolphin and tiger shows, some rode the roller coasters, and we paid to ride the elephant and drive the go-carts. All great fun. Loved the butterfly exhibit too. Bought tickets on line and stayed at Courtyard-Marriott directly across the street. Saved the $25 parking fee and were parked closer then the amusement parking lot!! Great day and beautiful weather-cool in morning and shirt sleeve once clouds lifted.\nShow less"], ["Reviewed August 16, 2016", 2.0, "The Joker", "The park itself is great! Don't go to this park if all you want to do is ride the Joker.\nIts broken most of the time.\nDon't go hungry. The food is ok and expensive.\nService and quality of food at Johnny Rockets is not like it is outside the park. Its understaffed, not that good and very expensive.\nShow less"], ["Reviewed August 15, 2016", 5.0, "Six Flags Discovery Kingdom!", "Love this park! Great Rides! Go early because the park does not have late hours and you want to give yourself the best chance to do as much as you can! The Butterfly house is amazing and the element of having animals is a nice break from rides so you are getting 2 for 1.\nShow less"], ["Reviewed August 13, 2016", 5.0, "Great weather and great fun!", "Love the variety from the shows to roller coasters , and live animals, Six Flags Discovery Kingdom is a breath of fresh air! They had great things to do from my 4 year old to my teens. We are definitely going back!"], ["Reviewed August 12, 2016", 1.0, "Amusement park", "Spent a lot of money on tickets. Park opened at 10:30 AM but rides opened at 1PM\nstaff told us they would open at 12:30 so stood in line in the hot sun for an hour with small children.\nWe paid for refillable cups but all the refill stations were closed so stood in long lines for refills.\nSome of the rides were closed\nWould not recommend for small children\nShow less"], ["Reviewed August 12, 2016", 4.0, "Fun times and awesome rides", "We are season pass holders and always enjoy riding the roller coasters and watching the animal shows."], ["Reviewed August 11, 2016", 2.0, "Run down park, rude employees, closed attractions", "We have been going to Six Flags parks around the country for decades, and even had season passes for a few years. This was our worst park experience ever. While they do have a new ride -- the Joker, which was amazing -- many of the attractions were closed down the day we visited, and the hours were very limited (10:30 -- 7:00) which is odd given that it's summer vacation. Each ride seemed to have different rules given what you could and couldn't bring. At Superman, one of our party had to wait and go on the ride later because my son couldn't bring a fanny pack. That has never been a problem in all the years we attended Six Flags. On the joker, the attendant rudely told us that he couldn't even enter the ride with his fanny pack -- and we could have someone else hold it -- yet she allowed other patrons to deposit purses and backpacks into a bin until they got off the ride! We were in line for Medusa and my husband was told he was too big to go on the ride but when the rest of us got to the end of the line there was a sign indicating a row of seats for taller passengers and there were men who were both taller and heavier than my husband on the ride! One hand doesn't seem to know what the other hand is doing which makes for a frustrating experience for customers who have limited hours, long lines and have spent way too much money on admissions and parking and closed attractions.\nShow less"], ["Reviewed August 10, 2016", 5.0, "The Joker is amazing", "This year Six Flags Discovery Kingdom added a new hybrid roller coaster called the Joker. The Joker is a mix of wood and steel and brings a new type of thrill. The Joker is a must-see when visiting this park as well as Superman: Ultimate Escape. These two roller coasters are one of the best in California. I highly recommend going on these two right when the park opens because as the day goes by, the lines will get longer.\nShow less"], ["Reviewed August 10, 2016", 3.0, "Hot but many shady spots", "Was very hot, but there were many shady spots throughout the park. Unfortunately, the lines were extremely long. The main attraction the Joker had a line for 2 hours, so we were unable to enjoy that ride. The Superman ride had a line of over 1 hour, but we were able to enjoy that ride. We had pre purchased sports bottles, but it took 3 attempts at different vendors in order to finally get our bottles.\nShow less"], ["Reviewed August 8, 2016", 1.0, "Avoid!!!!", "OK...so I am having to give this place 1 star because I am being forced to.\n\n1st thing, I bought a Go City Card for San Francisco that said that we would have immediate entrance to all of the attractions listed. The GO CITY CARD claims that. Therefore, THE GO CITY CARD needs to make sure that all of their attractions comply with that rule.\n\nWe got to Six Flags Discovery, had to park for $25 and then had to stand in line for OVER AN HOUR at Guest Services for them to issue the card . We lost a huge portion of time that we could have used in other places in San Francisco that were on the card.\n\nThe people in Guest Services said there was nothing they could do to make it better...they were all like 20 years old. I asked to speak to a manager and again, a 20 something with poor Grammer said \"There wasn't nothing they could do\"\n\nBut that is not true...you can reimburse my parking, give me free food, not charge me $10 for bumper cars in the park. RIDICULOUS. You can act like your overcharged guests actually matter because we will write scathing reviews on social media.\n\nNext, inside the park, things seem old, dingy, in disrepair. The animals (poor things) are swimming in dirty, murky water. The paint in old, peeling. This park has THOUSANDS of people attending. Put some damn paint on the rides.\n\nSix Flags has truly gone down hill since I was a kid. I wanted to take my kids for a fun day and instead I spent precious time in an understaffed line for over an hour,, to go into a crowded park filled with rude employees. A terrible end to my expensive, hard earned trip and vacation.\n\nI will NEVER attend another Six Flags park, nor will I ever buy a GO CITY card again. The Customer Service woman from GO CITY was downright rude and had an attitude because I bought my Go City passes on GROUPON. Um, don't sell your cards on GROUPON and judge me for buying them.\n\nDo yourself a favor and skip this nightmare park and don't ever buy a GO CITY CARD.\n\n.\nShow less"], ["Reviewed August 6, 2016", 3.0, "Decent enough amusement park, needs to get the left and right hands talking to each other though.", "We've been to Discovery Kingdom before. This time the visit was to check out the Dolphin Experience.\n\nIt's unfortunate that these days every single little thing incurs a cost. Parking? Gotta pay. Access to the park? Gotta pay. Stuff in the park? Gotta pay. Group pictures? Gotta pay. Dolphin Experience? Gotta pay. I should have mortgaged the house beforehand.\n\nWe managed to get into the park and make our way to the Dolphin Experience. The event included a classroom style interactive orientation, then participants suit up in wet suits and........walk almost all the way across the park to the dolphin stadium. \"Hmmmm, they made us pay to access the park and come in; couldn't they have placed the orientation room closer to the dolphin stadium?\" If you like getting gawked at and/or feeling like a celebrity (or a martian), this walk in flappy water shoes and a black wet suit will do it.\n\nThe dolphin experience itself involves getting down onto a platform right in the pool area with a trainer, following the trainer's directions as she or he tells you what to do and directs the dolphins to interact with you in different ways. Hand/fin shakes, eskimo kisses, hand pets, and plenty of mischievous signaling the dolphins to knock the contacts out of your eyes with fin-splashed water. You also get to marvel at the dolphin's intelligence and strength as they rocket straight up out of the water a story or so into the air to tap a suspended ball, and other stunts. Finish up by having a dolphin pull you half way around the stadium in the water while you hold it's top fin (forgot the name of it). Park staff take pictures of the experience and you are provided one free one per person with the option to pay for more.\n\nThe woman that did the classroom interactive orientation mentioned somehow to us that we didn't have to buy park admission to come to the Dolphin Experience, we really only needed to pay for that itself. This made us quiet angry because we didn't want to ride rollercoasters that day (3/5ths of our 5 person group literally do not ride rollercoasters) or any of the other park attractions.\n\nWe complained about this to customer service and they issued a very menial partial credit to us after telling us that the woman was wrong (we'd given them her name; I hope she still has a job as they didn't seem very happy about what she'd said).\n\nMy wife and I left the park quite disgruntled at spending a lot more money than we had to in this case but, more importantly, the boys had an absolutely fantastic time in the Dolphin Experience. And sometimes you have to let things go and just \"enjoy the ride\".\nShow less"], ["Reviewed August 6, 2016", 1.0, "Please Don't Come Here", "If you value your freedom and life then please don't come here. The security personnel act like mad rabbit animals. And they have the Vallejo PD to back them up. I've personal never seen anything like this before in my life. I wish I had read some comments below regarding the security personnel prior to coming, they're not there to help you , only to make matters worse. I would love to elaborate more , in due time. This place is a mad house and isn't fit to house any type of animals. Were is PETA and animal activists.....SMH..... Just skip it, It's not a good place at all.\nShow less"], ["Reviewed August 4, 2016", 3.0, "Kind of disappointing", "We went, of course it was incredibly hot, and unfortunately for us most of the water rides were closed.\n\nThe Looney Toons kid area was great for small kids. The lines for the rides weren't so long in this area and they were great for my kids (ages 4 and 6). There were a lot of characters out for photos early in the day but we couldn't find them after 3pm.\n\nThe arcade area had quite a few games, for the Pokemon lovers you can win Pokemon stuffed animals.\n\nWe waited over an hour in line to get food (but the people at the counter were very friendly and helpful), a lot of the refill areas weren't open, and the snack stands closed early in the day because they ran out of ice cream/churros/etc. Side note The bathrooms were very clean.\n\nDrench was by far the best part of our trip. The show was entertaining for both my children and myself. The sting rays and seals were ok, however they ran out of fish so we couldn't feed the seals and it was too hot so the sting rays gathered in the shade away from people.\n\nThere isn't much shade so be prepared to eat and wait in the sun. Maybe bring a blanket to sit on.\nShow less"], ["Reviewed August 1, 2016", 3.0, "Dolphin discovery and theme park visit", "I bought the dolphin discovery for my girlfriend and given she is in love with dolphins she absolutely loved it! However the park could have been better organised. A few major rides were closed and the loading and unloading of the other rides seemed painfully slow. Food and drink is quite expensive given they confiscated any food at the entrance! Overall, a good day out but very expensive for what it is, both for entry and food during the day.\nShow less"], ["Reviewed August 1, 2016", 4.0, "Has fun!", "I have been wanting to go to this particular Six Flags for awhile. We get passes every other year and when we do we try to hit some six flags parks across the nation in the summer. This year because we were headed to SF we were so excited to be able to utilize the passes at this theme park. And how exciting it would be because it has both rides and animals. Perfect for my differing aged kids.\n\nYes we were a bit on the fence about this park after reading reviews but I was determined to go because I love animals and really believed our younger kids would love it.\n\nWe got here a bit after it opened and reviewers were right. Parking is far from the park but we hopped on the tram and it took a bit to get to the entrance but it's fine. It was especially welcoming after a long day. We planned the day mostly around the shows since I knew the better rides were in other six flags park especially in Valencia where we were headed in a few days. I am so glad we did that because we adored the shows. My little ones and even my eldest teen loved them!\n\nI would definitely recommend the dolphin and tiger show. Drench was like a repeat dolphin show but in a bigger tank but still good. The sea lion comedy show was cute, a bit silly but good, but we were tired by the end of the day. The shows do take up most of your schedule so it's a give n take whether you want to go to those vs. riding rides.\n\nSome of us split up to ride the bigger rides. And if it's a repeat ride that we have been on before at another park we just skipped it. Rides were just an ok selection. But I think if you do go don't expect wow rides but focus more on the animals :)\n\nWe were impressed that this parks restrooms were really clean. That's a pet peeve of ours. Dirty restrooms at parks and surroundings make a not as fun experience. We loved the weather here. Got so cold in June but hot in the sun. Very odd for Texans lol\n\nThe animals all seem happy and alive here which was good. They seemed loved and cared for. There were old dolphins which shows that they took good care of them. We tried to stop and see them all but missed a few like the butterflies, birds etc. No time bc we were running to the shows :)\n\nFood is expensive here we knew that but we scoped out a few options n settled at Johnny Rockets and it was fabulous here for park fare. I have a separate review for that.\n\nAlso what I loved was the discount shop where they had really affordable souvenirs. Got a lot there and was fun shopping there.\n\nDidn't get to do any of the things that cost $ but didn't feel like we missed much. We have gold passes so got lunch, snack n early dinner here but left to get a bigger dinner out. It was enough for us. Felt content seeing it all. Glad we saw it and happy that our kids got their animal fix in this trip here.\nShow less"], ["Reviewed July 30, 2016", 3.0, "Too tall", "Unfortunately I was 3 inches too tall (I'm 6'6\") to ride the best rides in the park which would've been nice to know before I paid entry. Oh well, at least they had penguins..."], ["Reviewed July 29, 2016", 3.0, "Ok", "This is our second year as season pass holders. It's worthwhile to purchase the pass with the promotion with free parking. It's also worthwhile if you can visit a few times per year. The customer service is poor, but you get what you pay for."], ["Reviewed July 28, 2016", 5.0, "A day of fun and relaxation.", "We go to Six Flags Discovery Kingdom at least once a month. It's always a good time, whether we take kids with us or not. I especially like the Water rides. The very best times to go are during Fright Nights or Holidays in the park. All the food at the park is good. Especially have to try the funnel cake at least once. The dolphin show is a must see on every visit.\nShow less"], ["Reviewed July 28, 2016", 1.0, "Worst amusement park I've ever visited.", "Our family entered the park expecting a great day in a park that I'd heard nothing but great things about. We headed straight to Joker and got tho the front rather quickly. The ride then stops operation for an unknown reason. It's not long before it's clear that they closed the ride to fix the magnet on the exit gate that could have easily been operated manually. This fix added an hour to our wait. Once we finally got on the ride was mediocre at best. After that every ride had the worst throughput I've ever seen in a theme park. We waited half an hour to get through a small queue of about 40 people due to the staff being extremely slow to do everything. There were only three rides that qualify as half decent, those being Joker, Superman: Ultimate Flight and Medusa. The park was also filthy. There was litter everywhere and tables that were covered in food and trash. Overall I would never recommend this park to anyone and will never visit again.\nShow less"], ["Reviewed July 27, 2016", 4.0, "Fun Place to visit", "this place is so much fun, so much to see and enjoy, if you can handle to heat during the summer it's a place well worth visiting."], ["Reviewed July 26, 2016", 3.0, "Kids love it", "This is a good theme park with lots of rides for kids of all ages. The staff is for the most part friendly although a couple of them turned away our 4 year old from rides for being half an inch short. However, rules are rules. What is almost criminal about the park is how much they charge for God awful food and drinks. $4.50 for a bottle of water and $40 for the worst pizza ever is enough to ruin an otherwise great experience.\nShow less"]]}}