{"Stanford University": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Stanford University", "url": "/Attraction_Review-g32849-d102385-Reviews-Stanford_University-Palo_Alto_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/00/18/2a/34/stanford-university.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "1478"}, "address": {"@type": "PostalAddress", "streetAddress": "450 Serra Mall", "addressLocality": "Palo Alto", "addressRegion": "California", "postalCode": "94305-2004", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "This is Silicon Vally College", "Very clean and great campus. I visitied D-school and felt innovative atomosphere. There is big shop and they sell a lot of kind of good of Stanford. There is old style chapel in the center with pipe organ. It was great, too."], ["Reviewed 2 days ago", 4.0, "Haven of Peace", "The main campus buildings and manicured gardens are a real haven from the heat and the sun, and the Burghers of Calais statuary group by Rodin is a cultural surprise and delight.\n\nWe eat in the main student canteen, which was a pleasant interlude of sharing a moment of bustle and intensity of some of the world's brightest minds, while eating our takeaway chicken.\n\nI found the service at the integrated Starbucks left a lot to be desired, but that may have been due to the fact that I physically presented myself at the counter to make my order and found myself last in a huge queue of invisible internet-orderers. The downside of being at Ground Central of Silicon Valley, I suppose!\nShow less"], ["Reviewed 3 days ago", 5.0, "What Else is There to Say about This School?", "I've been to Stanford a few times to visit my sister who studied here. Clear skies, lush grass, and elegant architecture combine to make it one of the most gorgeous campuses in the world. Walking in The Oval and Engineering quad, I saw students studying and collaborating with one another. It truly felt like walking in the center of innovation. Stanford is such a unique place being in the heart of Silicon Valley. The entrepreneurship atmosphere drive students to study in interdisciplinary fields - combining both tech and humanities. A trip here is definitely worth it.\nShow less"], ["Reviewed 4 days ago", 5.0, "Wow!", "We visited as part of a business trip based on a recommended from a local taxi driver. This place is just phenomenal! Like a cross between a large town and a Tuscan village - complete with towers and churches. We took the free walking tour, which was hugely informative and really enjoyable.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great campus visit", "We enjoyed our walk around campus. A trip to the bookstore, the student eatery and the usual chapel visit.. Loved seeing people from all over the world."], ["Reviewed 2 weeks ago", 5.0, "MUST VISIT", "It is always great to visit US universities. They are just so different from what we have in EU. It is just fascinating.\nStanford offers an amazing and huge campus. The overall facilities are great and all the students houses are just outstanding! (Keep in mind that I have a European point of view therefore US standards are just fascinating for us!)\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Stanford University is worth a visit", "I visited as part of an Executive Program and then toured the University that has a lot of interwsting things to see."], ["Reviewed 4 weeks ago", 5.0, "Beautiful sprawling campus", "visited my son here at the Graduate School of Business. Lots to see, for great views go to the top of the tower"], ["Reviewed January 3, 2018", 4.0, "Second visit to Stanford University", "Very nice place to visit; many dream to study here, many visit, quite a number study here, especially Asians and Indians, among the minority. The walk to the Tower was pleasant, cool, peaceful, relaxing, and very picturesque. Went up to tower to look around, pay a small fee. Many visitors from China.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Amazing Public Sculpture", "I've been here dozens of time and am always knocked out by the breadth of the public art on the campus. The art museum has a walking/touring map. Some of the sculptures: Buffano, di Suvero, Henry Moore, Alexander Calder, Josef Albers, Rodin (or course), Kenneth Snelson, Maya Lin, Andy Goldsworthy, George Segal, Bruce Beasley...\nShow less"], ["Reviewed January 1, 2018", 4.0, "The coveted university", "While visiting San Francisco, we rented a car and drove to Stanford on a Saturday morning. The campus was dead and all the food places were closed but still we enjoyed the serenity, beautiful architecture, and the palm trees (so many of them on Palm Drive). Eventually we walked toward a nearby plaza outside the campus to have brunch . Then we visited Iris & B. Gerald Cantor Center for visual art which show cased a unique form of art. The memorial church was unfortunately closed but still we got to appreciate the outside view. One interesting thing was that the bathrooms around the campus were using recycled water for flushing.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Best College Campus in the World?", "Stanford is the dominant icon in an area known for icons. Before Silicon Valley, there was Stanford, and without Stanford there would be no Silicon Valley. It is a drop dead gorgeous campus - huge and bucolic, but easily navigated on a human scale, it's core being the Quad. Easily accessed, too, unlike East Coast iconic Universities I have visited. Best way to see the campus, bring or rent a bike.\nShow less"], ["Reviewed December 1, 2017", 5.0, "great university", "it is a great university and a good place to visit. many social & academic activities. you can spend all day here"], ["Reviewed November 28, 2017", 5.0, "Stanford campus", "You feel the brains just by being on this extraordinary campus. The two art museums are true musts. No wonder it is one of the most selective universities in the world."], ["Reviewed November 19, 2017", 5.0, "Do the visitor tour!", "PArk your car near the visitor center (Athletic area) and join the free tour. In one hour you get the basics. Loved it.."], ["Reviewed November 13, 2017", 5.0, "Beautiful campus", "Great university to visit. Can’t describe all the beautiful features it has. I’ve visited lve league campus’s, UF,UNC and many more. All were impressive but none compare to Stanford."], ["Reviewed November 10, 2017", 4.0, "Enjoyed Strolling the Main Campus Area", "Enjoyed a beautiful Sunday morning strolling around the main Campus area. Nice architecture, fountains, and landscaping."], ["Reviewed October 28, 2017", 5.0, "Other universities may denigrate the place as a “country club” but it is unique.", "Stanford University campus is architecturally striking and represents a mixture of styles, based on a central theme of red roofs and tan walls. The main campus entrance is via Palm Drive -- a long straight road lined with palms trees with a view of Memorial Church surrounded by rolling hills at the end. The interior quad is reminiscent of Spanish missions, with its arches, covered walks and use of sandstone; this is one of the main meeting points with quad doors lead to different departments and classrooms. I would recommend taking a shuttle tour as this is a large campus; however, it is also great for walking or one can rent a bike, as weather usually great all during the year. A personal favorite, in younger days, was a great jogging path called the Dish in the direction of the SLAC National Accelerator Laboratory, which now offers free public tours. Among the campus highlights are the Rodin sculpture garden (much better with a guide), Lake Lagunita, the tennis courts (John McEnroe studied here), Stanford Stadium and the outdoor pool complex. Other universities may try to denigrate the place as being a “country club” but Stanford University campus is unique.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Awesome campus and environment", "Very friendly people. Great amenities and weather with plenty of places to eat, lounge, meander, walk, ride, and learn."], ["Reviewed October 25, 2017", 5.0, "Auspicious!", "Having spent time on the respective campuses of Harvard, Yale, Princeton, and UPenn, I was overwhelmed after visiting Stanford. The areas inclusive of the campus are absolutely vast and beautiful. Goregeous facilities and a great sense of authentic community embodied my experience. Cactus garden and the \"Angel of grief\" statue emotionally moving.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Feel the greatness", "Stanford University is totally worthwhile to stroll around for an hour or so.\n\nIt is reached by a huge and beautiful park entrance, which in itself is the best location for a great run.\n\nThe University itself is beautifully built with very caraterístic building , wide spread and totally accessible for any visitor.\n\nThe campus atmosphere is just as you would expect of the place that generated all these great tech companies. Lots of students and easygoing wisdom.\n\nOne feels the greatness of the place!\nShow less"], ["Reviewed October 23, 2017", 4.0, "Nice Campus", "I'm in Palo Alto on business and am very near the Stanford campus. I went for a walk around some parts of the campus one even I ng and it's very beautiful and interesting."], ["Reviewed October 16, 2017", 5.0, "Beautiful campus, chapel and museum", "A wonderful place for a long walk among the sandstone buildings. Don’t overlook the Cantor Museum and Anderson Collection!"], ["Reviewed October 15, 2017", 5.0, "Wonderful architecture", "Spent 2 days here for a conference and I loved the ambience of this great University. Happy to have had the opportunity and loved the 100% electric buses which were absolutely free."], ["Reviewed October 11, 2017", 5.0, "tour", "make sure you take the tour, the students doing the tour were pretty good. you will learn more from the tour. no need to book ahead, it is a walk in tour"], ["Reviewed October 11, 2017", 5.0, "Only as a visitor - Not as a Student!", "Happy to be in a world class University! This university was founded in 1885 by Leland and Jane Stanford in memory of their only child, Leland Stanford Jr., who had died of typhoid fever at age of 15 the previous year. Stanford was a former Governor of California and U.S. Senator; he made his fortune as a railroad tycoon.It has the Alma mater of 30 living billionaires, 17 astronauts, and 20 Turing Award laureates. 64 Nobel laureates and seven Fields Medalists have been affiliated with Stanford. Definitely we are not in this list. But at least got an opportunity to be here!!!\nShow less"], ["Reviewed October 8, 2017", 5.0, "Gorgeous place", "Wow, you must spend here at least few moments. Monumental buildings, spirit of the place. Don’t miss."], ["Reviewed October 3, 2017", 5.0, "I'm in love", "Wish I was young and bright, so I could go study at this beautiful place!!!! Can highly recommend a visit to Stanford university:-)))"], ["Reviewed October 3, 2017", 5.0, "Only the best", "It dose not matter where you go.. always the service and product are the best! I love the art museum restaurant."], ["Reviewed October 2, 2017", 5.0, "Ideal for reading & coffee", "HUGE and beautiful campus - the style of all the buildings are highly consistent, making it very pleasant to view the campus from any angle. Don't miss the class plaque and time capsule at the entrance of the Memorial Church. The Stanford Bookstore offered some nice souvenirs - more of a souvenir shop than a bookstore, though.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Stanford Tours - Leg saving ideas", "Due to the large size of the campus, I recommend starting with a trip up Hoover Tower to get a view of the entire campus. Then walk through the main quad and target the departments that are of particular interest to future students. Do not forget to look at the athletic facilities even if you are just a weekend athlete. Even the recreational pool, golf, softball, beach volleyball courts, rock climbing walls, gyms, squash and tennis courts are beautiful. Attend a free sporting even to get a feel for the study body - we attended a free men's waterpolo game!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Beautiful campus strolling grounds", "The campus is beautiful and well maintained. The 'hidden' wooden benches and small table garden settings are tucked in everywhere!"], ["Reviewed September 27, 2017", 5.0, "Beautiful Campus", "I walked the grounds and this is one beautiful campus. Shuttle service takes to the train which is convenient. The mountain background is very spectacular."], ["Reviewed September 20, 2017", 4.0, "Beautiful Campus and Surroundings", "Went their for a quick tour and found the campus very beautiful and calming. The buildings there had some great architectures and it was buzzing with students and visitors. Must visit when in Bay Area."], ["Reviewed September 19, 2017", 5.0, "Beautiful Campus", "One of the most beautiful campus I've ever visited. Better experience walking or biking rather than driving"], ["Reviewed September 17, 2017", 5.0, "Awesome Campus", "So pristine and lovely this campus sets the bar very high in every way. The fields and pools and entire campus are unequaled anywhere else. Hoover Tower is amazing."], ["Reviewed September 16, 2017", 5.0, "OK, I'm Biased..", "I was fortunate enough to attend Stanford for my graduate work and even spent a few years there on the Engineering faculty. It's an amazing place and truly beautiful from an architectural standpoint.\n\nTry to enter the campus via Palm Drive -- a lovely road lined, as you might guess, with palms trees. As you drive you will have a distant view of Memorial Church framed by rolling hills . You can find usually find pay parking in the big loop in front of the main quad. On foot, enter the quad and head towards the church. Take time to enjoy the the shaded walkway on the interior permitter. When you get to the church, you will see inlays in the walkway dedicated to each graduating class. The doors along the interior quad lead to classrooms and some offices.\n\nTo me, Stanford is sandstone buildings with red-tiled roofs framed by a cloudless blue sky. You'll see that theme everywhere.\n\nHead uphill from the main quad to checkout the White Plaza, the fountain, and the bookstore (where you can buy Stanford apparel and Stanford-related gifts). You can stop for a snack at the Tressider Union or adjacent Coffee House.\n\nThis is a large campus. If you love to walk or can rent a bike, try to see:\n\nLake Lagunita\nStanford Stadium\nThe massive outdoor pool complex\nThe baseball stadium\nThe outdoor Rodin Sculpture Garden\nThe Stanford Medical Center\nFaculty Hill\nShow less"], ["Reviewed September 13, 2017", 5.0, "Fantastic campus!", "Really fortunate are those spending one or more years living at this exotic campus! Visiting the vast campus area itself is a great experience!"], ["Reviewed September 8, 2017", 5.0, "Now part of the Stanford family, everyone should visit!", "Visit the campus, its beautiful! Tons of history and stories. The bell tower is a must visit too! beautiful view! Don't under sell yourself, walk the whole campus!"], ["Reviewed September 7, 2017", 5.0, "Not just an excellent place to study", "The campus itself is worth a visit with the \"Palm Drive\" with the church at one end, a must see. Plenty of shady places, like the arboretum, for a quiet and pensive stroll or even a picnic. Quite a few coffee shops, including he nearby Stanford Shopping Center as well as the Student Union. At one end of the campus (towards I-280, or away from the dreaded 101), there is also a pleasant hike up the dish hill to people who enjoy that sort of thing.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Academia in Paradise", "Obviously being one of the top universities in the world one would expect a fabulous academic environment. It is that and what's more there is an incredible (outdoor) garden filled with Rodin sculptures. There's more here than in the Rodin Museum in Paris. Unbelievable."], ["Reviewed September 2, 2017", 5.0, "Stanford", "It's not just a university it's a full city.. it contains all the facility that any one could need.. it's big. I went there for Summer course and enjoyed every thing.. you can just visit even if you don't have anything to do there."], ["Reviewed August 29, 2017", 5.0, "High school summer college program", "Stanford definitely has an amazing high school summer college program. It is said that Stanford is the most selective university in the country. After visiting the campus I understand why. It is a truly amazing school. The Farm, as it is known, is 8800 acres and definitely worth every penny of tuition. The climate is near perfect and the facilities second to none. The benchmark is Stanford.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Certainly the best university in the USA", "Not only the education level is of highest standards but climate and environment is extraordinarily nice at all times. Very very lucky if you have a chance to visit The campus"], ["Reviewed August 25, 2017", 5.0, "Best university on the west coast", "Spectacular in every way. Beautiful campus with buildings sponsored by the greats of technology since the late 1800's. Every building, path and garden are maintained with care and beauty. The standard tours don't nearly do justice to all the things you'll see and do, so read before you go!\nShow less"], ["Reviewed August 25, 2017", 5.0, "quick tour to feel like a student", "enjoy spending time in the campus, take away restaurant and the bookstore to grab some Stanford clothes"], ["Reviewed August 24, 2017", 5.0, "Impressive", "One of the most important and impressive universities in the world - be sure to visit when in the Bay Area. Apart from the history you feel here and from the vast size of the campus it's probably one of the most beautiful places where you can study!\nShow less"], ["Reviewed August 24, 2017", 4.0, "Great Campus", "We visited over a few days this summer! Great campus to take a tour or if you have bikes this is the easiest way to get around and see everything. There are bike chain up spots everywhere! Don't miss the Cactus Garden, Totem Poles, Hoover Tower, the New Guenia Sculpture Garden and the Standford Cardinal Stadium (especially if you can catch an event there - we saw the LA Galaxy take on the San Jose Quakes in Soccer)\nShow less"], ["Reviewed August 22, 2017", 5.0, "Relaxing campus with great museum, church, and bookstore!", "Stanford University's campus is so big that it has its own shopping mall (on the corner of the campus), it has a very large memorial church with an interior that will render you speechless, a bookstore with a cafe on the second floor, and the Cantor Arts Center (Museum of art) with no entrance fee. I highly recommend the museum if you are into art & design, the exhibition is spacious with spectacular works being displayed!\n\nEven if you don't study here, Stanford is a must visit!\nShow less"], ["Reviewed August 18, 2017", 5.0, "Not your typical campus", "Expansive grounds, vast and varied Medical Center, notable museums and art collections and excellent FREE bus transportation throughout grounds and adjacent area"], ["Reviewed August 17, 2017", 4.0, "Vast!", "I have been here so many times and never really seen all. This is a mission impossible. The campus is so vast. I don't think it been every corner even by car. Beautiful lawns, buildings and world class stadium.. The list is endless. Highly recommended."], ["Reviewed August 17, 2017", 4.0, "Nicely maintained location", "Large location , very well maintained buildings and gardens beautiful statutes setting - worth a visit !"], ["Reviewed August 14, 2017", 5.0, "Wow, just....wow", "The school is one of the best in the country. We walked on our own (book a tour early as the fill up fast) and waited for twenty minutes to ascend the tower (worth the wait and the small fee). Now that my son has seen it, the thought of attending is very motivating.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Beautiful campus", "Rented bikes and road around the entire campus. Art museums and church were beautiful. Loved the D building, very unique and also the PNG totem garden. The buildings were great, awesome areas to bike and walk around. We thoroughly enjoyed our time there."], ["Reviewed August 12, 2017", 5.0, "A must see", "Stanford University has a gorgeous place around it with nice buildings and parks. You can get the student experience for a short time. It also has gift shops where you can buy a ton of Stanford themed stuff for yourself or your family/friends."], ["Reviewed August 10, 2017", 5.0, "Stunning campus!", "Had time to kill on the way to the airport so did the self guided walking tour and the campus is simply stunning! Ate lunch at the Packard cafe and it was really good too."], ["Reviewed August 9, 2017", 4.0, "Beautiful California-style campus", "Stanford is a unique campus, designed by Olmsted, the same man who designed NYC's Central Park, There is a great deal of open space and the buildings on the main campus are all in the same style, early California Spanish. The Memorial Church is worth seeing by itself. One can see the whole campus from the observation deck of Hoover Tower. Cantor Museum on campus has a garden of Rodin sculptures as well as the golden spike, other Stanford historical items, fine art and an excellent cafe.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Beautiful campus, great place to walk around!", "I visited Stanford University as part of my tour to Silicon Valley. The best part about visiting Stanford is that the Palo Alto Caltrain station is walking distance from the main gate. You can spend more than half a day in the campus that has a lot of trees and greenery surrounding it. There is always some activity or the other happening at Stanford and you can attend them as well. We also sat on the lawn for a bit and it was very relaxing. Overall, its worth the pilgrimage if you are an academician. A lot of the great inventions of our time have come from Stanford. Make a quick visit if you are in Silicon Valley\nShow less"], ["Reviewed August 9, 2017", 5.0, "One of the best campus in the world", "I went to school here and this is the best campus for sure! The memorial church is a must-go place. I got married there recently and it is one of the best moments in my life. Go Cardinal!"], ["Reviewed August 9, 2017", 5.0, "Thinking About My Life", "I traveld to Palo Alto last year. I've decided to do it because I'm intersted in studying there. For 2 days I've visited Stanford. On the first day, I stayed there to know informations about the course. On the second day, to walk and promenade. It's a very beautyful place. Not only a place with buildings to study. Much more than this. Like a farm, there is a lot of green and palms. We can smell the rosemary. There is Rodin's sculptures. Herbert Hoover, 31st american president, have studied and lived there. A tower (Hoover's Tower) was built in his honor. At the top of this tower, we can see a San Francisco Bay. Moreover, the University is prepared to receive visitors (there are a fire truck with a chief firefighter and a police car with the sheriff.)\nShow less"], ["Reviewed August 7, 2017", 5.0, "Famous University", "We visited the sprawling university campus yesterday.It was awesome.I will not write about it's famed academic activities as We went there to see the university campus only.Front portion is full of huge trees on both sides of the Main entrance road followed by huge playground and then comes the beautiful buildings ,library and the captivating church.The entire area was so beautifully and meticulously planned that it is not only captivating but also presents ideal study atmosphere for the students ,faculty as well\nShow less"], ["Reviewed August 4, 2017", 5.0, "College tour", "My rising senior daughter needed to tour the campus. I am an alum and was impressed with all the changes. Beautiful campus."], ["Reviewed August 3, 2017", 5.0, "Make time to visit the grounds", "This campus is just beautiful. I came for a class and quickly made time to walk the grounds. Just beautiful. The museum/art is also worth a visit."], ["Reviewed August 3, 2017", 5.0, "Amazing", "Lovely place Huge Long walks should be expected The art museum is really good Architecture is amazing."], ["Reviewed August 2, 2017", 5.0, "A very beautiful campus", "This a a very beautiful place. But prepare to walk long distances, as the guest parking is quite far, and the distances are long. But it is worth the trouble."], ["Reviewed July 30, 2017", 5.0, "Book the Golf Cart Tour", "We recently visited Stanford with our daughter and booked the Golf Cart tour. For $5/person, it was well worth the money. It is just 5 people and the guide in a 6-seat luxury golf cart. The tour covers much more territory than the walking tour. Our tour guide Haley was absolutely fantastic--full of energy and information! We made several stops and really felt like we saw the campus.\nShow less"], ["Reviewed July 28, 2017", 5.0, "World famous university", "I like visiting and looking at the grounds and hearing about the history. There are many different aspects here to see and appreciate."], ["Reviewed July 26, 2017", 5.0, "Great grounds", "We have grown up coming to Palo Alto every year and we always go to Stanford because the grounds of the university are gorgeous and a great place not just for students."], ["Reviewed July 25, 2017", 5.0, "Running the Campus Circus at dawn", "Go there at 6 Am , you can follow the route on Runtastic having the all around campus journey. Peace and quite within the magnificent park all around the buildings. You can breath the legend there"], ["Reviewed July 25, 2017", 5.0, "Beautiful! Beautiful, Beautiful!!!", "This is one of the most beautiful campuses I've ever visited. The university grounds are extremely well maintained and great architecture.\nTake a walking tour of the campus and visit the gift shops (a bit on the expensive side though - but you're sure to find something).\nMake sure you visit the chapel - it was the highlight of our visit.\nThe visiting center was very helpful and provided us with a map and advise on the best routes to follow. If you're hungry, enjoy lunch with the students at one of the canteens (very affordable).\n\nThis is truly a world class university.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Worth seeing", "Didn't see the entire campus by any means but it was good to see and step foot on campus of such a school. The campus is as beautiful as I expected to be."], ["Reviewed July 23, 2017", 5.0, "What a campus!", "I have nothing else to add. You need to come here to see it especially during the summer. Great temperatures."], ["Reviewed July 22, 2017", 5.0, "The most beautiful campus we've ever seen!", "The architect, gardens, and design of the campus is exceptional! It's worth putting on your bucket list! Since pictures are worth a thousand words check out my pictures!!!"], ["Reviewed July 19, 2017", 5.0, "Great outdoor art and views on campus", "There are so many great things to see on Stanford's campus, but do not miss the view from the top of the Hoover Tower, the Papua New Guinea Sculpture Garden and \"Stone River\" by Andy Goldsworthy."], ["Reviewed July 16, 2017", 5.0, "Happy surprise", "Ok I didn't think I had any interest in Stanford but my husband wanted to see it. I was totally surprised at how lovely this campus is and enjoyed walking around. Now I wish my kids would go there if it wasn't for the $64 K price tag, haha.\nShow less"], ["Reviewed July 13, 2017", 4.0, "A must see to visit!", "Love the place and the building structure. Simply amazing! A lot to explore and discover. Very nice and clean campus."], ["Reviewed July 12, 2017", 5.0, "Stanford university campus", "It is extremely beautiful campus with lovely landscaping and iconic buildings. Every once in a while I love spending a couple of hours walking around the Campus."], ["Reviewed July 8, 2017", 4.0, "Beautiful Campus, Great Academics--But not what it used to be in the 60's", "The campus of Stanford is huge and beautiful. As a 1975 graduate, I can't help but wish it had maintained a bit more of the spirit of the consciousness of the 60's. But time marches on, and the university is still fantastic, albeit in a much more formal way.\n\nI brought my family to see Stanford in July, and they were awed by it. So time marchs on and so does Stanford.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Great place to study and stay", "Beautiful Stanford University is great place to visit and spend quality family time. Wish it to more affordable."], ["Reviewed July 5, 2017", 5.0, "Stanford is our dream university", "Stanford is surely a dream university for us. My daughter also loved it. Whether she can make it here is to be seen."], ["Reviewed July 3, 2017", 5.0, "Beautiful Campus", "I have visited 10-12 college campuses over last 4 years. Stanford is one of my favorite. The energy is contagious, the building are beautiful - you know that you are in a special place. The athletic facilities are exemplary. I have not attended classes here, so can't comment on that. But have many friends that have gone here. They all rave about it.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Amazing campus!", "A huge campus, designed to be a University, very well kept. It is nice to make their own walking tour and learn about their history. Amazing!!!!"], ["Reviewed July 2, 2017", 5.0, "Cannot forget - such a magnificent campus!", "A large well maintained campus - you can barely cover 25% of it - not to forget the great alumni and founders/innovators who studied here. Even if you are touring San Francisco, a visit to this campus should not be missed.\n\nFortunate and blessed are those studying here!\nShow less"], ["Reviewed July 1, 2017", 4.0, "Looks like eesort", "Greens, low rise buildings, yellow stone wall, red tops, fountains, palm trees and .... Beautiful sunshine and blue sky. It looks a resort rather than university. Good place to study at."], ["Reviewed June 29, 2017", 5.0, "Wonderful university", "Wish my daughter would get opportunity to go here, but sadly they do not have an undergraduate business school, only graduate level. The tour was very informative, led by students. Would be a great place to study, with a web of support there on every level. If you can get in, they make sure you are taken care of, supported and encouraged to pursue your educational passion. Google started here, Olympians by the handful, and superstar alumni. History of the place is fascinating.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Beautiful campus right in the middle of Silicon Valley", "If you can get in and if you can afford it, this is one of the top universities in the country if not the world. Its focus on engineering with a business emphasis is perfect for young future entrepreneurs. Big enough to have alot of diversity of courses and people but small enough to not feel like one of the big cali state Us. The art museum (thanks to wealthy dotcom donors) is really impressive.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Gorgeous campus with inspiring buildings, art museums, concert halls and gardens.", "Stanford is one of the most beautiful campuses in the world and worthy of a visit even if you are not a studen there."], ["Reviewed June 24, 2017", 5.0, "Walking Tour", "We enjoyed a 70 minute walking tour of Leighland Stanford Junior University. It was wonderful to hear the history of Stanford and even the true name as well as our student guide's prospective about campus life. It is a beautiful and inspiring institution and my 13 yo son said he felt smarter just being there\nShow less"], ["Reviewed June 24, 2017", 5.0, "Beautiful Campus to tour", "The style of the buildings was a surprise for all of us. We weren't really certain what we expected but it wasn't what we say. They are beautiful. What's not fun about looking around on a college campus."], ["Reviewed June 24, 2017", 4.0, "Stop at Stanford", "We were on our way to visit friends for lunch in Palo Alto so decided to take a look at Stanford University. It's a big campus and surroundings kept nice. We also visited on a nice day and when school is not is session. Now we can say \"We went to Stanford!\".\nShow less"], ["Reviewed June 21, 2017", 5.0, "Walked through some of the sights which included the Rodin Sculpture Garden, the Quad, and other areas.", "Since we live not far (12 minute car ride away), some late afternoons we take a stroll through some of the gardens and wooded areas. It's a beautiful diversion from our daily routine."], ["Reviewed June 15, 2017", 5.0, "A beautiful and excellently maintained University", "Beautiful place to go for a day visit, the open lawns, the surrounding neat and clean areas would want to make one just sit for long hours, probably read a book or walk hands in hands with ones beloved. The Leland Stanford Junior museum in the premises is also very good to visit and one can voluntary contribute for the same, the entrance is free. The Museum also houses hands on activities for children.Not aware if public transport is available to reach it, but one can drive down or take an uber. Make sure when u drive recharge the parking ticket well in advance , else you can get a fine ticket. The cafeteria on site is also good and offers variety of food options.Walk around the Main Quad area and those interested in photography could capture good architecture of the buildings.Nice place for a day visit.Buses ply inside the campus, but not aware if they are free or if one has to take a ticket.\nShow less"], ["Reviewed June 15, 2017", 5.0, "A beautiful campus! A must see!", "My wife and I have spent many afternoons at the Stanford University campus which, in my humble opinion, is one of the most beautiful in the country. Excellent for biking, walking, picnics, strolling through the beautiful buildings, finding a quiet place to relax and do just nothing. It's a great way to spend a lazy afternoon with family and firiends. And it's FREE.\n\nGetting there couldn't be any easier either. From San Francisco drive south down 101 and take the Palo Alto or take Caltrain, from 4th and King Street, and get off at the Palo Alto station. From there it's a short walk to the campus or you can ride one of the many Stanford University's free buses, Marguerite Shuttle, onto the campus. From San Jose, drive north up 101 and take the Palo Alto exit or take Caltrain.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Beautful Campus", "What a beautiful campus! My family went on a walking tour led by a student that was a great way to see and learn about the campus. Whether you are a prospective student or just want to see the campus I highly recommend a visit to Stanford.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Beautiful, you can spend a day there", "Stanford Uni is one of the oldest foundations in the town so it's the closest to a historical site the town has in my opinion. The campus is gigantic and because it's a university, it has all the amenities of a town so you can spend a whole day there and find stores and restaurants without having to leave the campus. The school is also great for kids because of the general cleanliness, open fields, and public water attractions (fountains and small pools that people are technically allowed in)\nShow less"], ["Reviewed June 13, 2017", 4.0, "Nice stroll through the campus", "It's just nice to walk through the beautiful campus - a huge one but great surroundings. It's close to the cantor art center and Rodin sculpture garden. If you have a few hours to spare than worth the store. The bookstore is also worth a visit\nShow less"], ["Reviewed June 12, 2017", 5.0, "Fantastic", "Good to come back again and feel the atmosphere. I like the architecture of the building. We also visited the Hoover tower and you are able to view from the top. It was so relax and walk around and witness the different building."], ["Reviewed June 10, 2017", 5.0, "visit", "Certainly a must-see attraction.\nYou feel the atmosphere and energetics of the place right from the entrance.\nSerenity of the place together with activity of people inside is impossible to describe.\nYou feel it is the cradle of knowledge with immense history and heritage.\n\nSee pictures taken with my Relonch camera for a better impression.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Beautiful hniversity", "I was lucky enough to be here for a conference. I also had an opportunity to walk around it.\nIf you feel like a lovely stroll when you are staying in Palo Alto, then I'd recommend taking a walk around the campus. The grounds are beautifully maintained, lots of greenery and beautiful arched low rise buildings.\nAnd don't forget to stop at the campus store and buy some Stanford paraphernalia. There's a lot to choose from!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Culture, history, and a nice stroll to boot", "Stanford University campus lends itself to a very nice walk with friends and family. It is completely flat, so you if you have small children or a stroller, this is ideal. You can just stroll around the very pleasant grounds, or explore some beautiful historic buildings. All around, well worth it.\nShow less"], ["Reviewed May 16, 2017", 5.0, "beautiful architecture", "There are so many esthetically pleasing gardens, vantage points, art work, varied architecture and places to ponder the wonder of education at this university. The vast campus offers unique spaces both large and intimate to enjoy solitude or interact with fellow students. Wonderful library, ornate church, multiple dining areas and very large campus store.\nShow less"], ["Reviewed May 14, 2017", 5.0, "A lovely place to walk around", "I work on a college campus, and it's extremely rare that tourists take the time too look around our buildings. But it's clear when walking around Stanford that there are many people just enjoying looking around the lovely buildings. Take some extra time to check out the chapel, located right inside the main entrance... stunning mosaics on every wall.\nShow less"], ["Reviewed May 12, 2017", 5.0, "Interesting Architecture", "For most people, just walking around and enjoying the buildings and the landscaping will be the reason to visit."], ["Reviewed May 11, 2017", 5.0, "Visit to Stanford Bookstore", "Very active campus with lots of people riding bicycles, so you need to stay alert when walking around. We stopped to visit the campus bookstore to pick up some clothing for family members. The campus was easy to navigate and the bookstore was easy to find.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Loved this place", "This place is well laid out and has beautiful old and new buildings, especially the Spanish Mission style originals. The Visitor Centre provides a really good free 1-hour walking tour to introduce the campus and show you around the highlights. Spacious without being too spread out. Great atmosphere.\nShow less"], ["Reviewed May 9, 2017", 5.0, "Touring Stanford", "Stanford is a very LARGE spread out campus. The central area, known as the Quad, is where many of the original buildings are located. Must see is the collection of sculptures by Rodin. Other parts of the campus are nice to see. For the medically inclined, the Medical Center area has also a lot to see with many displays lining some of the walkways.\nShow less"], ["Reviewed May 8, 2017", 5.0, "Awesome campus", "Just beautiful and worth a visit. Go see the church on site, it is amazing. The art museum is under renovation at present."], ["Reviewed May 6, 2017", 5.0, "World Class", "2 art museums. Exquisite grounds, libraries. Great for hiking, dog walking, cycling. Near wonderful Italian restaurant, Vina, behind Tootsies and the Stanford barn."], ["Reviewed May 5, 2017", 5.0, "Great architecture, pretty campus", "Not an easy place to navigate, but once you locate a few of the choice old buildings like the Stanford Chuch, well worth the effort."], ["Reviewed May 4, 2017", 5.0, "Walking in history", "Stopped by just to see the beautiful campus. My father attended Stanford in 1944 and always told stories about his time there. I had to see the beautiful Quad for myself. The Chapel was beautiful. Interesting Rodin sculpture. Went up in the tower and could see for many miles.\nWe stopped at the visitor center on Galvez to pick up a map. You can take a guided tour, or follow the walking tour on the map. The volunteers at the tower had their own history to share.\nThere is metered parking by the visitor center. $2 an hour, but who wants to be ticketed or towed??\nShow less"], ["Reviewed May 3, 2017", 5.0, "Campus never fails to impress!!", "I grew up in the area and have since moved but I always love to travel back and see the beautiful Stanford Campus. We were there for a Baseball Game, and the field and ball park are great!!!"], ["Reviewed May 1, 2017", 4.0, "Pretty Campus", "Nice campus but no parking really. If you are going to just have a look see you will be walking quite a bit. Chapel is very pretty."], ["Reviewed April 30, 2017", 5.0, "Awesome Campus!", "Was attending an executive class in the school of business, and class room was awesome with updated technology and vented seats and great sound system. During my breaks, I would walk the beautiful architecture and landscapes. Great experience for this weekend class."], ["Reviewed April 29, 2017", 5.0, "Beautiful!", "Go to main building, there are a parking are for visitors. Then walk through the garden to the main square. Admire Rodin Sculpture Garden, and the Church with so beautiful gold images."], ["Reviewed April 28, 2017", 5.0, "Most beautiful university", "This university is so beautiful that couples are always using it as a place to take wedding photos. Surrounded by trees this campus is definitely a must-see if visiting the Palo Alto area."], ["Reviewed April 26, 2017", 5.0, "Check out the Rodin Sculpture Garden", "Huge Campus, lots of construction so get a map online before attempting to explore it. The free shuttle on campus is a bonus. The bookstore cafe upstairs had the friendliest baristas ever!"], ["Reviewed April 23, 2017", 5.0, "Beautiful campus", "Gorgeous campus that is fun to walk around. Unlike most other campuses I've been to, buildings aren't well marked so we wandered for a little bit longer than planned, which was fine. Stunning campus and a must see if you're in the area."], ["Reviewed April 22, 2017", 5.0, "You cannot miss Stanford if you are in the San Francisco Bay Area", "This is a vast campus but Stanford is a \"one in the world\" site. If you have minimal time experience the Palm Drive entrance and one or two sections of the Quad and if the organ in the church is being played take the time for a listen. There are some extraordinary other areas such as the Papua New Guinea art garden to the Canter Museum and the new modern art museum. You must plan for considerable time to find a parking source and walk to the main campus area.\nShow less"], ["Reviewed April 22, 2017", 3.0, "Some interesting things to do at a great university", "Of course Stanford offers a diverse set of activities and pleasant place to visit if you are in Palo Alto and have some free time. There is a some very fine outdoor art scattered around the campus and there is a whole collection of Rodin Sculptures, mostly in a dedicated Rodin Garden but also near Memorial Church. The church itself has several magnificent organs so if you are there when there is a concert by all means go (the organ is played at Sunday services too, and even if you are not a religious person sitting there to enjoy the music is nice. The view from Hoover Tower is quite nice a clear day and gives one a sense of the campus and also views of some of Silicon Valley. The Anderson Art Gallery offers an eclectic selection of modern and contemporary art. The Bing Concert Hall is an interesting structure but the highlight is the main auditorium with its lovely woods and acoustic design. Tours of Bing are available at certain times. The central campus area is closed to cars and is a nice place to stroll once you decide to visit the campus, but the bicycle riders can be treacherous at times.\nShow less"], ["Reviewed April 20, 2017", 5.0, "superb campus", "I had heard a lot about this university. Hence decided to visit just as a tourist.\nThe campus is awesome !!!\n\nThe building design is excellent.The church inside the campus is beautiful.The courtyard is very calm and peaceful.The corridors are a pleasure to walk around.\n\nThe free buses running inside the campus are very useful.\n\nThe best part is the students from all over the world moving around.\n\nThe greenery of the campus is also very soothing.\n\nThe only part I did not like is the limited free parking spaces and even the paid ones.They are always full it seems ! They must find out ways to improve this situation.\n\nBut overall, it is definitely one of the finest universities in the world.I regretted why I did not study here in my younger days !!!\nShow less"], ["Reviewed April 16, 2017", 5.0, "Nice to walk", "Beautiful arches and hidden passages that make it a beautiful campus. The art museum is worth a visit."], ["Reviewed April 13, 2017", 5.0, "Always breathtaking", "Lots of construction going on, but still an enjoyable visit. Beautiful campus, incredible scenery - what's not to love about this place?"], ["Reviewed April 12, 2017", 5.0, "Great place to visit", "Rodin garden only would be worth a visit. Had a nice lunch at Stanford barn (Tootsies) and enjoyed the campus. Kids liked the environment too."], ["Reviewed April 12, 2017", 5.0, "Beautiful Grounds", "Have been here mutliple times for conferences. This time end of March; Everything starting to bloom! I hope the students appreciate how lucky they are to be there!"], ["Reviewed April 4, 2017", 4.0, "Stanford University", "Went for a conference and the campus was gorgeous. My wife kept wondering why she didn't apply 40 years ago. She said she thot it was dusty. Not this month! Architecture is amazing and in such great shape. Only strange thing was the campus bus did not seem to run on Saturday. Coming from the East I guess you become accustomed to public transit!\nShow less"], ["Reviewed March 29, 2017", 4.0, "HUGE campus with beautiful buildings", "The first few times I visited Stanford, I got lost driving around the HUGE campus. Thank goodness Campus Drive circulates around the many miles of beautiful buildings. Maybe it's good for students who know where they are going. But it's hard for some of us visitors to find our way around.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Beautiful University", "This is a beautiful university campus and well worth the visit. I can highly recommend that Art Museum. They have an impressive collection with something for every art enthusiast. The Hoover tower was also nice and included a small exhibit on the president and this family.\nShow less"], ["Reviewed March 24, 2017", 5.0, "Beautiful Campus", "I visited the campus just to see it. I also went to Cantor Arts Center. It was easy to get around. The natural walk and run paths are very enjoyable."], ["Reviewed March 23, 2017", 3.0, "Nice campus", "Easy to navigate. Plenty of parking, bike paths and walking trails. Nicely maintained grounds. A pleasure to walk around"], ["Reviewed March 23, 2017", 5.0, "Really fun self guided walking tour!", "We spent an afternoon doing the self guided walking tour and loved it! Pick up directions at the visitors center or find the PDF online. Make sure to stop st the art gallery, visit the observation deck of the tower, and visit the bookstore at the end!\nShow less"], ["Reviewed March 22, 2017", 5.0, "The Havard of the West", "First of all it was more modern than I thought. Second the campus just beautiful. Third it is a very suburban campus. Last Its oval is reminds me of the one at The Ohio State University."], ["Reviewed March 19, 2017", 5.0, "What a beautiful campus - wish we had more time to explore!", "We loved everything about the Stanford campus, except for the lack of time we had to explore. The presentation we had gave us a lot of information. I would be thrilled if my daughter attended school here."], ["Reviewed March 17, 2017", 5.0, "A lovely place to walk and see Art", "We were fortunate to take a walking history tour of Stanford, and heard about its fascinating history. But there are other wonderful things there - sculpture garden, Art exhibits, Entertainment, bike paths, lovely architecture."], ["Reviewed March 17, 2017", 4.0, "Huge, spectacular campus", "The Stamford campus reeks of wealth and privilege. It is beautifully landscaped and enormous. Worth a visit"], ["Reviewed March 16, 2017", 5.0, "Georgeous Campus", "Have been here before and this time was around to visit the hospital but spent time on the main campus. The Rodin Sculptures are great and I loved the Cactus Garden."], ["Reviewed March 13, 2017", 5.0, "Best college, garden - like campus!", "We were there to visit my son who is a senior. Stanford is a fabulous place to visit, not only it is one of the best colleges in the world, the campus is stunningly beautiful. We just love to visit Stanford."], ["Reviewed March 5, 2017", 5.0, "Best University to Visit", "This is one of the most beautiful campuses in the country. It is also the largest university in the U.S. comprising 80,000 acres. However there are only about 16000 students/ There is a lot to see. The Rodin sculpture garden with the Gates of Hell door. There are additional Rodin statues in the Quad area. Thee Hoover Tower gives a great view of the entire campus and surroundings. Also do not miss the Memorial Church..outstanding architecture\nShow less"], ["Reviewed March 3, 2017", 5.0, "College Baseball at Sunken Diamond Stadium", "If you're a baseball fan in general or a college baseball fan in particular, this is a special place to watch the sport. I come here on occasion to watch my alma mater play the Cardinal. The field is immaculate, the stadium well designed, the concessions are good, and the staff is very friendly and helpful.\nHighly recommended.\nShow less"], ["Reviewed March 2, 2017", 5.0, "Best University in the U.S.", "Has to be one of the most beautiful campuses in the country. Was there for parents weekend. What can I say, I fully understand why its always ranked as one of the top universities."], ["Reviewed March 1, 2017", 1.0, "Baseball at Stanford", "Twelve dollars for a reserved seat. Can't beat that price. Great atmosphere. Great baseball game. Good announcers. Prizes awarded to public during inning relief."], ["Reviewed February 26, 2017", 5.0, "Beautiful campus", "The campus is beautiful. I walked throughout the campus for more than 2 hours and saw the amazing beauty of Stanford. Its beautiful. Hoover tower, museum all are excellent."], ["Reviewed February 25, 2017", 4.0, "Wonderful discovery", "Every time I have friends visiting from France or Germany, Stanford is our favorite tour, never missed the\n- Main Quad (historic and academic center of campus, including the school of Humanities & Sciences)\n- Memorial Church\n- or the Hoover tower [open. 7 days a week from 10am to 4:00pm [tips : the last tickets are sold at 3:30pm]\n- Also like to see the Rodin Sculpture Garden\n\nIt's a wonderful discovery of a beautiful natural campus.\nDon't forget the tip to the volunteer student guide :-]\nShow less"], ["Reviewed February 18, 2017", 5.0, "Beautiful University Campus", "Peaceful, modern campus. Excellent bookstore offering Campus clothing, books, coffee shop and technology.\n2 minutes walking to lots of campus fast food places, but the real value is walking around the beautiful, tree filled campus commonly seen in the Stanford logo.\nWe visit many Universities worldwide, some for history i.e. UK, Ireland and Europe, but from an asthmatic perspective Stanford is one of nicest, modern campuses, surrounded by trees and only a half hour from San Francisco.\nShow less"], ["Reviewed February 17, 2017", 5.0, "Inspiring Campus with many cultural artefacts accessible to any visitor.", "Have been visiting Stanford U [from Sydney Australia] for over 4 decades.\nOne of the worlds great learning institutions.\nVery attractive campus with numerous outstanding buildings and attractions.\nThe University Chapel is one and the Cantor Arts Center is another, of many other\nattractions. The Rodin Sculpture Garden is simply outstanding...some 20 Rodins\n[out of a total of some 200!] on display 24/7/365 outside in a Parisian Garden setting.\nVery easy to get to if you are visiting San Francisco. A 35-40 minute Caltrain ride [relatively cheap/clean/efficient/on time] gets you to Palo Alto. A free Campus shuttle \"Marguerite\" [hop on/hop off] takes you around the campus.\nSimply an inspirational institution, open to any visitor.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Loved it!", "We had a great time exploring Stanford's grounds while on a guided tour, definitely a great motivator for a high school student! Our tour started with semi-formal presentation by a faculty member and answered all possible questions about application & admissions process. After a short break we continued by feet for about a mile and a half walk guided by a student which added more fun and shared first-hand experience about life on campus. My son really liked it here and I believe this visit helped him to see greater opportunities!\nShow less"], ["Reviewed February 15, 2017", 5.0, "Walking around Stanford campus", "Grand campus, beautiful park and historic buildings. Famous tech names on buildings such as Hewlett, Packard, Gates."], ["Reviewed February 15, 2017", 5.0, "Interesting Visit", "Took the Margarite from the Alto Paulo station to downtown... really glad to see the uni campus. Have a wonderful time."], ["Reviewed February 13, 2017", 5.0, "Beautiful campus", "My first time getting an official tour at this prestigious university. The campus ground and buildings are well kept. My dining experience was wonderful. The food taste fresh and the price is reasonable.\n\nYou might not want to drive here since parking is limited. So, it's better to get here by public transportation, you will find the CalTrain station within minutes from the main entrance and there's free shuttle buses through out the campus.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Beautiful Campus with Great Meeting Spaces", "Attended a conference of the Stanford Social Innovation Review. It was held at the Stanford Alumni Center, which is a beautiful facility. The campus is gorgeous - art deco inspired buildings, beautiful landscaping. You can approach the campus on Palm Drive, which has masonry gates and an allee of royal palms - very scenic. The campus is environmentally friendly and makes good use of outdoor spaces. The university seems to marry intellect with social good in the events it puts on. Would happily visit again.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Plan ahead", "I was disheartened to learn that the campus, while gorgeous, is very quiet on the weekend. So quiet that we couldn't find anywhere for our youngest to use the bathroom, that was clean, or anywhere open to eat lunch.\nThe campus is absolutely gorgeous. The few people we did meet were very kind.\nShow less"], ["Reviewed February 8, 2017", 5.0, "Die Luft der Freiheit weht...", "I wish I studied here!. Amazing campus. You don't need to be a genius to figure that out ;) The world should thank to Leland and Jane Stanford for creating this fine institution in this amazing setting. Place to be..."], ["Reviewed February 7, 2017", 5.0, "Amazing University", "Amazed by the buildings especially the face of the church. It was all mosaic tiles and just incredible. This was where Steve Jobs funeral was held. A friend of ours is doing her PhD there and she showed us around. There were several people doing tours around the campus so it is definitely worth a visit. Put on your walking shoes as this campus is very big.\nShow less"], ["Reviewed February 4, 2017", 5.0, "Stunning campus and grounds", "Perfect for running first thing in the morning when I was staying in the Sheraton across El Camino Real; most paths and trails were very well lit (a key requirement, I was there in January so it was dark first thing) and runner and cyclists seems to have priority everywhere. The university buildings and facilities are of course world class.\nShow less"], ["Reviewed February 4, 2017", 5.0, "Innovative and life changing learning school", "Without question, the most desirable education is produced here. Enrollment applications are accepted at a unbelievable 1.5 percent of those applied.\nThis massive \"Farm\" developed by the Stanford family who were railroad tycoons at the turn of the 20 the century has truly had a remarkable record of bringing brilliant students with accomplished academics to new heights of accomplishment. Must stop areas are the Main Quad with Palm oval providing a majestic foreground. Tanner fountain, in its glory, appears before Hoover tower which you can also tour. The White plaza area with its tremendous bookstore is a real HEAVILY RECOMMENDED stop. Do not overlook Cantor Arts museum, it is free entry and free parking on the weekend. History of the Stanfords and rotating exhibits abound in a impressive building layout. The Rodin sculpture garden that fronts the museum makes a pleasant introspective stop.\nThe are 75 minute tours from the red brick visitor center at Campus Drive and Galvez Street at 11am and 3pm. Tours are free. Wheelchair accessible and family friendly atmosphere throughout the entire campus.\n\nShow less"], ["Reviewed February 3, 2017", 5.0, "Life-shaping place", "Beeing there was a true inspiration, an eye opener. Wish to take my kids there before they make major life choices. Wish to have such wide horizon of possibilities visible years ago. Campus with its unique housing is a must-see!"], ["Reviewed February 1, 2017", 5.0, "One of the world's finest universities ... and most beautiful", "Stanford's campus is beautiful - for a stroll through the arboretum, to the chapel, among the buildings, to the bookstore and a snack at one of the on-campus eating choices. Although you can sign up for an admissions tour, a simple visit and stroll on your own will probably be fine. Check the calendar at Stanford.edu before coming, because there are many on-campus events that are open to the public. Visitors ask themselves, \"Why didn't I think of Stanford when I was applying to universities?\"\nShow less"], ["Reviewed January 24, 2017", 5.0, "Incredible", "It's a magical place you have to see. The architecture and atmosphere, people around... everything is amazingly beautiful."], ["Reviewed January 22, 2017", 5.0, "Impressive campus, great sessions", "Go there and feel the vibe of one of the leading innovation hotspots in the world, while getting carried away by the very particular architecture on campus..."], ["Reviewed January 20, 2017", 5.0, "Great place to take a walk", "The Stanford University is a nice place to talk a walk, drink a coffee and enjoy the nature. In the winter try to get there early, so you have a lot of time with daylight."], ["Reviewed January 17, 2017", 5.0, "World class University", "I wanted to look for a short course, so I visited the university. It was difficult to find a parking spot, until I got one. Overall, I like the environment. I continue searching for short course via internet, after feeling comfortable visiting the University complex."], ["Reviewed January 15, 2017", 5.0, "Don't limit yourself to the campus tour", "Graduated from there a long time ago but was there again with my daughter for a campus visit. A key feature of the campus of this great university is its expanse; the campus tour took us to the key buildings in the heart of the campus (the main quad) but there was so much more. We spent some time visiting the SEQ Courtyard with the newer science/engineering buildings. The Rodin Sculpture again is worth a visit too. Not many places to eat on campus though, we got a quick bite at the Tresidder Union. Take your time and just walk around ...\nShow less"], ["Reviewed January 5, 2017", 5.0, "One of World's greatest universities", "Beautiful location in Palo Alto, about 35 miles south of San Francisco. Classic, Spanish inspired architecture, outstanding athletic facilities, 8,000 acres to roam around on bike or foot, an iconic church in the middle of the quad and academic facilities and achievements second to none. Well worth the visit.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Energy!", "I visited the campus during a work trip to Palo Alto. I walked around in the late afternoon hours and it was very pleasant. Great to see smart people working hard to obtain a good education. I felt inspired after my short time here. :)"], ["Reviewed December 28, 2016", 5.0, "Stanford Campus is Gorgeous!", "I've been here many times yet I still get lost on this gorgeous, sprawling campus. The Spanish-style architecture is simply lovely as are the overarching trees and other landscaping. I have a LOT of great memories here. Just be sure you use your GPS!"], ["Reviewed December 27, 2016", 5.0, "Stanford Campus and Museum - Beautiful and Amazing !", "We visited the Stanford Campus and Leland Museum on campus. So much to see and so little time. I will return and spend and entire day. The gorgeous Campus is massive in size. Its like a small city. The Museum was bigger than I thought with a quite a bit of stuff on displays. Its immaculate and very well organized. The huge statues inside and outside were amazing. Its definitely worth visiting and sharing info about.\nShow less"], ["Reviewed December 25, 2016", 5.0, "A spectacular campus!", "From the eucalyptus grove as you enter the campus and the big, oval-shaped Campus Drive--circling the perimeter of this expansive property, the Stanford campus blends Spanish colonial architecture with sleek, modern design in a way that lines, vistas and people all flow naturally, calmly and gracefully. It is at once a place of meditation and of achievement. And it is in the heart of Silicon Valley to boot!\nShow less"], ["Reviewed December 20, 2016", 5.0, "Impressive!", "Must seen in Palo Alto! The whole area is impressive. Buildings and parks. Probably you could put my whole University in their gym :) Don't miss the tower to get the big picture."], ["Reviewed December 15, 2016", 5.0, "Lovely campus and arts, concerts, etc.", "Love to walk on campus. The smell of lavender blossoms in the fall before they're cut...the Spanish styling of the architecture, amazing. Great concert halls and music events regularly. Bing Concert Hall is amazing! I am not a student or alum of Stanford, but a local who enjoys the campus and offerings of having a university like this nearby.\nShow less"], ["Reviewed December 13, 2016", 4.0, "Huge, Impressive", "The Stanford Central Campus is huge and certainly worth a visit, as it is the dream school of most applicants. You may find long tours of Chinese during your visit. The bookstore is one of the nicest and user-friendly I have found on US university campuses. Include on your visit the Main Quad, Frank Lloyd Wright's Hanna-Honeycomb House, the Hoover Tower, Lou Henry Hoover House, Memorial Church.\nShow less"], ["Reviewed December 13, 2016", 5.0, "Excellent tour for anyone interested", "Stanford offer campus tours not only for prospective students, but for everyone interested in the history and present status of the campus. Definitely worth a visit when you're in the area."], ["Reviewed December 7, 2016", 5.0, "The head of the Silicon Valley (still searching for its heart)", "It is a beautiful campus with lots of storied buildings. If you go to the psych department you can see the basement where Dr. Philip Zimbardo conducted his 1971 Stanford Prison Experiment. Don't miss the Stanford Book Store and the cafeteria at the Student Union. The place is particularly wonderful during the spring and summer, when student spirits overflow onto the grassy fields.\nShow less"], ["Reviewed December 5, 2016", 5.0, "Made me want to go back to college!", "Friend and I took our grandsons for a trial weekend of classes. We spent some time driving and walking the campus and going to the bookstore.\nWhat an incredible place, beautiful historical buildings surrounded by lots of nature. Would need a lot more time to fully explore. Wish I could be a student here.\nShow less"], ["Reviewed November 27, 2016", 5.0, "Beautiful Campus", "What a great place to visit. Parking is free on the weekend. Don't miss Hoover Tower and the Memorial Church"], ["Reviewed November 20, 2016", 4.0, "Looking for Sculptures", "We happened to visit the art gallery on a day it was closed so we toured the campus looking up the various sculptures listed on the campus map.\n\nThe current map was somewhat dated, but we were able to find most of what we were looking for.\n\nWe especially enjoyed the sculptures crafted by the Papua New Guinea sculptors who came to the university. These were situated in a small treed area and were very interesting and fun to view.\nShow less"], ["Reviewed November 19, 2016", 5.0, "Perfect city in Sillicon Valley", "Palo Alto is located in northern Silicon Valley, and one of the main attractions is the Standford University, with an amazing architecture where highlights the church and the beautiful gardens around, also in Palo Alto you can find the Standford Shoping Center with many of the most important stores in the country. And if you visit this city you will find that is almost perfect in terms of cleaning and landscapes, and also you will have the possibility to enjoy a dinner in one of the fancy restaurants in one of the most expensive cities in the United States.\nShow less"], ["Reviewed November 16, 2016", 5.0, "Stanford campus...beautiful", "Stanford has devolved into a beautifully landscaped campus since the early 70s. Some of the old ugly buildings have been removed and replaced with others that tie into the original architecture."], ["Reviewed November 15, 2016", 5.0, "Fantastic", "I was very surprised prided with Stanford. Great, easy going my, yet very focused environment, definitely the place one wants to be!"], ["Reviewed November 13, 2016", 4.0, "Pretty buildings and church", "I visited Stanford Uni with friends. I really liked the gardens and the church/chapel. It was good to walk around."], ["Reviewed November 12, 2016", 5.0, "Heaven", "Stanford is definitely a place to visit. Its architecture is simply amazing. The buildings seem to glow during sunny days. If you get hot, no problem! Just try fountain hopping, a very common tradition between students."], ["Reviewed November 11, 2016", 5.0, "Beautiful campus, great views of the Bay", "Built in the Spanish style, Stanford has a beautiful campus. The iconic Palm Drive, leading to the Oval and the chapel are a must-see. A visit to the Hoover Tower gives you a great view of the Bay on a clear day. The Cantor museum and the Rodin sculpture garden outside it are fantastic!\nShow less"], ["Reviewed November 10, 2016", 5.0, "fabulous campus", "If I could go back to school, this might be the, place I would choose. Just gorgeous, people were nice and helpful, easy to get around, but very very large!"], ["Reviewed November 7, 2016", 5.0, "Beautiful campus", "Went for a cheer clinic and football game. What a great experience. Will be back for sure. The directors of the cheer clinic were amazing!!!"], ["Reviewed November 6, 2016", 4.0, "Beautiful Campus", "On this large, beautiful campus, the top attractions are Hoover Tower with views over the entire campus (and nice displays about President Hoover and his remarkable wife), the Cantor Art Center (closed on Tuesday's, but the Wonderful Rodin garden is always open), and the Memorial Church (lots of mosaics and stained glass). Plenty of sculpture on the grounds.\nShow less"], ["Reviewed November 3, 2016", 5.0, "our 50th Class reunion was great!", "The Stanford campus changes every year. We go to each 5 year reunion, this being our 50th year. Again, more new buildings and more construction. You really have to take a campus tour to keep up!"], ["Reviewed November 3, 2016", 5.0, "One of the most beautiful campuses in the country", "Stanford is a wonder to behold. A beautiful campus designed for biking and walking with free bus service. Don't drive here. Park at the train station and take the free campus bus, M-F. Grab a bite to eat at the COHO coffee shop and visit the museums on the campus. Stanford should not be missed if you are in the area\nShow less"], ["Reviewed November 1, 2016", 5.0, "Beautiful place to wander on a sunny afternoon", "We stopped to see the campus because my husband is taking grad classes online and he wanted to experience the campus while we were in the area. It is a beautiful place to wander around -- peaceful and historical. I wish we had a tour guide to tell us the history behind the buildings, but even exploring on our own was great fun.\nShow less"], ["Reviewed October 31, 2016", 5.0, "A beautiful campus that rich in history and fun to explore", "We really enjoyed exploring the sports area to watch the athletes train and were really pleasantly surprised how friendly they were. We also liked seeing all the awards won in the olympics\n\nThe campus is amazingly big and beautiful! Our daughter really enjoyed the positive vibe you get across campus.\n\nGlad we spent time to experience this as many other universities are pale in comparison\nShow less"], ["Reviewed October 27, 2016", 5.0, "Beautiful Campus", "Very pleasant place to walk around. Elegant buildings and church. Robin's sculptures in the main quad. Having a cup of coffee at the book store is enjoyable."], ["Reviewed October 27, 2016", 5.0, "Education at it's best!", "Walking around one of the most prestigious universities in the world, makes you feel like going back to school again.\nAmazing architecture and design, serenity and wisdom, art and technology, all packed in one enormous campus! !\nI did not have a lot of time to fully enjoy my visit but managed to go through the main building, church and tower. I will definitely go back soon and spend more time. I missed the Rodin garden with his famous sculptures, so a second visit is needed! ! There are also guided tours if you like.\nShow less"], ["Reviewed October 26, 2016", 5.0, "Always a fun walk to stroll the campus", "As you stroll the lovely campus and admire the bell tower and architecture, take time to stop at the outdoor eating places students visit. It's lively and most days, bright! Beware of wild bikers, on sidewalks, pedestrian paths, just about everywhere."], ["Reviewed October 25, 2016", 5.0, "Stanford University Medical Center/ Stanford Chapel", "I travel to Stanford for world class specialists to treat some rare diseases that I have. So many brilliant minds in one place!\nIf you have an opportunity to go to Stanford, don't miss the Chapel. It is so beautiful, calming and a place to pray or reflect on the scriptures and thoughts that are engraved on the walls. The Stnafords put tremendous thought into this Chapel before entrusting their dreams to an architect nad their vision is still clear over 100 years later.\nThe big campus bookstore is a treat too!\nShow less"], ["Reviewed October 23, 2016", 4.0, "A Beautiful academic Setting", "Stanford blends the traditional quadrangle with outer modern buildings all with red brick roofs in a Spanish and Sandstone type of design. The buildings are placed among old oak trees and other trees to give you a real rural feel. It does a good job of providing lots of pedestrian-only access, such that cars have to park pretty far away. We were attending a Stanford Reunion, which was efficiently and professionally handled to make you feel very important.\nShow less"], ["Reviewed October 20, 2016", 5.0, "Outstanding Beauty and Historical Gem - A Bucket List Must", "Ok, I may be biased as an alumni, but I never get tired of visiting this beautiful campus with it's never ending archways and 100 year old palms. The crown jewel of course is Memorial Church built in 1903 by Jane Stanford as a memorial to her husband Leland. Another point of interest is the Mausoleum where the Stanford family and their young son are laid to rest. The stunning Angel of Grief with he outstretched wings is a tribute to Jane Stanford's brother and is not to be missed. The students have a big party there each Halloween, but I never went as it sort of felt disrespectful to these amazing founders of the university. You cannot leave without visiting the Hoover Tower where President Hoover's archives reside and as you stand at the top of this tall landmark, the view is simply breathtaking and hard to forget. I could go on and on, but please visit, it is magical. I didn't realize how fortunate I was to spend time there when I was a student, but I do now as an adult and each time I visit, I am more impressed!\nShow less"], ["Reviewed October 19, 2016", 5.0, "Historical place to visit", "Was there in Stanford for a week to attend a course in leadership. Great campus which is kept in great shape. Place has lots of historical interest for people who like going to such places. It is ideal to have somebody who knows the place with you. We were taken around by a permanent employee of Stanford for an hour long tour to the place and we enjoyed every bit of it.\nShow less"], ["Reviewed October 18, 2016", 5.0, "You just need to go!", "This campus is full of old architectural treasures. You will definitely enjoy your stay here. Wish I have checked on other areas aside from the Main Hall and the Church as I know the best places were well-hidden in this magnificent campus."], ["Reviewed October 17, 2016", 5.0, "Seriously? You need to rate this place?", "Duh. This is a tourist destination, being one of the top universities in the world. The campus is a mini-city, gorgeous and vibrant. Stop by the Visitor's Center to sign up for a guided tour."], ["Reviewed October 17, 2016", 5.0, "Amazing campus, chock full of history", "We walked to the campus from our relatives' home on Palo Alto Avenue. It's an unbelievable campus, with a fabulous cactus/succulents garden, quite close to the Stanford family catacomb. Hoover laid out the streets of Palo Alto; and met his wife on campus. Buildings are stunning and you can learn alot about the area from the turn of the 19th century to the beginning of the 20th. Don't miss it.\nShow less"], ["Reviewed October 13, 2016", 5.0, "Beautiful, Historic Campus", "The architecture is of note: stoll into the Quad, peek into Memorial Church. The art collection and statuary Stanford has amassed (near the art buildings) is world class. A drive around Campus Dr. loop gives you a feel for the size and variety of the property. The bookstore and cafes around campus fountain are good to visit. Or walk the oak lined avenues nearby. Certainly a fine college for high school students to visit. Nice bustling but friendly atmosphere.\nShow less"], ["Reviewed October 12, 2016", 5.0, "It's always a pleasure to visit this campus.", "One of the world best Universities. I love to go to the book store, walk around the quad and the Hoover Tower and enjoy the art pieces and the Legorreta's architecture at the Business School."], ["Reviewed October 11, 2016", 4.0, "Beautiful campus full of historic buildings", "Beautiful architecture and buildings full of history. The cathedral is a must visit. Be prepared for a lot of walking as the campus is large."]]}}