{"Staples Center": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Staples Center", "url": "/Attraction_Review-g32655-d616425-Reviews-Staples_Center-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/ba/13/9e/photo0jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3012"}, "address": {"@type": "PostalAddress", "streetAddress": "1111 S Figueroa St", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90015-1300", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Great Sports Venue", "Like all major sports arena, it is crowded and the food and drinks are expensive. But there were plenty of choices for food. Some vendors had long line ups and some not as bad. Although we were at a sold out Kings game, it wasn’t too crowded to walk around. Line ups for the boys bathrooms at least weren’t bad.\n\nThere is airport style security on the way in and no professional cameras are allowed. It was fairly easy to catch a taxi after the game. We just walked a couple blocks away.\nShow less"], ["Reviewed 5 days ago", 4.0, "Great Sports Venue", "Home to the Los Angeles Lakers and Clippers, this is a beautiful and functional arena. The suites are luxurious with plenty of food and beverage. Being a newer arena, it is designed for easy ingress and egress.\nBest to take public transportation rather than park if you have a choice.\nShow less"], ["Reviewed 1 week ago", 5.0, "Hockey game", "I attended a hockey game with my nephew had a awesome time. Facility is clean and handles crowds very well."], ["Reviewed 1 week ago", 5.0, "The LA Kings won !!!", "Stumbled into some VIP section tickets and it's definitely a great experience. Great seats/views. You order from a menu of tasty food and the \"attendant\" brings it --- no lost views of game changing scores."], ["Reviewed 1 week ago", 5.0, "Our first visit to Home of The Lakers/Clippers", "Visited during All Star Weekend and was immediately jealous of the wide variety of food (including McDonalds) available for concessions. Plenty of restrooms and space to walk around. Such a famous place and glad we were able to visit"], ["Reviewed 1 week ago", 5.0, "No LaVar but still very good", "We missed the Circus Show, not Ringling Bros but LaVar. The Kings are so entertaining, I must admit the AEG did a great job with the site."], ["Reviewed 1 week ago", 5.0, "An great experience!", "I visited the Staples Center with my sons during the 2018 NBA all star weekend. The best sports venue I have ever visited, with a good atmosphere and endless features. Although our seats were up on the top we could see very well. A great experience!\nShow less"], ["Reviewed 1 week ago", 5.0, "My first NBA match", "I've been in LA twice in the past 4 months and I had my first basketball match in the states here at the Staples Center. Fantastic and unforgettable experience!"], ["Reviewed 1 week ago", 5.0, "WWE Monday Night Raw", "I have attended many events at the Staples Center in Los Angeles, California. It is an awesome venue for Pro Wrestling, NBA, NHL, and Concerts!"], ["Reviewed 2 weeks ago", 3.0, "A pilgrimage for Lakers' fan", "If you are a Lakers fan, this is definitely one of your bucket list. I am blessed enough to visit this place. you can see the statues of great legends such as Shaq, Kareem, Jerry West. But I wish they have more jerseys other than the new recruits. I'm more of an old school guy. And I wish they could have a guided tour to explore this building. When I was there, all the doors were locked, and I can't even enter the court.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Go to Place in DTLA", "This is a must go and go to places in DTLA for events, party, night life and most importantly the matches."], ["Reviewed 2 weeks ago", 5.0, "A once in a lifetime opportunity!", "My teenage son and I had the amazing experience of attending Coby Bryant's retirement Jersey match. It was an amazing experience. Even though it was a full house the crowd was handled well and it only took about 20 minutes to get in the doors and seated. Seating very comfortable, enough room for long legs.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing", "This is really an amazing arena.\nThe surroundings are in construction so you need to have patience to get there but after parking around you are in a really great place.\nThe statues of the legends are fantastic. Shaquille O'Neal hanging in the ring is amazing.\nThe pre-game activities are a must.\nRestaurants around the area are great also for either before or after the game.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Saw the Lakers", "The arena was nice. Lakers won. Like the location and all the shops near. There were plenty of options to choice from to eat at."], ["Reviewed 3 weeks ago", 5.0, "an amazing arena", "a great arena for watching Basketball, great atmosphere and lots of pre-game events going on outside"], ["Reviewed 3 weeks ago", 5.0, "Outstanding facility", "Wow is all I can say about the entire experience. Went to experience an oilers Kings game. The facility is first class. Well laid out for everything you could want. The opening ceremonies light show was spectacular. My first visit I was very impressed"], ["Reviewed 3 weeks ago", 5.0, "LA Clippers Game!", "I'm an avid basketball fan from Toronto, and wanted to see a game at the legendary Staples Center while I was in town. Great location downtown LA near a nice square with shops, restaurants and bright LA lights. It was a week before the All-Star Weekend comes to town, so they were busy getting things prepared, but that didn't take any focus away from the Clippers that night. As I walked in through security, I passed by all the iconic statues outside the arena: Jerry West, Gretzky, the new Shaq statue, Magic Johnson, Kareem, etc. Truly amazing to see in person. If you've ever been to the ACC in Toronto, that's all I've got to compare this to so keep that in mind. It seemed a lot smaller than the ACC but the seating was closer to the court and more gradual inclination. As a result, the row directly in front of me was too close and blocked our views more than it would at any other stadium. With that being said though, I definitely felt closer to the court and the action, which was great. I got the tickets off StubHub for next to nothing and wayyyyy less than face value. The food was actually pretty good in here also. Overall great night, great game, and awesome LA experience. Would try to see the Lakers here next time because that's a whole different vibe.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Lakers game and LA Kings Game", "We came here twice once for an LA Kings game and once for a Lakers game. It's all really easy to find your way and heaps of staff around. You can't take backpacks or large handbags in. You can take a small A4 notebook sized bag in. Also you can't bring in cameras or go pros. Phone cameras are fine. If you do bring one you will have to check it and pick it up at the end of the game. The food was a little expensive bit that's to be expected at these kinds of events. We sat right up the top for the LA Kings game and the view wasn't bad. You could see what was going on really well in fact it was almost better to be up there for the hockey game. For the Lakers game we sat about half way up which gave a great view. I wouldn't of wanted to be up higher for the Lakers game.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Killer evening!", "We went to see the Killers in concert. This was the best venue I have been to as far as ease of getting in and out of the parking lot, in and out of the venue, good eating opportunities, good restrooms. Very happy with this venue.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice Venue for Basketbal!l", "Attended a recent Clippers Game at the Staples Center. The seating and view was good. The venue is easily accessible and had plenty of concessions."], ["Reviewed 3 weeks ago", 4.0, "Good size arena to watch an event", "Good size arena to watch an event, never really had problems finding parking lot not too far away .feel pretty safe."], ["Reviewed 3 weeks ago", 4.0, "Best visit yet! Well sort of.", "We came to see The Killers' first date at Staples on thursday night. It was the first time we had an awesome experience from beginning to end. I digress. I wish the event staff could have been more attentive. There was jerk with an aisle seat that filmed the entire show on his phone. I'm not bothered that he bootlegged or live streamed the entire concert, but what does bother me is that he stepped out into the aisle to get a clear shot with no redirection whatsoever from the event staff...even after I made her aware of the issue. This wouldn't have happened at The Forum. The ease of entry and efficiency of the food and drink vendors are commendable however. Nice try Staples, but not quite there yet.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "NBA!!!", "We visited it to watch an NBA game.It is an activity that everyone must do.An experience of a lifetime especially for someone who cannot do it usually.Strongly recommended."], ["Reviewed 4 weeks ago", 5.0, "Basketball", "Went to watch the Clippers. Unreal night. Great facilities. Great night for kids as there is lots of entertainment"], ["Reviewed 4 weeks ago", 4.0, "nice", "i haven't entered inside, but i just visited the outside of it, i liked it as there are statues for the most famous players who played in this center.\nit is glwoing in the night, which give the area around a very nice look.\nwhen i went there the clippers were playing and there was a booth for FOX sports outside which was fun.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice arena", "Staples center has the same problems all places have, way over priced food for most items, sight lines setup up for the luxury box crowd, and not the best area around it to hang out after a game. But those are issues every arena has to one extent or another. What it has going for it is some of the nicest upper deck seats in California, a huge scoreboard that everyone can see, and some nice places where you can get food for less than $15 per person. I would caution those who have balance issues from buying tickets more than half way up the top deck for it's steepness, but otherwise recommend seeing a show there.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Always fun", "I have been here for all sorts of different concerts, games, and events. I have also been to tons of other venues and I think this is one of the better ones. There are plenty of places to park and although LA always sucks for traffic there isn't a total cluster when leaving like you can experience at other venues. There are plenty of restaurants and bars nearby. The venue is kept up nicely so it says clean and in good repair. Inside you have all the amenities that you could want and even the worst seats are pretty good.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "great attraction", "Great arena with good organization. Many shop available inside the arena. Great for Hockey games and shows"], ["Reviewed 4 weeks ago", 4.0, "great forum for basketball \"Lakers\", hockey, :The Kings\" and concert venue.", "Great sports and concert venue in downtown LA, with easy parking , good in and out, and good layout. Multiple bathrooms without fancy tile but clean new paint and linoleum floors. Great bars and food stands and a very Funshua sports arena that is 20 years old. Great for a game or concert venue.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "WATCHING THE LAKERS AND CLIPPERS", "Saw my first game of Clippers. vs my home team the Raptors. The service was a little slow for the premium seating but overall very good value. So much fun."], ["Reviewed January 23, 2018", 5.0, "Great basketball venue", "Our family group watched a Lakers game at the Staples Center during our most recent visit to LA. Getting to the venue proved problematic as we had decided to use the Metro Rail to downtown and were planning to get off at Pico station. Unfortunately there was a problem on the line which delayed us and then the queuing traffic in the streets leading to Pico also slowed the train's progress. We had allowed plenty of time for the journey and looking at the traffic congestion as we neared Pico I was still glad that we hadn't driven in.\nThere didn't seem to be many bars close to the Center so we headed straight in and bought pre game drinks inside, where the food and drink is expensive but convenient.\nWe had a great view of the game and there was a really good atmosphere, so it was well worth going.\nThe traffic congestion was even worse after the game, with a lot of queuing traffic leaving the Staple Center car park and trying to get to the 10 and 110. We walked in the opposite direction along the section of S Figueroa St that was still closed to traffic and had drinks in Tom's Urban bar, leaving the traffic behind us.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Great night out!", "Wow! what a wonderful experience! This facility was clean well organized. Went to a Penquins hockey game last week, expected drunk, loud people. However, it was the complete opposite fans from opposing teams siting together cheering together! Very refreshing!"], ["Reviewed January 23, 2018", 4.0, "Go Lakers!", "We attended for the Lakers v Pacers game - and the Lakers won! Lots of eateries and bars, and easy to find your seats. A great stadium."], ["Reviewed January 22, 2018", 5.0, "Great grand big venue - not an Angelino bias.", "I have been going to the Staple Center since it opened. It was supposed to be a huge upgrade from the FORUM. Now, it has added a neighboring LA live with theaters and restaurants and a smaller venue. I have seen concerts, NBA, NHL, XGAMES and WWE events here. It's like there are no bad seats. Even the 300 seats are pretty good. The staff is helpful, bathrooms are clean. There's a stubhub ticket place right across the street. Parking is tricky if you're visiting, you have to park in a private lot which is usually cash only. You can park in the convention center or basement of LA live. No validations for staple center events. Great venues, plenty of concessions and plenty of bathrooms between sections. Easy to navigate in and out.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great game", "I have been to Staples center to attend a NBA game between LA Clippers versus Houston Rockets . Excelente infrastructure and a lot of good options to eat . Besides I have had one of the cheapest tickets , the vision from the sector 3 were great and really not so far from the game. Lots of goos options to park around , in a cost range of 10 to 30 US Dollarst\nShow less"], ["Reviewed January 22, 2018", 4.0, "Mixed feelings", "The center itself was nice looking and set up well but the outside and parking or just trying to pick someone up is outrageously difficult. And the location was centered in some areas I would not walk around other than directly by the center. It was a great game though.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Been here for Basketball, Hockey and music!!", "Staples Center is great. Been here for Basketball, Hockey, and music!! It is located downtown, so easy access via freeways, bus, etc."], ["Reviewed January 21, 2018", 5.0, "LA Lakers game", "Go for the atmosphere even if you're not a fan of basketball!! Fantastic area around the Center also!"], ["Reviewed January 20, 2018", 5.0, "Great", "Friendly and helpful staff. Lots of places to eat and drink around and inside the center. Kept really clean! Lots of toilets too. Great place."], ["Reviewed January 19, 2018", 5.0, "Basketball", "Having just arrived in LA, and having not slept in 36 hours we did the obvious thing any normal person would do and went straight to b.. No - not bed, we went to Basketball instead!! We went to the box office and they had a good selection of tickets but they ones left were more than we had planned on paying so she suggested we nip over the street to a well Ik own ticket resale company where we managed to get VIP seating at a snip of the price. The staff were great, as were the facilities and whilst we didn't eat there appeared to be plenty of choice (including a 5 layer carrot cake - not sue how we resisted!)\n\nThe layout of the seats is such that you have a great view wherever you sit, and the home team won so the atmosphere was fab. A great venue for any sporting fixture.\nShow less"], ["Reviewed January 15, 2018", 4.0, "Great for a NHL Game or Basketball Game", "Our adventure started off traveling to downtown. We toured through the Grammy museum which tools around 3 hours, then over to the game at the Staples Center, followed by a nice supper sitting outside on one of the local restaurant patios.\n\nWe picked up tickets for the game on stub hub for $30. Seats were in the upper section, but views are excellent from anywhere. If you are a fan of the Lakers, Kings, or have not been to any or many hockey game or basketball games - you do not have to cash in all your vacation funds to catch the game. There is also multiple ticket venues on location or for stub hub in the local vicinity.\n\nThe area around the Center is very new, had lots of great restaurants, and a few other venues.\n\nGreat way to catch a game!\nShow less"], ["Reviewed January 12, 2018", 5.0, "Expensive but brilliant", "The folk at the Staples centre have it all figured out. From the parking, the marshaling of crowds, the showmanship etc... everything feels polished and well thought out. As a rookie the only thing that caught us was that you have to print a hard copy of your parking permit (phone was not acceptable.)\nShow less"], ["Reviewed January 6, 2018", 4.0, "Nice arena good sight lines if only the Lakers could win", "Had the chance to catch the Lakers at the Staple Center. It is a good arena than is showing its age already. Sight lines are good. Food and concessions have great choices but it’s a destination for what surrounds it with LA Live. I did like the collection of statues of Laker and Kings greats outside to see. The banners in the rafters show the once great franchise history\nShow less"], ["Reviewed January 4, 2018", 5.0, "Great sight lines, bring money, and have a good time", "Great sight lines, bring money. Not an egalitarian local at at. The mega wealthy have their locations, either on the floor or in their private boxes and many of us are content to sit in the rafters. Great food and beverages and the location is superb. If you are at a convention you can cap off a day with basketball, hockey, or a concert. Hotels are nearby and the Metro station is a block away. Parking can be a pain and the lot owners charge based on the event. We always take the Metro. Easier to park elsewhere and avoid the crush of cars on Figueroa. Amazing the number of limos outside before a Clippers game.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Lakers at Staples = Must do", "What a great night. Our youngest daughter is 11 and plays basketball, so to be able to see the Lakers at their home stadium all the way from Australia was the highlight of our recent trip! We bought our tickets from viagogo in Aus dollars which didn't cost an arm and a leg. We even managed to be in the premium section which was an added bonus.\nWe were staying at Anaheim so traveled by uber to and from which was a lot easier and cheaper than we expected!! This is a must do for sure..\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great to watch the Lakers", "This is one of the most popular arenas in the US. We watched a Laker game and it was great. Lots of celebs in the crowd. It's remarkably large. The sets in the upper section where we sat are a long, long way away from the action. As long as that doesn't bother you, you'll have a blast. They could use a few more food options. The line for security for 45 minutes long to enter. Plan accordingly.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great Concerts", "i have seen many concerts at Staples and have always gotten pretty good seats. yes it can be expensive, the food and drinks are outrageous but the best of the best perform here,"], ["Reviewed December 31, 2017", 5.0, "Great place to watch Lakers", "Went to watch Lakers' game. Part of LA Live area. Building is clean and entry is orderly. Must visit in LA."], ["Reviewed December 29, 2017", 5.0, "Excellent venue for basketball games and concerts!", "I've been to the Staples Center about 10 times for Lakers and Clippers games. The views are pretty good even in the further seats. The premier VIP seats are nice because you can order food and drinks from your seat and have it delivered right to your seat... no need to stand in line and miss any part of the game. The closest paid parking is $30 but if you're willing to come an hour early and walk a few blocks you can park for free on the street. There are some good bars/restaurants nearby to grab some food and drinks before or after as well. I highly recommend attending this venue... clean, nice, and usually free gifts :)\nShow less"], ["Reviewed December 28, 2017", 4.0, "Great experience", "We had a great night - venue is easy to navigate around, excellent atmosphere, lots of eating options in and out of the stadium. Lakers were poor and seats cramped but it didn’t matter"], ["Reviewed December 25, 2017", 4.0, "A must for sports fans.", "Great stadium with bars and snack stands. Friendly staff and very easy to get in or out. I chose the metro train instead of car."], ["Reviewed December 24, 2017", 5.0, "Staples Center is part of a fantastic sports entertainment hub", "Staples Center is a glitzy looking stadium that hosts many Los Angeles sports franchises and hosts events and concerts for some of the most famous acts in the world. The stadium is in impeccable shape and is truly the best arena I have ever been to. They have a wide variety of food and many vendors so the lines aren't too long. After the game there is extra entertainment to be had outside of the stadium at LA Live. I would definitely recommend making a trip out to this arena.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Great family night out", "Lots of excitement, fun, cheering, and fantastic watching their skills. Lots of crowd interaction with basketball games, great food and souvenirs."], ["Reviewed December 21, 2017", 5.0, "Stevie Wonder's House of Toys", "A fantastic holiday concert by Stevie with special guests Tony Bennett, Ray Parker Jr, Paul Jackson Jr, Ricky Minor, and a great performance by the lovely miss Jade Novah!"], ["Reviewed December 20, 2017", 4.0, "Great Venue", "Staples Center is the best arena on the west coast. NYC has Madison Square Garden and Los Angeles has Staples Center. What I like about Staples Center that is located in the heart of Downtown Los Angeles next to the Convention Center. If you are a music to a sports fan you will enjoy the great venue of the staples center.\n\nWhat I like about the Staples Center you have numerous food and dinning places. Also some great lounges with bars. When it comes to seating you have several options. From seats to luxury boxes. I have been to staples centers hundreds of times. If you are seating in the luxury boxes for basketball games it's much harder to see then a hockey games.\n\nYou have private lot parking. I highly recommend taking a taxi services. As parking can be a hit or miss.\nShow less"], ["Reviewed December 15, 2017", 5.0, "I love this place", "I always enjoy the Staples center. Very clean! These fans are loyal!! There are plenty of concession stands open during games and although the food is over priced it’s still decent tasting. Beware of the parking lots that offer so called valley parking!! We waited an hour to get our vehicle after the game\nShow less"], ["Reviewed December 15, 2017", 2.0, "I really don't know how much more I can take of this place.", "We go to Staples a lot, I mean about 12 times a year. We are sort of stuck in as much as some events we can only see there. I really can't stand going there at this point, it only gets worse every time. The parking, the service, the food, and the lack of women's bathrooms is terrible and they don't care. They think they have a captive audience. I have taken to driving out of town to see the same event just to avoid the misery that is Staples Center.\n1. Parking: The pricing is crazy, it can be anywhere from 25 to 50$ depending on the event. If you are handicapped, but not wheel chair bound you are going to be miserable by the time you get to the venue. They will try to force you to park in these structures that are at least a block walk from the venue. This is illegal and I have just about had it. There are spaces right in front of the venue, none handicapped marked and filled with God knows who, but not the people that need those spaces. You can arrive over an hour early and it matters not. So the start of your venture to hell is arguing with the parking attendant with a handicapped pass in your hand.\n2. Getting in: If you have Flash Seats which means you get in with your credit card or Drivers License, that is going to take some time. The staff gets confused and has all but the right information. When you say you are sorry, but you had no choice offered but Flash Seats, you will be told you are wrong, that you should have gotten paper tickets. This would be wrong. Some events do not allow for e-tickets. You go with Flash Seats or you don't go. And they speak to you like you are an idiot. This is especially fun when you have a delayed child with you that just wants to get in to the event.\n3. Don't Ask Where Things are. They Don't know: Being disabled is something many of us deal with us daily. I plan my trips so I know how far I can walk and then how far I can keep walking without falling. Now, I have walked a block to get to the venue, now I am standing for 5 minutes while the staff tries to figure out Flash Seats, and the fun has just started. My child wants his face painted. I ask where is that. I am sent in the wrong direction walking around this huge venue. I ask another and am finally sent in the right direction. I pass the two staff members who insisted I go the wrong way. I mention in a calm voice, you sent me the wrong way, just so you know, some of us have a hard time walking. The response I got, \"My bad.\" WOW!!!!\n4. Don't buy food: The lines are absurd, the food is awful and the prices are absurd. I don't mind paying 10$ for a plain, little hot dog, but when it also sucks, well that is not fun. But hey, if you want hard liquor at a Children's event, no problem, have a double martini and drive your kids. Disgusting.\n5. Are Those Really Your Seats?: You get to your seats and someone else is in them. At this point I really need to sit, feet numb, child flipping out. I ask for help, no one \"does that.\" Finally an attendant shows up. He sees my tickets, that are of course, exactly where they should be. He looks at the other tickets, clearly wrong, but we are going to discuss this? No, we really are not. I need to sit down please. I am at this point begging, just let me sick down and you can figure this out. He is holding my tickets saying, \"I know you are in the right seats, but wait while I try to figure this out.\" Seriously. The people were moved where they belong (maybe had someone helped them in the first place they would have not ended up on the wrong side of the venue. The lights go down, the show is starting and my child is still not seating and is crying.\n6. Disney on Ice was great. Take your kids. Just take them to a different venue if you can. And again, we were there over 1 hour early!\nShow less"], ["Reviewed December 12, 2017", 5.0, "LA kings", "My boyfriend and I wanted to see what an LA NHL game would be like. We sat in the PR1 section and thought this was pretty good. We have been to many arenas around Canada and the US and both agreed the staples centre was very modern and clean. Everyone at the game were so excited and lively. The arena staff did a great job at keeping the crowd engaged and entertained. The LA Kings won and there was a party in the stands. Overall this was one of the best NHL games we've ever been too. We recommend checking this out!!\nShow less"], ["Reviewed December 7, 2017", 5.0, "WOW", "First time in my life to see a NHL game and in the area it make even more perfect Biggest station I have been on for ice hockey and everything was perfect here and very good service from staff."], ["Reviewed December 6, 2017", 5.0, "Go LAKERS, CLIPPERS and KINGS!!!", "Ive been here a few times and its exactly what you would expect from an arena. The dope part comes from LA Live (The area right outside of the arena) where you can take pictures with bronze statues of some of the greatest athletes of our time.\nShow less"], ["Reviewed December 3, 2017", 5.0, "guns and roses", "we went to guns and roses on 24th of November in the staples center is was really fantastic. great seats and great performance of guns and roses."], ["Reviewed December 3, 2017", 5.0, "Great!", "We had a blast at the Lakers vs Clippers game. The arena has plenty of alcohol choices especially beer choices. More food choices than I've seen at an area before. I would defiantly take the opportunity to see a show or game here!"], ["Reviewed December 1, 2017", 5.0, "A slick customer experience", "Having some spare time on a business trip searched what was on offer in LA. I had three choices Bruno Mars at the Apollo, Guns and Roses at the Forum and a home LA Lakers game. The Staples arena is fabulous and I’m glad I chose it. The area is surrounded by bars and restaurants, but I wanted to try food and beverage options, expensive but tasty. Purchasing a ticket is easy, via the website and released to your Flash Seat account a few hours before the game. And it was easy to scan and enter the arena. The Lakers sure know how to put on a good show too, pre game show, national Anthem performed by saxophone, all well executed. When in LA I’d do it again.\nShow less"], ["Reviewed November 28, 2017", 4.0, "Kings game in style", "Worth a trip to experience. Well set up, easy to find your seats. Good food and drink selection. Fun."], ["Reviewed November 26, 2017", 5.0, "Great hockey arena", "We came here for a game against Montreal in October. There is a massive entertainment area outside, including lots of restaurants and pubs.\n\nWe drove here, and managed to find a parkade within a block at a reasonable rate. Most of the streets in the immediate area are blocked off by police during a game.\n\nArena itself is impressive, clean, wide concourses, lots of bathrooms and endless choices for food and beverages.\n\nSeats are comfortable, there are TV's throughout the concourse showing other games, in this case Dodgers baseball.\n\nOverall a very enjoyable evening, at the end we were on a freeway within ten minutes.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Great Arena!", "What a great arena! Clean, well designed and open walk ways. Lots of food options. Sat in a suite for a Lakers game, highly recommend the suite plus it was a good deal.\nWe were very impressed. Side note - food and souvenirs are very expensive. Also, where the arena is located is a nicer area of downtown LA.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Impressive arena!", "If one is attending an event at the convention center, it is not possible to miss the Staples and Microsoft Centers. To have such facilities in close proximity with easy access in a good area is wonderful. The security is amazing."], ["Reviewed November 20, 2017", 5.0, "As good as it gets....", "They say Madison Square Garden in New York is the world most famous arena. That might be true, but the Staples center is the world's most comfortable. There are parts of Staples Center (the suite levels) that feel like a hotel, with plush red carpeting and classy bars. There are multiple places to eat. Several craft beet stands, and perfect sight lines from every seat. Even the top deck is fine. The train lets off 2 blocks away. Great way to get there. Leave extra time for the long lines through security. It takes a while because they do their jobs....\nShow less"], ["Reviewed November 20, 2017", 5.0, "Went there for a Lakers game", "We were staying at the JW Marriott for a conference and we taken to a Lakers game at this centre. I was very nice, easy to get into with the security and we were very lucky to have been take to a suite to watch the game.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Great venue", "the remodel they did on this venue was great it looks new. I watched a Lakers game and was pretty high but I could still see the players well. They have good food options and its very clean. I was surprised on how easy it was to get there and how clean the surrounding area was.\nShow less"], ["Reviewed November 18, 2017", 4.0, "Staples Center", "During my stay in LA I’ve been there twice! If you’re an NBA Fan from one of the LA teams it’s totally worth it to go there. I visited two LAL games and would go a third time. Ticket prices are, I would say, normal if you happy with a seat in the upper areas. Haven’t had drinks or food, but I saw that a cup beer is about 10$, what is a bit of expensive I guess. But how often will you be there? haha\nShow less"], ["Reviewed November 16, 2017", 5.0, "FUN", "Recently went to a few Kings games. Easy access to the Staples Center, great atmosphere, plenty of vendors for drinks and food."], ["Reviewed November 15, 2017", 4.0, "Awesome venue!", "Went to a LA Kings ice hockey game and had an absolute ball! Access in and out was fast and efficient, venue staff were friendly and helpful."], ["Reviewed November 12, 2017", 5.0, "Best sports/entertainment venue ever!", "This is a great venue. Friday we saw Katy Perry and it was just great. There are private boxes and party rooms above the show floor so if you are a client of any of the holders, check to see if they will accommodate you.\nThere is plenty of good food and great drinks to be had on all levels. The sports shop is on the lower level.\nParking is difficult and expensive so we either take the Metro or an Uber as it costs less and there is less hassle getting in and out.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Home of LA Lakers", "Home of LA Lakers a must visit place if you are a baskeball fun. Watching an NBA game is always an experience and I should do it again if I have a chance"], ["Reviewed November 10, 2017", 5.0, "The Sports and Entertainment Capital of The World", "I've had the pleasure of working as the In-Arena Host for the LA Kings for the past 9 years. This venue is by far the best in Los Angeles for live sports and concerts! Not a bad seat in the house. I've had the pleasure of seeing Dane Cook sellout the building for stand up comedy and even seen the Stones on their 50th anniversary tour while standing in the tongue pit!\n\nThe staff is friendly and knowledgeable. From the ushers and concessions to ticket sales and operations staff this building is first rate in providing an excellent guest experience.\n\nFilling your belly with delicious food options is easy with a wide variety of menus available. Celeb chefs and local restaurants make cameo performances on the concourse with new and exciting dishes in a food scene that is always changing in Downtown Los Angeles. From sushi rolls to Ludo Bird you always have great choices for dining.\n\nBut for me personally... nothing will ever top being outside for the 2012 Stanley Cup Championship Parade where 250k fans will the streets in support of their hometown team.\nShow less"], ["Reviewed November 9, 2017", 5.0, "kings game", "was amazing. got to see some fighting.\nThis is the staples center. Home of the Lakers.\nSilly mistake wore only a shorts and a short sleeve shirt.\nWas fun and entertaining. Everyone got to see Will Ferrell on the screen. He was present at the game.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Show time!", "Went here to see the Lakers play the Cavs. Good game, better environment! Great food and drink options, awesome variety of memorabilia! Super fun night with friends!"], ["Reviewed November 8, 2017", 4.0, "Go See a Show...or the Lakers!", "It's basically a center for shows but it's surrounded by other theaters, restaurants and shops. THIS is an essential LA experience called \"LA LIVE\". Don't forget to check out the Grammy Museum."], ["Reviewed November 8, 2017", 5.0, "The Home of the LA Kings", "I have been down to the Staples Center several times, but never got to see a LA Kings game until this year! It is a great venue and has seating for a ton of people! There are numerous places to eat and drink and relax at the Staples Center during breaks from the game. You can buy your LA Kings clothing gear here too, but bring your savings, as it's not cheap!\nShow less"], ["Reviewed November 7, 2017", 4.0, "LA Kings", "While visiting from the East coast - Was able you have great seats through my son's company for my (our) first hockey game in decades -\nKings led 5-0 until late 2nd period -\nthen we saw\npenalty shot by the Maple Leafs - for a goal\na 2nd Leafs goal with barely seconds left in the 2nd period\na 3rd leafs goal early in the third period\na 2nd penalty shot against the Kings - No score\nand the Leafs pulling the goalie with almost 4 minutes to go in the game\n\nKings win 5-3\n\nso no complaints for the game\n\nI was \"surprised\" - by how chilly it was - i guess i just never thought about the need to keep it the ice that cold\n\nfood selection and quality was easy and fine - arena pricing as \"anticipated\"\n\ntook us 90 minutes for a 45 minute ride - ugggg LA traffic LOL :)\nShow less"], ["Reviewed November 7, 2017", 5.0, "Experience of a lifetime!", "We went to see an NBA game at the Staples Center - Los Angeles Lakers v Denver Nuggets. I bought the tickets via the Staples Center website from Australia. Then I downloaded an app that saved the tickets. On entry I just had to show the tickets on the app at the door. So easy.\n\nI paid about $250ea for seats close to the court. Worth. every. cent! My kids were blown away as was I. Such a great venue! Different to any we have in Australia.\n\nFood and beverage outlets within the Staples Center are run so so efficiently. Really well staffed, reasonable prices. Refillable popcorn and soft drinks! Impressive!\n\nOutside the Staples Center is the LA Lakers shop. It closes during games. So time your visit to the shop for when there are no games at the Center. Why they close during games is beyond me! Shop is huge. Mainly Lakers gear and the other LA team.\n\nWe stayed at a hotel nearby and just walked to the game. Easy! If driving, lots of parking options nearby and not expensive.\n\nThere is any area around the Center called LA Live (think that's what it was called) which has restaurants etc.\nShow less"], ["Reviewed November 5, 2017", 5.0, "Good public transportation", "There was a lot of options getting there and leaving afterwards which we appreciated since we didn't want to take the car."], ["Reviewed November 5, 2017", 4.0, "LA Kings Game", "Watched the LA Kings defeat the Toronto Maple Leafs 5-3. Had terrific seats just next to center ice in row 11. Fantastic view and experience. The arena light special effects were great. Easy to get to our seats and out to the food areas between periods. Food was good for arena type locations, good beer selection and even had a bar for mixed drinks.\nPlace was very clean, great location at the LA Live area.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Second Arena on my Boys Bucket list", "My Oldest son was so happy to have another opportunity to see where the great Kobi played. We weren't there during game season but just to go to the Staples center was enough for the moment. Besides Kobi's retired...."], ["Reviewed November 4, 2017", 5.0, "Home of Many LA Events!!", "Going to sports events late night in LA used to be slightly dangerous. Although everyone should always be aware of their surrounding, LA is such a safer place to be.\n\nThat being said, the Staples Center is wonderful! It is constantly the host of so many of the LA events including teams (Lakes, Clippers, etc) and concerts. Across the street is LA Live/Nokia. This area used to be so runned down and has been truly revitalized through the foot traffic and efforts of those who come.\nHaving lived in LA for most of my life, it's really such a wonderful thing to be apart of and to see the people come together. I believe there has been a positive shift in the city and mentality of downtown and surrounding areas. I'm excited to see what's ahead.\nShow less"], ["Reviewed October 31, 2017", 3.0, "Basketball Mayhem", "This place is easily accessible by LA metro. Since there was no basketball match going on, so i only saw this center from outside. This place is must for photo memories."], ["Reviewed October 25, 2017", 5.0, "Awesome Experience", "It was an awesome experience to watch a basketball game at this world class sporting and concert venue . The apparel store and the many restaurants are also cool . And while in the midst of the excitement, gratifying to see different sculptures of the many sporting heroes such as Magic Johnson and Wayne Gretsky among others, just outside the event center.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Great experience", "I went to a Clippers preseason game against the Sacramento Kings and parked in the Lot 1 garage which is literally a two minute walk to the arena. I sat in the Premier seats with their own entrance and waitstaff. The in arena experience was great. All of the staff were great and the game was a lot of fun.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Soooo Cold! Bundle up!", "We attended a Kings game and saw them lose to the Calgary Flames in OT. Getting here by subway was super easy! We saw celebrities Kelly Hrudey and Will Farrell.\n\nI can’t believe how cold it was in this arena!!! From the moment you walk in the door, it’s like walking into a refrigerator. I’m from Canada, so I know what cold is but this is ridiculous! I was wearing a sweater and a toque and was shivering the entire game. There’s no need to have it that cold in the place!\nShow less"], ["Reviewed October 23, 2017", 5.0, "Awesome place - but super cold for hockey games", "We went here for the Los Angeles Kings season opener against the Philadelphia Flyers. We sat in section 333, which offered great views of the entire arena. Beer, food and McDonalds right outside the section.\n\nWe have been in many hockey arenas in America, but Staples Center is by far the coldest one we've experienced. Forget the lovely weather outside. Dress for a cold day while watching hockey :)\n\nWe took the car and parked in \"Lot 4\" (see attached picture). Flat rate $20. We watched the entire game, and after, it took us 15min to get up on Hwy 110. So smooth!\nShow less"], ["Reviewed October 22, 2017", 4.0, "Clippers opening night", "On holiday from Australia and went to our first NBA game clippers v Phoenix.\n\nTravelled here from west Hollywood by #4 bus with 3 young kids (took a while, but only cost $5).\n\nGood choice of food and even better choice of beer. $13 for a craft beer though is a little steep in my opinion and $11 for a boring American lager.\n\nIn seat ordering (we sat in PR11) for food and drink during the game was so good, staff were friendly.\n\nTo get back to Hollywood walked to broadway and jumped back on the #4 bus\nFeeling safe the whole time whilst walking through LA late on a Friday night.\n\nShow less"], ["Reviewed October 17, 2017", 4.0, "Great venue!", "The venue is great for sporting events. Parking is a close walk to entrances. There are plenty of food options once inside. We always have a great time here. If you are going to a Kings game, make sure to wear warm clothes!"], ["Reviewed October 17, 2017", 5.0, "Laaaakers!!!!", "Attended my very first pre-season Lakers match. Our American relatives got us great seats. Blown away with how packed the stadium was for a pre-season game! The entertainment between quarters was fab! The stadium was clean and staff really friendly!!! So happy I got to experience it!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Great athmosphere on a game day", "We watched LA Lakers winning, which made our evening in Staples center even better. We even saw Jack Nicholson and David Beckham from faaaar away :) Would love to go back again."], ["Reviewed October 15, 2017", 5.0, "Clippers vs Rockets", "With the driving in L.A, you should allow yourself plenty of time to get there and to find parking and to walk. Along the walk, there was a great food truck and it had fully loaded mexican hotdogs. The arena was so much fun and threw out free stuff all night. We even caught a t-shirt!\nShow less"], ["Reviewed October 15, 2017", 5.0, "Spectacular!", "The vibe around the Staples Center can't be beat. There are so many great restaurants & they do an awesome job of keeping the energy up!"], ["Reviewed October 15, 2017", 5.0, "Clippers vs Lakers game", "Still a great place to see any sports event. After a few long years and winning games here this place looks great and clean and safe. The event staff make you feel very welcome and happy to be party of the event!"], ["Reviewed October 15, 2017", 4.0, "Lakers", "This was our second time at Staples Center for basketball in the past year. We love the atmosphere and the game itself - it makes for a great night out.\nWe had premier seats and the views were completely unobstructed. Actually finding our seats was not the easiest and we did get a bit lost.\nWe got popcorn only to find out if we had got the medium sized bucket we were entitled to free refills... but who can eat that much popcorn anyway?\nThe burgers/fries all looked and smelled amazing and not the cheap rubbish food you usually expect at these events. Not sure if this was because it was premier seating though as we have been used to the cheap seating in the past!\nI wanted to check out the merchandise before leaving however I had to exit the building and re enter further away. They did not want to let me back in and when they did, the merchandise team completely ignored me and proceeded to pack up all their stuff.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Phenomenal venue makes any event a treat", "Even when the Lakers are losing, Staples Center itself is alive with activity, terrific eating and drinking options and activities other than the game. There are stars to see watching the game. The crowd is electric. The place is new and clean."], ["Reviewed October 7, 2017", 5.0, "Lots of options", "This place has something for everyone. Great place to walk around before of after an event at the stadium."], ["Reviewed October 5, 2017", 5.0, "Staples Center", "This is one of the best sports venues in the nation. The Staples Center can accommodate several different sporting events and also music concerts."], ["Reviewed October 3, 2017", 5.0, "THE BEST PLACE TO WATCH A BASKETBALL GAME", "Watching either Lakers or Clippers is sure a wonderful atmosphere with all the fans cheering together and the Carrot Cake with ZERO Calories is so Yummy, well that is what the vendor told me ; Zero Calories,"], ["Reviewed October 2, 2017", 4.0, "Kcon baby", "I got to the concert on time. It was a great concert. I was in p2 but i wish i could've had a better view. front view would've been better i guess, but i would've been further away. I'm grateful they held the concert though. Backpacks were allowed the first day, but weren't the second day. it made things a bit more confusing. the backpack check was long so i would suggest to not bring one if you can. they didn't check our kcon bags though.\nShow less"], ["Reviewed September 28, 2017", 5.0, "box seats", "sat in the box for a GSW vs LA Clippers game. the suites are nothing great, what I expected for an arena. the weird stage lighting takes some time to get used to if you are used to other arenas. there are plenty of statues to take pictures with (basketball, hockey, boxing) right outside the arena. parking is horrible, try to park further out and take uber/lyft. in the same plaza is LA LIVE which has all sorts of restaurants/bars to grab a meal before or after. plenty of lines to get into the arena. come early, staples center is a very popular arena for the major sports teams... especially the lakers.\nShow less"], ["Reviewed September 16, 2017", 4.0, "First Game in LA", "Great view of the game. First Clippers game, or any basketball game on the west coast. Easy to get around, and exciting to watch. Went to a game back in 2015..."], ["Reviewed September 15, 2017", 5.0, "Great game", "We watched a fantastic women's game ,LA Sparks won . The atmosphere was amazing, music ,games ,giveaways we had a great time . We had a great view from our seats , you could see the whole court aswell as the big screen . When in LA next I'll go see something else as the prices were good .\nShow less"], ["Reviewed September 15, 2017", 5.0, "Top", "Great arena, excellent view from every angle, food and drinks a bit pricey but it was expected no surprise."], ["Reviewed September 13, 2017", 4.0, "Downtown Los Angeles arena.", "Inconveniently located near the intersection of the 110 and 10 freeways, getting to Staples Center is pretty much always a nightmare, especially on a week night. Once you get there, you get to pay through the nose for parking as with most major sports venues. The good news, there is quite a bit of parking near the facility. The arena itself is quite nice and the sight lines are good. There are many concession stands on all levels and the place is kept clean. The staff are friendly and helpful.\nShow less"], ["Reviewed September 13, 2017", 5.0, "LA's Staples Center", "Current home to the LA Lakers, LA Clippers, the LA Sparks (women's Pro basketball) and to excellent food, merchandise, and right next to LA Live (hotels, restaurants, nightlife)."], ["Reviewed September 6, 2017", 5.0, "Great venue", "I have attended many concerts, basketball games, skating shows, etc. at this venue. It is large capacity but there really isn't a bad seat -- all have a decent view. Ample parking, easy freeway access."], ["Reviewed September 4, 2017", 5.0, "A must go if you are in Los Angeles", "Come down to Staples Center to see the Lakers, Clippers or the Kings play during the season. If not there is other concert and many other activities taking place during the year. Love it."], ["Reviewed August 28, 2017", 4.0, "a landmark", "We got into this place when someone toured us around explaining what made this a popular tourist destination because of the games played here. We were privileged to have done it with a driver, best to go there walking."], ["Reviewed August 27, 2017", 4.0, "L.A's most Popular Arena!!", "It took me 2 visits to see the sculptures outside the arena.The first time I went to see the arena it was temporarily closed..I guesss a a renovation was taking place,but glad I went back a week later,and finally got to see the bronze sculptures upclose. The awesome bronze sculptures are,of the most popular athletes,that had made a name of themselves here.Even if you don't attend a game or activity here,it's worth to see the sculptures of this athletes.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Excellent Facility- Exccelelnt Concert", "We found Staff helpful, and plenty of food and drink options. All a good experience. Excellent Concert. Limited taxis available to get home. Try to make plans ahead to exit area. ."], ["Reviewed August 19, 2017", 3.0, "WNBA game", "the area was nice, and had lots of different things around it. some of the monuments around the center were really neat! however, the food and the staff weren't as good, nor as friendly\\professional as the staff at Dodger Stadium, which we had gone to earlier in the week.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Concert", "Great place to visit even if you do not attend any game or concert. There small shop, plenty of restaurant to choose from or just stroll around and enjoy the light and environment."], ["Reviewed August 11, 2017", 3.0, "ok but............", "I guess to see something its ok as long as you pregame elsewhere. the prices are to the point as to say \" I dare you to buy a drink\" The staff are very nice here, just dont buy food or beverage inside."], ["Reviewed August 9, 2017", 5.0, "Go watch the Sparks. Truly Entertaining.", "Thought a trip to Los Angeles wouldnt be complete without a basketball game so went to the Staples Center to watch the Los Angeles Sparks womens' basketball team and had a great time. The match itself was of a really high standard and the entertainment around it was good too. Highly recommended.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Convenient", "Nice location and a lot of things to do around there. Restaurants, bowling, and local shops are walking distance. The center itself is clean, easy to navigate, and has multiple entrances."], ["Reviewed August 7, 2017", 4.0, "Pic only", "We went downtown at night and only viewed it from the outside and took a picture. Didnt get to see inside at all. Next time we will go to an event there."], ["Reviewed August 6, 2017", 5.0, "The Mecca for the LA Sports Scene", "Staples Center is the Mecca for Los Angeles Sports. The home to the Lakers, LA Kings, surging LA Clippers, LA Sparks. Additionally Concerts, the Grammys, and countless other events. THE spot to be seen and watch live action sports."], ["Reviewed August 5, 2017", 4.0, "Go to a game !!", "We went to the Womens basketball game here, great staff, good venue with decent views of the game even from cheaper seats, don't take even a small backpack as separate screening is a hassle. Smaller crowd for womens game meant that 50% of the food outlets closed but still enough open and queues OK to get food or drink.\nShow less"], ["Reviewed August 2, 2017", 4.0, "This place is beautiful", "I went here in June. It is very nice. The staff at the venue I attended was very nice. I shall return to soon."], ["Reviewed July 28, 2017", 3.0, "Interesting stop", "The Staples Center hosts several major sports teams including the L.A. Kings.\n\nThough there are no tours available, it still is a nice stop if you want to get a photo the Kings team sculpture or other iconic statues of Magic Johnson, Wayne Gretzky, Kareem Abdul Jabbar and others.\n\nOur boys loved shopping in the Everything LA sports store where off-season sales can be found.\nShow less"], ["Reviewed July 22, 2017", 5.0, "A fun venue", "Recently went to the ESPY Experience at the Staples Center / LA LIVE. Great place for sports and entertainment acts. Food choices are pretty good, too. Parking is pricey."], ["Reviewed July 20, 2017", 5.0, "Staff fvery riendly", "Went to see a concert at the Staples Center and found the staff to be very friendly! The concert was geared towards my teenage girls, so it made some good humor with the guards and concession stand workers! I enjoyed the visit to the center (and admiring the history and great teams that have played there)\nShow less"], ["Reviewed July 20, 2017", 5.0, "Great place for entertainment venues", "Go to place in downtown LA for a large variety of choices-dining, entertainment-cinema, concerts, sporting events."], ["Reviewed July 20, 2017", 5.0, "Sensational Staples...", "Superb experience! Great atmosphere for all concerts and sports events! Food and service on the VIP Club level was spectacular. There are so many options for dining and entertainment within walking distance. A must for any traveler. Cheers-Tiffanie"], ["Reviewed July 19, 2017", 4.0, "Great Stadium!", "I've had many great memories at this place. Growing up in LA I had my first concert here (Britney Spears Opps I did it again) haha and I watched my first Laker game and Kings game. This venue is a great venue. The 300 section gets a bit high in case you are afraid of heights.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great modern venue", "Except the food prices which are obviously off the roof as in all american stadiums it is a great venue that offers concerts, lakers, kings and very cheap clippers games. Definitely worth it if you buy the six dollar tickets from stub hub!"], ["Reviewed July 19, 2017", 5.0, "Tim McGraw and Faith Hill concert", "Great venue. Excellent concession. Parking price is excellent for the area. Parking prices fluctuate from 15 to 25 dollars depending on proximity. But all are good options."], ["Reviewed July 19, 2017", 5.0, "One of the best stadiums in the US", "Suites here are amazing. Great views of all sporting events and concerts. Food and drink is a little pricey but worth it."], ["Reviewed July 14, 2017", 1.0, "Staples is poorly run and not customer friendly", "Went to Staples for a game last night. Someone in their hierarchy decided without telling or warning customers that they had implemented a new 'search all backpacks and diaper bags' policy. So, all attendees with anything bigger than a small purse had to go stand in one long line to have their backpacks scanned. They had one scanner. Two people working. Several people and two supervisors standing around. Offers to empty bags completely were rebuffed (\"No it has to go through the scanner\"). The fact that it took 40 minutes and many people missed the beginning of the game. Tough luck. Or as the staff AND THE SUPERVISORS said: \"We don't make the rules. We only work here. Don't blame us.\" When I complained to the Staples manager, he lied and said we have been doing this all season. Well, I am a season ticket holder and have been to several games and this was the very first time I experienced it. So he showed that he was perfectly fine with telling an alt fact.\n\nI understand. I run a large operation. I know how essential it is not just to plan what you and your staff do, but also what the impact is on the customer and how that can be mitigated. No one did that second part. While I will finish up my season tickets, I will not spend any money on their concessions. And I will not renew my tickets for next season.\nThey should be ashamed, but I don't know if whomever set up this operation has the wherewithal to know how incompetent the plan was. My season ticket rep was not informed of the change even though they have meetings with the Staples crew.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Awesome center", "The Staples Center is awesome and must-see place if you are a sport's lover. Specifically i visited it because of the Lakers."], ["Reviewed July 13, 2017", 4.0, "Shawn Mendez Concert", "Very good for my Daughter I was impressed with the concert. The venue is really nice and it was well organized. Please read my review for Stuart Hotel from hell."], ["Reviewed July 12, 2017", 4.0, "Great venue", "Visited the staples center for the Shawn mendes concert with my daughter\n\nIt's like any 20,000 ish seat arena, although I particularly liked the the seating arrangement. Almost all stars are good. Nice touch with numerous suites available too. Acoustics excellent and food choice and cost not too bad for an arena. More than just hot dogs and fries.\n\nThe only draw back was no pass outs, so once you're in, be prepared to stay til then end.\n\nShow less"], ["Reviewed July 12, 2017", 5.0, "Sports Center of Los Angeles", "A magnificent venue for Los Angeles' best sports teams: Lakers, Clippers, LA Kings, not mentioning the fantastic concerts on many more events....2028 Olympics is next. Way to go!!!!!"], ["Reviewed July 12, 2017", 4.0, "Staples Center only if someone gives you a free ticket!!!! LOL!!!", "Staples Center only if someone gives you a free ticket!!!! LOL!!! The crowds are amazing. Most people are discourteous. Almost as bad as Dodger Stadium. I did not feel 'safe'. LOVE the sports events if one has really good seats! NOT in the 'nose bleed' sections. I have to be up close and personal with the sports event, otherwise I would watch on TV. Lines at hideous for food and bathrooms. Do not go to the bathrooms unless it is absolutely necessary.\nShow less"], ["Reviewed July 12, 2017", 4.0, "Nice Center", "I came here for a LA Lakers Basketball game and I really like the Center. The staff is friendly, you feel safe and we had a lot of fun!"], ["Reviewed July 11, 2017", 4.0, "Well-organized, secure and comfortable venue", "Enjoyed several events here in recent months - Barbara Streisand, the LA Lakers, the Stones. Good snacks, good seats, etc."], ["Reviewed July 10, 2017", 4.0, "Good arena for sporting events, not so great area outside", "Been her Kings, Clippers and Lakers game, the facilities inside are good its outside there are issues. Not the best part of town and parking is a headache"], ["Reviewed July 10, 2017", 5.0, "Great Place for Sports 🏀🏈 & Music 🎼🎤", "Where ever you sit, any event, is easy to see. If it a concert it's a great concert. If it's men or women's basketball 🏀 it's always a great game."], ["Reviewed July 10, 2017", 2.0, "Not the best concert venue", "Saw Bruce Springsteen here on opening night and have been to other concerts notable Paul McCartney. Not my venue of choice. If you are in the nose bleed section the space in front of your seat is very small. I'm amazed someone hasn't died from falling in this venue. In addition the sound is muddy. If it wasn't for great performers you'd be miserable.\nShow less"], ["Reviewed July 9, 2017", 5.0, "great shops", "Very nice area to visit has some good shops and places to eat nearby and is on the hop on hop off city sightseeing route so its easy to get to if you do the bus tour"], ["Reviewed July 8, 2017", 4.0, "Up to Snuff", "The Staples Center is precisely what you would think a big city's stadium for basketball, hockey and other entertainment would be. It's huge, slightly hard to park when crowded and has a lot of fast food. However, The Staples Center is also very clean and offers some more \"upscale\" food depending on the ticket types you buy for sporting events. The bathrooms are usually very clean (at least when the event starts), and the crowds are generally civilized. There are some very decent restaurants right next to it, and I recommend trying one such as Flemings beforehand (they have delicious rib eye).\nShow less"], ["Reviewed July 8, 2017", 5.0, "Laker game was amazing", "Staples center is a top notch venue. Parking can be hard to find and security can be hassle at the front but once you're inside its great. Our seats were close enough to make out the players faces. 100% recommended."], ["Reviewed July 3, 2017", 4.0, "Lakers rule the nest here.", "Park along 12th Street west of the 110 Freeway for free. Then walk east about 10 minutes to the stadium. Place is always rocking. Lakers rule the nest here, followed by Kings then Clippers in terms of fan base."], ["Reviewed July 2, 2017", 4.0, "WNBA Staples game", "Phew come from behind win over Washington. What a visit! Cracking game and the entertainment was mind blowing. Seats were brilliant. We could see perfectly but just wonder how we could get courtside huh"], ["Reviewed June 27, 2017", 5.0, "Wow great entertainment at the Lakers Game", "Nothing like the big action at a live basketball game in the US. We saw the Lakers and loved it. A must do when you visit the US."], ["Reviewed June 27, 2017", 5.0, "Amazing views", "Went here to see WWE Raw and every seat was excellent. It is in an excellent location. I would arrive early because of all the traffic in the area"], ["Reviewed June 22, 2017", 5.0, "Fun place", "Fun place even if there isn't a huge game, they have a ton of shops and restaurants cool sports memorabilia Etc worth the visit anytime"], ["Reviewed June 21, 2017", 5.0, "Great venue", "We have been for several events, sports and concerts. It's a great venue for both. Recently here for a concert. The seating was ample and the sound very good."], ["Reviewed June 19, 2017", 5.0, "Basketball game", "Awesome to see a basketball game the Americans really put on a show. Dont eat there very expensive. We had premier seats really worth going"], ["Reviewed June 17, 2017", 4.0, "Impressed by the statues of some great basketball players", "I did not get to go inside the Centre but was attracted by the statues of great NBA legends such as Erwin \"Magic\" Johnson, Kareem Abdul Jabber. These were my heroes as a young man watching basketball on television in the 80s."], ["Reviewed June 15, 2017", 5.0, "\"Paying Homage to Lakers\"", "While vacationing here we wanted to come and see the iconic Staples Center. We were not here for an event so we did not get to go inside but we were able to see the statues and get some nice photos. This was a great experience!\nShow less"], ["Reviewed June 7, 2017", 4.0, "Very impressive on the outside and a busy place", "There is interesting arquitecture to be seen from the outside. The building is located next to the convention center and a Microsoft plaza. Interesting advertising, good place to do some people watching."], ["Reviewed June 2, 2017", 4.0, "Fun Photo Opportunities, Outside Staples Center!", "When we recently visited the Los Angeles area, there were no sporting events at the Staples Center, but that did not deter us from visiting LA Live and the Staples Center. Everyone in our three-generation party enjoyed walking around the center and taking lots of photos of the iconic sports hero statues. Most of the statues are so well known that only a first name is needed - Magic, Kareem, Shaq and Gretsky! Other statues include Jerry West, boxer Oscar De La Hoya and Lakers broadcaster Chick Hearn. Fun times visiting the Staples Center!\nShow less"], ["Reviewed June 1, 2017", 5.0, "Hockey and Basketball games are so much fun!", "Nothing like a live hockey or basketball game here! 90% of the seats have an acceptable view of the arena/court. The building is well kept and clean. Having a Metro station close by is a great perk. No $20 parking fees or traffic jams to deal with and a lot of regular fans ride the train so the atmosphere is festive.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Legendary sports center", "I was very sorry that we didnot get a chance to visit this years play offs. nevertheless the place is wirth visiting to see the statues of reknowned heroes of the city."], ["Reviewed May 31, 2017", 5.0, "NBA", "We went to a Los Angeles Lakers NBA game. Wow! Very organized stadium, full of parking lot nearby. Many options of food inside. The products there are more expensive, so we suggest you buy souvenirs outside the stadium."], ["Reviewed May 29, 2017", 5.0, "Lakers and Clippers Game", "I saw a Lakers and Clippers game in one week. I receive the tickets on a discount and enjoyed myself both nights. I was in the nosebleed seats but I didn't feel uncomfortable with the big screen televisions and fans that were in the same area. Had a great time.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Kings Game", "My friend and I visited the Staples Center back in January. It was by far one of the coolest places we have been to watch hockey. Our seats were great, and very easy to find ( we were five rows behind the glass).\n\nParking is expensive, so be ready for that (LA is not cheap), but we still parked close enough, that when the game was over, we had no problems getting out.\n\nGood food selection, found the staff to be helpful, and found the security to be on top of things (we saw some fans fight, and security came down right away and escorted them out).\n\nMy friend and I would come back for a Kings game again for sure! I also would not mind seeing an NBA game there either.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Awesome Sporting Events Venue", "Attended basketball game here recently and love the venue. The staff is friendly and helpful. Locating one's seat is easy and if you have to walk around it is an excellent opportunity to see what is available, whether dining, purchasing or just browsing."], ["Reviewed May 22, 2017", 5.0, "nba", "we have frequented several Lakers games there..love the atmosphere.I have somehow managed to be on the jumbo tron each game..."], ["Reviewed May 22, 2017", 5.0, "LA Kings", "Had a great time watching the game. Fun venue and far less crowded than expected. The VIP lounge just off the ice is a great spot to grab a drink or chat with friends."], ["Reviewed May 22, 2017", 5.0, "Basketball and beer!", "During the regular basketball season, my boss gave me some Clipper tickets. The Staples Center is beautiful. Food stands are all over the place, and no matter where you sit you can see everything!"], ["Reviewed May 17, 2017", 4.0, "LA Kings Game", "Staples is easy to get to. Either to drive or take metro. Food choices are getting better. Seating is usually good almost anywhere."], ["Reviewed May 16, 2017", 5.0, "Good to catch a NBA/NHL game", "Saw 4 NBA/NHL games over a week. Easy to get to from Pico station (Expo line) or 7th/Metro (Red line). Plenty of places to eat around Microsoft Square prior to games. Definitely catch a Kings/Clippers/Lakers game if you're in town."], ["Reviewed May 14, 2017", 5.0, "Great Venue", "The Staff here run a very slick operation, gets everyone moving, very helpful and all look so nice. Great centre and lucky enough to see a great game!!"], ["Reviewed May 12, 2017", 5.0, "Catch a game", "Catching an NBA game while in the USA is a must do activity and the Staples centre offers up twice the options, being home stadium to both LA Lakers and Clippers. Great stadium, plenty of food options."], ["Reviewed May 11, 2017", 5.0, "Awesome", "\"We loved downtown LA and rode bikes all around the center. The statue os Shaq was beautiful\" This was one of our favorite stops while we were in California. Could have spent the day"], ["Reviewed May 10, 2017", 5.0, "Kings Game", "Staples has lots to offer... lots of food and drink options. It's a typical event venue. Great for watching a kings game!"], ["Reviewed May 8, 2017", 3.0, "a little disappointed", "We drove over an hour to shop at the store for Kings stuff. They had nothing out. No pucks, stickers ,shirts anything. We wanted to get souvenirs for friends back home in NY. No matter if they are out of the playoffs or the season is over you should still have stuff out for them.\nShow less"], ["Reviewed May 5, 2017", 4.0, "Lakers game", "Nice venue to see sports, as I went to see a Lakers game during a business stay in LA. Parking is rubbish, but what do you expect in downtown LA??"], ["Reviewed May 3, 2017", 5.0, "NBA FAN", "For those who are sports fan the Staples Centre is a must visit especilly if there is a NBA game on. We got tickets too two playoffs games LA Clippers Vs Utah Jazz, what a awesome experience watching live professional basketball the pre game during the game was such a buzz for my family from down under New Zealand. I would highly reconmmend going to any sporting event to the Staple Centre. We used Uber to and from the game we came from 2011 Highland Ave Hollywood which cost $18 each way.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Red Hot Chili Peppers", "Went for a concert back - great sound, great lights, great show. We had dinner across the street at El Chollo and beverages at the venue. Fun night all around."], ["Reviewed May 2, 2017", 4.0, "fresh vibrant new", "Lots of restaurants bars etc now in this area. Fresh look and vibrant. Felt safe and clean. .................................."], ["Reviewed April 27, 2017", 4.0, "I hope you have a lot of money", "I go there to watch hockey. You better be prepared to spend big bucks foer everything. From parking, beer, food tickets , programs and anything else you can image. This is LA folks. This is where the dealmakers and breakers go. The average Joe doesn't have a chance. Check where your seats are prior to laying out the big bucks. Beer is $11.00 to star6t with.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Something to see", "If you're a Laker fan like my boyfriend is, you might want to stop by and see the bronze statues of the Laker greats that stand outside the arena. The area around the arena has really been built up nicely."], ["Reviewed April 26, 2017", 5.0, "Go Clippers!", "We visited the Staples Centre to see the Clippers play the Jazz. We had a fabulous time. Everything is well organized and it was a great atmosphere. We sat in section 301 row 2. Therefore we were in the upper bowl, but we sat in the centre and close to the bottom of the bowl, so we could see very well. We considering sitting lower, but our seats would have been to the side and we might not have gotten as good a view of one of the baskets. Section 301 worked great and would work great for anyone on a budget but still wants a great view of the court.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Love this venue", "I have been here for many events and i have yet to leave unhappy. This place is clean and organize. its expensive."], ["Reviewed April 25, 2017", 5.0, "Go Lakers!", "I love the Lakers since I was 10, unfortunately now they are among the worst teams in the League. BUT you have to see this! I was very disappointed I could NOT find a Kobe Bryant Jersey, nor Kareem, Magic Johnson, or O'neal. It's sad, but I hope they read my review and do something about it.\nThere are sculptures of all those players, except Kobe, in the back. Very clean place. Love it!\nShow less"], ["Reviewed April 19, 2017", 4.0, "Kings Game", "Attended a Kings game a really enjoyed my visit. Had something to eat earlier at LA Live which is a neat little spot and then crossed across to the game. I was worried about parking so we went down early and ended up with perfect parking,altough it was $25...LOL. Very fun place with great Hockey ticket prices.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Amazing experience!", "Flew from London to Los Angeles to watch the LA Clippers and it was an amazing experience! From the entertainment during half time and the auction for signed merchandise by the team players themselves."], ["Reviewed April 15, 2017", 5.0, "What a great venue!", "Visited here for a Flames vs Kings hockey game, sat in the permier section. The arena was easy to get into, directions to seats were perfect. Seats were amazing, with drink holders. Staff were ALL amazingly professional and service oriented. Our bartender remembered our previous orders after the first visit. And, they have a smoing area on the roof.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Cool arena", "It was cool to see all the statues out front of all the Laker greats. Tickets were a bit overpriced considering the Lakers' abysmal record but I had fun."], ["Reviewed April 12, 2017", 5.0, "Concerts and Games", "I like to go here for music concerts as you hear things very clear compared to open theaters. I would suggest parking in Lot 1 if you can as the walk is super close to staples center."], ["Reviewed April 12, 2017", 3.0, "Lakers game!", "Once we got to our seats, this is a very good arena. We were up in the second tier behind the baskets and we really enjoyed the game. However, it took us quite a while to get in to the arena. There must be some way of speeding up that process...also drinks were expensive, but then again you are a sitting duck so this should perhaps have been expected. it was comfortable, clean and we had a great night, but some aspects could be improved.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Lets go HEAT", "We really enjoyed the Staples Center. We had an opportunity to see Many former professional athletes as they did the pregame show. It was super exciting."], ["Reviewed April 10, 2017", 5.0, "Great Venue!", "This was our first time at the Staples Center and we were not disappointed. I recommend the Premier Seats to avoid the up and down of ordering food and drinks. Having someone take your order and bring you everything is quite the treat!! Restrooms were clean. Parking was easy in, and out. Good direction from staff. Fabulous time and we will definitely return!\nShow less"], ["Reviewed April 10, 2017", 4.0, "Clippers!", "I've been to over 50 games at Staples, very nice atmosphere. Been to a few concerts also. The seating is decent, the building is nice and modern. Decent food and drink options. The Clippers are an exciting team but can't seem to get over the hump. Maybe in 2017? I surely hope so.\nShow less"], ["Reviewed April 9, 2017", 4.0, "Brilliant for concerts", "I saw Adele on my first night in LA here and was blown away by the stadium. You could see the stage even when you were high up you could see Adele compared to somewhere like the 02 or Wembley where she would have been a dot in the distance. The seats were comfy, the staff were friendly and helpful. The sounds, lights and overall atmosphere in the stadium was immense.\nShow less"], ["Reviewed April 8, 2017", 5.0, "Visited for a Lakers Game", "We only had cheap seats on the 3rd level but they afforded good view of what turned out to be a great spectacle."], ["Reviewed April 7, 2017", 4.0, "Decent Stadium", "If you want to catch a game or a show it's a great place to see high level entertainment for sport and the arts."], ["Reviewed April 6, 2017", 5.0, "Improved Atmosphere", "I have been going to the Staples Center for years, and they have recently undergone a customer experience change to make the venue more exciting. There are great new restaurant partnerships and different games and activities to partake in whether you are there to watch the Clippers win, Lakers lose, or see a concert\nShow less"], ["Reviewed April 5, 2017", 4.0, "Clipper Game", "1st time at Staples center for a Clipper game. Awesome arena for a enjoying the game. They had also just unveiled Shag's statue outside of the arena in the court of champions. Cool"], ["Reviewed April 4, 2017", 5.0, "Superb sports venue!", "Went to see Lakers game and was not disappointed. The complex has everything you would need and more with lots of food and drink options. Everything seems to be very modern around the arena and the sound quality was top notch as well. If you are a sports fan you should definitely visit this place at least once!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Bucket List down!!!", "Went to Staples to watch a Clipper game. Had a good sit and the experience was really unforgettable. The place was so comfortable and the entertainment after every timeout and halftime break where eye popping. Would like to visit this place again hopefully the\nLakers will have a stronger team by that time.\nShow less"], ["Reviewed April 3, 2017", 5.0, "A Dream!!!", "My trip to Los Angeles had been planned for November because we wanted to attend a match of the regular season NBA. Luckily for me, there was a game with my Oklahoma City Thunder and Russell Westbrook, who with a last second field goal beat the Los Angeles Clippers! Beyond that, it was really a dream to be at the Staples Center, where countless legends had played and where until a few months ago Kobe Bryant was still playing.\nSpeaking more specifically of the structure, it has a really beautiful layout with great organization; there was a short line to enter, a waitress who took orders, the ability to eat, drink and tease. A truly unique experience!\nShow less"]]}}