{"State Street": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "State Street", "url": "/Attraction_Review-g33045-d108663-Reviews-State_Street-Santa_Barbara_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/6b/08/6f/santa-barbara.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2395"}, "address": {"@type": "PostalAddress", "streetAddress": "State Street Highway 101", "addressLocality": "Santa Barbara", "addressRegion": "California", "postalCode": "93117", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 3.0, "Not Very Impressed", "My husband and I have been down State Street a few years ago and it seemed much better back then. We didn’t care for most of the stores and there were tons on homeless people. On homeless man was smoking marijuana right on the sidewalk. I don’t think we will be back.\nShow less"], ["Reviewed 4 days ago", 5.0, "Very Beautiful Street in Santa Barbara", "This is the main street in downtown Santa Barbara. It is lined with shops, restaurants and coffee houses. It conserves the typical Spanish architecture and is very pleasant to walk, up and down."], ["Reviewed 4 days ago", 5.0, "My favorite part of California.", "Wonderful area to walk, grab a coffee or a bite to eat. When ever I have visitors from other states we make a trip to Santa Barbara. Great one of a kind shops, restaurants, and galleries."], ["Reviewed 1 week ago", 4.0, "Heartbeat of the City", "State street is a much!! On Tuesday evening and Saturday they block off part of the street for an amazing Farmer's Market. There are a variety of shops and restaurants The street also has a lot of charm...."], ["Reviewed 2 weeks ago", 1.0, "Disappointed", "Really hard to find touristy gifts. Even on the Harbor front, couldn’t find gift shops. Parking on or nearby State Street was impossible."], ["Reviewed 2 weeks ago", 5.0, "Shopping food coffee and more", "State Street is the main commercial drag of Santa Barbara full of shops and restaurants and much more. It also has a large outdoor mall. One of the nice things is that there are public parking lots every couple of blocks and the first 90 minutes are free. You don’t need an agenda when you’re on State Street. Just walk around and see what interests you. Some of the best restaurants are in the area. Great people watching too.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Happening!", "This is the place to be if your not at the beach. Reminded me of Lower Broadway in Nashville in terms of the set up without the droves of people. Establishments everywhere that were all seemingly very nice.\n\nI didn’t get the allure of Santa Barbara until we walked this street at night.\n\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Full of great shops, bars and restaurants", "This is the main street in Santa Barbara with many shops and great bars and restaurants. A perfect street to walk down any time of the day or evening"], ["Reviewed 3 weeks ago", 5.0, "Farmer’s Market", "State Street comes alive Tuesday evenings. We walked from the wharf along state street. there were many bars, restaurants and shops open on a balmy evening. There is a farmers market that runs about 3 blocks down the middle of the street. It was fun."], ["Reviewed 3 weeks ago", 4.0, "If you like shopping...", "Tons of restaurants, tons of shopping, very touristy. A bit more expensive here than elsewhere, but c'mon, you're probably on vacation. You have to walk the streets and duck into a store or two. Have a meal or a drink and keep strolling. The weather is almost always great, so enjoy!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "great afternoon stroll", "Used to be fun to cruise in a car back in the 90's. Now I stick to enjoying the street on foot. Plenty of unique shops and eateries to keep you busy. The architecture is beautiful, especially with all the recently renovated areas off the main drag( check out the funk district). If you're in Santa Barbara, be happy! It's heaven on earth.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Christmas by the beach", "Walking the main road, State Street in Santa barbara should be on every visitors must do list. So beauiful and so many stores to shop, eat & even take in a movie.... Enjoy"], ["Reviewed 4 weeks ago", 3.0, "Not much left of the old State street!", "Things seem to have changed, many places closed, lower quality stores and merchandise took the place of the good things that used to be there. It looks like they opened in other areas and didn’t leave Santa Barbara. Its better at day time, because it seems that at night it just died. We went there about 7:30 pm and did not see many people nor much traffic.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "An outside mall", "We walked most of the main part of state street. It’s like visiting a mall only outside. Most of your favorite mall stores are here. If you like strolling around a mall you will like this"], ["Reviewed 4 weeks ago", 4.0, "Fun walk", "Walk up and town State Street to take in the sites and sounds--and the shopping of the area. You can also ride the bus up and down the street for just 50 cents."], ["Reviewed January 24, 2018", 3.0, "Beautiful Downtown but MANY empty storefronts", "Santa Barbara is so beautiful, and its downtown with its Mediterranean architecture is gorgeous. However, there are now a noticeable number of empty storefronts/For Lease signs... several on every downtown block on State St! It’s very sad to see this. It sure wasn’t like this in years past. Another noticeable thing is nearly every store is a big chain. Very few independents. Sad to see, as it’s the independents that in the old days, made State St a unique shopping experience. The CITY COUNCIL of this city needs to get off its backside and get to work to offer incentives for small retail businesses to open shops on State St! GET THOSE EMPTY SPACES FILLED! The city also needs to get the police to do some regular community patrols of State St to reduce the homeless begging.\nShow less"], ["Reviewed January 22, 2018", 3.0, "Like a shopping mall", "I remember visiting state street 20 years ago, cute restaurants and little unique stores. Walking down the street this time I was reminded more of a shopping mall than a main street usa. It was a bit disappointing but if it's a shopping mall with major stores you are looking for, its perfect. There are still some nice restaurants but not worth it as a destination.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Find whatever you need on State St.", "State street is where all of the action is....shopping, dining, wine tasting, theaters and spas. It's busy but still has a quaint small time feel."], ["Reviewed January 20, 2018", 3.0, "Great for day shopping with your significant other.", "The city boasts of being \"green\" and friendly, I was very concerned with the rather large amount of homeless people on the streets, more than I would normally see in Los Angeles or NYC. Gives the area a bit of an unsafe feeling, in my opinion.\nShow less"], ["Reviewed January 8, 2018", 2.0, "Lovely street ruined by people begging", "walked along this lovely street but was constantly bothered by beggars some of who were abusive to us this is in marked contrast to my last visit three years ago the city council needs to take urgent action to clean up this once lovely and welcoming street and the shop and hotel owner need to realize that these oprresive people begging and smoking pot on the pavement of the this street is going to hurt their businesses we stayed in the Santa Barbara hotel and were dismayed to have to walk around a group of people begging and sitting on the pavement by the entrance smoking pot to me pot or drinking in the street and annoying tourists and residents is not acceptable\nShow less"], ["Reviewed January 8, 2018", 5.0, "A stroll through state street for a few consecutive days", "State street is full of small, cute restaurants and stores. We had a great time at the movies and outdoor stores. We also visited a board game store and ended up buying some of our favorite games! Could easily spend more time around here. Some places were closed down because of the fires but all were accommodating. Check out McConnel's for amazing ice cream. Tons of shopping to do here.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Has changed a lot with lots of vacant storefronts. Sad...", "Has changed a lot since I was here a few years ago, many stores out of business, namely the seafood restaurant across street from pier. Lots of vacant storefronts on State Street. We enjoyed the pier."], ["Reviewed January 7, 2018", 5.0, "Wonderful Street for Wandering", "State Street is a “don’t miss” Santa Barbara location. The shops and dining choices are endless. Of course, don’t miss having coffee at Peet’s. You can find national brand stores as well as charming local establishments. I liked the sock store where I could purchase fun gifts for the family back home. You can stop at CVS for all the necessities you forgot to pack, then indulge yourself in clothing or something for your home in many of the shops. State Street is also charming & beautifully illuminated even after the holiday season.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Happening place worth a visit for all", "Visiting Santa Barbara, plan a half day stroll or longer here...see/be seen, everything from extremely high end shops to souvenir places and local convinces, food from fast to every type of high end cuisine. Visit here"], ["Reviewed January 7, 2018", 5.0, "Excellent walking and shopping street", "Fun to stroll window shopping or not, people watching, stopping for a meal of ice cream. Santa Barbara is the perfect city to enjoy sauntering up and down State St"], ["Reviewed January 1, 2018", 3.0, "Not what it once was", "State Street remains the heart of Santa Barbara but it has lost some of its shine over the last couple of years. Too many empty shops, and a sad increase in the numbers of homeless folk, mean that whilst it's still a lovely place to visit it;s not what it once was.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Shops, restaurants and old buildings", "There is so much to see on State Street! It's one of the main streets full of shops, restaurants and interesting buildings. We walked portions of it and biked pretty much the length of it. Wear comfortable shoes if you visit and plan on spending a while especially if you stop and shop.\nShow less"], ["Reviewed December 31, 2017", 1.0, "Run down", "State street is run down with lots of empty shops. Lots of homeless people every block. There are lots of cheap low rent shops and restauarants. This town is very expensive to live in but can’t sustain any culture in their downtown area. It has declined since the 1980s when I first visited.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Families traveling with teens will love State Street", "When traveling with teens, getting the whole family to agree on what to do and where to go can sometimes be a challenge. The whole family enjoyed hanging out on State Street.\n- Very clean\n- Lots of great shops and restaurants-- some familiar, some new\n- Lovely walk 2-4 mile walk on a pretty day (Go clear down to Stearns Wharf)\n- Many restaurants are very reasonably priced (We ate at Natural Café and Craft Ramen)\n-Parking reasonable compared to many cities (First 75 minutes free--then $1.50 per hour thereafter)\n- Beautiful architecture\nShow less"], ["Reviewed December 30, 2017", 4.0, "Always a happy Stroll along State Street", "A must do part of your visit to Santa Barbara is a stroll along State Street. There are some great shops, architecture, and eateries along the way. I really enjoy taking pictures and there was plenty to capture here. And when you are hungry or thirsty this is the place to be as well. The Arlington and Granada Theaters provide great focal points for your lens. I easily spent a couple of hours walking around taking photos.\nShow less"], ["Reviewed December 28, 2017", 4.0, "Nice walk", "State Street is a great place to meander, shop, and eat all afternoon. Very unique boutique shops where you will not find the ordinary tourist junk. The only downside to this lovely way to spend a day is the “alternative culture” which can become aggressive and offensive in their approach for assistance. Don’t let that keep you away!\nShow less"], ["Reviewed December 22, 2017", 4.0, "Place to see", "State street is nice to take a walk from south to north. Beautiful old buildings around. Plenty possibilities for eating and shopping. Easy parking on many public parking places around."], ["Reviewed December 21, 2017", 5.0, "Ideal shopping precinct.", "Plenty of shops, bars, restaurants and cafe's. Wear comfy shoes if you want to walk the entire strip. Shopping for all tastes and flavours. The strip will also take you past other points of interest such as Santa Barbara museum and court house.\nTake the time to walk it.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Walking and shopping", "Safe walking by yourself. Lota of restaurants, and shops. Trolley if you are tires of walking. Lots to see."], ["Reviewed December 1, 2017", 5.0, "Santa Barbara is a must see", "My wife loved it there, as I have visited many times. Great stuff to see, nice hotels, good food and a relaxed atmosphere."], ["Reviewed November 30, 2017", 4.0, "Busy night and day", "A wonder place to stroll around during the day for all kind of shopping, eating and wine tasting, it turns around at 10PM to a rather hectic night/bar scene. I was surprised how many homeless people that show up at dusk, some a little obnoxious."], ["Reviewed November 28, 2017", 4.0, "Happening Location ...", "If something is going on in Santa Barbara then State Street is a likely location for it. It’s long a fun to drive as you’ll find trendy shopping areas, restaurants, bars and stores."], ["Reviewed November 26, 2017", 5.0, "Always enjoyable", "From all the restaurants or the market fair never disappointed, plenty of shopping if that is your thing but plenty of people walking around all the time."], ["Reviewed November 25, 2017", 3.0, "Depressed and Homeless", "You are immediately struck by the number of shuttered stores on this street...and even more on Chapala street. It's almost a wave of commercial depression highlighted by homeless in every nook and cranny. In our 3 days here over Thanksgiving we failed to see one policeman or car patrolling...perhaps took the holidays off? Even the electric shuttle failed to run on Thanksgiving! Which explains probably why motorcycles and cars exceeding the 30 mile speed limit. This is NOT the Santa Barbara that has been so welcoming in the past. Will not be back anytime soon.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Great upscale shopping & eating", "State Street is the Main Street running from the beach up through downtown and north toward Goleta (when you look out at the ocean from the beach in the center of Santa Barbara, you’re actually looking south, not west as many assume). Having previously lived in SB at a time when there was little shopping other than high end tourist places, the State Street shopping is now an excellent place to do typical daily shopping or “vacation” shopping. So many choices. The Paseo Nuevo mall is nicely done, and offers a variety of choices that expand your options. The restaurant & bar scene on State is vibrant and fun, with all kinds of selections. If you like to shop and eat, State Street in the downtown area will be fun for you. Just a note: State Street is very long, and changes to residential/commercial business once you pass the downtown area. If you see accommodations with a State Street address, they may very well not be in an area close enough to walk to the shopping area. Check a map to make sure. The main shopping/eating area is between Cabrillo (along the beach) up to about Victoria.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Good walking street for everything.", "This is the Main Street of downtown Santa Barbara. Good long walk with restaurants, shopping, historical buildings etc"], ["Reviewed November 15, 2017", 4.0, "Take a self-guided tour that includes State Street", "Presumably everyone in the world has heard of Santa Barbara. The truth is, of course, that this ocean-side city is much the same as many Californian towns. It is way richer than most of course. And because of that it can save and look after its history.\n\nSo, take a self-guided walk (either get the information online or from the Visitor Center) and you will find State Street is the backbone of the walk. Avoid the stores, who needs to shop in Santa Barbara? Look for the history and you will find it. The remains of the Presido, the old courtyards and one of the oldest buildings in the state.\n\nOn a cool October day this was an excellent way to fill in a morning.\nShow less"], ["Reviewed November 15, 2017", 5.0, "FARMERS MARKET ON TUESDAY NIGHT", "We got lucky! Farmers market was going when we visited. 2 blocks of fresh vendors. Selling honey lots of it....., flowers, fruits, vegetables, candles, pistachios, The strawberries were so good. Omg! Its kinda crowded.\n\nWe parked at Hotel Californian and walked u der the bridge towards State St. We we're just going to walk along and hit the shops.\n\nBut we got lucky for sure. There was a \"ONLY IN SANTA BARBARA\" Shop. They have a great selection of SB holiday ornaments. I also found a clearance section.\n\nThere is a 99 cent store here. Load up on munchies for the road. Forgotten supplies, lost makeup, etc.\n\nLots of places to eat and looks like a healthy variety of night life.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Mesmerising!!", "One of the most beautiful cities I have seen so far! Fell in love with its white exterior! If visiting west coast , Santa Barbara would be worth visiting for sure!!! Unlike Solvang which has become quite touristy in recent times, Santa Barbara has got those holiday vibes with local feel!\nShow less"], ["Reviewed November 10, 2017", 4.0, "Stroll down State Street", "We had a great afternoon strolling and shopping down State St. in SB. There is a nice variety of shops and the side streets and spaces were clean and dressed with a variety of Palm tress and other plants. And of course the weather was perfect. Also, there are convenient public parking garages at either end of the street.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Shopping one afternoon", "Be sure to take a day to walk up and down State Street while visiting SB. After the family wedding we attended, we did some shopping. It was fantastic! Just 1 block off of State Street is the Handlebar Cafe and Coffee House, which serves amazing coffee! There's a sandwich place next door, which is fantastic! 3 pickles. Love this area. It has a small-town feel but it's the downtown area and quite nice.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Lots to do!", "Cute and quaint street with lots of activity. Stores, restaurants, bars, massage just to name a few of the types of commerce along the street. Very pedestrian friendly."], ["Reviewed November 4, 2017", 5.0, "A very happening interesting bustling street", "In Santa Barbara , this is where one would love to come again and again The night life was bustling with eateries of al varieties , lovely interesting shops, even the lively shopping malls.. the whole adobe architecture was so lovely.. So festive too"], ["Reviewed November 1, 2017", 5.0, "Excellent sightseeing, people watching, eating, drinking and shopping", "We had an entire afternoon in this area, so we walked along the entire street. Great sightseeing, and people watching.\n\nWe entered almost all the stores, most stores were welcoming, even the high end ones that everything is way outside my budget.\n\nWe stopped in for coffee, lunch and then dessert in different places. Did some shopping too, Ended meeting up with friends at a nice outdoor patio beer garden.\n\nTake the time to enjoy at a leisurely pace.\nShow less"], ["Reviewed October 27, 2017", 3.0, "Visit", "Although state st looks on the surface really pretty but when you either walk down it or sit and have a meal, there are lots of homeless people asking for money. It can be quite intimidating plus there are lots of empty shops too."], ["Reviewed October 26, 2017", 5.0, "I had a wonderful time sightseeing, shopping and eating on State Street in Santa Barbara !!!", "State Street has many wonderful shops and restaurants. I enjoyed walking and looking inside the different stores and just had fun with friends. The weather was perfect also. A great sunny day in Santa Barbara. We ended the day with ice cream and it cannot get any better that that !!!!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Great place for shopping and dining", "State Street is a great place to wander along.(It is a long street!) It has some very interesting shops and a wide variety of eating places from snack food to fine dining. There are museums and Theatres as well. There is also a Mall alongside the street with the usual quality shops)\nShow less"], ["Reviewed October 25, 2017", 3.0, "average shopping. better in a mall", "its like a giant mall on one street. you walk a lot. the restaurants were not good. they can have santa barbara it's for old people. go to beverly hills and see more, do more for less"], ["Reviewed October 24, 2017", 4.0, "State street strolling", "This street in Santa Barbara is the main shopping street which leads down to the beaches and sterns wharf. It has lots of shops and eateries including restaurants and coffee shops. Some of the larger stores are Ross dress for Less, Saks outlet and a very large Forever 21. A lot of the stores are boutique clothing stores but the street also features a Levi's, Sketchers and Vans. It's a beautiful tree lined street with a lot of Mediterranean influences in the architecture. It was very clean and a nice place to walk. Parking is located close by in numerous underground parking lots.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Still amazing after all these years", "Shops, restaurants (Jane's), theaters, the first Cat Cafe (1213 State St Ste I) so much to see, so little time, can't wait for our next Santa Barbara get away:)"], ["Reviewed October 20, 2017", 4.0, "Fun place to shop", "A great long walk. Lots of shops and restaurants. A fun way to spend an afternoon shopping and people watching"], ["Reviewed October 17, 2017", 5.0, "Great people seeing, walking, eating, shopping", "My daughter and I visited for the day and really enjoyed walking the strand on State St. From small boutiques, gift shops, and trendy stores to Nordstrom's, Marshalls, and Saks Fifth Off, to every possible restaurant you can imagine. ENJOY. Find public parking or street parking for 75 minutes.\nShow less"], ["Reviewed October 17, 2017", 4.0, "LOVELY", "When you like shopping, this really is the perfect place! It 's awesome to walk around in the street and enjoy some fancy restaurants or drinks! A must while visiting Santa Barbara"], ["Reviewed October 16, 2017", 2.0, "The demise of beautiful Santa Barbara", "Tacky, vacant, mall like, franchise, commercial. This is not what Santa Barbar used to be. Best sites about a mile apart at wharf and museum."], ["Reviewed October 16, 2017", 4.0, "Typical Tourist Haven", "OK- so go there once walk up and down and buy something. This is like any other tourist spot that one will either drive by or walk by on to somewhere else. It is what it is."], ["Reviewed October 16, 2017", 5.0, "Love SB", "State Street is the long Main Street running through Santa Barbara with many shops, restaurants, cafes etc etc. Hours can be spent walking up and down although the Electric Shuttle is a boon for sore feet. Our hotel was on State Street as were both of the restaurants we ate at and our favourite bar\nShow less"], ["Reviewed October 16, 2017", 2.0, "Disappointing", "Perhaps we had our expectations set a bit too high for the \"American Riviera\", but we found State Street to be a rather unimpressive collection of corporate retail and nondescript bars and restaurants. Claire's? Seriously? The wharf, while quite scenic, had nothing memorable to see in the way of shops or dining. We tried to find a fun place to stop for happy hour on a Wednesday afternoon, and virtually every bar was deserted. The only highlight of our entire day in Santa Barbara was the Spanish Garden Inn, which I highly recommend.\nShow less"], ["Reviewed October 15, 2017", 3.0, "Pretty but Fading", "We have not visited Santa Barbara for many years and I am afraid it has faded over the years. The street is still tree lined and pretty but it is not the prosperous place it was. A lot of the food outlets are fairly cheap burger places although we did eat at Viva down a little courtyard and that was smart with nice food. There is plenty of inexpensive parking in the centre but Macy has closed leaving only Nordstrom of the large decent clothing outlets. Much of the street is just touristy while the bottom end toward the beach has more closed premises than open. State Street needs a boost somehow, maybe a bit more than the old pianos for passers by to play on. (They were in tune though) I don't want to dissuade any one from coming to Santa Barbara, but you should research some destinations such as the Mission or the Court House. The street by itself does not offer much\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great Way to Walk and Enjoy", "State Street is a great place to take a walk at your own pace and do a little shopping, a little dining, or just watching the people. It's clean and beautiful and filled with an eclectic variety of shops and restaurants."], ["Reviewed October 14, 2017", 5.0, "Has everything; pubs, designer stores, tourist shops", "Great place to spend a day or 2. There are tons of pubs, restaurants, designer stores, discount stores, and touristy shops. Anything you could desire to eat can be found, from Irish pubs, to quality Sushi, to French fine dining. Shopping from Prada to Marshalls to furniture. The electric trolley can take you from one end to another for 50 cents, and several attractions like the museum, courthouse and waterfront are blocks away.\nShow less"], ["Reviewed October 13, 2017", 4.0, "Restaurants galore", "State street is fun Lots of funky shops and any type of food a person desires . You can start or end up at the pier."], ["Reviewed October 13, 2017", 5.0, "Love this place", "Being Ventura county/LA resident, we have been going to Santa Barbara for over a decade now. Love State street. Good food options and happening area. Highly recommended."], ["Reviewed October 13, 2017", 1.0, "Clean up this charming street the homeless have taken over!", "This was the highlight on my previous stays in Santa Barbara. I m very disappointed with the lack of police to move the problem away from the tourist. I use to marvel at the clean charming shops and sidewalks. This is all gone with the current state of our country it's sad to see this, I know the real issue at hand but the smell of urine and feces makes me sick. Panhandlers all over and street performers need to be moved along and out away from the outdoor restaurants. I am not heartless just would love to sit on a clean bench without the fear of lice and bedbugs. Any ideas would be appreciated.\nShow less"], ["Reviewed October 12, 2017", 4.0, "State street", "Lots of shopping and good places to eat. Tuesday night Farmer's Market makes it even more fun. Quite a few homeless in the area."], ["Reviewed October 12, 2017", 3.0, "Santa Barbara", "We were in town for a wedding and ventured out to State Street a few times. The parking was not my favorite, for those from bigger cities this may not be an issue. There is a pretty big homeless issue here, many folks asking for money....some screaming at people as they walk by. It was a little off putting at times, seems the folks that run the City would do more to help these folks and move them away from the tourist areas. It was also a huge issue when walking the beach.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Great Shopping and Fun Atmosphere", "We love grabbing a snack and walking down State Street. There's so much to see, including great architecture. It doesn't lack for shopping, and several shops are very artistic - my fav! You can enjoy yourself without ever buying anything . . . shhh!"], ["Reviewed October 11, 2017", 4.0, "Still one of premier shopping venues in SoCA", "Lovely tree lined main street with a nice mix of both chains & boutiques that runs for many blocks. Like most business areas, SB took a hit from online shopping. It lost one of two Macys & quite a number of small local stores. But there remains a great vibrancy of offerings esp casual cafe dining & coffee/juice/wine bars. Also, not surprising this close to Hollywood, there’s quite an array of cinemas.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Great For Eating & Shopping", "Lots of shops and restaurants to choose from, easy to park, and leads down to the beach and pier via a short underpass. Only wish I'd had more time to explore the place before moving on."], ["Reviewed October 10, 2017", 4.0, "Lots of shops", "If you like to shop this is the place for you. Reasonable places. We took the bus up and walked down and visited the shops."], ["Reviewed October 7, 2017", 4.0, "Like an outdoor mall", "This street has everything! Extra bonus on Tuesday & Saturday they have all the local farmers bring produce to sell on the street. That was so nice to be able to purchase from the locals. I also like how it was bicycle friendly"], ["Reviewed October 6, 2017", 5.0, "It has everything!", "You can find everything, restaurants, coffee shops, clothing stores, banks, bars. It's a nice Touristic street."], ["Reviewed October 4, 2017", 5.0, "Stately progress", "Main Street in town most of best shops on or adjacent with restaurants bars cinema theatre something for everyone"], ["Reviewed October 3, 2017", 5.0, "Take the trolley to the top and walk toward the pier", "Take the trolley to the top and walk toward the pier. Plenty of shops and restaurants. Stop and relax in one of the capers and enjoy coffee and a pastry. Lots of interesting restaurants. At the lower end is the Santa Barbara pier."], ["Reviewed October 2, 2017", 5.0, "Always fun", "We spent several months in Santa Barbara and loved State St.\nParades and local events ( Summer Solstice, Fiesta) evolve around State St. So it seems like it is always decorated for fun times.\n\nSeveral retailers have left, leaving some vacant stores, but there's still plenty available for shopping or eating.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Shopping!", "Lots of fun shops and plenty of restaurants and bars. Great place to spend a day. You won't be disappointed."], ["Reviewed October 2, 2017", 5.0, "Lots of Fun Shops and Great Restaurants", "A beautiful day in Santa Barbara should include visiting State Street, where there are lots of restaurants, coffee shops and shopping opportunities. It is a very Long Street, so if you plan to visit, plan on spending at least a half a day."], ["Reviewed September 29, 2017", 4.0, "Take a walk on a sunny Spanish Calle .", "You can walk from the Pacific Ovean for three miles up to the historic Mission Santa Barbara. Great restaurants, trendy boutiques and throngs of people make it fun. Take the State Street trolley for $.50 ' Great way to spend the day !"], ["Reviewed September 27, 2017", 4.0, "Lots of Great Shops", "Definitely spent some time walking down State Street while you're visiting Santa Barbara! There are lots of great shops and an eclectic combination of things to buy. Great fun for the whole family!"], ["Reviewed September 26, 2017", 5.0, "A shopper's dream", "My wife is the shopper and fashionista in our family, I am the walk along husband. That being said I also enjoyed strolling State Street. The shops are unique, very clean and all in all a fun day can be spent here. Some of the shops are tucked away off the beaten path and they are some of the best to visit, so keep your eyes open to a little opening off to the side.\nShow less"], ["Reviewed September 22, 2017", 2.0, "What Happened to State Street?", "We have lived in Ventura and the Santa Barbara area since the 70s and have seen many changes over the years, but none so shocking as the recent changes to the main shopping and restaurant district on State Street in Santa Barbara. In the heart of the main shopping area for locals and tourists alike, one now sees significant business closures with for sale and lease signs on buildings up and down State Street. Even after the crash of 2008, I don't recall seeing as many retail restaurant and retail shop vacancies as I observed on a recent overnight trip to Santa Barbara. The numerous for lease and for sale signs on store fronts detract from the overall experience of strolling down State Street. While the sidewalks are clean and shrubbery and planters are well maintained, the store fronts of the closed buildings are not well maintained with dirty and dusty windows and facades. Many of the windows of the closed buildings are taped over with brown paper, which is peeling off the windows from inside. At some point this decay will impact neighboring businesses which are still operating.\n\nTransients wander the street and on some occasions, as I observed, accosted some of the pedestrians. Although I personally did not feel threatened some might feel differently walking along State Street.\n\nI hope that Santa Barbara can find a solution to reversing the decaying shopping and dining area on mid-State Street, for it has historically been a fun experience strolling the Street.\n\nHowever, all is not lost because the Funk Zone that used to be a run down area and the place to avoid, seems to be booming now. Its located at the lower end of State Street by the beach and pier. Its definitely where the action is now, especially if the wine tasting scene appeals to you.\n\nOn the other hand, If you want to get the feel as to what strolling and shopping on State Street used to be like, travel about an hour and a half up the coast to downtown San Luis Obispo. Its the way Santa Barbara was like in the 70s and 80s.\n\nHappy travels.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Nice place to walk around and shop/eat", "We enjoyed a morning stroll along State Street. There are endless shops and many restaurants, There are also a couple of museums and an art gallery so there is plenty to see and do."], ["Reviewed September 15, 2017", 4.0, "Great location to stay", "Stayed at Best Western pepper tree inn on state street. Great location for access to all sites, beach etc. State St has so many bars and restaurants to choose from and great shopping including Macy's department store!"], ["Reviewed September 15, 2017", 4.0, "Relaxed shopping experience!", "We've been coming here for years. There's not as many shops here as before, but you can still find some fun places to browse. Some very overpriced shops, but you can find some great local shops for t-shirts & local crafts. Restaurants abound & the scenery is amazing. Use the local trolley to get around....50cents per trip (less for 62 plus & youngsters, and drivers are very courteous and helpful). Look for Farmers Markets that close down State St. The produce & local merchants are spectacular! A definite must do! I give this a 3 for local shops, a 5 for scenery & restaurants and a 5 for the Farmers Market.\nShow less"], ["Reviewed September 13, 2017", 4.0, "Great choice of shops and spotless", "Really loved our visit to State Street. Loads of shops and restaurants, mix of independents and chains and a really nice street scene that makes it a really pleasant environment to walk down."], ["Reviewed September 13, 2017", 2.0, "Not a fan", "It was ok but overall not a big fan of this district...many closed storefronts and just not a great vibe as it seems to be deteriorating."], ["Reviewed September 13, 2017", 5.0, "Satisfying for all budgets", "From consignment shops to high end indulgence, all your needs can be met! The area shines with the goods of local artisans and the outdoor shopping. The weather is always gorgeous. You cannot help but glide through the shops! I find it most helpful to leave the watch at home. It's worth an entire day. The shopping, the restaurants, the local arts simply engulf any need to fulfill prior appointments!\nShow less"], ["Reviewed September 13, 2017", 4.0, "Always changing, always interesting!", "Like any city, downtowns change, but Santa Barbara's history and architecture will keep most folks fascinated. Remember, State Street goes way past the Arlington!"], ["Reviewed September 13, 2017", 5.0, "Always a fun time", "State Street is always a,fun way to get a bit of exercise. Good mix of shops, restaurants and bars. Did notice that several stores,that were previously there are now gone. Hope,the downtown continues to be relevant."], ["Reviewed September 13, 2017", 5.0, "Lots of shops and restaurants for all types of budget", "There is something for every taste and budget, from shopping to restaurants. The variety is great. We spent 5 days in Santa Barbara and never got tired of exploring the various shops and experiencing variety of good food."], ["Reviewed September 12, 2017", 5.0, "So much to see!", "Check out the Theatre District at the one end of State, and Stearns Wharf at the other end. State Street ends in the ocean at the Wharf. Lots of restaurants, shopping, but also beautiful old historic buildings such as multiple old theaters, the Courthouse, and others. This is a great place to go for a walk.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Main Street of one of the most pleasant towns in California", "I lived in Santa Barbara during the 80's and have visited on and off over the years. The street has changed, of course, but always offer many things to do and see, including people watching. There is much to see on t he street and within one block either way. A great stroll when visiting.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Southern Californian Spanish revival", "State Street is the main shopping and business thoroughfare in Santa Barbara. Like much of the city, it has very pretty Spanish style buildings and architecture. SB is a relatively compact and accessible city, and State Street perfectly reflects that aesthetic. a long and elegant boulevard, it terminates at the seafront and the Santa Barbara pier, and gives vistas of beautiful and breath taking views of both the ocean and the city behind alike.\nShow less"], ["Reviewed September 8, 2017", 5.0, "State Street - The Main Drag", "Walk from the wharf right up State Street, plenty of shopping, restaurants and sights to see. The Main Street of SB and what a long one it is....walk one way and take the Trolley back for 50c a ride. Plenty of shade and a great place to people watch!\nShow less"], ["Reviewed September 8, 2017", 3.0, "Stimulating, interesting but very noisy", "If you want to see what can be done to keep a downtown viable, visit Santa Barbara's State Street. It is a must see.\nThe downside is that California has lots of egoistic losers who somehow need to attract attention to themselves by making noise - with cars or motorcycles. This can make a conversation difficult at one of the many sidewalk/outdoor restaurants.\nShow less"], ["Reviewed September 6, 2017", 3.0, "Shopping street", "Runs from the pier through the. Enter of town. Wide variety of shops and eateries with a regular farmers market selling high quality local produce."], ["Reviewed September 6, 2017", 5.0, "Great vivid place", "Go in the evening, it's much better. Great shops and places to eat. We parked on a side street and walked around for hours. Beautiful place."], ["Reviewed September 4, 2017", 4.0, "Nice Shopping Street", "Nice old mission style charm for shopping in downtown Santa Barbara. The area seems to be a little depressed as several shops are closed up with vacancy signs. Still a large number of walkers/shoppers. May be rents are too high."], ["Reviewed September 2, 2017", 5.0, "Fantastic shopping experience", "I rode the trolley all day hopping on and off to the areas I was interested in. 50 cents per ride; the trolley's runs from 10am to 6pm Monday through Friday and till 10pm on the weekends, it's a great way to ride and see stores you want to visit and hop off there. Nice and cool ride!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great stroll", "Wonderful to stroll up and down, shopping, eating and drinking. Nice atmosphere, beautiful buildings."], ["Reviewed August 28, 2017", 4.0, "Nice way to spend time", "Something for everyone, a bit touristy but not too bad. Neighborhoods on upper State Street are very charming."], ["Reviewed August 27, 2017", 5.0, "Everything you need is on State Street", "State Street has restaurants from Seafood to Pizza and everything in between. Lovely street with plenty of benches if you get tired. Great to just stroll and visit the shops."], ["Reviewed August 23, 2017", 5.0, "Great shopping and restaurants", "Stayed in a hotel on State Street and was able to wander the shops, eat food and ice cream, stop into a bar to watch an NFL game, listen to live music, etc. Definitely worth an afternoon if you visit Santa Barbara"], ["Reviewed August 22, 2017", 4.0, "Would like to give a 5 star but", "State street in Old Town is great. Lots to do. Walk and walk. Site see the beach or the old courthouse or the mission. Easy to get around on the shuttle- 50 cents or 25 cents for seniors. Lots of dining on the sidewalk with your dog or inside. Outlet stores are prevalent. So why 4 stars? The sidewalks need cleaning. It feels dirty. Leaves and small trash everywhere. In fact the whole area not just state street. Clean her up Santa Barbara !\nShow less"], ["Reviewed August 22, 2017", 5.0, "Uniquely Santa Barbara", "If you're visiting the Central Coast a visit to State Street is not to be missed. A mix of unique shops, not many chain stores, and eateries is not to be beat in this California classic."], ["Reviewed August 21, 2017", 5.0, "Lots if great shops and restaurants - parking always a challenge", "Enjoyed many of the small unique stores and restaurants but not the accessibility. Lack of ease for handicapped individuals with such poor parking. Need more Free lots with store validation"], ["Reviewed August 19, 2017", 4.0, "Easy to walk around", "Fun shops and easy to stroll around, lots of frozen yogurt options, all kinds of shopping and Thursday farmers market"], ["Reviewed August 18, 2017", 4.0, "Nice stroll", "This is a nice area to stroll along. Numerous shops and restaurants but quite a few closed ones as well. There is a shuttle that runs up and down the length of the street with transfers to the zoo and harbor. Worth taking a look"], ["Reviewed August 18, 2017", 5.0, "Downtown Santa Barbara", "State Street is the main drag in downtown Santa Barbara. There’s a mix of local and chain stores here. Also there are a lot of good restaurants to choose from. However turnover seems to be high—might have something to do with the high rents. The downtown area is within walking distance to the wharf, which is where State Street ends. Somewhere in the middle is Paseo Nuevo mall. Plus there are a few hotels right on or just off State Street that are highly recommended. Once a week a couple blocks of the street are closed to traffic for the farmer’s market. It’s definitely a nice place to take a stroll, get some dinner, or have a drink. And it doesn’t seem too touristy.\nShow less"], ["Reviewed August 17, 2017", 5.0, "A very nice stroll", "State street is the Main Street in Santa Barbara, where you can have a nice long stroll from Stearns wharf up all the way through shops to historic sights."], ["Reviewed August 16, 2017", 5.0, "Great Walking Street", "Super cute, great shops and a fun place to enjoy a walk. We were there during festival and it was so much fun!"], ["Reviewed August 15, 2017", 5.0, "Old Spanish days fiesta", "First of all State street is filled with shops and restaurants and cool little places. I went for the old Spanish days fiesta and it was a blast. Overall Santa Barbara is a great town with a great culture of people here! Can't wait to come back!\nShow less"], ["Reviewed August 14, 2017", 3.0, "Nothing great", "State street is a lot of hype and nothing great to see. Just a lot of restaurants and bars and very few stores....apparently there used to be more but due to the popularity of online shopping they are closed. It is a long street...if you go there is no need to walk the entire street.\nShow less"], ["Reviewed August 14, 2017", 1.0, "Not good", "Did not enjoy this on a recent Sunday night at all, lots of seedy areas, vagrants dodgy massage places, closed shops, appears run down and wouldn't recommend it"], ["Reviewed August 14, 2017", 5.0, "Santa Barbara strip", "There really are no all inclusive words to describe ur first visit to Santa Barbara's state street ... although slightly more affordable than Beverly Hills rodeo blvd it is equally as interesting ... possibly more so as rodeo blvd shopping is really for the wealthy .. state street has something for everyone....the A to Z goes from Apple Store to Zillys bike rentals state st has it all .. starting at the northern end in a large shopping center and wandering slowly thru historic areas that include the historic old mission to the picturesque court hose complex and ending up right down on the pristine beaches that include the famous stearns wharf and the large bustling marina .. a feature of Santa Barbara that must be considered mandatory for any visitors\nShow less"], ["Reviewed August 14, 2017", 5.0, "People watching", "We went las Saturday, have a nice walk there, niche shops and restaurants, if you want to see and being see, this is the place to go, also nice eateries around all kind of food to choose."], ["Reviewed August 10, 2017", 4.0, "Beautiful Weather, Shops, and Restaurants", "State Street is a wonderful way to spend the day if you happen to be in the Santa Barbara area. Park just off the 101 at Garden and State in the pay lot (it's cheap). Then, head out for a leisurely stroll away from the beach and enjoy the beautiful weather and wonderful shops. There are local, funky shop as well as more established corporate places. Outside dining and drinking is abundant, as is people watching. You'll eventually find yourself in an outdoor mall around and in which you can wander, and there is even a movie theater for the more indoorsy types. Some stores and people seem out of place, but these can easily be ignored. Go under the freeway and enjoy great seafood at Enterprise Fish Co., or walk a couple of blocks to the beach and enjoy all the sights available there. You'll have a great day.\nShow less"], ["Reviewed August 9, 2017", 2.0, "Unsafe", "State Street was nice during the day. The shops were cute and the restaurants we chose were excellent and not too over priced, but beware at night! The homeless people start coming out when the sun goes down and it starts looking like a homeless village. One of them followed and circled my group for a few blocks getting way too close. It felt like he wanted to take my purse. We felt very unsafe. We took shelter in one of the business doorways and when I took my phone out he went away. I was very shocked to see how many homeless people there were, and not a cop in sight. This was my first time here and it was not such a good first impression.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Awesome atmosphere", "A must if in Santa Barbara where everything is and the decor is superb make sure you go to the new paseo shopping area"], ["Reviewed August 2, 2017", 4.0, "Nice walk for a tourist", "State Street is quite pedestrian friendly. Driving it is difficult. A must see for unique shops and environment."], ["Reviewed August 1, 2017", 2.0, "Needs something new !", "I agree with a lot of other posters . They claim urine odor and they are correct ! I have been coming here once a year for the last 5 years and I swear half the stores are out of business. It's depressing to see . They need something to make it an attraction again.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Quaint", "Such a quaint little area, our hotel was 2 miles east of downtown center, beautiful floral and fauna during the walk through the more residential side of Stare St then the downtown area with quaint shops along with the chain store nestled in. Very laid back and relaxing stroll through area\nShow less"], ["Reviewed July 31, 2017", 5.0, "quick visit to Santa Barbara", "Arigato sushi is amazing! Brophy Bros always incredible! Did the State Street trolly to get to know the town easy rip and very resonable"], ["Reviewed July 31, 2017", 5.0, "Romantic", "Romanticism is the theme here. Whether you like the charm of Spanish colonial architecture or sassy European decadence there is something for you on State Street. We especially enjoyed our shopping experience, which included Italian pottery from a local proprietor who sources from various towns and villages in Italy. Although a little pricey we a really enjoyed strolling here.\nShow less"], ["Reviewed July 29, 2017", 4.0, "Visit State street for coffee, restaurants, shopping, bars and people watching.", "State street, we heard, is not what it used to be or likely will be again. Quite a few closed storefronts mixed in with many open and bustling coffee shops, bars, restaurants, and stores. The Stores range from small, unique, expensive, to mall-staples, such as Neiman Marcus and the GAP. Some big players are closed, such as Macy's. The restaurants on and just off of State street are of every variety. We wandered into several we located on TripAdvisor and found them to be just as described. We enjoyed walking and bike-riding up and down State street.\nShow less"], ["Reviewed July 29, 2017", 3.0, "Some pretty architecture but really just a shopping street", "I'd definitely recommend walking down State street at least once during your visit. The architecture is pretty in places and there are some quaint courtyards hidden away. However at the end of the day it's a street full of high street shops!"], ["Reviewed July 28, 2017", 3.0, "Probably worth a few hours...", "Yes this Is probably worth some time while on your travels in SB although I wouldn't waste too much time here. There's some nice restaurants, bars & shops to explore but personally SB is famous for its coast so I personally preferred to be closer to the coastline than in amongst the hustle & bustle of this place. I've seen a lot nice main streets / old towns or whatever you wana name it.\n\nThere's also lots of homeless up that way.\n\nAs I said it's probably worth a hour or two at best.\nShow less"], ["Reviewed July 27, 2017", 5.0, "State street is great for walking", "Loved going around to the various locations on state street for shopping, eating establishments, funk zone. Very nice"], ["Reviewed July 27, 2017", 4.0, "Lots to do!", "There's lots of shopping and good restaurants along this street. It is good to go for stroll at any time of the day. Check out the shopping mall just off State Street for some good shopping. Also, stop in to one of the many wine tasting rooms sprinkled pretty much everywhere just off State Street.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Beautiful Downtown Santa Barbara", "My husband and I live in LA. We love driving up to Santa Barbara and spending the day downtown. There are so many cute shops and great restaurants - plus it's minutes away from the beach."], ["Reviewed July 26, 2017", 3.0, "No long vibrant", "The once exciting shopping and restaurant area has very little worth seeing anymore. Worse yet, the area has a depressing odor of urine."], ["Reviewed July 25, 2017", 3.0, "Another place feeling the online hit to retail", "State Street is still a pleasant walk but its clearly seen better days. While there are still many nice restaurants and shops on it and adjoining streets, there are also more vacancies and budget establishments. Further, the last few blocks (southern end) has quite a collection of homeless - sad and shocking in such a wealthy enclave.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Different areas up and down State Street.", "Great street for shopping, food and entertainment. Go under the bridge and to the \"funk Zone\" near the beach and park for more mature food and beverage places and still reasonably priced. Prior to the bridge is the clubs and bars with the younger crowd and lots of energizing music.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Nice walk in a cute city", "The heart and spinal cord of Santa Barbara. Nice street with tons of cute stores and tempting restaurants. And if you get tired, hop on a trolley!"], ["Reviewed July 22, 2017", 5.0, "Street walking", "Fun place to walk around and visit. Lots of shops and eateries and a good place to people watch. The weather was amazing."], ["Reviewed July 20, 2017", 5.0, "Stores, Cafes, Restaurants and people.", "This street has tons of stores to shop at. Cafes to sit down at, and restaurants to eat at. You can walk up and down the street and even people watch. This place has action. A must see place......"], ["Reviewed July 20, 2017", 5.0, "Quaint shops - great and varied restaurants", "Great place to meet friends, shop, large selection of restaurants from quick pick me up go romantic restaurants. Lots of boutiques and brand name stores. People watching at it's best."], ["Reviewed July 20, 2017", 5.0, "Fun Street", "This street has it all: shopping, clubs, restaurants, and bars. There are movie theaters and live theater. The Spanish architecture is lovely."], ["Reviewed July 19, 2017", 5.0, "Shopping and People Watching Galore", "Take a stroll along this street for tons of window shopping and people watching. You will have a great time enjoying the ambiance and also seeing all the cool stuff for sale here. A little further down the street and there are tons of local cafes and eateries. Sit out on the sidewalk in the beautiful weather and enjoy the day! Still further down you will encounter the sea, bright blue and refreshing...take a beach chair with you (or stop at the local GoodWill store across the street and pick one up for cheap) and watch the sunset from the sand.\nSuch a great town and State Street is the heart of the Santa Barbara experience.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Friendly main drag of downtown Santa Barbara", "We visited Santa Barbara for three days and three night, and we enjoyed \"passagiata\" (stroll) on State Street three nights and one morning. Locals of various ages, esp students fr SBCC and UCSB, come here. State Street has high-end and low-end department stores and clothing stores, second-hand clothing stores, restaurants, nightclubs and bars, coffee shops, ice cream store, etc. We walked 2 mi each time we came. We had dinner and lunch and ice cream on State Street on our visits. The Santa Barbara Museum of Art is on this road. The Santa Barbara Courthouse is one block over. Street parking is ample on State Street and streets close by. City-run parking lots with about an initial hour of free parking is available.\n\nThe only sad sight are the many homeless folks on State Street. We never got panhandled but they were there.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Santa Barbara's \"Main Street\"", "One of my favorite memories of State St. is of one time in springtime, when for some reason I had to wait around downtown. I got a spot on a bench on State St. and then a slight breeze came up, and I noticed flower petals falling like snow from the trees lining State St. I sat there on the bench, enjoying the sunshine in a billow of flower petals, and it felt like magic.\n\nState St., which is Santa Barbara's \"Main St.,\" is a long street with various different sections.\n\nFrom Highway 101 going uphill to Sola St., State St. is the heart of the downtown district., with lots of shopping, restaurants, sidewalk cafes, a couple of movie theatres, the Paseo Nuevo shopping center and the SB Museum of Art. This section was beautified block by block a number of years ago. You can pick up a downtown walking tour map from the Santa Barbara Visitor Center that occupies the tiny stone building on the corner of Garden St. and Cabrillo Blvd., just opposite the beach.\n\nThere are lots of benches along this part of State St. where you can take a rest for people-watching, if you like.\n\nFrom Highway 101 going downhill to the beach, that area is called the Funk Zone.\n\nIf you continue on and walk out over the ocean going straight out from State St., that is Stearn's Wharf, with shops, restaurants, and the Sea Center museum. A large compass at the end of Stearn's Wharf shows you that if you are there looking out to sea, you are actually looking south!\n\nThe electric Downtown Shuttle bus runs up and down State St. between Stearn's Wharf and Sola St. every 10 or 15 minutes from 10 a.m. to 6 p.m. and costs 50 cents. On summer evenings from Memorial Day to Labor Day it continues on from 6 to 9 p.m. with service every 15 minutes.\n\nMuch further up State St. is another commercial area known as Upper State St., patronized much more by locals than by tourists, with more shopping, restaurants, motels, etc., and the La Cumbre Shopping Center.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Still fun, but needs upgrading", "First let me say I'm biased because I actually live here.\nState Street is considered our \"entry way\" into downtown SB and there are some very good stores, restaurants and bars - but it's all in need of an upgrade.\n\"Lower State\" which is on the beach side of the railroad tracks has the Funk Zone with lots of fun breweries and eateries.\nThe new MOXI Children's Museum is fantastic if you have young kids visiting. (right at State and the railroad tracks)\nState Street is a great place to spend the day or a weekend, there is something for everyone.\nShow less"], ["Reviewed July 18, 2017", 5.0, "4th of July Parade on State Street", "I enjoyed the 4th of July parade down State Street. There was a good variety of floats and activities. It was colorful and tasteful except the Tea Party Float which they could have left out--don't need to politicize everything."], ["Reviewed July 18, 2017", 3.0, "Like a shopping mall. On the street!", "Who doesn't love a bit of retail therapy? To me it feels that this is a locals-first spot of Santa Barbara. Lots of chai stores, local and chain restaurants offer a bit of something for everyone. The historic appearing facades are charming. Prepare to pay for parking, but fear not, the costs are reasonable.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Nice place to wander", "Plenty of shops and restaurants to keep everyone busy and entertained for the day. Nice way to spend a day and night."], ["Reviewed July 15, 2017", 5.0, "Best shopping in SB!", "This is THE BEST shopping spot (or should I say, street) in Santa Barbara. Beautiful streets lined with dozens of beautiful, unique, vintage as well as new, local and varied shops & restaurants of all price points, including tourist merchandise. I personally love the imported handmade goods from Turkey at 7 Hills Turkish Bazaar and the outdoor Indian booth filled with handmade items from India. What's also nice is you have your more common larger retail chain stores such as Forever 21, H&M, Saks Fifth Avenue, and the outdoor shopping mall Paseo Nuevo which includes Victoria's Secret and Nordstrom, so it's a shopper's dream. I love Paseo Nuevo's european bistro lights dangling overhead as you travel down the quaint & narrow paths of the outdoor mall. You simply cannot visit Santa Barbara without taking a casual stroll up & down State St.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Nice and long street", "I assume this is the main street of Santa Barbara because of the amount of people walking around. There are a lot of stores, known as unknown. Very nice to walk around to go shopping or grab a bite."], ["Reviewed July 13, 2017", 5.0, "Hip and modern city", "My sister and I spent two days walking through State Street for her birthday celebration and we enjoyed it immensely. The streets are clean, stores are modern, updated and interesting and cafes / restaurants are vibrant, health conscious and enticing.\nThe people are friendly and the consignment stores were fun to shop in. State Street is definitely a worthwhile destination.\nShow less"], ["Reviewed July 11, 2017", 2.0, "Needs help", "Too many empty storefronts, too many chains, lots of homeless people needing help. Very little unique or special, spend your time in the ocean, at the beach or in some of the city's great parks and gardens. Well you might want to make a quick stop McConnell's Ice Cream store-its great.\nShow less"], ["Reviewed July 11, 2017", 4.0, "brakin' up", "If you are in S.B. a stroll down State street is a must. Large variety of shops and interesting bars."], ["Reviewed July 11, 2017", 5.0, "Fun and plenty of shopping.", "Came to spend a couple hours while on our vacation through California. Ended up spending most of the day 4+ hours . Had a great time. Good memories."], ["Reviewed July 11, 2017", 5.0, "Gorgeous", "This street is absolutely gorgeous! Tree lined streets, beautiful buildings, and more shopping and food than you could possibly want. A must see, even if you don't even get out of the car!"], ["Reviewed July 10, 2017", 5.0, "Fun street with tons of upscale shops and restuarants", "This street ends at the waterfront and it has everything on it. Many outdoor dining venues, plus shops of any kind you would want. Lined with palm trees and done very nicely, it is a treat to visit."], ["Reviewed July 8, 2017", 5.0, "Road trip", "Very lively at night. Feels safe to walk around. Many many small shops and eateries. Some historical buildings."], ["Reviewed July 5, 2017", 5.0, "State Street SB", "We visited State Street on July 2 as part of a food tour. I was impressed that there were no big advertising signs, no street parking, no vagrants or homeless asking for money. It was clean with wide walkways. It felt safe. The architecture was all uniformly Spanish style. Historical buildings and adobes were everywhere. I love the little Paseos with cafés, winetasting rooms, and shops. There are many great restaurants and unique boutiques. There are also higher-end stores such as Anthropologie, Nordstrom's, etc.\nI loved the exterior lamps, the old theaters, the large trees, and the immaculately maintained landscape and grounds. Santa Barbara makes State Street very tourist friendly.\nShow less"], ["Reviewed July 4, 2017", 4.0, "A must see, spent most of our two-day visit there", "It seems that it took a hit in the last two years, 20% of the stores were closed for good. You can tell because their doors had collected spider webs. Also the city doesn't have a solution for its homeless population."], ["Reviewed July 2, 2017", 4.0, "I like this Street...but", "There are so many shops and restaurants, very pretty. And at night there is lots of clubs to go out to...go club hoping ! My only issue is...I have been going here for years, and this visit was a little disappointing, there are many , closed business...this was unlike anything I have seen in the past. I just wonder why,.\nShow less"], ["Reviewed July 2, 2017", 4.0, "Supping and Shopping on State Street", "Fantastic area for eating, drinking, shopping and simply relaxing with friends or family. State street is a long road so we would recommend taking the tram along it in the first instance and then jumping on and off at your pre-chosen places of interest."], ["Reviewed June 29, 2017", 3.0, "A \"must experience\" for 1st time visitors", "One of our focal points of our trips to Santa Barbara is State Street and the downtown area. Along this palm lined street you will find many types of shops, restaurants, Starbucks, movie theaters, the Museum of Art and boutiques. What is missing is parking places on State Street. However, It is easy to park on side streets, and explore on foot or on the electric shuttle that runs the length of downtown. There is a parking structure near Ortega Street and Chapala. A note of caution...The downside of State Street and Cabrillo that runs along the beach is the dozens of homeless people but don't let that stop you from the experience.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Shopping!!", "Paseo Nuevo was worth going to. Once I figured out where to park it was easy to get around everywhere on State St. Awesome farmer market in Tuesday from 3-6 and they shut down State street. Wear good walking shoes and prepare for lots and lots of shopping!\nShow less"], ["Reviewed June 28, 2017", 5.0, "Really enjoyed State Street", "Great area and a must visit for an out of town visitor. Great shopping, good bars, large selection of restaurants, good mixture of shops, massage, and the best part Wine! Recommend staying in the area or taking an Uber. Not a lot of parking, and wouldn't want to arrive on vacation and go home on probation!\nShow less"], ["Reviewed June 28, 2017", 3.0, "the MAIN DRAG thru SB from N. end 101 to wharf", "at the southern end , theres planty of smaller businesses , from pizza places, breakfast places, AAA , tons of motels, shopping center/ outdoor mall ,\n\nat ocean end, wharf, more restarants and mid -way on State plenty of high-mid range stores, from clothing, furniture, kitchen things, jewelry, movie threater and more restaurants .\nShow less"], ["Reviewed June 27, 2017", 4.0, "Great for Browsing", "Main street with boutique shops, alleyways to explore, nice selection of restaurants, and some lovely old buildings. If you are lucky, you can also catch the street market while you are there."], ["Reviewed June 24, 2017", 4.0, "Nice stroll", "Had several good walks up and down this street and saw something new each time. Looking forward to going back."], ["Reviewed June 24, 2017", 5.0, "A nice Downtown street", "A nice place with shops, bars, coffee shops and restaurants. It has a lovely chilled out vibe and well worth checking out. There are plenty of places to park on the side streets and are $7 for the day, so you can take a stroll down to the beach and pier for the day with no worries about a meter.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Best", "Amazing place good streets so fun and good for breakfast and lunch amazing so fun and popular if u go there plz give them a review"], ["Reviewed June 22, 2017", 4.0, "Wonderful shopping experience", "Lots of retailers and local shoppings going on in the street. It is a really delicate little street. You may even encounter movie stars!"], ["Reviewed June 20, 2017", 5.0, "Shopping on State Street", "We had a fun day shopping and walking State Street. We had a lovely lunch and enjoyed the excellent weather."], ["Reviewed June 19, 2017", 4.0, "seen better days", "We've spent time walking state street several times over the years but have been a bit disappointed lately with the quality of some stores and many vacancies. There are still some that make the walk worthwhile and a number of restaurants to choose from."], ["Reviewed June 16, 2017", 4.0, "Lovely street", "We visited in may. There's numerous shops and restaurants to eat at. The only negative we had was that the night we visited was mid week and the town was fairly quiet. The street is well lit and very clean. We really enjoyed our visit."], ["Reviewed June 15, 2017", 4.0, "An Enjoyable Walk", "We like walking up and down State Street whenever we visit Santa Barbara. It's a tree-lined street with lots of interesting shops and restaurants, always lively with colorful local characters and tourists strolling around. Finding street parking can be problematic, whether it's mid-week or weekend. We usually end up parking in one of the public parking garages.\nShow less"], ["Reviewed June 15, 2017", 4.0, "Great shopping and dining street.", "Lots to see and do invluding theaters. Public parking nearby is cheap.You can spend hours and hours here. Unique and familiar shops. Nice for a long stroll along this tree-shaded route. Other interesting sights are nearby including the Public Market and the Courthouse."], ["Reviewed June 15, 2017", 5.0, "Nice place for shopping", "I love the atmosphere of state street , too many stories and Resturant's . It's so great to walks around and enjoy ."], ["Reviewed June 14, 2017", 4.0, "Birthday Time in Santa Barbara.", "My mom enjoys Santa Barbara so I took both my mom & sister for their birthday retreat. Spent time eating, shopping, and strolling down the blvd. Enjoyed a late breakfast at Anderson's and visiting a few dress and other type shops. Only had 1 day otherwise would have taken in the Art Museum as well.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Reminded me of The Plaza in KC", "Lots of shops and restaurants! It is very nice. Reminded me a lot of The Plaza in KC. It starts right of off the pier and stretches for several blocks. If you want to do some shopping here....this is the place to go."], ["Reviewed June 12, 2017", 5.0, "Quick trip", "Similar to other downtown shopping areas in upscale beach communities. There are independent shops and restaurants along with chain stores."], ["Reviewed June 10, 2017", 5.0, "Amazing shops and food", "Great place to have a wander around the stretch of shops and restaurants is huge on UK standards. Definately worth a visit!"], ["Reviewed June 9, 2017", 5.0, "What a beautiful and walkable area.", "There are so many shops and wonderful restaurants in this charming area. Several wineries have tasting rooms here. My favorites paired wine with artisan chocolates."], ["Reviewed June 7, 2017", 5.0, "Fabulous Santa Barbara", "Wonderful shopping! Every store you might think of, is there. Quaint resale shops as well. Art galleries are wonderful to browse thru! A theater with live shows is very exciting. Locals are there and lines are long."], ["Reviewed June 6, 2017", 4.0, "Pretty decent main street", "In a 5 day stay, we were on and off State street often. There are a plethora of restaurants from start to end. All types of cuisine. The shopping ranges from chain to local, while mixing in the required tourist traps. You have a couple of Starbucks locations, and local movie theaters as an example. Recommend parking at one of the parking lots, that give you 70 minutes free, with the additional being around $1.50 per hour. Get out and walk it. It's very flat and easy to access, with several crosswalks to cut back and forth.\nShow less"], ["Reviewed June 6, 2017", 4.0, "LIVELY SHOPPING STREET", "Very lively place.even though there were no special shops but all were different and nice.One night had an old car display which was nice.Have a lot of restaurants there."], ["Reviewed June 5, 2017", 5.0, "Great shopping", "We weren't in Santa Barbara for long, just a few hours, but of all the places we visited down the coast, this is the one I'd like to come back to and stay a few days.\nSanta Barbara just has a great vibe. State Street was a nice place for shopping. Standard main street stuff mixed in with some quirky, eclectic stores.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Fantastic view on traveling down State Street in the Hot Rod Limo", "We are looking forward to coming back and enjoy walking around conversing and relaxing with the locals."], ["Reviewed June 2, 2017", 4.0, "If your lodging is on or near the beach, you might was to drive.", "A lot of renovation going on right now, so you will have to walk thru a construction zone to get from or to Stearns Pier and the downtown shopping. Excellent restaurants on State St."], ["Reviewed June 2, 2017", 4.0, "Lovely", "lovely street to walk up and down on either side.loads of places to eat and drink and shop.the street itself is lovely with plenty of colour and its very clean.worth a visit."], ["Reviewed June 1, 2017", 5.0, "Charmingly quaint", "Shops, restaurants and people watching. The perfect trifecta So much to see and the best part is that it's clean and family friendly. Dogs welcome too!"], ["Reviewed June 1, 2017", 5.0, "A MUST DO in Santa Barbara.", "I can not image going to Santa Barbara without a stroll down lower State St. So many people, shops, places to eat, even entertainment. And the walk is good exercise and FREE."], ["Reviewed May 31, 2017", 5.0, "Lots of nice shops and people watching opportunities", "Great shopping and just enjoying walking around town there are some high end shops but also department store and smaller gift type placed"], ["Reviewed May 31, 2017", 5.0, "Lots to see and do", "Spent quite a bit of time on State Street this past weekend. More shopping than what I thought at the beginning of the street. I enjoyed the bottom and middle the most. When I go on vacation I like to go into the more touristy places than the major stores I have at home. The wine tasting places and resteraunts are all over so pick out a few to visit.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Must Experience Street", "My wife and I spent 4 days in SB one block off State St. It extends from the SB Pier at the coast several blocks inland.\n\nIt is simply full of really good restaurants, from cheap eats to fine dining. The are lots of interesting locally- owned and national brand shots, movie theaters and department stores. The side streets also have interesting shops and dining places.\n\nLots of places have street-side seating, which are great places to people watch. There seems to something for everyone.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Enjoyable stroll and window shopping, plus farmer's market", "A very pleasant street to stroll and window shopping. Inexpensive shuttle bus runs frequently, free to visitors travelling by Amtrak. Numerous restaurants and cafes along the way. Gelato n More serves the best nocciola gelato this side of the Atlantic. Don't miss out on the fabulous farmer's market on Tuesdays and Saturdays!\nShow less"], ["Reviewed May 28, 2017", 5.0, "Beautiful shopping", "Amazing views of downtown Santa Barbara and great shopping lines both sides of this historic street."], ["Reviewed May 27, 2017", 4.0, "Must see!", "State Street is a great little shopping area but I have to say it looked like quite a few restaurants had gone out of business recently. Hopefully it will rejuvenate and come back."], ["Reviewed May 26, 2017", 5.0, "Best Shopping", "This scenic street provides many unique shops for clothing, knick knacks, and treasures. Not to mention the delicious food and dessert along the way!"], ["Reviewed May 26, 2017", 4.0, "Fun Shops", "Lots of fun shops and restaurants on either side of State Street. Electric shuttle runs every 15 minutes in the summer months, every 30 minutes all other times."], ["Reviewed May 25, 2017", 3.0, "A good spot", "I rate only three stars because some parts of the streets a lot of businesses are closed and there is a lot of homeless. It reminded me a little of Hollywood boulevard. Some great restaurants and boutiques. definitely worth the visit but somehow felt not safe.\nShow less"]]}}