{"Stearns Wharf": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Stearns Wharf", "url": "/Attraction_Review-g33045-d116767-Reviews-Stearns_Wharf-Santa_Barbara_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/4e/bc/23/stearns-wharf.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1636"}, "address": {"@type": "PostalAddress", "streetAddress": "219 Stearns Wharf", "addressLocality": "Santa Barbara", "addressRegion": "California", "postalCode": "93101-3581", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Great view !!!", "Must go place for Santa Barbara. Great view, try deep sea wine tasting room with ocean view, you can bring your own food there ,since they do not have any ."], ["Reviewed 1 week ago", 4.0, "The Wharf", "On a nice bright sunny day it's a nice walk down along Stearns Wharf. You can take some nice pictures of water with the mountains in the background or just take in the serenity of the location. Check out the gift shops and grab an ice cream and wander back. Worth the walk? Yes of course.\nShow less"], ["Reviewed 1 week ago", 5.0, "Nice Wharf", "The wharf is a great stop on your Santa Barbara visit. Less trashy and crowded than other piers like Santa Monica although it still has its fair share of people asking for money. The beach there is clean and dog friendly and the restaurants good. There is parking directly on the wharf although the parking lot is small; they kept letting people into the lot even though it was completely full which was kind of annoying to take an extra 20 minutes to make the trek in to have to go right out but is no big deal if you’re not in a hurry. There are plenty of other lots nearby and the wharf is an easy walk to State Street.\nShow less"], ["Reviewed 1 week ago", 5.0, "Lots of boats and great views", "Easy to get to, lots of boats to see, walkable to State St, food & drink nearby and plenty of public parking."], ["Reviewed 1 week ago", 3.0, "Nice view", "The beachfront area is really pretty and a great photo opportunity. The wharf can’t compare to developed wharf areas in other cities such as San Francisco, which truly are destinations. Go down and take some pics and find some good seafood and take a nice walk along the beach. It’s a short drive from downtown so quite convenient.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth it!!", "Amazing view and romantic place for couples to spend time at the beach. Would recommend it. Plan on going back again someday."], ["Reviewed 2 weeks ago", 5.0, "Nice place for a stroll!", "Lovely afternoon walk on the pier. Great location and place for families. Definitely recommend this for a fantastic visit."], ["Reviewed 2 weeks ago", 3.0, "Kind of boring", "I love piers, especially original piers. This one had nothing really going on.\n\nThe entertainment along the beach is much better in terms of free fun. The views are nice of course but again, not better than from the beach.\n\nI checked it off my list but not memorable unfortunately.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "California Iconic Fishing Pier", "Sterns Wharf is a must walk to visit several classic restaurants as well as gift shops! Grab a fishing pill and catch lunch or dinner"], ["Reviewed 3 weeks ago", 3.0, "A long walk", "There is not much there at Stearn's Wharf unless you are looking for a restaurant. Even the view of the ocean or shore is not that interesting. Next time we will try the marina."], ["Reviewed 3 weeks ago", 5.0, "A joy to walk along the pier", "A superb walk taking in the ocean air and seeing the lovely shops and restaurants doing great trade. Stop at the Sea museum"], ["Reviewed 3 weeks ago", 5.0, "Beautiful Wharf", "Quite a long walk along the wharf, but good Restaurants at the end, quaint novelty shops, and fabulous views of the surrounding area. Wear good walking shoes."], ["Reviewed 3 weeks ago", 5.0, "A Great Place to Walk", "Fun to walk and watch the birds and sailboats and yachts. Good restaurants to eat by the water. Short walk to State where you can visit the local shops."], ["Reviewed 3 weeks ago", 4.0, "A Great Place for a Casual Walk, used regularly by locals.", "I have walked and fished this pier since a child. You can also drive a car (very slowly) to the end. There are shops and restaurants...The Harbor (fine dining) and other more casual places to eat and shop at the end of the pier...There is limited parking at end of pier.\nBeautiful views of our City....Enjoy!!!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "What a pleasant morning stroll", "This was a lovely morning stroll across the wharf. Picturesque views of Santa Barbara and some lessons in history through the plaques. Great place and can drive onto the wharf and park free for 90 minutes"], ["Reviewed 4 weeks ago", 3.0, "Good place to watch the sunrise", "Kinda cool that you can drive your car on it but nothing special about it in general. But it is a pretty place to watch the sunrise."], ["Reviewed 4 weeks ago", 5.0, "What a lovely place", "My husband and I walked down here while visiting Santa Barbara. A few locals were fishing off the end of the pier. They were so friendly and welcoming insisting we try our luck fishing with them , a really sweet older gentleman called ‘doc ‘ really went out of his way to teach us how to fish.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "A nice pier, but....", "The pier is nice, however Santa Barbara sits in a position on the Pacific Ocean where a lot of the days are hazy and overcast, so you have to time your travels right to get a sunny day to really enjoy it. The day I went was hazy and overcast, so you couldn't see out very far. It's fun to sit and watch the fishermen on the pier and watch the pelicans sitting on the roofs sunning themselves.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Lots of cool places to eat, amazing views from all of them", "We had dinner with the sun setting along the coast. It was amazing to sit and watch that. There are several shops with trinkets and stuff, you know the ones, ice cream shop and several other places to eat. There is no railing at the end so kids could be in danger of going for a swim. There is parking out there but seems like it would fill up quickly on a busy day.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Nice walk", "It's a standard wharf if you've ever been to one. A few restaurants and shops, great view. Some people were fishing. The pedestrian walk was in need of some refurbishing and organization as it kind of just ends and you have to cross over but it wasn't too bad. Great fish and chips at the little shop.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Nice view onto the ocean. A bit touristy", "We were fortunate to be on the wharf (it's really a pier - Google it ;) ) during low season on a beautiful day. The first 90 minutes on the wharf are free (for cars). You can also walk onto the Wharf. It is at the ocean end of State Street. Unless you're planning to eat at one of the restaurants, 30-45 minutes is plenty of time.\nShow less"], ["Reviewed January 15, 2018", 4.0, "GREAT WALK OUT OVER THE WATER", "I always include the pier in my walks when visiting Santa Barbara. It is a scenic spot where you can fish at the far end. There are restaurants and trinket shops (even a palm reader!) out there, but I have never visited any of those. Beautiful views of the ocean, the marina, the beach, the city, and the mountains. Can't be beat! You can drive out, too.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Enjoyable Morning Walk", "Nice view of the city, beach, and mountains. Went in the morning and enjoyed the emptiness. Interesting to note, with 5 public bathrooms, e realized that was four more than we saw at#lax. Nice job SB."], ["Reviewed January 12, 2018", 5.0, "Great views!", "This is a wonder place for sitting and watching boats, pelicans and folks fishing. You can get a latte and sit out on the dock. Great food too at Harbor Restaurant and fun wine tasting at Deep Sea wines !"], ["Reviewed January 8, 2018", 5.0, "Great piercand always see my favorite Pelican birds with close up photos!", "A must see! Park on pier get 90 mins free. We are at the end of pier at small Fish Place. Great for families and walking!"], ["Reviewed January 7, 2018", 3.0, "Nice Place to Walk", "If you want to take a nice stroll, the wharf might be the place for you. It takes you out across the water which provides a lively view. On the other side you’ll find restaurants if you want to delay your return."], ["Reviewed January 7, 2018", 5.0, "Ate honeymoon dinner here in 2004, now teenager likes aquarium here", "Worth a visit when in SB. Restaurants and activities (aquarium) here are notable. Visit here, plus there is a great walking/biking trail to this location"], ["Reviewed January 7, 2018", 5.0, "Gorgeous views! Great food and quaint shops.", "I have been visiting Stearn's Wharf all my life. I can remember when the Mariculture Foundation abalone project was there before the fire.\nI love to visit the restaurants out there for the freshest seafood in town.\nThe museum is great for families, I like to go as a single adult.\nThe little shops have the typical variety of tourist souvenirs, which even as a resident I enjoy looking through.\nYou should definitely include Stearn's Wharf during your visit to Santa Barbara.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Breathtaking view", "This wharf is clean with lots of good options to eat at. The view can’t be beat. There are cute stores to get souvenirs and even a booth to purchase tickets for a boat ride. Take a stroll in it at night for a sunset you won’t forget!\nShow less"], ["Reviewed January 6, 2018", 3.0, "Go for the view, not for the dining.", "You must go to the wharf if you visit Santa Barbara. The views back to the shore never cease to amaze me, and I have been going for over 30 years. There is a very knowledgeable sports card proprietor on the second floor of one of the stores. Very unassuming but if you can get him to talk, wow!\nAvoid the restaurents as they are overpriced and the food average at best. On the other hand, the ice cream store is yummy.\nShow less"], ["Reviewed January 4, 2018", 3.0, "Good views of the area, usual tourist spots", "As we walked the pier, we pondered why waterfront places like this seem to always have a candy/fudge/ice-cream shop. I guess tourists like fudge and t-shirts. Great for a short walk - see the fishers at the end and get a view of the city. But, the fish-based eateries and candy shops don't do a lot for me. If you are in the area, it's worth a quick visit, but I would not make it my sole destination.\nShow less"], ["Reviewed January 3, 2018", 5.0, "An Affordable and wonderful, relatively short walk.", "If you are visiting from an area that is not on the ocean, this will be a lovely experience to have. Even those that live here, love to do this. So much to see. If you are fortunate to come early in the day or on a Saturday, it is fun to watch the fishing boats come in and unload. Walk to the end of the wharf for a complete experience. All ages will love to do this.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Very touristy", "Nice walk, some good casual sea food places. Take the walk and enjoy the view of the Channel Islands."], ["Reviewed January 1, 2018", 4.0, "For the view", "Stuarts Wharf is popular and offers great views of Santa Barbara and the mountains. There are a couple of places to eat but not much else. It is worth a stop to orient yourself to the city and with the aid of a directional sign on the wharf figure out where north and south are in this area of the CA Coast.\nShow less"], ["Reviewed December 31, 2017", 4.0, "So busy on a Sunday", "This was a very busy wharf on a hot and sunny Sunday afternoon. Cars were lined up gettig on and off. We biked to the end, looked around the few shops and took in the great views. There were many different sea birds and boats on the water. It was a nice stop for a bit of rest although very crowded with people.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Sunset visit", "Lovely Boardwalk a few shops, restaurants etc just take in the views of the ocean and mountains behind you, fishing 🎣 off the end of the pier history of Santa Barbara on the information boards beautiful views and atmosphere"], ["Reviewed December 29, 2017", 3.0, "Great views but not much there", "The wharf in Santa Barbara has great views of the city and the ocean. There is a wine tasting room and a few shops. There is however not much to do there and we were ready to leave after half an hour."], ["Reviewed December 26, 2017", 3.0, "Nice walk but not much there.", "Stearns wharf is not a destination in itself, but it is a good place to go if you plan to go into downtown Santa Barbara. It is a pleasant part of the entire walk of State Street."], ["Reviewed December 25, 2017", 3.0, "Casual Walk out on to the Wharf", "A few restaurants and watering holes along the wharf. Good spot to visit as a tourist. Fish market was good. I wouldn't visit this again."], ["Reviewed December 24, 2017", 4.0, "Beat place in Santa Barbara to watch the sunset", "If visiting Santa Barbara, you should make sure you visit the wharf. It is easy to find and to get to, being opposite the main street in Santa Barbara, which is State Street. There are some nice restaurants there, we can particularly recommend Longboard’s where we ate at. The end of the pier has no barriers to stop people falling off so make sure that you keep an eye on the kids. Sunsets are good, unfortunately the sun did not set over the sea in November, when we were there. The wildlife is fun to watch with the Pelicans and Seals and even the occasional dog on a person’s stand up paddle board. You can drive your car up the pier and there is limited parking available on the pier.\nShow less"], ["Reviewed December 24, 2017", 5.0, "A must see while in SB", "Some of the best sunset views and vistas of up and down the coast can be seen from this wharf/pier. Shops, food and parking are all here too and it is an easy walk from off of State street. \"Stearns Wharf is located adjacent to the harbor in Santa Barbara, California, United States. When completed In 1872, it became the longest deep-water Wharf between San Pedro and San Francisco. Named for its builder, local lumberman John P. Stearns, the wharf served the passenger and freight shipping needs of California’s South Coast for over a quarter century. Find more details, visit Stearns Wharf History.\"\nShow less"], ["Reviewed December 23, 2017", 5.0, "Mother Stearns Candy", "Most amazing toffee and fudge, which they make on premises!!! They make snickers fudge, etc. Lots of candy to choose from. They also pop fresh popcorn and have candy apples. Brought my 7 yr old and teenagers and they loved everything they picked out to eat. Will return!!\nShow less"], ["Reviewed December 21, 2017", 3.0, "Pleasant winters day walk", "Easy to get to. Walk, ride or drive. 90 mins free parking. Typical of all piers, touristy shops and stalls. Walk to tje very end amd order some fresh seafood from the Santa Barbara shellfish company. Amazing!!!\nBest time is December. Sun is still out and cool breezes but not uncomfortable.\nPlenty of photo ops.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Stearns Wharf is a must for a visit to Santa Barbara", "Stearns Wharf was a catalyst in the development of Santa Barbara, and it remains a top attraction to this day. Super convenient - you can drive on and park, but it is also within walking distance of many hotels and resorts, as well as Santa Barbara's State Street.\n\nGreat restaurants serving breakfast, lunch and dinner, as well as drinks. Gift shops and the aquarium. Historical exhibits that give one a feel for the rich heritage of the region.\n\nIf walking along the beach is preferred, there is a walk/bike path stretching for many miles.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Nice pier", "Santa barbara is a nice place, and you have to visit the pier whilst there. old and quaint, but lovely. Great views, and a good place for food and drinks. The pelicans there are cool."], ["Reviewed December 6, 2017", 4.0, "Easy walk to the best views!", "The maritime flavor is all over the quaint shops and restaurants, but the mountain and ocean views are spectacular, especially around sunset. Walk on the water!!"], ["Reviewed December 3, 2017", 5.0, "Great view", "Beautiful piercing, old wood bridge, classic. Small shops, restaurants. Friendly. Fishing going on. Can drive car, public parking."], ["Reviewed December 1, 2017", 5.0, "Deffinately go to the warf", "Santa Barbara is a cool place to visit, great weather, sun and lots of stuff to see and do. Also it is on the way to San Francisco."], ["Reviewed November 30, 2017", 4.0, "Nice place for a walk.", "If you are visiting Santa Barbara, this is a nice place to walk to and have an easy hour or so looking around the shops or just relaxing in general."], ["Reviewed November 27, 2017", 5.0, "Playful seals", "We enjoyed watching some seals playing in the waves just off the wharf. The waves were washing over the sea wall so we ended up a bit damp but it was worth it to see the seals. There are a few good shops plus some tacky knickknack places.\nShow less"], ["Reviewed November 25, 2017", 4.0, "Love the sea center!", "The sea center was the highlight of our trip. Our young children enjoyed all of the exciting things here. From the touch tanks to the jelly fish exhibits and even the clear floor looking down at the ocean. Admission wasn't super high or super low but we didn't mind paying it. Everyone was super nice here greeting is and making sure we were having fun.\nOverall this was an amazing place but we still have to go to the natural history museum oh well next time!!\nShow less"], ["Reviewed November 25, 2017", 4.0, "Picture time...", "Fun walk and a great opportunity to take pictures with a sense of Santa Barbara’s Touristic side. Also you will get a perfect view of the coastline"], ["Reviewed November 22, 2017", 5.0, "Stearns Wharf - Beautiful", "If you're looking for atmosphere with a view you've found it here. The weather was perfect on November 19, 2017. Light wind, sunshine, sailboats, kite surfing, bicycling, etc."], ["Reviewed November 21, 2017", 2.0, "Views are great but the food is lacking", "Walk along the beach for the view and got to the public market for the food. Better than tired seafood."], ["Reviewed November 20, 2017", 4.0, "Snack on the Pier", "We parked on Sterns Wharf to go have a snack with our Grandson and watch the sun set over the marina. Parking free first 90 minutes. Lots to do on the wharf, several restaurants."], ["Reviewed November 19, 2017", 5.0, "The Heart of Santa Barbara's Harbor", "Stearns Wharf is a fun place to visit, right off Cabrillo Boulevard and the shoreline park, at the foot of State Street. There are small shops, and also two or three decent restaurants, and two years ago we had an excellent Christmas buffet at one of them. Of course, you will also run into plenty of people fishing at the end of the pier. Watch out for their tackle.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Beautiful sunset views", "Lovely walk down the wharf. Lots of photo opportunities. Plenty of seafood restaurants. We enjoyed our evening here."], ["Reviewed November 15, 2017", 4.0, "It's a Wharf!!", "Indeed it is. A wharf that sticks out into the ocean. Is it worth visiting? Well, of course! It's a wharf!!\n\nSeriously, though, it is a wharf with plenty of room to stroll, plenty of places to eat, plenty of views out to sea and back to the city and the hills. There are restrooms, shops, seats, fishermen doing their thing, and restaurants.\n\nDo it! It is a real wharf.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Lovely view of Santa Barbara with its mountain backdrop", "It's certainly worth a visit to the warf. You can either walk onto it or drive onto it and park for free if your stay is 90 min or less. You get a fine view of the ocean, with some tourist places there and a couple of restaurants (I haven't tried either). But Santa Barbara is as beautiful a town as there is and this is the best place to see it in all its beauty.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Lunch", "Lunch was very good. We ate at Moby Dicks. They had very good food. Fresh fish, good drinks, wine, ambiance fun."], ["Reviewed November 8, 2017", 5.0, "Fun to people watch", "Nice shops and places to eat. Sit outside and watch fishing boats and sail boats go in and out of the harbor. Watch people fish and just take in all of Santa Barbara."], ["Reviewed November 7, 2017", 4.0, "Nice walk", "We walked the length of the pier. You might want to bring a towel if you want to sit for a picture. Lots of bird poop."], ["Reviewed November 3, 2017", 3.0, "Nice views, but nothing “it of the ordinary”", "There are a few shops and four or five restaurants on the wharf itself. It is certainly worth a walk-about just to be out over the water. The wharf is made from very rough hewn planks, which jiggle when the cars drive over them. It’s fun walking above the water.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Great views!!", "You can park the car right on the pier- that is if you can find a parking spot on the pier.This place is just awesome, lots of sea breeze, sea-gulls ready to pounce on any morsels of left-over food & overlooking the mountains. There are many restaurants too for choice of your food.There are benches to sit & enjoy the food in amidst nature,if you wish to right on the pier itself. All in all, nice place to visit, only issue being parking!! Try your luck here!!\nShow less"], ["Reviewed October 26, 2017", 4.0, "Long wharf but a nice morning walk", "Great spot for a nice walk in the morning. Some small tourist shops and some dining. People fishing at the end."], ["Reviewed October 26, 2017", 4.0, "Must visit Stearns Wharf", "If you’re in Santa Barbara, it’s simple and say to visit Stearns Wharf. Free parking curbside along the beach and a short walk onto the pier. You can also drive onto the pier."], ["Reviewed October 26, 2017", 4.0, "Nice walk with some great photo oportunities", "Its a nice walk along a traditional wooded decked pier. There are attractions like the museum and quite a few café and gift shops. Some great photo opportunities especially looking back towards the mountains."], ["Reviewed October 25, 2017", 4.0, "An interesting walk", "If its not crowded, there is free parking for the first 90 minutes of your visit. This is a good value as long as you don't exceed the time. If you plan to be there for a long afternoon or evening, then its probably cheaper to park in the beach lot.\nAlthough we didn't eat there, it appears to have at least 2 or 3 reasonable restaurants.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Well worth a walk out", "What a great view back to the beach and mountains, well worth popping out to the Wharf, grab an ice cream on a hot day and enjoy the view."], ["Reviewed October 25, 2017", 3.0, "a long pier", "walk down the pier and get bombarded by panhandlers so keep your wallet close to your pocket. the fun is the restaurants in town. once you have been to a boardwalk you realize this one is really boring."], ["Reviewed October 25, 2017", 5.0, "Lots To Do and See", "This was a busy place the day we were there. For those who don't want to walk all the way out, there is limited parking that is free for the first 90 minutes. It is enjoyable just to walk out to the end of the wharf and watch the boats and the kayaks and the birds. There are several places to eat and we were able to go to the top of one building and eat outdoors.\nShow less"], ["Reviewed October 24, 2017", 4.0, "Lunchtime stroll", "We enjoyed lunch and then took a stroll and enjoyed photo opportunities on the wharf. It's nice to walk around and watch the locals. There are a few shops and an ice cream parlour and several fish restaurants. Parking is free for the first 90 minutes and if you go over you just pay on your way out. However if you go over the 90 minutes then the time is rounded up to the next hour. It was nice to get some fresh air have a walk and look around the shops.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Lots to see on this pier with shops and restaurants", "One can drive on this old pier, which has ample parking, and visit one of the many shops and restaurants ranging from inexpensive to fine dining. Beautiful views of the channel islands can be seen from Stearn's Wharf."], ["Reviewed October 23, 2017", 4.0, "Tastiest Clean Seafood", "This is a regular stop for us for many years. We like the location on the water; non-pretentious good service and food!! Like the fact that one can order seafood in its natural state e.g., not smothered in cream and butter sauces! Finding a seat can be a wait but one can always have a beverage while waiting.\nShow less"], ["Reviewed October 23, 2017", 4.0, "Great views of Santa Barbara", "Walked out on the wharf one afternoon while visiting my daughter. Great views of the bay. Busy restaurants and a few souvenier shops."], ["Reviewed October 21, 2017", 5.0, "Very Pretty Views", "Enjoyable walk. Souvenir shops and seafood restaurants. We saw sea lions. Fishing pole rentals. Lots of photo opportunities!"], ["Reviewed October 20, 2017", 4.0, "Lovely for an early morning stroll", "Has a few shops and restaurants. Great views of the harbour, shoreline, mountains and plenty of people fishing. We saw some seals playing in the ocean off the front of the pier, as well as seeing a stingray caught by a young lad (with the help of 4 grown men!). Obviously, they let it go afterwards, but it was something special to see!\nShow less"], ["Reviewed October 20, 2017", 3.0, "Great walk", "A quant place but shops are expensive and so are the restaurants. It definitely has great views of the ocean"], ["Reviewed October 19, 2017", 5.0, "A real tourist attraction", "Definitely walk out to the end before high noon (or late afternoon). There was a fisherman singing opera when we were there. It’s beautiful looking out to the sea and back at the beach and tall palms."], ["Reviewed October 16, 2017", 2.0, "Not Much Of Anything", "OK you will go there since it is there. Spend 10 minutes, avoid the shops and restaurants take a photo and then next...."], ["Reviewed October 16, 2017", 5.0, "Perfect", "The focal point of Santa Barbara’s waterfront. Sterns Wharf offers magnificent views, restaurants, shops etc etc as well as the chance to try your hand at fishing off the end of the Pier. You could just wander up and down the Wharf all day enjoying the sights and weather(a good job as my wife lost her glasses and we wandered around for ages looking for them!!).\nShow less"], ["Reviewed October 14, 2017", 3.0, "Like a lot of Cali attractions it is overrated. Good for food, snacks and cheap trinkets", "Note you can park out on the wharf. We did not know this and walked all the way out. Not a big deal but if you have mobility issues it is nice to know you can park out there. Mostly fish and chips places and souvenir shops. Had I known that I probably wouldnt have bothered with it. The ocean is nice, some informative placards along the way but I didnt think it was all that.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Santa Barbra from the Water", "We walk out the pier after dinner and saw the sunset over the mountains. It was nice to see the lovely views and boats going and coming in the harbor. There were several people fishing from the pier and people site seeing. We stop at some of the souvenir shops and got some interesting souvenirs. There are interesting plaques which give some of the history of the pier.\nShow less"], ["Reviewed October 14, 2017", 3.0, "Not much to do or see", "Unless you’re going there to eat don’t waste your time. There’s only about 4 stores, a wine tasting shop, and a few restaurants. The stores just sell trinkets made in China that you can find cheaper and get a better selection right down State Street. If you want to eat and enjoy a better view I would suggest going up the road just a bit to the marina. There you get to look at the water, and get the added view of a hundred interesting boats.\nShow less"], ["Reviewed October 13, 2017", 4.0, "Drive on Pier with Super Views", "Perched at the bottom of State Street this small pier or Wharf allows you to drive on and park. The restauants are probably the biggest draw but this is missing the real reason to visit and that's the view from the end. From here you can see the whole of Santa Barbara and surrounding countryside stretched out before you, beautiful. It has to be the best way to see this area.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Worth the walk out", "I would definitely recommend walking out on this wharf. You can even park your car on it. The views of the harbor are worth seeing. Especially impressive if there is a cruise ship anchored. Fun to watch the tenders going back and forth."], ["Reviewed October 12, 2017", 4.0, "Great iconic way to see Santa Barbara", "State Street is a great street. It has shopping, theaters, museums, restaurants, hotels, & bars. Best of all, it continues right into the ocean as Stearn’s Wharf! Pedestrians, bicycles & cars can all venture a few hundred yards into the Pacific, on a wooden pier, and enjoy views of the harbor, the city and the sea beyond.\nLocated on the wharf are restaurants, shops, wine tasting, an ice cream parlor, and a bait & tackle store to supply you for fishing from the pier. You can also catch boat rides here on charters, or regular water taxi service (Lil Toot!).\nIrregular walking surface so don’t go barefoot or in high heels. Also, bring along an extra layer of clothing.... it can be much cooler over the water than back in town or on the beach.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Stopped on a whim...glad we did.", "Stopped here while looking for a scuba shop on the other pier.\nDrove in, parked, and walked the pier, stopping at the Marine museum and a snack shop. The snack shop served the best clam strips I've had since Howard Johnson's closed.\nFantastic views of the ocean and boats. Everyone was very friendly.\nVery glad we stopped.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Fantastic pier - with free parking nearby", "We took a leisurely walk along that the pier - what an iconic pier and an amazing place to spend a couple of hours."], ["Reviewed October 10, 2017", 3.0, "A view of Santa Barbara like no other!", "Walking out all the way to the end of Stearns Wharf in Santa Barbara, turning back and looking at this great beach town you get a view that just takes your breath away. From the homes high up in the skyline of the riviera to downtown State Street, it's the quintessential beach town. Restaurants, shops and a great pier that you can rent fishing gear right there and catch some Pacific Ocean fish... it's fun for the whole family. There's a great candy and ice cream shop, gift shops, toy shop and so many restaurants to choose from it's the perfect way to spend a sunny afternoon in SB. Worth going to if you're in town... it may be where the tourists go but I guarantee you, us locals love it there too.\nShow less"], ["Reviewed October 9, 2017", 4.0, "Good for a stroll", "We walked up the boardwalk and enjoyed seeing everything from a different view point. There are a few restaurants, but we didn't eat there. We took a harbor tour from the Wharf and enjoyed the quiet boat ride."], ["Reviewed October 8, 2017", 4.0, "Nice Wander", "Nice evening spent wandering along the pier then went for dinner. Good place to watch the locals fish & to watch the Sea Lions mess about. Lovely place 9/10"], ["Reviewed October 7, 2017", 5.0, "Santa Barbara’s Pier", "This was my second trip to the pier. There are restaurants, shopping plus wonderful views of Santa Barbara as well as the beach life of Santa Barbara. Parking is free up to 90 minutes and it’s a drive on pier"], ["Reviewed October 6, 2017", 5.0, "Nice place to visit!", "Nice place to visit, we really enjoyed our visit to the Stearns Wharf, there is parking and restaurants and you also get a nice view of the city."], ["Reviewed October 6, 2017", 3.0, "End of the Pier show", "At conjunction of East and West beach is Stearns Wharf which has car access and the complimentary trolley service passes by.Usual array of tourist attractions supplemented by tarot card reader... Didn't see that coming...."], ["Reviewed October 6, 2017", 5.0, "Fell in love", "I fell in love with the place! Therr is a nice stroll passing nice restaurants and tons of boats & yachts. Finally you get to a beautiful spot to run down to the beach & a great spot for sunset pictures. If continue walking you come to a small island cove which is amazing! You have to walk down a balancing beam to get to the cove. But well worth it!!\nShow less"], ["Reviewed October 4, 2017", 5.0, "Nice to walk on see the view of the Santa Barbara coastline", "If you are visiting town you should stop by Stearns Wharf you will get a great view of the Santa Barbara coast line and there are many great restaurants and sea food places and the best Clam Chowder in town."], ["Reviewed October 3, 2017", 4.0, "A Fun Place for Locals and Tourists", "No trip to Santa Barbara is complete without a walk on Stearns Wharf. It is lovely to just enjoy walking, but there are restaurants and shops to enjoy also."], ["Reviewed October 2, 2017", 4.0, "Nice times on Starns Wharf", "We went to the Wharf from Venice Beach just to have lunch. That's how nice it is. Santa Barbara Shellfish at the end of the pier has great seafood that you can eat outside at picnic tables. The end of the pier is a fishing Mecca with all kinds of equipment being used. Treat it like a floor show while you eat. Then go to Longboards for a cocktail or two. Nothing but a fun time to be had.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great surprise!", "We didn't have much of a plan for the day so drive into Santa Barbara looking for a place to park. Put Stearns Wharf into the sat nav and wow..... what a result.\n\nArrived and you park on the pier - free for first 90 mins then $2.50 for each hour or part thereafter. Great places to eat, shop and fab views of marina and shoreline.\n\nWell worth the visit - you won't be disappointed. We went 11am on a Monday morning and easy to park - perhaps weekends are busier.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Restaurants and Tourist Shops", "Beautiful views of the water from Stearns Wharf. You can either park near the beach and walk or if you were lucky, you can find self parking on the wharf itself. The wharf does also have complimentary valet parking, but there is a charge to park on the wharf. There are some great restaurants, whether you were looking for grab and go sandwiches or sitdown meals. Little tourist shops selling souvenirs. You may also get your palm read, if you are interested in that stuff. Lots of people fishing off the pier and bringing in fresh crab etc. Fun place to visit\nShow less"], ["Reviewed September 28, 2017", 4.0, "A little scary", "You can drive out onto the wharf but it is very hard to find a parking spot. When you drive out, you get the feeling that it's not going to hold...LOL Worth the trip though!"], ["Reviewed September 27, 2017", 4.0, "Nice Walk", "For all the times we have been to SB, this was the first time we walked out on the pier. It is a beautiful site and fun to watch the boats coming in & out of the marina. There are a some busy, touristy restaurants and some rather colorful characters wandering around. I don't understand way they have to use the pier for a parking lot.\nShow less"], ["Reviewed September 27, 2017", 4.0, "Great walk along the Pier", "We walked along the pier and back great to see people shopping, eating, and fishing of the end of the pier , the shop nearby supplies rods etc. no licence required"], ["Reviewed September 26, 2017", 4.0, "Very long pier!", "A very pleasant stroll along the Stearns Wharf Pier. Unlike some piers, this one is free and even offers free parking right on the pier for the various restaurants."], ["Reviewed September 25, 2017", 4.0, "Beautiful sites!", "Had a beautiful day to walk out on the wharf. A busy spot on a Sunday...people shopping, eating, fishing, sightseeing."], ["Reviewed September 25, 2017", 4.0, "Great Place to Take the Convertibles in the Sun", "Pretty neat place; you can drive out onto the pier and park a few feet from your dining location. The wooden boards on the deck surface crack and rumble as you drive over them giving you that feel similar to how they would have felt back in the day.\n\nParking fees were very reasonable. Your first 90 minutes are free and any time there after is billed at $2.50 per hour. Great bargain. I am not sure how they handle the parking on weekends as you would have no idea if there were any spaces available BEFORE you started out on the pier. None of the spaces are in your line of sight from the ticket booth/swing arm.\n\nIts location and layout add to the ambulance of the day; it is great to sit and watch people as they travel by.\nShow less"], ["Reviewed September 22, 2017", 3.0, "It's beginning to feel like once you've seen one Pier in California you've seen them all!", "We walked the pier and found the most enjoyable part to be watching the numerous fishermen trying to catch today's dinner. One gentleman, who was right on the end corner, landed at least half a dozen while we were there! You can park on this pier which is one advantage but it has the usual array of small gift chops and restaurants that you find on all piers like this along the Pacific coast. We didn't stay long and wouldn't return if we were in the neighbourhood.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Nice walk with great views", "Stopped off in Santa Barbara and parked in the town and walked down to the waterfront and to the pier. You can actually drive onto the pier and park for free for up to 90 mins.\n\nIt's a really scenic walk with amazing views, and it was really quiet when we visited (probably helped with it being mid week). There's a few shops and restaurants as well to stop off in while your there. Well worth a visit.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Fabulous Ocean Views, Restaurants, and Gift Shops", "Be sure to walk out to the end of Stearns Wharf for a fabulous view of the ocean. Restaurants, gift shops, ice cream, and more!"], ["Reviewed September 20, 2017", 4.0, "Nice Walk, a Few things to see, Pleasant...", "We strolled along the pier which turned out to be this Wharf... Pleasant to walk along, a few fish restaurants, some touristy shops, etc., and a few guys line fishing and lifting Mackerel out of the water. One guy was selling his fish straight into the adjacent restaurant, that's fresh for you! We had an ice cream, which seemed a little expensive...\n\nShow less"], ["Reviewed September 20, 2017", 4.0, "Beautiful setting - great ice cream", "Perfect for a stroll and snack, we had some amazing gelato in a waffle cone (the best waffle cone ever) and strolled along the pier. It looked like there were some nice places to eat too."], ["Reviewed September 19, 2017", 5.0, "great view", "we had a beautiful day to walk out on this wharf. Loved the Moby Dick!! Didn't have time to visit the sea museum, but definitely will next visit!!"], ["Reviewed September 19, 2017", 3.0, "Old time pier-good restaurants", "Old time pier with nice views of the beach and marina. Good for a casual stroll. There are several good restaurants on the pier. I recommend finding one you like . They have great views of the beach and water . parking is available on the pier and is free for the first Two hours\nShow less"], ["Reviewed September 18, 2017", 3.0, "It was probably more interesting 20-30 years ago, but worth a stroll if you're in the area", "Looking a bit run down now, and a bit tacky, cheap shops selling mostly junk, couple of fish restaurants, they seemed busy, so maybe better than they look.\nAs I said in intro, if you're there, then worth the 30 minutes to stroll out for a look.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Worth a trip", "Nice to see, but not a lot of time needed. The view is nice of the beach and the marina looks great from the Wharf."], ["Reviewed September 18, 2017", 4.0, "Pleasant way to spend an hour", "We walked here from our hotel and sat in the sunshine eating large ice-creams. It was a very pleasant interlude during our vacation."], ["Reviewed September 18, 2017", 5.0, "Nice walk and place of attraction", "Great place to visit and enjoy the sunshine. Friendly people and yummy ice cream. The pier is the main attraction"], ["Reviewed September 16, 2017", 4.0, "Fun Time", "Visited Stearns Wharf on our CA coast trip. Able to drive onto pier and park, free for 90 minutes. Ate at a restaurant there with a great view. Not great but a nice stop. Walked around area after, clean and safe."], ["Reviewed September 15, 2017", 4.0, "Fun visit", "We enjoyed the shops and a little hidden gem of a winery shop for great tastings, Deep Sea Tasting Room."], ["Reviewed September 13, 2017", 5.0, "Beautiful!", "With 75 minutes of free parking you have to stop and walk the wharf! We spent about an hour here just walking around and making pictures. Beautiful views all around!"], ["Reviewed September 13, 2017", 4.0, "Nice walk with shops and restaurants", "I like this wharf, because it has shops and restaurants and the most important part is that only at the end of the wharf, there are allowed to fish. I could stay away from them."], ["Reviewed September 13, 2017", 3.0, "A Must Stroll", "Strolled along the Pier, great photo ops and views back to the city and beach. Free 90 min parking on the Pier itself, loads of restaurants and souvenir shops....."], ["Reviewed September 12, 2017", 4.0, "Exelent pier out into the ocean", "We could drive out and park on the pier- and the first 75 minutes free The pier is all wooden built and that gives a very nice impression There are several restaurants, shop and bars on the pier,and it is really worth a visit!"], ["Reviewed September 12, 2017", 5.0, "One of my Favorite Places", "Santa Barbara is one of my favorite cities and a visit there is not complete without a walk down Stearns Wharf. The views from the wharf of the city and the mountains are wonderful. I prefer a quiet weekday morning but this year I visited on a bust busy Sunday but it was still great.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Afternoon Walk", "A beautiful walk down the street from my house. With a great shellfish restaurant at the end of the pier serving cold beers and outstanding food. Stearns Wharf is a fantastic place to buy souvenirs and take out of town guests."], ["Reviewed September 8, 2017", 4.0, "Great views", "Beautiful views, perfect weather. We visited on a Wednesday morning so lucked out, not to crowded. We parked on the wharf itself and parking costs were reasonable. Many choices for food and gifts."], ["Reviewed September 8, 2017", 5.0, "Family", "You can park on the wharf, the views are breathtaking, there are lots of seafood restaurants, you can fish and ocasionally see the seals!!"], ["Reviewed September 4, 2017", 3.0, "Busy - Touristy - Mixed Quality Food", "The Wharf would normally be the destination to get good seafood, right? In this case it is hit or miss. Most of the places are frozen fast food deep fried locations. Peak at the food coming out of the kitchen and into the kitchen if possible before dining.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Nice walk on the wharf", "You can drive onto the pier but I think you have to pay. There are quite a few restaurants to pick from and a few specialty shops. Cute old fashioned candy store with delicious taffy and fudge."], ["Reviewed September 2, 2017", 3.0, "Crowded but great views of ocean", "We walked along the pier for an hour. It was very crowded with many homeless people asking for food or for money. The views from the wharf are beautiful, but I would only go back for a meal."], ["Reviewed September 1, 2017", 4.0, "Beautiful views, not too busy", "The wharf offers wonderful views and is very easy to access using the shuttle that runs up and down State Street. There were lots of little gift shops unfortunately all selling overpriced tourist souvenirs, and the restaurants were a bit pricy, but the wharf itself was lovely to walk along in the sunshine. There are flags for every major event in Santa Barbara's history with some information about each period, which was very interesteing to read.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Nice walk and nice view of shore and sea", "On top of the nice view over Santa Barbara and the sea, you have good choices of eateries, shops and trips. Very pleasant pier, quite huge too."], ["Reviewed August 29, 2017", 4.0, "Good walk with a view of the sea front", "Good to get a good view of the waterfront. Surprised to find parking on the wharf, handy for those that need it, and not full. Several places to eat and drink, no surprise that it was mostly fish based food. A few shops to walk around. Nice way to spend an hour or so.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Incredible views", "Walk around this iconic wharf, eat, shop, and enjoy the view of Santa Barbara, CA. Fresh seafood is available for eating or purchasing. Boat trips can be booked here as well. There is also a marine life museum for kids with a touch tank."], ["Reviewed August 25, 2017", 5.0, "A pleasant stroll", "We came to this historic pier in the evening before sunset. It was a very nice walk as there are some shops to look at. When we got to the end of the pier, there were a lot of people fishing. Had a fun time talking to the people and checking out their catch.\n\nThe view of the sunset from here was very beautiful and a perfect time to take pictures of Santa Barbara town too.\nShow less"], ["Reviewed August 23, 2017", 5.0, "A great day of sunshine and fiesta", "We went to enjoy the sun and fun in Santa Barbara and decided to have a little fun at the Sea Center. It was a cute place and we were able to touch the starfish and other live creatures! After that, we walked and shopped on State Street.\nShow less"], ["Reviewed August 23, 2017", 5.0, "lovely old pier", "interesting pier. has a marine life centre and places for food and drink. Was overcharged in the gift shop so check your receipt!"], ["Reviewed August 22, 2017", 4.0, "A lovely stroll among the fish restaurants on the Pacific Ocean", "This is one of the must do strolls of Santa Barbara and it is also the busiest. Strange that cars are allowed to drive onto the pier and park there. There are also lots of little souvenir shops, but the best bit is to turn right when you come off the pier and visit the 1km long stretch of artists showing their own creations, from pictures of California to home-made original Ukuleles and ceramics. These are really beautiful creations if you had space and room to bring them home.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Morning walk", "Great place to sit and stare out to the ocean. Really nice looking restaurants and gift shops. We didn't know any of the history of the pier so great to learn all about the fire and the refurbishments. Glad we visited on our bike ride."], ["Reviewed August 22, 2017", 5.0, "Free Parking and a view", "Santa Barbara is amazing and the Pier adds to the flair. 90 minutes of free parking to put you several hundred yards in the middle of the bay with sailboats, fishermen, and towns people enjoying the day. Do it!"], ["Reviewed August 21, 2017", 4.0, "A Pleasant Stroll", "Taking a stroll along the wharf area is a must do! Lots of little shops, restaurants and bars will keep you busy! There's also a wine tasting room on an upper level (Deep Sea Wine Tasting) with outside seating that is great for sight seeing!"], ["Reviewed August 20, 2017", 5.0, "Nice views!", "Nice walk to the wharf. Quaint little shops & cafes. Great views across the mountains and beach. Worth seeing. Lovehy place."], ["Reviewed August 18, 2017", 3.0, "Nice pier but too many cars", "Yes they drive and park on the pier. And no fishing. Pretty long. Seafood restaurants and gift shops line the pier. Along with lots of cars. Great view of beaches and mountains."], ["Reviewed August 18, 2017", 5.0, "Wharf with fantastic views", "Great low-key wharf to go for a walk. There are only a few restaurants on this wharf, so it’s never crazy crowded with people. There are fantastic views of Santa Barbara and the surrounding areas especially at sunset. Also I guess this is one of the few places along the west coast where you see the sun set over land. The end of the wharf doesn’t have any railings, which was a little disconcerting to see. I guess it’s all fine as long as you’re not going for a drunken walk.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Unique in California", "You can actually drive onto this pier with parking at the end. There aren't guardrails around the back of the pier so you have unobstructed viewing but need to hang onto your kids. There are several restaurants that seemed overpriced. We did a wind tasting at Deep Sea Wine Tasting which features Conway wines. The view was great but the wines were weak. We had really good ice cream at Great Pacific.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Nice pier!", "Good attraction to do a reverse view towards the mountains and the city in addition to the seaward views."], ["Reviewed August 16, 2017", 4.0, "A good stroll", "It's a nice place to walk, there's nothing much to see so keep your expectations low. There are nice restaurants and gifts shops to experience but those are nothing extraordinary. This is just like any other touristy spot near the ocean"], ["Reviewed August 16, 2017", 5.0, "Sunday summer sunset on Stearns Wharf", "Sunday summer sunset on Stearns Wharf, what a beauty.\n\nFamilies with children, romantic couples, groups of friends, so many different kinds of people, and everyone enchanted in the golden hour of the sunset.\n\nHappy locals and visitors taking selfies, group shots and photos of the sunset from the wharf - I must have heard 10 different languages spoken.\n\nPeople fishing off the pier, people rushing to get dinner at the various restaurants, people contemplating the big compass showing that when you look out to sea from Stearns Wharf you are looking south, not west, since this is the South Coast.\n\nLong lines of big brown pelicans flying close to the water in V formations, heading for wherever pelicans go to spend the night.\n\nSun slowly dipping down, down to a spot where I had so much fun taking pictures of it sinking down with all the palm trees showing up in the sunset.\n\nOh what a sweet way to close out a warm summer weekend.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Best views of SB?", "Well worth the walk or drive to the end. Amazing views 360 degrees. I really like Longboards, especially for MUDPIE! you can go JUST for that, feeds 2 or more!"], ["Reviewed August 15, 2017", 4.0, "Nice vista", "Not that much going on but great views on a sunny day. Food looked ok but we didn't try any and there is ice cream shops too"], ["Reviewed August 15, 2017", 5.0, "Stroll at night", "There are a lot of people here having fun... restaurants shops and the beautiful beach! Worth coming during the day but I was here at night. Very Family friendly, date hot spot or for even solo traveling for people like me."], ["Reviewed August 14, 2017", 3.0, "Go only if you have the time", "This wharf is impressive. It is huge,and cars can drive and park on it. However, actually walking on it is not necessary and is something of a waste of time. The few shops only sell simple souvenirs and postcards; the restaurants here are ho-hum. The view is decent, but you can catch the same one at other points along the beaches. I say it is enough to see it from afar; walk up on it only if you have time.\nShow less"], ["Reviewed August 13, 2017", 3.0, "A Little crowed for my liking", "the wharf is defiantly worth a visit but can get very crowded on a nice day, suggest visiting earlier in the day"], ["Reviewed August 11, 2017", 5.0, "Views!", "The first thing you notice when you get to the end of the pier is the incredible view behind you. It really does take your breath away. It wasn't too crowded and it seemed the cars that were coming onto the pier had plenty of place to park. When you are in Santa Barbara it is a must do.\nShow less"], ["Reviewed August 10, 2017", 3.0, "Nice Walk - \"Super Turisty\"", "At the end of State Street is Stearns Wharf, which is nice wooden pier that stretches out a ways from the shore. Its a really nice walk, with lots to see. Shops and stores on the wharf are what you might expect if you are looking for a burger, some shells, or one of those souvenir shirts from Santa Barbara.\n\nIt has several restaurants, shops and an aquarium.\n\nNice walk but don't expect too much.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Fantastic views!", "We visited here one evening around 8PM and managed to get parked for free on the pier itself. Parking is limited, but at that time is easier to find. I imagine during the day, it's nigh on impossible to get parked on the pier, particularly as the first 90 minutes are free.\n\nFrom the pier you get stunning views on the sea, harbour and mountains. The sunset is pretty spectacular, too.\n\nOn the pier there are gift shops, sweets shops, ice cream and a number of restaurants to choose from.\n\nWell worth a visit.\nShow less"], ["Reviewed August 10, 2017", 4.0, "Good spot to visit", "Nice spot to visit in Santa Barbara, with a great view at the end. It has several restaurants on it (nicer ones are not dog friendly), while the ultra casual dining spots have bench tables outside where you could take your dog. The rest of the wharf is dog-friendly so it makes for a nice spot to hang out. Parking is free for the first 90 minutes (mid-day a problem, but later on it is possible to find a spot).\nShow less"], ["Reviewed August 9, 2017", 5.0, "What a view!!!", "Awesome place to see the sunset and have a light meal or a drink. You can drive almost to the end of It and park your car Free (90 min Free). Take your time, take pictures and have the best time in Califórnia. You can't miss it\nShow less"], ["Reviewed August 8, 2017", 5.0, "Fun spot", "Great shops, restaurants, wine tasting, and parking available right on the wharf! Allow a couple of hours, at least to enjoy all it has to offer."], ["Reviewed August 7, 2017", 5.0, "Great place to go", "Wonderful view. Great food. Great little aquarium. Boat trips. You can see pelicans, cormorants, sea lions and harbour seals. What's not to like?"], ["Reviewed August 5, 2017", 5.0, "Longboards is awesome", "Pier is great and breeze is perfect. Longboards for burgers if you are in mood for something besides main lobster on the West coast. Wait staff awesome."], ["Reviewed August 5, 2017", 5.0, "A great wharf you can park on", "Drive your car onto the wharf for 90mins free parking and explore the beautiful wharf and external roadways with smart market areas"], ["Reviewed August 2, 2017", 5.0, "Great place to walk around, get food, and smell the ocean", "Had a great time at the Wharf. Did some sightseeing, shopping, ate great food, and all on the ocean. Could not ask for a better place for an afternoon. The area is not overly large, but it is a quaint place to visit."], ["Reviewed July 31, 2017", 4.0, "Seaside pleasure", "A pleasurable place to stroll out over the water, with an old-fashioned boardwalk giving great atmosphere. Beautiful views of the coast from the pier. Several casual restaurants, perfect for lunch or a refreshment."], ["Reviewed July 31, 2017", 4.0, "pier with restaurants and shops", "huge long pier where you can drive up to several restaurants and shops. you cantata very nice photos of your surrounding and if you are lucky you can see sea lions lounging on the boats"], ["Reviewed July 29, 2017", 3.0, "Worth a walk to the end", "It's free to walk along the pier, vehicles have to pay. If you are in the area it's worth walking to the end and admiring the views. The few restaurants on the pier seem overpriced and very touristy."], ["Reviewed July 28, 2017", 3.0, "Just Ok for me...", "I suppose it's an OK pier with some restaurants, shops and facilities on it.\n\nIt has good views of the ocean and beach either side and out to sea.\n\nPersonally for that's as food as it gets I think the pier has a tied, tacky freely about it which does suit the beautiful Santa Barbara at all.\n\nI suppose it's worth a visit but don't be too disappointed if you don't get around to it.\n\nEnjoy.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Worth a visit", "Definitely worth visiting, area has a nice vibe and the nearby artists market is worth a walk round. Would visit again when in the area"], ["Reviewed July 23, 2017", 5.0, "A must to visit", "Beautiful place with plenty of good restaurants or just go for an ice cream and walk along the pier. We used their valet parking right there on the pier and ate at Longboard's Grill (definitely a must)."], ["Reviewed July 22, 2017", 4.0, "Very Nice Pier", "This is one of the nicest piers. There are three restaurants, shopping, candy and ice cream. Perfect for an evening walk and ice cream after dinner at the Fish House."], ["Reviewed July 21, 2017", 4.0, "Lots of places to eat out on this pier!", "Nice walk. Even cars can go out on this pier/wharf! Lots of places to eat and shops. Just be careful as it is a wooden pier and it's uneven, so don't trip!"], ["Reviewed July 20, 2017", 5.0, "My teenaged kids say it is LIT! :)", "Lots of shops and good eats. Very cool that you can actually park on the pier, too! The shops that we visited seemed to have great quality items. If we'd had more time, we would have enjoyed more time simply shopping."], ["Reviewed July 20, 2017", 3.0, "Wharf with Food, Drink and Tourist Attractions", "It is atypical wharf with food, drink, and tourist shops. There is a wine tasting room, Deep Sea, which is interesting."], ["Reviewed July 18, 2017", 5.0, "Sterns Wharf, Santa Barbara", "Sterns Wharf is a great place to take beautiful pictures of the Santa Barbara beaches and to get a good ice cream cone. It is also a nice place just to sit and people watch as you enjoy people watching and the lovely ocean views."], ["Reviewed July 18, 2017", 3.0, "Rick Steves wouldn't go here if this happened to be in Europe", "Touristy, loud, expensive and mediocre all explain this Santa Barbara landmark. Though it touts a rich history of being an active fishing wharf, this now active pier features gift shops, parking and restaurants that thrive on having a view and a captive audience. That said, you'd be surprised if this review were any different. If your in Santa Barbara for the day, there are better ways to spend your time and money.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Site seeing", "We really enjoyed the Wharf. Nice restaurants and shops. They even have valet parking available. It's a great place to visit."], ["Reviewed July 17, 2017", 4.0, "A crowded but breezy walk", "One the waterfront one can walk to the pier.One can park the car there close to pier but tough to get a parking. There are eating joint there.One get good view of beach, and cruise and mountains."], ["Reviewed July 17, 2017", 4.0, "Very cool!", "Surprised to be able to drive out to the middle of the wharf! If you stay less than 90 minutes, it's free. Interesting to talk with the fishermen to see what they are catching. Interesting placards telling you about the history of the wharf."], ["Reviewed July 16, 2017", 3.0, "Hard to park.", "Nice but crowded, very tight traffic and small road. If you step off the sidewalk of the business your in the road and good chance to get hit. Cars have very little room and we had to just drive around with all the other cars and play musical parking space. Several nice places to eat dinner and also a pub.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Enjoyable visit", "A nice stroll on the pier where you'll find a wine tasting room, chocolate and ice cream shops, restaurants, and cute gift shops. There is also a decent sized aquarium that is fun for kids and adults. You have the first 90 minutes of free parking.\nShow less"], ["Reviewed July 16, 2017", 3.0, "Ok but not great", "If this was the first wharf my wife had visited, it might have been ok for her but to be honest, it wasn’t that great at all and she was not that pleased. Again, if this was a stand-alone trip, perhaps it would be ok but we were visiting beaches, and piers and wharfs up and down the coast and this one is a definite pass and not on my list of must see stops.\nShow less"], ["Reviewed July 12, 2017", 3.0, "Worth seeing. But nothing special unless you've never been to a wharf before", "As far as wharfs go, it unique in that you can drive and park on it. Neat history lesson on signage. Nice souvenir shops."], ["Reviewed July 11, 2017", 4.0, "brakin up", "If you drive out on Stearns wharf during the day you will have to pay, but if you go in the evening it is free and parking is free. Views at night are exceptional on a fog free evening. You can see up and down the coast.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Old fashioned wooden wharf you can drive out on", "There are a few shops and restuarants out here, but driving out on this is unique as it is made of wooden slabs. You wonder if you really should be driving on it? Cool area to walk around. There is limited parking on the wharf, but it is free for the first 90 minutes\nShow less"], ["Reviewed July 10, 2017", 5.0, "This is a must see", "This is a must see to any visitors who comes to santa Barbara. A few shops, restaurants and a relaxing walk on the wharf itself...."], ["Reviewed July 10, 2017", 2.0, "WENT FOR THE FOURTH", "Spent the fourth there. Went to the Wharf, for the most part the restaurants we visited were overpriced and not top quality. The wine tasting concession was crowded and the young people serving you did not even say \"HI, I'll be with you in a minute\", or acknowledge out presence, although they looked right at us. It was fun to walk out and look back at Santa Barbara, but I would not recommend any services available on the Wharf. Mainly a tourist trap\nShow less"], ["Reviewed July 10, 2017", 4.0, "Nice walk early in the morning", "For early birds, the walk through the wharf became part of my morning routine. I saw herons, pelicans, and a seal! Also stunning views of sunrise as well as fishing boats heading out for the day. Then I walked the beach. Great Stuff!"], ["Reviewed July 8, 2017", 4.0, "Nice walk to take in views", "Nice Pier to take a walk along and watch the water activities going on. The usual touristy shops that didn't venture into, cars can come on the pier so just need to watch out, There is a small ferry taxi service that runs to the Harbour, we did the trip from harbour to Stern Wharf having walked to the harbour and this seemed a less busy trip.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Fantastic", "Will visit again. Great place to enjoy the day. Restaurants have great food and night life was a lot of fun."], ["Reviewed July 7, 2017", 5.0, "Wharf fun!", "We walked by the skate park there and the boys had fun watching the skateboarders. We walked onto the Wharf itself, it was very windy. We went and bought some candy at the candy shop there and biuggt tickets to the small museum there. It was eductional and entertaining\nShow less"], ["Reviewed July 6, 2017", 4.0, "Nice easy walk - good for the end of the day on a warm day", "This is a nice place to walk and enjoy the ocean breeze and the ocean. There are a few restaurants on the wharf and you can have good clam chowder, sea food and American favorites. We like to walk here towards the end of the day when is not so busy. Street parking nearby, but please make sure you read the signs.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Nice but not the best", "If you have been at Santa Monica this pier will not impress you but worth a visit. Very windy. If you suffer cold weather keep a sweater handy"], ["Reviewed July 4, 2017", 4.0, "Worth checking out", "I had dinner on the Wharf one night and took the time to walk up and down. The view are lovely, but the wind was really cold, so couldn't stay out too long, but it is worth checking out."], ["Reviewed July 3, 2017", 4.0, "Nice walk down the pier", "Lots of families and tourists milling around the little shops and restaurants. It's a good way to spend an afternoon. Souvenirs were not too high priced"], ["Reviewed July 2, 2017", 4.0, "Such a nice place to visit", "I feel if you are in Santa Barbara, this is a must see, you can either drive and park on the peir or park nearby and walk out. There are many places to eat, and a nice icream and candy shop, as well as several little shops . Great photo opertunities .. go and see... No disappointing moment here.\nShow less"], ["Reviewed July 2, 2017", 3.0, "Lots of Restaurants", "We noticed cars driving right up onto the wharf. A beautiful area full of restaurants and shops. We were not sure where to park so we went a couple of blocks north and looked at the pier from that view."], ["Reviewed July 1, 2017", 3.0, "Typical pier", "This is a well known and popular attraction. It's worth going to but it's nothing special. Get the pic taken and at least you will have some memories"], ["Reviewed June 30, 2017", 4.0, "Yummy candy flood ice cream", "This is a lovely spot to walk in the Santa Barbara heat! I adored the candy floss ice cream! Would definitely recommend!"], ["Reviewed June 30, 2017", 5.0, "Must Visit for Santa Barbara", "We love the aquarium -- perfect for kids -- the relaxed vibe, with people fishing, hanging out. Forget the souvenir shops and stop at one of the small restaurants for fish 'n chips or fresh cracked crab when it is in season"]]}}