{"Sterling Vineyards": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Sterling Vineyards", "url": "/Attraction_Review-g32143-d144104-Reviews-Sterling_Vineyards-Calistoga_Napa_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/83/b5/9b/stunning-view-of-sterling.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1461"}, "address": {"@type": "PostalAddress", "streetAddress": "1111 Dunaweal Ln Between Highway 29 and Silverado Trail", "addressLocality": "Calistoga", "addressRegion": "Napa Valley", "postalCode": "94515-9635", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Nice winery", "Loved the gondola ride up to the winery! The wine tasting was very good! Excellent staff and views. Nice to be able to take home the glass too. My only complaint would be to have a guide tell you about the winery instead of reading the tv screens.\nShow less"], ["Reviewed 5 days ago", 4.0, "Not your typical winery experience", "After you get through the elegant driveway to the parking lot, you are requested to choose your experience package. We chose the self guided tour with 4 wines to taste for $35 per person. You can go in without tasting wine for $25/person. Kids will receive a bag with some activities to stay busy while you sip your wine.\nTo get to the winery itself, you need to take a cable car which will take you up the hill to a building with an amazing view. Each participant received a wine glass (to keep!) and we started walking around. There are tastings stations around the property, where you can see the process of making your wine. A terrace overlooking a beautiful view is available for extra cost.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Overpriced and disappointed", "First of all, it was quite expensive to do the tour. You need to take a gondola up to the winery. The view was nice, but not great. Then, the wine is not good. I was actually very disappointed with their wine.\n\nIf you go want to do a gondola ride and don’t mind the high cost, then go for it. However if you are there for the wine, then I suggested going somewhere else.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Views, Great Wine", "This winery is perfectly perched on a ridge in Napa facing south where you get great views of the valley spreading out before you.\nWe came on a cool clear day in January which was a great choice.\nThe tasting is given in stations situated around the property giving you a great feel for this amazing property as you walk from station to station and up some stairs (50ish I think). The walk winds through the various parts of the business end of the wine making with a self guided video tour that is worth pausing for as you try to pick out the parts of the video that apply to the stop you are at. The views from the second tasting stop are just draw dropping and you may want to hang there on the patio for a while in good weather.\n\nThe tour has an added unique feature in that in good weather (low wind), you can take a tram up and down the ridge from the parking lot. This gives you time to appreciate the coming views on the tasting and savor the sights until just before your departure.\n\nNo veteran discount here, but would put it on the list of must see vineyards in Calistoga.\n\nNote: This was our second attempt to tour Sterling Vineyards. The first was foiled by showing up late in the day in the fall on a Saturday where the wait for the tram was 60 min plus. Recommend that you make reservations on line prior to heading to Napa or come in the off season.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Beautiful veiw, just felt industrial not welcoming.", "If you like bitter/tart wines this would be your place. The sky lift was down while we were there, that would have been neat to see. One of the best views in the area. The building and tasting tour was very unwelcoming to us. They do offer offer a splendid desert wine.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Incredible Views & Nice Wines", "This winery is located on top of a huge hill and provides one of the best views of Napa Valley. A self guided tour is available. The wines are very nice, particularly the reds. The tasting room is like a restaurant dining setting with very nice service.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Wine. ...", "The trolley ride going up was great experience. ...\nThe wine stop was great. And explaining the wine and view point of each was nice. ...\nThe pack for kids was also very nice. ...\nThe visit was very organized and informative. ...each stop has a great view and informative board was definitely great. ...\nThe cheese platter was nice too. ...\nThe wine glass was great souvenirs. ...\nThe service was good. ...\nWe had such a amazing time. ...\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Only aerial tram!", "So worth it! The panoramic view is absolutely gorgeous and from start to fonish the tour is so cool. At every station you have a tasting of a wine. Great service, beautiful place, just go and enjoy. The roof top is very nice too!"], ["Reviewed January 21, 2018", 3.0, "Family weekend", "Made a reservation for the silver tour, which is the basic tram ride and silver tasting of about five wines. So incredibly crowded and had to wait for about twenty minutes to get the tram up. The tasting area is quite nice , and our server Quinn was very good. Just way too many people, and so commercial . Wine very mediocre. Pass it up and go to any other family owned and not commercial Winery.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Wine!!!", "I love wine in general and I really didn’t know much going here but they really give you a background of which grapes give you what taste, what to smell for and it was really informational for me and I can now tell the difference between a Merlot and Cabernet and the years are important to know if was a good year or not. I can taste the difference car in wines and k ow why !!!!!\nShow less"], ["Reviewed January 20, 2018", 5.0, "Unique and beautiful view!", "I recently made my fourth visit to this winery. Access to the winery is via aerial tramway (short trip). The winery has a great tour, restaurant, shop and beautiful view of the area."], ["Reviewed January 18, 2018", 5.0, "Fantastic winery with excellent view", "It was a big plus to ride on the tram to the top of the hill where the winery is located. The staff there was excellent and the self-guided tour was good with the TVs and captioning explaining the process of the wine making in each of the room. I would go again!\nShow less"], ["Reviewed January 14, 2018", 4.0, "What a view", "The place is at the top of a hill with an astonishing view of the whole valley. The visit is one that you can actually see the production process and has good wines to taste."], ["Reviewed January 5, 2018", 4.0, "Love the wines", "Lisa is a great host so as well as Gregor! Vineyard has great view of the vineyard and valley and cable car is a cool experience on its own!"], ["Reviewed January 1, 2018", 2.0, "amateur hour wine/tasting experience", "The tram was a fun novelty to start, but it goes down hill from there. The service in the tasting room for the silver experience was slow and depleted when we said we were not going to join the club. Our server knew very little about the wines, the grapes used and the areas in which they are grown. This was the only vineyard we visited that used precise 1 ounce pours, and there was only one wine added onto the tasting. The wines themselves were okay, but lacked any real personality. In our opinion, this experience was the most commercial we saw in the valley (even more than Mondavi). Perfect for people who don't know much about wine and just want a view; disappointing to those hoping to learn and have a true wine experience.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Beautiful views", "What fun to ride a tram up to this winery. The couple we came with had a membership so we were able to ride the tram for free along with the tasting which was very impressive. The wines are delicious and the sparking wine bottles are beautiful. There is a small outdoor restaurant to relax and take in the views. There is also an indoors members only restaurant which was also beautiful. If we lived any closer I honestly think the membership is absolutely worth every cent.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Maurice made our day", "We are members and have not been in some time. Many things have changed since our last visit. I’m not sure l like all the changes. We actually went to Sterling to cancel our membership. This is primarily because we live so far away. We went to the club area and were served by Maurice. Maurice was so kind and engaging that we decided to keep our membership. If you go to the club area, ask for Maurice. He is exceptional. Sterling shines a little brighter because of Maurice.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Beautiful view, delicious wine", "Whilst we’re on a holiday of a lifetime we stopped at Sterling vineyards. Making the reservation online was easy and great, big tick! The cable car is fun, relaxing and gives you a great indication the way the land lies and size of vineyards. The tasting itself was average, wine good. Sadly half of the cellar was under construction. The views overlooking Napa are simply fantastic. Definitely worth a visit and comes recommend.\nShow less"], ["Reviewed December 21, 2017", 1.0, "Don't even bother", "We had a 10 day vacation in Sonoma/Napa and we visited quite a few wineries. Some were good, some were outstanding. And then there was Sterling. We paid $35/person to walk through their facility, unguided, stopping at 4 stands along the way to get small samples of not very good wines. This was the most unusual and least personable tasting I have ever seen.\n\nThe people poring the wines at each station did not seem enthusiastic about their jobs.\n\nThe only redeeming factor is the view from the patio at the end of the tour.\n\nI do not recommend anyone visiting Sterling.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Worth a visit for the view", "This vineyard was on a list provided to us by friends. Wow. The whole experience was great. Even if only one person is wine tasting you have to pay the full price for both due to the experience of the cable car to the top. Saying that, it was well worth it. The tour itself was well organised and staff were very friendly. The view from the terrace at the top is stunning. You can purchase food there if you wish. Wellworth a visit.\nShow less"], ["Reviewed November 30, 2017", 4.0, "beautiful landscape and design", "this is where i do not skip whenever i go to Napa. but, last time i visited, i was disappointed that i didn't fine a bottle to bring home.\nnonetheless it has a style and service of their own. and, do pay attention to the chalk board to read and write near parking area. i end up taking some serious moments to ponder at times..\nShow less"], ["Reviewed November 28, 2017", 4.0, "Beautiful views", "We loved the tram up the mountain. The general admission is not worth your $$ but we did the Silver experience add the cheese platter for two and it was nice. Kenny G is a funny guy. He poured our wines. We loved their Malvasia Bianca. Lovely gift shops. Would be nicer another time of the year... it was very quiet maybe due to the fires. It was also cold and rainy. But overall I’d say it was worth it for the views!\nShow less"], ["Reviewed November 27, 2017", 5.0, "Great view", "This was my 5th trip to the winery. This time I choose the silver experience which was $48 per person. Including a tram ride and a wine glass, seated wine tasting was a good deal. We can see amazing view at the terrace at the end of the tour!\nShow less"], ["Reviewed November 25, 2017", 5.0, "Amazing", "This winery was by far our favorite today! Maurice Dixon in the Silver experience made the extra cost more than worth it, and was so amazing. He was really passionate about what he did and engaged in some really hard questions we threw at him! The views from the terrace were also beautiful. Lynn was also super friendly. We were there for over two hours enjoying wine and the scenery. I would definitely recommend at least doing the Silver. Definitely arrive early to enjoy the more personal touch!\nShow less"], ["Reviewed November 23, 2017", 4.0, "Tourist attraction, not the best wines but worth the ride!", "Maurice you were the best! Thank you for being such a kind host. Sterling is a beautiful winery, the wine is not my favourite but the tasting fee is worth it just to see the facility. Spring for the silver tasting and grab a cheese plate it makes for a really nice day.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Super place on a sunny day", "On our way to Oregon fron San Francisco my friend suggested we visit this particular vineyard. There's a cable car ride upto the top of the hill where the tour starts and the view from the cable car over the gardens is lovely.\nThe tour is very professional though the wines you sample are good, you only get a little to slurp! When you've done sampling and seeing a bit of the process (not much to see really) the high spot for us was the view from the top, over the valley. Spectacular and on a hot sunny day as we had, clear great views. It's a modern building, stylish and slick. Was pleased to learn that a fellow Brit had started the vineyard originally.\nShow less"], ["Reviewed November 13, 2017", 3.0, "tram ride is fun", "Hmm, what to say...in a nutshell the tram ride is fun but the wines are not worth the ride. The views are lovely..tour is self guided..wines nothing special."], ["Reviewed November 12, 2017", 4.0, "Gondolas with no skis", "U take a ski gondola up the mountain and they serve wines along the self guided tour. Great to see the wine making process, but the views from the top are spectacular."], ["Reviewed November 12, 2017", 5.0, "Beautiful winery", "We only had time for a couple wineries and this one was a great choice. The gondola brought us up to the building for the wine tasting and it was a beautiful day to sit outside and enjoy the view as well as the wine!"], ["Reviewed November 8, 2017", 3.0, "The Ride Is Most of the Fun", "This vineyard draws a lot of visitors because it is a familiar brand, and because it has what no other wineries do, a gondola ride from the valley up to the premises. The crowd management functions, however, are somewhat scattered. There are several choices of experience available, depending upon what you reserved for or are able to upgrade to. Maybe one of them included a guided tour of the winery, but ours involved only a self guided browse, and a tasting. The tasting was friendly and in nice surroundings, but the it was inescapable to note that it was a sales pitch, much more pointedly than other places we visited. Sterling is worth a visit, but not more than one.\nShow less"], ["Reviewed November 5, 2017", 2.0, "Unorganized", "We made a reservation for a tour and tram ride for 3 pm. When we arrived, it didn’t matter if we had a reservation or not. The line for the tram appeared to be at least an hour long, and we were also given an option to take a bus to the top of the winery. We decided to wait for the bus because the tram line seemed never ending. When the bus arrived, everyone stormed the entrance, pushing each other out of the way. Somehow our group made it on and we were just happy to be headed to start our self tour. The self-guided tour felt like an amusement park attraction, being shuffled from station to station without much education or guidance. The wine was very mediocre for Napa standards, I did not enjoy any of them. The views were fantastic, but hard to enjoy with the crowdedness. The line for the tram back was long as well. I wouldn’t recommend coming here for the wine.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Quite fun. Tram up to the hilltop compound with great views", "Tasting rooms and and indoor and out restaurant at the top of the tram. $25 per person gets the tram and self-guided tour and tastings - and a beautiful outdoor hilltop patio - but not the in-and-outdoor dining room. Can for $23 each add the silver tasting, which is a 4 wine tasting with wine guide/server in the in-and-out dining. Both options have a $16 charcuterie platter option. Or instead of these two for $75 each all-in you get the served tasting in the dining area plus a full served lunch. All plus about 4.4% tax. All options include access to gift shops and self-guided facility tour and the tram back down. Beautiful views.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Make the Time", "I had never been to Napa, and I decided to go to Callistoga when I saw what Sterling Vineyard has to offer. The gondola ride alone is worth the trip. I would suggest purchasing the silver or gold package, as you will be able to try additional wines and go up to the club area. It's incredibly relaxing up there, and the wine is delicious.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Panoramic views of Napa Valley", "The visit to Sterling Vineyards is worth the journey because the panoramic views of Napa Valley from the aerial tram to the bright white hillside visitors' center is outstanding. Tours, tastings and a tram ride are a package price with additional charges for premium tastings. Not our favorite wines, but the scenic views are wonderful.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Platinum Tour", "This comprises the tram ride, a tasting of 5 wines including a flight of 3 cabernets (2011, 2012 and 2013) paired with 3 small appetizers and a self-guided tour of the winery for $75 each. The cab/appetizer pairing was guided by a knowledgeable young woman who explained the differences among the three vintages and we experienced how the taste of the wine changed with the food. While we are knowledgeable wine \"enjoyers\" we still learned from it! We expressed an interest in pinot noir and were given a tasting that resulted in us buying a case of Sterling's Russian River PN. Recommended experience (as well as the PN)!\nShow less"], ["Reviewed October 16, 2017", 4.0, "Sterling Vineyards for great views and Aerial Tram", "Sterling Vineyards is located in Calistoga near Napa wine country. If you are short on time then this is one you must visit. Whenever I have out of town guests who wish to visit the wine country then Sterling is usually on top of my list. Though it is located further away than more famous wineries in Napa and Sonoma, it is well worth a visit. One of the few wineries with beautiful views of the valley as well as some real good Cabs (Cabernet Sauvignon).\n\nParking is free but the cheapest ticket is $32 per adult and includes the Aerial tram ride and four wine tastings. Collect your token after payment for the Aerial tram ride. A maximum of four adults are allowed per gondola. It is a short 5-6 minutes ride up the hill to the winery offering good views of the surrounding countryside.\n\nUpon reaching the top, you start off with the first wine which is usually one of their sparkling white. Hang on to your glass as you may take it home at the end of your tour. You go up another level passing the gift shop then hang left to enter the factory. There are large number of stainless steel tanks for processing and fermentation. Here you get to taste two more wines usually reds. You then pass through a long corridor with oak casks stored on either side below you. The last stop is a large open terrace with tables and chairs where you can relax and enjoy your purchased bottle of wine. Take in the beautiful views of the wine country below you as far as the eyes can see. The last and fourth wine tasting is in this area.\n\nThere are restrooms by the parking area and ticket counters. Items in the gift shop are way over priced unless you have money to burn. But there cabs are pretty good and priced between $20 and up. Please allow 1-2 hours from start to finish. Overall a good experience.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Tram car best view!", "This winery stands out because you get to it by tram and you can see the vineyards from above. The wine they offer with the standard tour is not great, you should go to the terrace and pay for a premium wine. The view from the terrace is just amazing.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Beautiful views, self-guided tour", "Sterling is a beautiful winery set high up in the hills which gives is amazing views of the valley! You take a tram up to the winery and begin your tasting there. We got the silver experience which includes an extra tasting of premium wines and was definitely worth it. Our pourer (Unfortunately I didn't catch his name) was wonderful. Very funny, friendly, and exceptionally knowledgeable about the wines, wine chemistry, and food pairings, without being pretentious. The wine was very good and made even better by the pairings with certain cheeses and almonds offered.\n\nThe tastings around the rest of the winery were ok, but we were very rushed to get to our next tour after spending so long at the Silver experience. I would recommend giving yourself plenty of time here to thoroughly enjoy the beautiful views!\n\nI was disappointed that the \"tour\" was really just walking around and reading the signs they have posted. However, the signs were very informative.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Best winery in Napa!", "We visited many many wineries in Napa and this was by far our favorite! It is amazing! You take an air trolley wit beautiful scenery to the top and then you can taste inside or out. We tasted wine and ordered pairings on the rooftop. It has amazing views and delicious wine and food. Staff is amazing! Good pricing too! You can also tour the area yourself which is great! Loved it.\nShow less"], ["Reviewed October 6, 2017", 3.0, "Expensive Visit", "The highlight of this visit was our great tasting host, Kenny G. He did a nice job introducing us to the wines and company. The walking tour through the winery is impersonal. The gondola ride is nice but not worth the admission fee."], ["Reviewed October 6, 2017", 1.0, "What a RIP-OFF!!", "We toured ten wineries in the Napa area, and this was the worst of all of them.\n\n$32.00 a person for four very small pours on just very mediocre wine and a very short self-guided so-called tour that was not at all informative. The only thing nice about it was the view from the patio.\n\nBelieve me, you can do MUCH better than this!\nShow less"], ["Reviewed October 2, 2017", 4.0, "Great Stop when wine tasting", "This vineyard has a gondola that you take up the mountain to the tasting room. It's worth going for that fun experience. The wine was very good and we should have bought more. The self guided tour takes you to an awesome patio overlooking the mountain when you finish. They've designed this tour and tasting to perfection but it definitely takes time and not one of the \"faster tastings\". We loved it!\nShow less"], ["Reviewed September 30, 2017", 5.0, "Beautiful Views", "We did the Silver Wine Tasting with the Cheese Tray. We sampled three additional wines with pairing from the cheese tray. The wine and cheese was excellent. Did the walking tour of the facility, a lovely modern refinery. You could watch the workers actually making wine. The views of the valley from the winery were spectacular.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Loved it!", "Fun tram ride to and from the tour. You could see the countryside and all of the vineyards. Self guided tour with tastings of 4 wines included - could go at your own pace. Very organized and marketing oriented without being pushy."], ["Reviewed September 27, 2017", 3.0, "Great view, poor \"tour\"", "At $32/per person to ride the aerial tram up to the winery, I felt you were simply paying for the view. The vistas from above are gorgeous, but there was no \"tour\" per se - visitors walked around and stopped at various points for small tastings. The pourers were lovey people but knew nothing about the wines, production facilities, etc. Any of my questions were met with \"i don't know\". This was my least favorite winery...it felt extremely detached and touristy. If you are into wine, tasting and discussing it, this is not the place to visit.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Amazing views & vino!", "My girlfriends and I went here in mid-September for a girls trip. We were delighted by the friendliness and ease of booking our visit. In order to begin your wine tasting, you have to take an aerial tram (about 2-3 minute ride) to the site. There were 4 of us and we fit comfortably in one pod. Once we arrived, we went to the first bar area for our first tasting. We then walked up a few short flights of stairs to an outdoor tasting room. We sampled 3 or 4 different wines, all of which were amazing. The staff was also very friendly here. You can then walk through and do a self-guided tour of the winery, tasting about 3 or 4 more wines along the way!\n\nIt was the best tasting I had while in Napa/Sonoma. The wine, the views and the staff were all incredible. I would highly recommend visiting Sterling Vineyards on your trip!\nShow less"], ["Reviewed September 21, 2017", 4.0, "Wonderful experience", "We've become picky about the vineyards we visit since they are charging quite a lot of money. To get the best bang for our buck we decided to visit the Sterling Winery. The tram ride is fun and the experience on a nice day is just great b cause they have decks and patios with such nice views. Cliff, Lawrence and Ana were so friendly and made sure we had a nice tasting experience.\n\nShow less"], ["Reviewed September 20, 2017", 5.0, "Excellent Aerial Tram, tour and tasting experience", "We did the aerial tramway ride to the top where we start the wine tasting and tour. The ride is fun and the views are great. At the top we start the tasting and self-guided tour. At each tasting station you learn about that particular wine then move along where you get great insights into the operation of a modern winery until you get to the next station and the next wine. We do two whites and two reds. At the last station you’re at the top of the place with terrific views. It’s a fun and interesting way to learn about the Sterling Winery. When you’re finished with the tour you catch the tramway back to the entrance.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Great view", "The price of admission includes wine tasting, a gondola ride and self guided tour of the wine making process. The wines were very good to excellent. The view from the winery of the valley is spectacular."], ["Reviewed September 20, 2017", 3.0, "LIKED THE TRAM RIDE", "Not a wine drinker so I just tag along with my wife. Tram ride is clever (the hook to get you in) and scenic. Beautiful views from the top. Took the least expensive package of the 3. Wife did not particularly like the wine"], ["Reviewed September 17, 2017", 2.0, "View with a disappointment", "The estate is anti-climatic. A warm ride up in a gondola that anticipated a fun tour for $32.00. Very big disappointment in the education of the winery. A lack of excitement with the wine that was offered within the tour. (4) tastes.\nThe views were spectacular and pictures were fabulous but the tour itself wasn't worth the ride in a hotbox.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Sterling Vineyards", "Went to this vineyard because was recommended as a must see. It is definitely beautiful but not being true wine expert, I found it more like factory with workers on auto pilot. You pay $30 to get in and sample wine. They make sure to give you not a drop more than is allocated by the stopper on the bottle. There is a cable ride up to the top that is nice but just a cable ride. It is pretty at the top. On the plus side, you do get to keep the glass and if you find a few more lying around that people left behind, you can make yourself a set.\nShow less"], ["Reviewed September 15, 2017", 4.0, "Cable car vineyard", "Good excuse to take a cable car up the hill over the vineyards. Nice selection of wines before descending again"], ["Reviewed September 14, 2017", 5.0, "Beautiful vineyard/ winery", "We had a very pleasant time there with tastings in a sunny and hot day. I recommend it also because of the tour with air car."], ["Reviewed September 13, 2017", 3.0, "A sum of less than its parts", "Four of us stopped here to get a look at the operations of the winery from which we have bought many products in the past years.\nI wish I had done more homework before choosing this one, though.\nPart of its appeal was the tram ride, which is heavily advertised as the only one giving you a panoramic view of the vineyards in Napa Valley. In addition, my daughter was intrigued by the idea, and it seemed like it would be a real treat.\nWhat is not apparent though, is that the tram goes all of 90 feet in its trip to the top, and the panaramic view is not that stunning.\nThe self-guided tour takes you to many areas where you can observe the steel containers of wine, and have a taste of some of the varietals they produce. Apparently, there is a planned renovation for one of the larger spaces to showcase the process of making wine and storing it in wooden barrels. Right now, it's a rather sterile and unremarkable walk - thru, although the outside deck at the end is a lovely spot.\nThis was a pretty expensive proposition for the return, so I would recommend booking with caution\nShow less"], ["Reviewed September 12, 2017", 4.0, "Nice experience!", "I noticed that almost all vineyards in Napa Valley have their own attraction, my family chose Sterling because they thought that the cute tram would also keep my cousins, who were 5yo and 3yo, entertained.\nIt was a nice experience, and my most favorite part was breathing the sweet air around the area, I'm not sure if other vineyards were also the same, but it smelled like sweet peaches and grapes of course lol.\nThe wines, well, I think they're the same i liked 2 out of 4, and I got to keep my glass!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Lovely Winery!", "Whats great about Sterling is that the wine stations(for wine tasting)is scattered than in one location. It makes more interesting to walk around to see how everything is being made. Great selections of wine as well. Lovely!"], ["Reviewed September 10, 2017", 5.0, "A Fun and Scenic Afternoon", "We went here as 3 friends looking for a scenic and fun winery, but I will be the first to admit that we know nothing of wine and I personally don't like wine very much.\nWhen we arrived it certainly felt tourist-y. There's a long line for the gondola after buying your tasting experience where they have music playing and fans misting water over everyone. I'm not going to lie- it felt a little disneyland-ish.\n\nOnce we rode the gondola (we didn't wait too long maybe 5-7 minutes) we got our complementary take-home wine glass (very nice - crystal and the only logo is on the base and very tiny) and headed up the stairs to the private tasting room for our \"silver\" tasting experience. We were seated inside for our first wine but we saw that a table opened up in the shade outside and our server had no problem with us moving. we tried three wines with our charcuterie plate and enjoyed the view. We didn't feel rushed and we even tried a pino noir that was spectacular! (at least for us non-red lovers). Afterwards we headed down to the self guided tour and the basic tasting that came with it. At the end of the tour there is a lovely balcony where you can finish up your tasting or get a full glass and enjoy the view.\n\nThe gondola ride down was equally lovely. It was nice that the ride down is different from the ascent and you get some different scenery.\nShow less"], ["Reviewed September 7, 2017", 4.0, "Greek architecture with a gondola ride!", "My husband and I visited this winery as a gift from a friend. We arrived to discover a gondola ride to get to the winery. The landscape is breath taking with the water features and manicured grounds. The greek architecture of the buildings is unique and fun. The view is stunning from the deck.\nThe actual wine tasting was an experience. We were fortunate to get to try the \"higher end\" wines, they are very good.\nShow less"], ["Reviewed September 6, 2017", 2.0, "What a view!", "If you are looking for a fun venue, fabulous view and a change to sample wines at your own pace, this might be for you. If you want to taste upper end wines and really know about what you are tasting, the terroir, etc. I would pass.\n\nThis is a mass market, churn them through, operation where the pourers are polite and nice but only know their script.\n\nOn the other hand...the view.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Beautiful scenic vineyard...", "I tasted 5 wines. Before heading on the tram, I had set my mind on getting a bottle of Cabernet Sauvignon. I was very impressed with the Merlot (2014).\n\nIt's about $10 cheaper if the cable car is not running (bummed to have missed that). The price with the wine tour is less than without wine samples - ~$22 + tax. This includes the RT ride, a bottle of water, and a wine glass.\n\nHere's what I sampled:\n1. 2016 Sparking Wine\n2. 2014 Napa Merlot\n3. 2014 Napa Cabernet Sauvignon (I also tasted the small white grape)\n4. Reserved Cabernet Sauvignon - \"2013 Platinum\" (small white grape)\n5. 2016 Malvasia Bianca\n\nFull disclosure: I am not a wine connoisseur.\n\nAll the wines were really great, but my favorite was the Merlot.\n1. Cool, crisp and refreshing - slightly sweet (in comparison to a Chardonnay)\n2. Just really good -- almost like water\n3. Good and sweeter than the Merlot\n4. Two other people I was with really liked this one, but I'm not sure if it's because they saw the \"reserved\" label and the price tag (~$72)\n5. Crisp and sweet (sweeter than the Sparkling wine)\n\nI learned from a conversation with a staff member that the Merlo was one of Sterling's specialties. Of course this was right after I told him I was surprised that the Merlot was my favorite.\n\nThe staff member also explained the difference between a Cabernet (these grapes are picked later) and Merlot. He also explained the process between keeping the grape skin even though using a white grape gives the color of the wine (red).\n\nI got a bottle of Merlot and 2 bottles of the rosé sparkling wines. I was going to get a case of wine that was 60% off but opted not to since I didn't try them.\n\nBest was the $.54 tax on $84 worth and 20% mix/match.\n\n\n\nShow less"], ["Reviewed September 3, 2017", 5.0, "Fantastic Views", "The gondola ride is a unique experience and the views at the winery are breathtaking. A cool experience."], ["Reviewed August 31, 2017", 5.0, "Girls trip in Napa", "We were so surprised how beautiful the grounds were! The wine was really good too! This is a definite if you are in Napa!"], ["Reviewed August 29, 2017", 2.0, "Overrated tram ride and no personality!", "We did the wine and cheese tasting tour and were very disappointed in this compare to our other winery experiences. We were handed off from place to place and person to person. No personalized service and not very organized when it came to our actual wine and cheese tasting. the Server didn't eve know what the cheeses were and how they should be paired with the wines! what a disappointment\nShow less"], ["Reviewed August 29, 2017", 5.0, "Napa valley", "Nice day out from San Francisco. Views were stunning. We rented a car to get there and head through napa valley train tours information office. As it was unplanned, there is no schedule tour at that time but the staff at the desk was very helpful to talk us through where to go hence we ended up in sterling vineyards. Once arrived,we bought a basic wine tour ticket which include a cable car to go to winery and wine tasting. I am not into wine but white wine tastes so refreshing and good, views around the winery is brilliant. Definitely a must when you Visit SF or other places in Cali.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Vacation", "We visited this winery during our family vacation. There were six adults in our party. We are from Ohio and have some nice small winery's here. So going to the Napa and surrounding area I had some high expectations. At this winery all of it was met. The tram ride up is amazing. Gives a beautiful view. The wine was delicious and staff very nice and professional. I would recommend this place to anyone.\nShow less"], ["Reviewed August 27, 2017", 5.0, "AMAZING Winery", "From the time you pull up until the time you leave you are submersed to breathtaking views. The winery is up on the hill and you take an aerial car up the mountain to help preserve it. THe whole ride up you have more and more scenery to look at. Then you get to the top of the ride where the tasting rooms are and it gets even better. I recommend the Silver tasting as you get a private table and a view from the patio/terrace which gives you even more great views of the valley.\nShow less"], ["Reviewed August 24, 2017", 1.0, "$100 for 6oz of Wine", "We chose the Silver Experience and upgraded to a cheese platter. We arrived and took the tram up to the tasting area. If you've been on a tram, then there really isn't anything special about the ride.\n\nOnce at the top we were greeted by a sample of a sparking wine, which was a great welcome. We were told to take the stairs up to our tasting. Once up on the balcony we found a shaded table, which really did have a great view. We thought we hit the jack pot on wine tasting experiences. Unfortunately, we had not.\n\nThe wines were actually really tasty and we would argue the best of what we tasted during the day compared to the other wineries we sampled at. However, for the price we paid and for only 3oz of wine each, it was a huge let down. We were rushed through the experience and were informed that we should have upgraded to the \"large\" cheese and meat platter as we had \"only\" purchased the small platter. But we could fix that by becoming members of their wine club. After a good three minute sales pitch (yawn!), we went back to our tasting...oh wait, it literally lasted 15 minutes.\n\nWe did sit and enjoy the views and milked our last wine sample. When we inquired if we could purchase a glass of wine each, we were informed that it's not a bar and they don't do that here. Well, ok then! What a sour way to end a very fast tasting.\n\nWe seriously would have preferred to buy the $100 bottle of wine and sit and enjoy the view over a rushed, and very stingy tasting we received. The view really was amazing, but really not worth what you pay to get up to the view.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Great to see the valley from the top", "This vinyard is very commercial and although the cable car ride is nice, it is not an absolute must do. However, if you are nearby and you have time, it is well worth the visit despite the high price."], ["Reviewed August 21, 2017", 3.0, "Best part is the tram ride", "Sterling Vineyard is very state of the art and undergoing a major restoration. The tour is very nice, the best part bing the tram ride up to the building. Views are wonderful from there. The tour is a bit pricey $25 admission and then a $7 fee for tasting. You then can taste 4 different wines, which were fine. The staff is super friendly and will answer all questions, but the information about the winery and the wine making process comes mostly from information boards along the way. So, basically a self guided tour.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Great vino but lacking in wine education", "Best to arrive here early to beat the crowds, if you can make it before noon then that would be best.\nThe gondola was the amusing part. The wines poured for us that day were all pretty good but servings were stingy. The place is big and offers a self-tour type of visit -- yes, you look at something and read the poster beside it.\nWhat they lacked was personality and being able to impact some wine education to the guests.\nWe were lucky our friend was a member so she was able to bring us to the member's only area for further wine tasting and the awesome charcuterie board.\nOverall still a good experience.\nShow less"], ["Reviewed August 19, 2017", 3.0, "Nice gondola ride but otherwise ...", "Fun gondola ride up the mountain but otherwise a bit cold and austere. Glad we did it but many more smaller wineries that really give you personal service. Pretty views once atvthe top."], ["Reviewed August 16, 2017", 4.0, "Okay if you have time", "We arrived here around 1pm on a weekday. Not crowded. Got onto the gondola quickly. Wow! Did i not anticipate how hot it is in the cabin! By the time we arrived, about 5 minutes, we were sweating!! The view is beautiful. I was disappointed because for the amount of money spent for his admission, my husband received UNLIMITED water lol. He doesnt drink. At least other places gave him grape juice. We did have the charcuterie platter and it was good. The woman that provided the wine tasting was nice and personable. Once you arrive you are put in a nice room. Then you can roam around to certain stations, which is really about 3 more tables until you get to the view. The pours were stingy but it was a nice experience and the view was nice. Maybe time your visit when it is not 99 degrees.\nShow less"], ["Reviewed August 14, 2017", 3.0, "Go for the TRAM and the Views", "TRAM is unique, Views are spectacular. After that not so much-silver tasting seemed like an assembly line with not a lot of information about the wines. Self guided tour was poor at best-maybe parts were under construction?? You can do better in Napa."], ["Reviewed August 12, 2017", 4.0, "Great Views", "The gondola ride to the top is fun and exciting with beautiful views of the surrounding hills and valley below. Once arriving at the top there is also a great view of Castello di Amarosa. The winery tour is self guided which is a nice touch, with multiple wine tastings station along the way and a commemorative wine glass to take away.\nShow less"], ["Reviewed August 12, 2017", 2.0, "Disappointing", "We read a review on internet in 'trotamundos', a Spanish web with usually very good opinion. We followed a girl's suggestion for visiting this cellar. We came all the way from Mariposa in Yosemite just to go up the air tram and experience new, vibrating and exciting moments, but after we were asked for 32 dollars each, plus taxes, and hoping there would be such good effects going on, we were ever so disappointed to find out that they offer 4 tastes of normal wine and you get to see really nothing of how wine is made.\nI was taking my partner there because he's a fan of wines and has quite good knowledge of the ones from Rivera de Duero... So I presumed he would enjoy seeing one... But we didn't choose well.\nMy recommendation is to try another, although I can't really go for any. We did pay a quick visit to Castello di Amorosa, and it looked quite a different better story, but we didn't stay long\nShow less"], ["Reviewed August 7, 2017", 4.0, "Great Self Guided Tour", "Like the kid friendly, self guided tour. Got to see wine making process, enjoy four wines, and then great views of the valley. Have your camera ready!! Tram ride is a nice way to get to and from the lot to the winery, but beware it will not run if temps are > 100 degrees.\nShow less"], ["Reviewed July 31, 2017", 2.0, "McNada - Fast Wine Serving", "Gondola ride was okay, view was nice (best part of the experience), and the wine was lacking. We went here with a large group and no one enjoyed the experience. It felt like we were just being rushed through and out the door like at McDonald's. Some of our group felt the reds were ruined because they were too warm. The views are beautiful but overall I found the experience lacking.\nShow less"], ["Reviewed July 30, 2017", 4.0, "Winery Meets Amusemant Park", "I suspect that there are few, if any wineries that have their own cable car. Sterling does. It makes for a very interesting experience when one want to take the winery tour. The tour itself is interesting, if self-guided, and the winery is generous with its tasting. This isn't the best winery in Napa, but is the most unusual. Worth a trip.\nShow less"], ["Reviewed July 30, 2017", 3.0, "Good for a Start", "This was our first winery visit in Napa Valley and starts you off gently.\nYou take the aerial tram - cable car - to the winery building at the top.\nEnjoy the views whilst you taste the wines. We only did the basic tasting and it was fine. Wouldn't rave about the actual wines but enjoyed the experience.\nDecent shop with some good quality merchandise.\nShow less"], ["Reviewed July 29, 2017", 4.0, "Platinum Experience", "The platinum experience is completely worth it! I enjoy wine, but am definitely not an expert so didn't really know what to expect. Upon arrival, you get to ride the tram to the winery, there is an option to take a shuttle up, but you'd be missing out on the whole experience and the views. At the end of the tram ride is where you get your first taste of wine, where you then walk up to the waiting area (for platinum experience). Once staff seats you, there are 4 more wine samples brought to the table, which are paired accordingly to food samples and dessert. During the tasting, staff explains why each item pairs well with each other. The staff was very friendly. Once competed, you then go on the self guided tour inside the winery, along the way, there are 3 additional wine samples and amazing views. At the end of the tour, you have the option to purchase a cheese plate or wine by the glass.\nOverall, Sterling Vineyards is worth the trip and money. The only reason I didn't give 5 stars is because they did not have a variety of sweet wines (which I tend to enjoy more), otherwise, highly recommended.\nShow less"], ["Reviewed July 29, 2017", 1.0, "Embarrassing Recommendation", "I have been to Wine Country numerous times. On this visit we were \"guiding\" friends on one of their bucket list trips. This review has nothing to do with the wine which is ok. It is about the experience.\n\nWe reserved the Silver Experience. We were seated at a dirty table and immediately served minuscule food pairings. An uninterested server poured our wine with a rapid fire description then on to the next table. No time for our questions or observations.\n\nWe commenced the self guided tour through heavy construction that had not been disclosed. The noise was very annoying. One server along the tour answered my question with a condescending \"no one knows this wine sweetie\" and challenged me when I asked to see the label. \"Why\" he actually asked. I couldn't wait to get out of here.\n\nIt's all about the tram ride but it is so not worth it. Thankfully the other tours I arranged for our friends were excellent.\nShow less"], ["Reviewed July 27, 2017", 1.0, "Poor experience. Lacks authenticity or charm.", "We visited to find out more about Napa winemaking however were disappointed. Why? From receptionist who sold tokens to the tastings everyone we encountered were less than credible asking us to read signs rather than being able to provide any insight or impart any knowledge. First tasting the chap actually started making up answers. Really disappointing largely to the hired help which gave it a poor theme park experience.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Living the life!", "This place was awesome! The general tour included the sky ride to the wine tasting villa. We had 4 wines to taste included. they were delicious. The view was amazing. there are also tours that included more wine tasting, but we were good with 4. We bought 3 bottles of fine wine and got a 15% discount. I wish there was a vineyard tour which would have made the experience better.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Sterling Vineyards", "First time for my husband - 2d time for me. The tram ride is fun and beautiful. The views are stunning from the tasting rooms and the quiet is unbelievable. Not my favorite wines but we did find one that we liked. Last time I was there they had some sort of art show going on - paintings hung all over - this time just bare walls. It is expensive - a little, very small, picnic pack was $20\nShow less"], ["Reviewed July 25, 2017", 5.0, "Expensive", "A very nice winery that we opted for the self-guided tour which included three wine tastes and the Gondola ride. The views were spectacular."], ["Reviewed July 24, 2017", 2.0, "Overpriced.", "Way too much. $32 for entrance and tasting. Tram was fun, but too much money. Beautiful views. Wouldn't go back."], ["Reviewed July 23, 2017", 4.0, "Only family friendly winery in Napa Valley", "Sterling directly caters to families, while as many of the other wineries are 21 and over only. Tram is nice, winery self tour is OK. Kids will enjoy, but it is only about an hour total tour. Adults $32, kids $15."], ["Reviewed July 23, 2017", 5.0, "Good for Family Visit", "This is a good winery to visit with the family. The winery works to make sure the children feel included in all the activities. The children enjoy the ride up, plus the views from the top."], ["Reviewed July 22, 2017", 5.0, "A must visit!", "Aside from the great wine, the beautiful white buildings and gondola ride make Sterling Vineyards a must visit!"], ["Reviewed July 22, 2017", 4.0, "Great wine tour", "Friends had recommended this tour and we were not disappointed! The cable car up, the views, the food pairing (we did the silver tour) and the different stations made for a very nice afternoon. We took our kids there for their 21st birthday and all really enjoyed it.\nShow less"], ["Reviewed July 21, 2017", 2.0, "Things have changed! (And not in a good way)", "Came here last year and we enjoyed the upgraded experience, so when I came back this year - with family - I encouraged everyone to do the same experience. I had been raving about how we got to sit on a beautiful patio and taste three premium wines (and were able to order a cheese plate). We couldn't wait! But the experience has changed. The upgraded experience now just sends you immediately (before the self-guided tour) to a different patio (lower, and without much of a view unless you peer over the corner wall), where a nice server took care of everyone on the patio (10-12 of us) with tastes of three wines. And that was it! Then on to the rest of our tour - most of which was of nothing because much of the interior is undergoing renovations. The sky ride is cool, but what a HUGE letdown the upgraded Silver Experience was. That had been the highlight of our trip last year, but this year I felt like we had fallen for a gimmick (and it feels like Sterling is trying to make a quick buck tricking people...). It left a bad taste in my mouth about the entire company. It's interesting because I heard another group behind us during the self guided tour saying they felt things had changed too (and not in a good way). Again - fun gondola trip, decent views, average wine, but not worth it.\nShow less"], ["Reviewed July 21, 2017", 5.0, "A great Tasting experience", "We had been recommended to visit here while staying with Friends in Novato,California.\nWe had a wonderful visit and the stand out is that the visit starts with a Cable car ride up over the vineyard to the Winery on higher ground.The Winery itself is designed in a Greek style and the tour is very interesting with different tasting stations with knowledgeable servers. The final stop is on a lovely Terrazo overlooking the wonderful valley below. The shop is certainly worth a visit .An enjoyable day out.\nShow less"], ["Reviewed July 20, 2017", 3.0, "Mediocrity in Wine Country", "They don't tell you, if it's a 100+ degrees, the trams don't run. Whether or not the tram works, it's $32 for tasting! The \"AC\" van they use to take you to the top is not so \"AC\" and the price doesn't change. $25 for the tram ride (even when the tram is not working; this is also applicable for yourDD who either can wait for you at the ticket purchasing area in the 100 degree weather or pay to ride in the van with not so friendly drivers). $7 for tasting...they don't break the price out for you until you see the receipt-- $25 for tram (operable or not) + $7 for tasting. Wines are mediocre and pourers are not so friendly. View a the top is cool, but on a hot day, they only had 1 umbrella out....can you communicate more that you don't want people there on hot days?\nShow less"], ["Reviewed July 18, 2017", 5.0, "Like the TV Show- Absolutely Fabulos", "From the parking area it was very unimpressive, but once on the gondola it started to open up and got better. I was drawn in by the beautiful ride and views. Then we were at the top it felt more of a resort than a vineyard. The staff was friendly and helpful. The wines great, the entire experience unique and wonderful. No rush, no sales push, no limits. We could stay as long as we wanted and buy or not buy. Will return!! BTW we did the Silver experience. The pairs with cheeses were excellent, next time I'll do the platinum.\nShow less"], ["Reviewed July 15, 2017", 5.0, "A wonderful wine yard", "This place is amazing a very quaint. Its beautifully set and being a visitor there was really a lovely experience! On top of that the wines tasted so good! A place to visit for sure!"], ["Reviewed July 13, 2017", 4.0, "Go for the view!", "Self guided tour means walking from tasting to tasting yourself and watching videos on the way. Stunning view! Fun tram ride. Nice wine. There's an opportunity to purchase a glass of wine and chees plate and relax looking at the view"], ["Reviewed July 12, 2017", 4.0, "Great views", "The tour of this property are worth the tasting fee. I would recommend the genera admission tasting as the silver didn't add much to it for the price. The views from the terraces are magnificent and the aerial tram is a unique addition. The wines themselves were average.\nShow less"], ["Reviewed July 12, 2017", 2.0, "Go for cable ride, wine is forgettable", "The cable ride is awesome!\nI got to ride solo, just got this season.\nThere is a walking tour and not much to see.\nWines are very forgettable.\nGlad they had water stations and misting fans, but still too hot!!!\n\nThey charge admission now - it used to be free.\nShow less"], ["Reviewed July 11, 2017", 3.0, "Dissapointment", "The winery is in a beautiful location and an looks impressive on the hilltop. The views from there are great as well. Service however was spotty and the wines were disappointing. Everything had a very \"corporate\" feel. A lot of money invested in the facility that was missing in the final product...\nShow less"], ["Reviewed July 10, 2017", 3.0, "Birthday for Chuck and John", "Unbeknownst to me, Sterling has new owners and is in the process of major changes. The expensive tour ($32 for the \"basic\") used to be wonderful--\"the best in the Napa Valley\" according to my winemaker father. But this time , a great disappointment! The tram was not running due to the heat, but no one told us as we waited line. The bus ride to the top was fine however, but lacked the drama of floating on a gondola over the beautiful Napa Valley. The tour that moves from tasting station to station throughout the Greek inspired architecture has been abbreviated for the \"basic\" with fewer stops and friendly, but novice staff pouring and describing the wine. The fabulous art has all been removed presumably with the sale. The apparatus of the working winery is being removed as well. The wine, made and bottled by the former owner, is still superb, but who knows if it will continue to be? Not recommended any more. Sad.\nShow less"], ["Reviewed July 7, 2017", 2.0, "Vineyard", "This was an expensive tour that promised a tram ride and art to go with the wine and spectacular views. The tram was closed due to heat and we were not told about the possibility tho high heat was anticipated. The art was gone. The wine was OK but the sense of joy in wine was absent. The tour paled in comparison to Clos Pegase down the road.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Another gem for family to enjoy", "Coupled this tour after the castle across the street and it worked out great. Kids were given a treat bag with stuff tailored to their interests which is well designed. Sterling, being a very large producer still makes you feel welcomed and informed upon your arrival and the views and vistas from the top of the gondola on the terrace cant be beat. A little bit stingy on the value side of the equation regarding the amount of wine we tasted, but being with family, the view and grounds made up for the actual tasting.\nShow less"], ["Reviewed July 1, 2017", 3.0, "Fun cable car ride", "I enjoyed taking the cable car from the parking lot up to Sterling Vineyards. We did a self-guided tour and wine stations were set-up along the route. However, only one wine selection was offered at each station. If you're a fan of only one type of wine be prepared for a very limited selection.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Beautiful views!", "We enjoyed the self guided tour and all of the wine tastings. The best part though, and what makes this tour unique is the tram ride! Beautiful views!"], ["Reviewed June 29, 2017", 2.0, "Not as expected", "The cable car to the tasting area was nice. However, after that its a bit mirthless. Couple tasting areas, with very light pours."], ["Reviewed June 29, 2017", 5.0, "Beautiful Views", "This self-guided tour can be a bit short but the views from the winery are worth it. At the end of the tour, there is a beautiful terrace with outstanding views. The cable car ride was fun. A different experience."], ["Reviewed June 29, 2017", 4.0, "Fun Commercial Vineyard Experience", "We spend a couple of days in Wine Country during our lengthy vacation to California. Traveling w/ 3 children, we put much thought into which vineyards to visit. Sterling was a great choice! Kids and adults a like pay an admission fee which includes tasting for the adults and a little bag w/ a drink, activity book, and pencil for the kids. This is such an awesome touch for kids who are \"along for the ride.\"\n\nThe self guided tour begins w/ the gondola/aerial trams, which is super cool! Our kids enjoyed this. Each tasking station is spread out and you do get a peek at different areas of the facility. The tour ends on the patio w/ breath taking views and very comfortable seating.\n\nWe enjoyed the wine and our experience here! It was a perfect family-friendly choice.\nShow less"], ["Reviewed June 28, 2017", 4.0, "Silver Plus Experience", "We enjoyed the short tram ride and the reserve wine tasting with cheese pairing. The other wines were mediocre and the self-guided tour was not interesting. The view was beautiful, but you don't see much during your tour. It is the only place in the valley you can ride above the vineyards though :)\nShow less"], ["Reviewed June 26, 2017", 3.0, "Gondola is the highlight, Scenic Views, Sad Tasting", "We came here for the kids as they have a gondola. That was neat. They also gave the kids a little sack of Gatorade and cheese crackers with activity books and neat pens. That was nice. I think grape juice would have been a better choice for beverages. The view is great. The winery is just okay-kind of plain with nothing too in-depth to see or look at. The patio is gorgeous. We had a 4 wine sample and they selected those wines which included one white, two reds and a another sweet white. I've been once and don't think I would return.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Excellent Winery", "The pairings of the food with the wine were excellent. The 2012 Cav was so delicious and the oak smell of the 2010 Cav had a great aroma. The Gondola ride had a wonderful view. The Platinum package is with the experience."], ["Reviewed June 24, 2017", 3.0, "Overated", "Not bad, but was expecting a little bit more of the experience. Nice staff, good wines, but that's about it."], ["Reviewed June 23, 2017", 2.0, "Pay to Hear a Sales Pitch?!", "My husband and I went to Sterling Vineyards while we were in Napa. We had both been there before, many years ago when you didn't have to pay for wine tastings. I know that things have changed, and all the wineries are now charging for everything, so I didn't have any problem with paying $49 a piece for the tram ride, wine tasting, and self-guided tour. HOWEVER... after the tasting, we endured a 15 minute pitch on joining their wine club. Although it was not forced on us, it made the experience awkward. In addition, the gift shop(s) are now geared more towards selling their wines, than nice souvenirs. The tram ride was nice, the view is spectacular, however, I will never go back.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Friendly people and staff win tram but too short", "Went with my family and my son loved the tram ride even though it was a bit short. If you like wine tasting you can go and try this but overall I felt the tour was too short and quick. The view from the upper deck at the end of the tour was quite nice though.\nShow less"], ["Reviewed June 20, 2017", 2.0, "Save your time and money", "Boy, with all the choices in Napa and Sonoma (and we visited many during our stay) this tasting was by far the least enjoyable to us. The tasting tables were set up in hallways and staffed by kids who didn't know much about wine and didn't really seem to care. And, sorry, but the wines didn't live up to any of the others we tasted. So, not to be a downer but there are MANY other better, and less expensive, options.\nShow less"], ["Reviewed June 19, 2017", 1.0, "Platinum Experience is not worst the money", "Sterling has a nice aerial tram but you can get it with just your general experience fee. Their platinum experience is not worth the money. They don't give you a one hour food as they stated in their brochure. They sensational appetizers are extremely small. We were in their educational tasting less than 15 minutes. Don't waste your money or time in any of their experience except their general experience if you are willing to do self guided tour.\nShow less"], ["Reviewed June 18, 2017", 4.0, "Lovely location and wines", "I actually visited here because of the location and that you need to ride a gondola to get to the top of the winery itself - nice novelty and quite scenic. I had mixed opinions about their wines, mostly good, but wine like coffee etc. is a very subjective topic to talk about, as even award winners don't appeal to all people. Each wine you tasted was in a different section of the winery, so it made for an interesting walk, look around and a breather between each glass. Their was a restaurant onsite however we did not dine here. They had water stations along the way to drink or rinse your glass. The last tasting was on an outdoor terrace and we happen to have a gorgeous day for it. At that point you were able to order some cheese..... disappointingly it looked like the cheese selections you receive on the airplanes, inside a plastic container, still tasted ok - just took away from the elegant surrounds and tastings thus far. Overall I rate this as a winery to visit; professional, friendly and scenic. Our tasting of 4 wines including the gondola ride was $30.\nShow less"], ["Reviewed June 17, 2017", 3.0, "Beautiful scenery", "I'm only giving 3 stars because we got the Silver package and do not feel it was worth it. Very small pours for the 3 extra wines and the \"cheese and charcuterie\" plates were very very tiny. Not worth the extra $17. The views from the winery were gorgeous though and the normal tasting was great but I wouldn't pay the extra for the silver experience again.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Upgrade to Silver, go during the week", "The Silver package includes a tasting of an extra 3-4 wines in a quieter, secluded section of the tour. You do have to go up at a certain time, as they have limited seats and tables. We sat outside on the terrace, and dragged it out as long as we could (Lisa was very helpful and knowledgeable). The meat and cheeses are just TASTES, do not expect to be fed. There are also meat and cheese plates to buy out on the main outlook, but again, not large. The tour was informative with videos and you can watch the folks working. I was not blown away by any of the wines, but then again, i am not a wine guy.\n\nI might go back to Sterling just for the little gondola ride and the view, especially on a weekday, it was nearly empty.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Best tour ever", "The Staff at Sterling Vineyards was very nice and informative especially Charlie. If you really want a treat get a Coupon at the Napa Valley Visitors Center to upgrade to Sterling tour."], ["Reviewed June 12, 2017", 5.0, "Best view in Napa!", "After visiting the Castello di Amorosa winery, our driver Donald Buxton from Beau Wine Tours (he's a must book!) drove us down the street to our next destination - Sterling Vineyards. We chose this winery because of the views to be had. Once we arrived we took a little aerial tram up to the winery. It is due to its location up the mountain that you get such great views. We weren't disappointed! Not only were the views fantastic from the rooftop patio, but we were able to purchase a \"wine-by-the-glass\" after the tasting and sat on the patio just enjoying the breeze and scenery. Dawn, one of the wine baristas on the rooftop was AWESOME! I will definitely come back here next time I am in Napa. The wines here are also really great. Upgrade your package to the silver experience to get some nice cheese pairings at your last wine tasting spot here.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Great tour and wines", "We thoroughly enjoyed this tour. The aerial tramway took you to the top of the hill and provided outstanding views of Napa Valley. The majority of the wines tasted were very good. We spent some 90 minutes at the Vineyards tasting wines and looking over the Napa Valley from the outdoor terrace.\n\nThis is one of the vineyards that you must visit especially for the views.\nShow less"], ["Reviewed June 11, 2017", 4.0, "Wine tasting", "This was the first winery we visited, the sky ride to the main area was a very beautiful ride and the scenerie at the top where you look out over the valley is breathtaking. My wife love the last wine offered on the tour, brought some back.\nShow less"], ["Reviewed June 11, 2017", 4.0, "Lovely winery to visit with children", "We were travelling in Napa with our seven year old and thought that Sterling offered something for him and us. Children are given a back pack with a juice box and some fun activities. We all enjoyed the (very short) gondola ride up the hill. The views were spectacular. The first host we encountered was very welcoming and made my son feel included which was important. In fact all bar one members of staff were very pleasant and informed about the wines. Our one concern was when a member of staff spoke abruptly to my son making him cry. I had asked my son to fill my glass from the water fountain and the staff member stopped my child and demanded to know why he was carrying a glass. I was no more than a few metres from my son and the water and, at seven, he's more than capable of filling this up himself. It was the only sour note from our visit. The wine itself was nice but not nice enough for us to purchase. The tour itself is very informative and you get a real sense of the workings of the winery.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Napa Valley Bucket List - go at least once", "You cannot beat the view of Napa Valley by taking the tram up to the the Winery on the hill. The wines were good. The well laid out tour was informative but some construction happening so looks like it will be even better. Wine tasting stops along the tour was a fun way to do tastings. Only hesitating was the some of tasting staff didn't seem to be experts but more like pourers. If you have one place to go for the best views of Napa Valley this is the place. The view...the view... the view. 5 stars for the balcony with the view.\nShow less"], ["Reviewed June 10, 2017", 3.0, "Nice experience", "The Sterling winery is a really nice place. The main attraction is the gondola lift, and the views from their terrace. The wines are decent but not espectacular."], ["Reviewed June 8, 2017", 5.0, "Gotta do the tram ride", "It's a bit gimmicky but it works for me. After V Sattui, this is the next place I bring out of town guests for their first visit to Napa. I don't remember the tram ride being so expensive but it cuts down the crowds I guess and you get four healthy tastings. Gorgeous views of the valley - I particularly like seeing Castello di Amerosa from the deck. It's a great idea that their tasting stations are split up around their building - like a progressive party!\nShow less"], ["Reviewed June 7, 2017", 5.0, "Stunning Views", "Nice cable car ride, reasonably priced total experience. The views from the top are spectacular and the wine's not bad. A well done tour."], ["Reviewed June 6, 2017", 3.0, "Cable car ride", "Well, there was a very long line for the cable car ride. $30 each for a 3.5 minute ride to the top and 4.15 min ride back. Samples of new wine's they made. 2 reds and one dry white. There should have been something sweet and not dry in the white category too. It was hot. And I live in Phoenix. It was humid and the line was LONG. they should have opened up another ticket window.\nthey have a blackboard there that you can write on, 'before I die I want too' and fill it in. Mine? 'get over my fear of heights'.\nThis is all we did, didn't look around, did I mention it was hot and humid? ;-) I wouldn't do it again and if someone had warned me it was just this, I wouldn't do it in the first place. but it was ok.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Amazing", "Staff were very nice, the place is great, the wine is also awesome. The views are worth every penny. The tour is above expectations. I am Not a fan of wines, but came put as one. A must see in Napa Valley."], ["Reviewed June 2, 2017", 5.0, "Beautiful views", "We visited Sterling when it opened and enjoyed the whole experience... the gondola ride up, the tastings and the wonderful views of Napa! Parts of the winery were under construction, but the tastings were at different locations. Food is available on the patio but it is not necessary to make a purchase. For the price, the view and tastings are well worth the visit!\nShow less"], ["Reviewed June 2, 2017", 5.0, "Great valley views", "Yes, it's touristy. There are long lines, the tour is self-guided and the wine is so-so on the main deck. But the Gondola valley views are beautiful and the members-only area is shaded. You can order snack plates too, I wish all wineries did that."], ["Reviewed May 31, 2017", 5.0, "Fantastic experience", "From the Napa Valley Highway we spotted a large building on the top of a hill that we thought was a private estate. We were intrigued. As we turned to head over to the Silverado Trail we saw the entrance to Sterling Vineyards and decided to drive in. There we saw the arial tram and low and behold it took us to the estate on the hill! The views are fantastic!!! I really enjoyed how the whole tour is set up. You pay for your wine tasting and get your tram ticket on the ground. When you get to the top you have your first tasting as you enter the building and are given your souvenir glass to take with you to the next tasting. As you make your way through the building you have more tastings. You get to view the whole wine making process and end up on the top terrace for scenic viewing. The place was going through an enhancement that was almost complete and will add a lot of interesting info about wine making. We were so glad we happened upon this vineyard.\nShow less"], ["Reviewed May 30, 2017", 4.0, "A nice place to hang around", "You have a very good bird's eye view from the winery. The gondola makes the tour even more interesting. We went on the Memorial Day weekend, and it was fully packed with tourists, which makes the general wine tasting tour a bit crowded. However it's still worthy to give a tour and enjoy the ambience there.\nShow less"], ["Reviewed May 30, 2017", 3.0, "Great Views! Wine SoSo", "Ok so go here just for the view from the team and the terrace. Do not take the Silver Experience! Pay $30 pp to take tram, then do the self guided tour and finish on the terrace. Order your own cheese/charcuterie box for $20. It's a lot of food for two as a snack and you get more than if you did the silver experience. Our friends did silver and they were stuck on a guided tour with less food. The wine here is not great, but it's worth the entry for the view of the region from the terrace.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Mountain Winery", "Napa is wine country heaven. Sterling Vineyards is the beauty on the mountain. The tram ride to the tasting is worth the visit alone. Wines will not disappoint."], ["Reviewed May 30, 2017", 5.0, "Highlight of our trip to Napa!", "What a unique activity to do while in Napa. We stayed in Calistoga area and wanted to find some fun things to do. We had friends who visited Sterling and told us about it. The gondola ride was really memorable. The staff was very friendly and informative along the \"sip and stroll\" path!\nShow less"], ["Reviewed May 27, 2017", 5.0, "Loved the gondola ride and spectacular views", "Amazing ride in the gondola with spectacular views. When arriving to the top they great you with a tasting. Then we sat on a porch and enjoyed the views of the valley. We also did the self guided tour which was nice as they had wine tastings throughout then it leads to a huge porch where you can enjoy more of the views!\nShow less"], ["Reviewed May 26, 2017", 1.0, "Very Impersonal, rude servers, Inder construction.", "The best part of the tour is the tram ride. No interaction, under construction, the servers were very impersonal. When we asked for another pour, the server said we could buy bottles. Overpriced and overrated. It felt like a bad ride at Disneyland."], ["Reviewed May 26, 2017", 3.0, "The ride up was fun", "I don't think we did this winery right. We did the self guided tour, and it seemed like we just walked through the grounds, got our 5 wines and left. We were in and out in an hour. I would suggest a guided tour if you're looking for more of an experience. I chose this winery for the ride up to the building, but looking back, I would have skipped it. Again, it might be different as a tour.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Game Changer-Do and Don't", "First, it was my first time in Napa and second in a vineyard/winery. I visited the Mondavi Vineyard right before and paid 30 bucks for a flight of 4.\n\nI noticed that most that didn't enjoy Sterling complain about the $30 Silver package. Here is the Do and Don't\n\nDo pick the \"Platinum\" package.\nDon't pick any other package.\n\nThe Platinum package includes 3 delicious pairings with some of their best wines, plus the regular tour wines. Had a total of 9 different wines on this tour. Don't cheat yourself. Go big or go home.\nShow less"], ["Reviewed May 24, 2017", 4.0, "worth the trip", "This is worth the trip up north. great scenery and better than average wine. their wines and sweet wine are the best."], ["Reviewed May 24, 2017", 5.0, "Wine for parents, entertaining enough for teens", "Sterling Vineyards is maybe the best winery for families with older kids. I took my 2 teens. $15 per kid includes a ski lift ride, a bag of goodies including snack, Gatorade, word search book etc. It's a beautiful view, the gondola ride was fun, and I got to taste wine while challenging my 15 year old to a word search. We didn't take a formal tour which made my kids especially happy. Win/win.\nShow less"], ["Reviewed May 24, 2017", 4.0, "A little expensive but a nice experience", "Not having traveled to the Napa wineries for a number of years, we were surprised at how wine tasting has become a big money making enterprise. Not much free wine tasting at the big wineries. However, after a little compromising we decided to pay the $49 each for a tram ride, wine tasting (7), some nice cheeses, beautiful scenery, very hospitable employees, and a very nice souvenir high quality (Riedel) wine glass. After all, a pleasant couple of hours in the Napa valley.\nShow less"], ["Reviewed May 24, 2017", 4.0, "Airtram!", "You can make reservations for your tasting on line day of. We purchase the Silver Experience ($49/pp). The whole tour was so fun. You take an aerial tram up to their property. We were directed upstairs to a gorgeous room. We were greeted by Charlie who served us our tastings. We had 3 wines paired with charcuterie plate. Charlie was great in explaining more in depth about tannins. She also let us try their 2011 Yountville Cab, which we purchased of course. After our pairing, we went along the rest of the self guided tour of the property that had 3 more tastings along the way. It ends at a gorgeous patio with fabulous views.\nShow less"], ["Reviewed May 22, 2017", 4.0, "Nice vineyard!", "The tram was unique for a vineyard and wine tasting. It took you up to the top of the hill where the Tasting areas were. Would have preferred to choose what wines I wanted to taste."], ["Reviewed May 20, 2017", 4.0, "Terrific view", "Don't miss if you're in the area. Gondola ride, tour and tasting are worth the fee. Check web for discounts."], ["Reviewed May 20, 2017", 3.0, "Too much of a tourist type location.", "Although the grounds are beautiful and the tram ride is fun. The location is quite \"touristy\" which is not my preference especially with the many other wineries in the area. The wines are not bad, but not great. Fun to visit just to say you took the tram ride.\nShow less"], ["Reviewed May 19, 2017", 4.0, "Best View of Napa, Unique Chair Lift", "This was the first winery I went to of 10 and it had the best view. It was neat to see Castello di Amorosa and then go there to see Sterling. The Malvasia Bianca taste was my favorite and it's only sold at the estate. I didn't buy it and have regrets because it was my favorite out of all the wines I tasted over the next few days (good if you like sweet). It's being remodeled so hopefully once they're done they can immerse you more into the process. The roses at the bottom were very lovely.\nShow less"], ["Reviewed May 16, 2017", 4.0, "nice experience", "Since all the wineries charge for tasting we decided to go to Sterling for the views and the tram ride. We found a coupon in the local free magazines for the upgraded \"experience\" and this was fun. we had an extra 3 wine tastings in a special tasting room then the 4 we had during the self guided tour\nnice views on the balcony.\nShow less"], ["Reviewed May 15, 2017", 4.0, "Great View", "An average experience. The staff were great, the wine very pleasant but the self tour and speed at which they serve you the tastings meant it was for the quick turn around. They've had a face lift in recent years so it's very pleasing on the eye and the cable car and terraces offer amazing views of the valley.\nShow less"], ["Reviewed May 9, 2017", 5.0, "What a view...", "Take the cable car up for the view. The tour is average but the views dono disappoint. Sip you wine from the large balcony and take in the scenery . Snacks and extra wine can be purchased in case you want to linger"], ["Reviewed May 8, 2017", 3.0, "Tram ride was the highlight", "The only way to access the top of this place is by purchasing a tram ticket. You cannot walk or drive up. Unless they are actually in harvest season there is not much to see. Great view at the top but it was crowded."], ["Reviewed May 4, 2017", 5.0, "Views", "We really enjoyed the views from the gondola and from the patio. What a bonus for a tasting (and same cost as the other wineries we visited)\nThe staff was very friendly and informative\nWe enjoyed the wine.\nThis was the only Chardonnay that my husband has enjoyed\nWe had to purchase some wine here to take along (our state still does not permit shipments.....)\nShow less"], ["Reviewed May 3, 2017", 4.0, "This winery is definitely one to visit for the experience", "When you arrive, I recommend getting the Silver Experience. All entrance packages include the tram ride up (great views of Calistoga, and the nearby areas), once you arrive at the top, all packages include the tasting and winery tour. The tour is different in that you taste a different wine in spread out areas of the winery. One the tour is done, if you get the Silver Package they take you to the other side of the winery where they allow you to try the more unique wines they have (the ones you cannot find in Total Wine or local grocery stores). The views are truly spectacular! I recommend going early as this winery offers great landscape pictures, but I can image as more people arrive it will be harder to capture. Also this winery is located in Calistoga, so perhaps doing this first and working your way down to Yountville/Rutherford is probably best. Entrance was not expensive, and the wines for purchase are fairly inexpensive. The tasting includes some crackers, but food is available for purchase.\nShow less"], ["Reviewed April 30, 2017", 2.0, "Don't go during construction!", "Take my advice and avoid this place if it is still under construction. You basically pay $30 for some ok wine and to walk around looking down on building work. Gondola ride was nice, but otherwise plenty of other wineries nearby that would give you a much more pleasant experience at this time!\nShow less"], ["Reviewed April 29, 2017", 5.0, "Best experience in the area", "Went to 3 other wineries in the area before this one, this one is the best in my opinion. The driveway lined with trees was a nice start, the $30 for the tram ride and tastings is pricy but it seems to be the going rate for the area. The view at the end of the self tour was worth it especially if you purchase a $10 glass of your favorite wine to drink while enjoying the view; the pour is generous. You can also purchase a cheese chacuturie platter for $20.\nShow less"], ["Reviewed April 25, 2017", 4.0, "Vegas style tasting", "It's not the first time we went to this winery .Years ago the tram ride was free. You only paid for wine tasting upstairs if you wanted . If not , you just had a view for free. The tasting itself was much cheaper . These days it's unbelievable high -$30 per person to get upstairs. And what you get is one glass for all 4 different types of wine tasting. They give you just a little bit of wine enough for one seep for$30 !!!!!!! For 4 of us we paid -$120 !!! Haven't even tasted enough of the wine to have a proper opinion. You can buy a plenty of super wine for $120!!!! Unbelievable !!!!!!!!!!!!!\nShow less"], ["Reviewed April 24, 2017", 4.0, "Picturesque Driveway and Setting.", "A miniature Disneyland setting with a tram to and from the top of the hill where we tasted. Disneyland crowds, too. We did the self-tour which is a mostly an indoor walk around with your takeaway glass. You are poured sips of wine along the way by super friendly and helpful staff members. The property is clean and seems to being freshening up. We enjoyed the informative wall boards and especially the high-def video screens which are all educational. The view from the outdoor patio area at the end of the self-tour was awesome. Crisp, clear day with forever views. This is a must see when in Calistoga and northern Napa Valley.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Grape Stomp", "We were fortunate enough to be here for the stomping experience. Such fun! We then took the premium tour which allowed us to have a sit down tasting at the tour's end. Definitely recommended for the best experience!"], ["Reviewed April 20, 2017", 3.0, "Under construction The aerial tram was fun. Beautiful look out patio.", "Tram fun excellent views but The winerey itself lack any appeal in 4/2017 but it appeared to be undergoing remodeling of the viewing rooms. The rooftop patio was lovely. Lots of kids here..."], ["Reviewed April 19, 2017", 5.0, "The perfect surprise visit to the top for tasting, tour and the view!", "Our kids had this venue on our weekend wine tasting trip and I had forgotten their visit a year ago when they toured Sterling. So, they treated us to this tasting and I was very impressed. So fun, such a different way to start a tasting and what a great way to see the valley.\n\nI've been a fan of Sterling wines for years but this trip affords an opportunity to taste wines we don't get to routinely try. They give you a glass, you start off on your route and about the time your glass is empty you are ready to come upon yet another part of the wine process and another wine tasting.\n\nPerfectly timed, all well informed guides and you get to look around their operation. Lots of information about how they do things and you end up on the patio rooftop.\n\nThe view from the top is gorgeous. The wine they serve at this last stop is like a sweet ending. Them you linger if you want or go in the gift shop and buy wine and wine compliments.\n\nI think it is a perfect tour and one you will remember. Unique. Will go again next time as it was so fun.\nShow less"], ["Reviewed April 18, 2017", 4.0, "Take the tran", "Visited in April 2017. They have a tram ride up to the main building that is quite a nice ride and overlooks the rest of the winery. Once up on the hill, visitors can make their way through the different rooms and areas. The lower tier entrance fee will get you on the tram and allow you to sample three types of wines. I think you could pay more to do more sampling. We were fine with the three wine samples and mostly spent the time taking pictures as there is a balcony area overlooking a large stretch of Napa.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Nice place for First Time Wine Tasters", "My SoCal friends wanted to go here for their first ever wine tasting experience. We went last Saturday; and also had a free upgrade from General Admission ($30) to Silver Experience, thanks to a coupon from a Wine Magazine. Unfortunately, the aerial tram was down that day, and we were shuttled to the tasting rooms instead. It was certainly a bummer, because the aerial tram was what stood out from all the other wineries. The Silver Experience was awesome, so as the tour and views. I would have given them 5 stars, but was later disappointed when I found out that 2 of my friends, who got there late, got a $10 discount from their admission and only paid $20 because the aerial tram was down. I was shocked when my friends told me, the $10 discount wasn't even offered to us. I could have saved $60 (I paid $180 for all 6 of us at $30) and would have been able to buy a couple of bottles of Malsavia Bianca... :(\nShow less"], ["Reviewed April 15, 2017", 5.0, "20th Anniversary", "A little disappointed that the gondola tram was broken when we arrived, but the overall experience made up for it. Best views in Napa Valley surrounded by well organized tour and great service. Also, seemed to get a lot more wine for the money on this tour!\nShow less"], ["Reviewed April 15, 2017", 3.0, "Sterling Vineyards - avoid for a couple of months", "They are renovating the entire facility so very little to see. The trim is also broken today for an unknown period of time. Don't waste the money and call ahead to make sure the renovations are finished before you go."], ["Reviewed April 11, 2017", 4.0, "Wonderful Wine", "The silver tour was a great experience. The cheeses that were served with the wine really made all the difference. The gondola up to the winery was such a different touch! After the silver experience we got to get more pours for the regular tasting, and they were great. Wish the tour wasn't self guided, but excellent wines and ride to the top!!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Combo of Wine and Vista", "We went to Sterling because we are in wine country and some of our party aren't wine geeks and we needed to spot a little tourism too. Sterling fit both. We took the cable car up, and with the Silver plan upgrade, went to a special tasting room where you get a three extra glasses of extraordinary wine. The Chardonnay was AMAZING. The silver tasting room is quiet, calm and a nice respite from - in our case - a rainy day. The premium wines come with a bit of cheese and fruit. Enough to balance your palate. The remainder of the trip includes four tastes of wine on a tour of the winery. Along the way there are enough stops and at the end a patio with beautiful vistas over the valley. To top it off, you can keep the glass. As I said, fits for both the casual tourist and the wine enthusiast. Now for the best part, there are places to get upgrades for the Silver tour, so we paid the regular price and got a nice upgrade. This one is worth taking time out for.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Bring friends to have a really good time", "my siblings and I had a very nice experience, we did the silver experience which added a little cost and a short touch of elegance to the event. I noticed one big factor around the winery, couples were having a nice romantic type get away, but the people having the best time were the groups, the wedding group, the bridesmaids get away, and other family groupings. My sisters and I had a very nice time tasting and checking out the views, especially of the castle across the valley I felt transported to some English countryside estate. Wines were good some better than others, a bit pricey the special was 3 bottles for $70.00. They had wines in all price ranges. Wish they would have sold the cheeses they shared with us some were amazing. The gondola ride was the highlight.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Gorgeous View", "We wanted to do this winery because of the gondola ride to the top & it was well worth it to see the countryside. You could look across from the top of the winery & see the Castle on the other side. Absolutely beautiful!!! We did the silver tasting which is wine tasting accompanied with a cheese plate. I think they could add a little more cheese to the plate but all in all it was nice! It's very different from any other tasting we did because you are left to wander until you come to the next station to get a pour. I liked that you were able to look around as you had your wine but they need to give a little more direction; however, would highly recommend putting this winery on your tour list.\nShow less"], ["Reviewed April 9, 2017", 5.0, "Quick stop in wine country", "Driving from San Fran to Portland and decided to spend a couple of days in wine country to enjoy the sun. The wine tour at Sterling was great. Had our 14 year old with us and the tram ride to the top of the hill, views and glorious sunshine at the top even charmed him. Wine was fantastic, staff friendly, and even though we could have stayed as long as we wanted, it was possible to do the tour in a short amount of time and continue our road trip. Truly an unforgettable stop.\nShow less"], ["Reviewed April 7, 2017", 3.0, "Busy", "Great views from the winery. The 30$ admission is steep but a great opportunity for the view. Wines are ok but you can buy them at Costco or Safeway for less$"], ["Reviewed April 7, 2017", 3.0, "Scenic place but the wine isn't anything much to rave about", "We decided to go here due to it being a 3 min drive from our hotel.\nThe estate itself is beautiful from the drive into the estate to the grounds.\nYou'd have to purchase your ticket at the entrance then take a cable car uphill to the tasting salon and main grounds.\n\nWe got the Silver experience for $49 per person. It comes with 3 wines and a so called pairing of cheese and \"charcuterie\". Basically it was a small platter of cheese and 1 piece of duck breast.\nNote that the portions are tasting portions.\n\nThen you'd proceed to down the stairs and you'd be given a glass you would have to hold on to, for tasting 4 more wines at different stations.\n\nTheir wine really isn't fantastic at all, with the exception of the last semi sweet wine, and I found it strange a vineyard would allow people to use the same glass to taste different types of wine. Proper places won't let you mix glasses for white and red.\nThe merlot wasn't great at all, a lot of people were dumping it into the bucket.\nAnd it was disappointing that you don't really get a tour of the winery as that portion was closed for visitors.\n\nBasically you're paying for the views and the experience. You can get much better wine from a wine shop or a supermarket.\nAnd they should have made it clear when you paid upfront that it was closed.\n\nWe then proceeded to Mumm where we paid way less for way more alcohol.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Use the coupon in Wine this week", "Nice scenic tram takes you to the top of the hill for a beautiful outlook. We used the coupon to get the Silver experience which gives you cheese tasting and their top tier wines"], ["Reviewed April 5, 2017", 5.0, "Winery Tram Ride", "This is the highlight of the tour, the Tram ride elevated above the grounds before the wine tasting. If you're in Napa for the first time; this is a \"must do\" Their grounds are hillside whereas many others are flat in the valley. Scenic rooftop views too!\nShow less"], ["Reviewed April 5, 2017", 5.0, "Much better than you'd expect", "Having tasted wines all over the world, one is rightly skeptical of visiting this vineyard past the edge of the Napa Valley boundary. But the tram to the top offers the best views in all of Napa Valley, and the limited edition wines tasted at the top show off the diversity of Sterling wines. Highly recommended, even for the dubious.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Excellent Tour", "This is a must see and do in Napa. Nice quick ride up the mountain(large hill) and great views from the top"], ["Reviewed April 4, 2017", 3.0, "Good vineyard for beginners", "My wife and I enjoyed our visit to Sterling. It was less crowded than Castello di Amorosa (the castle winery) across the street. Their winch service up the hill to their processing plant is a nice ride. They serve 4 wine tastings for the base price and their self guided tour is OK. The views of Napa valley from top of the hill are spectacular and is worth the price. They let you keep the wine glass as a souvenir, which is nice.\n\nPersonally, I would recommend they show more of their operations with a guided tour like some of the other wineries in the region do.\nShow less"], ["Reviewed April 3, 2017", 4.0, "Different than other vineyards", "Quite a diverse selection of wines, you'll always find at least one that would be to your liking. The cable car does not add anything to the value; the ride is in fact relatively short."], ["Reviewed April 3, 2017", 4.0, "Beautiful setting...", "Great gondola ride up the mountain to the winery. Great scenery and view of the valley. More than the typical wine-tasting experience."], ["Reviewed April 3, 2017", 3.0, "Magnificent view -wine not so much", "The View is magnificent, the wine not so much. There are tours of the facility during harvest time. As you walk up to the observation patio , you walk through the facility as well as the production."], ["Reviewed March 31, 2017", 5.0, "Amazing setting", "We toured this winery and upgraded to the silver plus which was $49 a person. The tasting was in the club level with amazing surroundings and came with 3 tastes of cheese to go with the premium wines. The wines were excellent and the information given by our hostess was great. There is also a tram to take you up the mountain to the tasting area. You then get to taste the other 4 standard wines and relax and take in the view from a roof top patio with breath taking views. We were here 3 hours. Mostly to enjoy the perfect setting.\nShow less"], ["Reviewed March 24, 2017", 3.0, "Nice Views", "On the nice day, the view from this vineyard is amazing. Wine tasting is average, but the gondola ride to the top is worth it."], ["Reviewed March 18, 2017", 5.0, "beautiful grounds", "we loved this winery, hate to admit it but we did. We didn't expect that we would like the wine because it is so mass produced, but we did. We didn't expect to be impressed by the tram to the top of the mountain, but we were. It helped it was a gorgeously sunny day and a balmy 70 degrees. the grounds are gorgeous. my only regret is we didn't spend more time on the grounds, not even sure if you're allowed to do that.\nShow less"], ["Reviewed March 16, 2017", 5.0, "An Experience on Several Levels", "We enjoyed the Silver Experience and felt the private wine tasting allowed us time to ask questions and learn more. Since this was our first trip to the valley, we were curious and with a visit during the week, we felt that it wasn't crowded and we had time to ask and learn more about our taste in wine.\n\nThe tram ride adds to the feeling of secret access. The view from the Upper Tasting room is picture worthy to send home to your friends.\n\nIf it's your first time to the area, I would recommend this winery.\nShow less"], ["Reviewed March 16, 2017", 4.0, "Good wine and great views", "We visited last week, and had a great time. Our daughter was with us, and she is starting to like wine. The nice thing about the tasting was that it exposed her to several different wines. We loved the view from the patio on a sunny day. The gondola ride gave it a different dimension. This was well worth the drive. Would recommend it for a nice day!.\nShow less"], ["Reviewed March 15, 2017", 4.0, "Very nice wine & cheese tasting", "Bought the \"Silver Experience\" which includes the tram to the upper level and a wine cheese pairing (I recommend booking tickets ahead of time as we did). View of the valley from the tram is breathtaking on a clear day. Sterling was under construction so the winemaking videos were not running and some areas were off-limits, still visitors could go around and see the \"backroom\" of winemaking.\n\nThe wine and cheese pairing was outstanding. We had three scheduled wines with great cheeses and our hostess gave us samples of two others. It was said that the finer wines offered at the wineries are only available at this site. I spent time doing a web search and found this to be generally correct. Bottom line: if there is a wine you enjoy here, buy it because you are not likely to find it elsewhere.\nShow less"], ["Reviewed March 14, 2017", 3.0, "Interesting Self Guided Tour", "Great short gondola ride from the lower parking lot to the winery. Very accommodating and pleasant staff except for the young lady at the main entrance who wouldn't check the tour selection and pricing board. The board stated $29.00 for general admission that included tram, tour and tasting. Even the website states this option with no days of the week excluded. The attendant, moderately forcefully stated that wasn't available and that we had to pay $39.00. Be solid in your understanding of what is available. The couple behind us also was charged the same as us and didn't like it either. Misrepresented. Quite liked the self guided tour but unfortunately the winery is under renovation so limited access really. Of the 5 wines tasted we only liked one....did not buy any.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Nice Napa Outing", "This is a nice place to get an easy, relaxed wine tasting excursion. The gondola is very quick but you get a view of the vineyards. The staff is friendly as you try about 5 different wines with descriptions. There is a patio at the top where you can enjoy the sunshine and views. We purchased several bottles to be delivered home. It took a while for them to arrive, but we were glad for the reminder of the lovely afternoon we had.\nShow less"], ["Reviewed March 13, 2017", 3.0, "Go for the views", "Spectacular views of Calistoga/Napa with a fun gondola ride to the top. I recommend going to see the views. Don't expect great wines but my husband and I still had a fun experience."], ["Reviewed March 12, 2017", 5.0, "Excellent winery and amazing views!!", "My husband and I visited Sterling Vineyards yesterday. We loved the gondola ride up the mountain to the winery. Very unique experience. We did the silver plus experience which included extra wine tastings with cheese. Highly recommend this experience and our tastings were outside which had great views! Wines were our favorites so far on our trip! It's a self guided tour with amazing views of the valley! This is a must do Winery!! Highly recommend!\nShow less"], ["Reviewed March 11, 2017", 5.0, "Amazing view ~ Great wine", "Tram rides are always fun even thought his one is short. Would have liked to walk back but it's not an option. Excellent wine tasting menu. Can spend as much time is the various areas to sip and look at the scenery. One catch. Two employees said a wine I was interested in purchasing was $18 upon check out it was $24. Found out they were giving me the wine club price.\nShow less"], ["Reviewed March 9, 2017", 5.0, "awesome place!", "my second time here! gondola ride is always fun and a little scary for some people cs you hang up in the air pretty high at some point, you can't beat the view though!\ninside winery is very nice and clean and you get to see the process. we did self guided tour! outside the view is also amazing, building sits right in the middle of the field, so you get the whole view of the valley from up high too - its incredible! must visit place!\nShow less"], ["Reviewed March 9, 2017", 1.0, "Big Disappointment", "We recently had the opportunity to spend a week visiting a number of wineries in Napa and Sonoma. The visit was wonderful even though the weather was a bit cool for this time of year. We love the landscape of wine country, the stories about the wineries and of course the wine. We used it as an opportunity to visit wineries to taste wines we might not have tried before. When we saw an ad for Sterling in a weekly promotional magazine we thought it might be a wonderful stop as it was at the top of a hill and they were offering a cheese plate with 2 tastings.\n\nWell what a mistake, both a waste in time and money considering the many other wineries where the experience and the wine was better.\n\nPart of their fee includes the capability to tour the winery. Only problem there was nothing to see during the self guided winery tour as it is under going a renovation. Their terrace that looks south into the Napa valley was also closed - what a disappointment as this is the prime viewing area. Because it is during the week they force you to buy their silver tasting which I guess provides a premium experience - only problem is that they crowded everyone into a small room that resulted in a sub-par experience. The tasting room was full when we got there we had to wait in another room for a while. When we finally got in, the experience was underwhelming. Lots of noise, no views servers who were so busy they really didn't have time to talk and not that knowledgeable of their wines. There was no choice of a red or mix flight - something you fine at most better wineries. When we commented that we didn't particularly like some of their wines the response was sorry but that is what we are pouring today. (Most servers at other wineries will try to help fine something that you might like.) Oh about the cheese plate, as we arrived at 12:30, the server pointed out that in the fine print it states you must be seated by 12:00 to get that. Sure enough if when we read the fine print at the bottom of the page of the ad - that is what it says.\n\nBottom line they could have done some things to make it better for visitors given they were under going construction, but didn't really try nor open to suggestions.\n\nWith all of the other great wineries in the valley do not waste your time. There are many others with equally great views, better wines and a greater sense of hospitality that you come to Napa for.\nShow less"], ["Reviewed March 7, 2017", 3.0, "Beautiful property, but deceiving experience", "We had high hopes for Sterling Vineyards and our visit. Having heard about the aerial tram trip up to the winery with incredible views peaked our interest. We went on a day with poor weather and low visibility, and accept that's just nature's luck of the draw. The disappointment and rating for this review was that the tour was under construction - two of the three large areas for tour and winery facility viewing were completely bare, simply stating they are under construction/renovation. Had we been told this, at least we could have been prepared and made an informed choice, but likely we would have chosen another time to pay $78 to see empty rooms and taste a few types of wine. We enjoyed the sample wines through the tour better than those we paid extra for on the \"reserve\" experience. Given the ample choices in the Napa Valley area, this trip felt like a deceiving spend for a relatively sub-par experience.\nShow less"], ["Reviewed March 3, 2017", 4.0, "Long lines", "While there were long lines, they moved fast. Loved the gondola ride. Beautiful views. You get a tasting glass. Tour is self-guided. Expensive for what you get."], ["Reviewed March 3, 2017", 4.0, "Fun Gondola ride, beautiful views, average wine", "I rate this very good only because the ride and the scenic portions of the tour. I am not a fan of the actual wines on the tour. Your pallet may be different so try it out because the rest of the experience is great!!"], ["Reviewed February 28, 2017", 4.0, "Beautiful views", "The views from the tram and winery were some of the best our whole trip. It's gorgeous at the top. Everyone was extremely nice and friendly. Willing to help at any moments notice. Would definitely recommend to other couples. We were personally not a huge fan of the wine but our tasting waiter was amazing and super enthusiastic which made for a much better experience.\nShow less"], ["Reviewed February 28, 2017", 5.0, "Great Overall Experience", "Went on a rainy, overcast day to do the premium self-guided tour. Friendly staff, beautiful views of the surrounding landscape and most importantly, great wine!"], ["Reviewed February 26, 2017", 5.0, "Fun day, good wine.", "You start right off with the gondola ride up to the winery...smashing views. Self walking tour/tasting was nice and the kids each received a lunch-type paper box, that looks like a gondola, full of activities and surprises!"]]}}