{"Sundial Bridge": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Sundial Bridge", "url": "/Attraction_Review-g32952-d286092-Reviews-Sundial_Bridge-Redding_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/f6/91/a2/bridge-on-a-rainy-day.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1225"}, "address": {"@type": "PostalAddress", "streetAddress": "Turtle Bay Exploration Park", "addressLocality": "Redding", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "You Don't Want to Miss This", "Another great place to visit. It is a nice stroll around and across this area. Highly recommended and great photo op!!"], ["Reviewed 1 week ago", 4.0, "Sundial bridge", "Pretty cool bridge 👌 but that’s the only thing cool their lol don’t go to the garden it’s lame very dry not much to see."], ["Reviewed 2 weeks ago", 5.0, "A definite stop on the I-5, great flower garden to boot", "I think we have been to Sundial more than 50 times. It never gets old and the floral garden is very relaxing.No matter if you are in town or passing through it is worth the stop. VERY soon there is a Great hotel opening there as well. The combination will make for a wonderful trip. Get a coffee at the gift shop, walk the bridge ( take selfie's under the bridge) and gardens and even visit the Turtle Bay.If you are Lucky you can see the fish jumping in the steam.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Neat park", "Very nice park with lots of short trails & education stations. The green grass, plants & trees were amazing. So nice to see in the middle of winter. So much different than back home, in SW KS\n\nThe walk bridge crosses the Sacramento River. It’s a glass & steel bridge, but unable to see through the glass, as I’d hoped. Was nice to stand on the bridge, watching fishermen & Wildlife. A good variety of ducks & geese on the river\n\nThere’s a small gift shop with all the usual items. A coffee shop is also in the gift shop\n\nWe planned to visit the museum, which stated they had an aquarium & aviary. The admission is too pricey for us\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Very interesting bridge", "This is a pedestrian bridge that crosses the Sacramento River at Redding, CA. It is a glass topped bridge with a huge pillar at one end that acts as a sun dial. Very unusual and quite nice. Lots of joggers and walkers. Very scenic view from the bridge.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Stroll in the Sunshine", "The Sundial bridge is an amazing piece of architecture, allowing walkers to enjoy the beauty of the Sacramento River in a way no other structure would. Highly recommend visiting the bridge, and the arboretum grounds. Great for families."], ["Reviewed 3 weeks ago", 5.0, "Cool place to walk around", "We enjoyed a walk across this modern bridge and into the adjacent gardens. Dog friendly and spacious. Plenty of quiet spots to enjoy the scenery or take in a reflective moment."], ["Reviewed 3 weeks ago", 5.0, "Must-see when you visit Redding!", "We live in the area and never tire of bringing our guests to this landmark. The bridge is amazing and beautiful. There are plenty of walking trails and an arboretum to explore. The nearby Turtle Bay museum is always interesting as well. This is a treasure for our town!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Very fun walk. The Park is Clean, well mantained. A way to spend a fun for everyone walk.", "I enjoyed the walk. The bridge and the park are very clean and well maintained. There are bathrooms, a restraint , store and a small fun museum. Very good entertainment for the entire Family. Just one of those very good places to see.........."], ["Reviewed 4 weeks ago", 3.0, "It's a nice bridge", "There isn't much to see, just a bridge that is well designed and it brings in a source of tourism for the Redding area. It's also the base of the trails and you can walk everywhere from there - nice hikes and it's very family and dog friendly. It gives the families something to do.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful at night!!", "We went for a walk on this amazing bridge at night. We had fun exploring how the bridge was held up, we counted the cables and looked underneath the bridge to see how they were tied in. It was quiet and the river sounds underneath were calming. It's a romantic spot!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful bridge", "This glass floored bridge is so awesome ! I have walked this amazing trail. The first time I walked across this bridge I was all freaked out because it was glass. The sundial bridge is the jewel of Redding !"], ["Reviewed January 21, 2018", 5.0, "Unique walking bridge in beautiful area", "The sundial bridge was designed by an internationally famous architect. A unique and beautiful bridge accommodating walkers and cyclists. Whole area is very scenic. The Turtle Bay museum is nearby. New Sheraton high-quality hotel in the same park complex just opened, becoming very popular already."], ["Reviewed January 20, 2018", 5.0, "Fun stop", "Love the design. Great place to break up a trip on I5 and stretch your legs. Tables to bring a lunch."], ["Reviewed January 19, 2018", 5.0, "Really Unusual Bridge", "What a neat find! Definitely worth seeing! We heard it’s beautiful at night as well. The Museum store next door had great souvenirs and the Museum had a really great exhibit about the bridge and the dam construction. The bridge is free to visit, the museum has a cost, but it is worth it!\nShow less"], ["Reviewed January 16, 2018", 5.0, "First time", "The bridge was amazing walking over the river and the sundial is HUGE!!!! It was cool to look at the different things around-"], ["Reviewed January 15, 2018", 5.0, "Beautiful peaceful place to enjoy nature", "Stopped here to stretch our legs and saw many types of waterfowl, trout fishermen, the captivating unusual Sundial Bridge, and the nearby gift shop (overpriced typical souvenirs). Skip the shop. Outside public restrooms were locked. Enjoy walking across the bridge and along the river."], ["Reviewed January 15, 2018", 5.0, "Beautiful Park", "The addition of the Sundial Bridge was part off a huge image makeover for Redding. The bridge is the central attraction for the largest city in the north central valley. Very modern and lit at night, like the city's crown jewel.\nIt's a pleasant walk on the pedestrian bridge with views up and down the Sacramento River. Trails line both sides of the river giving visitors access to the beautiful nature right in town. I have met people from all over the world on this bridge that might otherwise never have stopped in Redding.\n\nKudos to the city planners who have done an excellent job showcasing the attraction of redding.\nShow less"], ["Reviewed January 11, 2018", 4.0, "Glass, foot bridge with a view", "The glass bottom of the bridge is frosted so no worries about those under the bridge looking up & gaining more than they (or you) bargained for. The bridge spans the width of the Sacramento River, the largest river in California. The bridge is a very easy, flat walk suitable for the very young, the elderly, children, & people in both wheelchairs & strollers. On one side of the bridge is Turtle Bay Museum, a fun place for young & old alike. there are interactive live animal shows periodically (check the website for show times) & during certain times of the year a butterfly enclosure & a bird enclosure. Both are fun for people to look close up at winged creatures. Be aware that they may land on you so those who cannot remain calm should opt for other attractions within the museum such as the small aquarium where people can view local fish who live in the river. There are sturgeon, trout, bass, salmon & more for year around viewing. Also inside the museum are changing attractions. Some focus on local Native Americans whereas other focus on animals & feature hands on experiences such as a beaver pelt. The bridge itself is a wonder & was a challenge to situate initially. It had to have a little add-on before it was situated in its current location as it was a few inches short. Across the bridge is river access which is great for summer time as people can dip their feet into the Sacramento River. Right across the bridge & to the left takes people to the botanical gardens which are always being added to. The gardens contain a water feature as well as some sculptures finished by local artists. There is a small coffee/snack shop outside the museum as well as a small seating area. The snack shop offers coffee, juice, water, tea, & some snacks as well as sandwiches which are of generous portions. One is a good size to split between two people.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Salmon Spying at It’s Best!", "This beautiful suspension bridge not only gives you a great place to spy on the monster fish in the Sac. swimming below; it’s also a marvelous work of art and engineering."], ["Reviewed January 8, 2018", 5.0, "Very unique!", "I visited sundial bridge today. Despite it being a rainy overcast day, the bridge was still beautiful and offered some gorgeous views of the Sacramento River. The bridge crosses over to the botanical gardens which were nice as well. They have a kids area with some pretty unique playground activities. Additionally there are beautiful sculptures and art work along the paths!\nShow less"], ["Reviewed January 7, 2018", 1.0, "Sore Thumb", "This bridge is dramatic and jarring. It sticks out like a sore thumb. It’s bright white, sleek and modern. It would look fine in a modern city, and does nothing to compliment or enhance the beautiful Sacramento River. The glass floor gets as hot as 150 degrees in the summer. When we visited, the floor was dangerously slippery due to rainy weather.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Architectural highlight of Redding", "Enjoyable stroll and pretty views even year round. We were fortunate enough to have a sunny day in January to enjoy this bridge and park."], ["Reviewed January 5, 2018", 4.0, "Worth multiple visits", "this is a unique attraction in the city of Redding, it’s easy to get to and it’s free to enjoy. I’ve been here several times and always bring an out of town friend to see the bridge, as you get a lovely view of people fishing in the river, birds flying overhead and there’s some nice forested trails and property to walk through. It’s also a very photogenic space, and is located right next to Turtle Bay in case you are traveling with kids and want to visit that as well.\n\nSantiago Calatrava, the Spanish architect who designed the bridge, has done unique projects all over the world, making this a special gem in the north state!\nShow less"], ["Reviewed December 24, 2017", 4.0, "Unique Bridge", "Great, easy walk across. Beautiful views of the Sacramento River on either side. The bridge itself is a working sundial, but only accurate on the summer solstice, I believe. It's still a fun and quick thing to do in Redding, though.\n\nFree parking at Turtle Bay Exploration Park. Restrooms, snacks, and a gift shop also available at Turtle Bay.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Very Unique Experience!", "Friends in Redding brought us here. We unique bridge.. a must see if in Redding. Nice trails and beautiful River."], ["Reviewed December 6, 2017", 5.0, "Definitely stop", "The Sundial Bridge is so cool! It’s right off the freeway, easy to get to. The day we went was absolutely perfect."], ["Reviewed December 4, 2017", 5.0, "Beautiful spot to visit.", "We came to see the bridge and did the walk around the park. It was a nice flat walk with wonderful scenery."], ["Reviewed December 2, 2017", 5.0, "Only one in USA", "WE saw the sun dial in France that mentioned this one in Redding. It was a must on our list; Paris does not have a real glass bridge. Be first to run to this bridge! What a wonderful way to spend a few hours!"], ["Reviewed November 22, 2017", 5.0, "Designer had a whimsical sense of humor", "Designer had a whimsical sense of humor. Easily it could have been a simple bridge connecting points a and b. But someone, with the political support to have fun designed the sundial bridge. It provides the incentive to get out @nd walk."], ["Reviewed November 19, 2017", 5.0, "Great local attraction", "Wow! What a great place for families, couples and individuals to get outside and walk, ride a bike or jog. It made us happy to see that the area was so popular it was, even on a week night."], ["Reviewed November 15, 2017", 5.0, "Love my Turtle Bay Museum Membership", "It's been a wonderful place to take my Grandaughter and family. I love the museum and just strolling on the Sundial Bridge. The children's garden is also a beautiful place to stroll through ☆☆☆☆☆...!"], ["Reviewed November 14, 2017", 4.0, "Interesting Bridge", "When you do a six week road trip that includes Northern California you see a lot of bridges and this is one of the more unusual. We visited at dusk on a warm evening and were surprised at the lack of other visitors. I guess if modern architecture is your thing then this is a must do but even if it isn't it's worth a look just to see the river rush under.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Gorgeous", "This is a very rare kind of bridge. Walk it at day and walk it at night. Day time it beautiful and it really is a working sundial. At night the under lighting coming through the glass floor is awesome. Best of all, it's free. The Sacramento river below is wonderful to hear. There are miles and miles of developed paths around the river and bridge. The museum is nice too. Always carry water. NO BARE FEET in the summer!!! If you think 107 degrees in the summer is hot, wait until you try this bridge in bare feet. I hope you have good insurance! People of ALL ages will marvel at this bridge. People there were friendly too.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Interesting architecture and a nice spot", "The bridge itself is well worth taking time to stop and walk across. The bridge itself is a neat architectural and engineering site. The river is much larger through Redding than I expected. It's a generally nice area, with a nice park and museum at one of the bridge.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Very Interesting and pretty", "The location is so beautiful. The river rushing below as you walk on the glass style bridge. Fishermen below you standing in the cold river patiently waiting their catch. Ducks and Geese flying above and landing below. the bridge is an amazing piece of architecture. It attracts people from all over the world to experience the beauty.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Awe Inspiring Archetecture and Experience", "Walking across the Sundial Bridge over the Sacramento River is breathtaking. On a bright, sunny and warm October morning, there were cyclists, families, dog walkers, runners, couples and groups enjoying the experience. Fishermen in small boats and waders, fly casting for elusive salmon were fun to watch.\nNice to have coffee and snacks available with outdoor seating. The gift shop is worth checking out.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Sundial Bridge", "Quite an architectural structure. Beautiful at night. Café offers visitors various beverages and snacks."], ["Reviewed November 9, 2017", 5.0, "Cool architecture", "Beautiful glass walkway bridge over the Sacramento River. (Which is freezing, btw, even in summer when it’s 115 degrees out, but I see a lot of fisherman up/downstream standing thigh deep in their waders.) The bridge is constructed to be an actual sundial, so it does keep time more or less. I highly recommend placing your ear to one of the huge metal cables & knocking on it. If your ear is properly aligned it will sound like the space battle sound effects in many sci-fi classics.\nIn the summer there is a weekly Farmer’s Market at the parking lot. The Turtle Bay Exploratorium (see their website for entrance fees) changes display themes every 3-4 months and is always kid friendly. There’s also a small collection of animals, butterflies & birds.\nThere are a few short walking trails at the bridge leading to hidden treasures. There is always a wide array of avid walkers/runners/cyclists on the bridge, as well as tourists in nearly every ethnicity & language. People are generally pretty friendly & so are their dogs. A beautiful area & one of my favorites for cheap/easy entertainment for out of town visitors.\nShow less"], ["Reviewed November 9, 2017", 4.0, "The Big Man Made Clock that Works", "A first time vistor to Northern California to this small city. During the heat of summer but still a a great visit. The Sundial Bridge is an amazing structure and you can tell the time. A nice walk in the surrounding area to explore."], ["Reviewed November 9, 2017", 5.0, "Love this place", "The sundial bridge has become a Redding landmark. The grounds and walking trails surrounding the bridge are beautiful. Turtle Bay is close by and a great place to take the kids for an educational and entertaining day of fun."], ["Reviewed November 9, 2017", 5.0, "Beautiful area with beverages and food near by", "You have to go here if you are any where near Redding, CA. There are trails that lead off the Bridge that take you along the river."], ["Reviewed November 8, 2017", 5.0, "Pretty cool park", "The bridge is cool but the views are awesome, especially at sunset. There a bunch of trails and the adjacent arboretum is also a great hour or 2 if you have time."], ["Reviewed November 8, 2017", 3.0, "October Birthday Trip", "Can be seen from some distance away. Interesting pedestrian bridge and worth seeing if you have the time"], ["Reviewed November 7, 2017", 5.0, "Pay Attention !!!!", "This is a fun place to visit and to take photographs. Toward the end of our visit, a couple of bus loads of elementary school students were just arriving, so most of the time the bridge wasn't crowded. There was a dog obedience class going on and there was a long line of people walking very obedient dogs (on leashes, of course) up and down one side of the bridge. It's a peaceful place, the water flowing under you, but it's important to stay alert, so I found. What appears to have been some sort of anti-social \"tweaker?) guy on a bicycle brushed against my shoulder as he sped by. Acknowledging the contact he looked back and yelled an inappropriate expletive. I reported the incident to the authorities. But the point is that, although this is just a \"walking bridge\" they allow people, including unruly townies, to use the bridge as well. So, it's sort of a \"be peaceful but stay alert\" kind of a place to visit. I took a lot of photos of the bridge but when I got home I discovered that the marvelous structure is best appreciated in person. The photos did not do it justice. I'll return next time I come this direction. It's a fun place.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Bridge and wildlife park", "A lovely place to spend a sunny afternoon. This place offers perfect stops for photos and to view the local plants and wildlife, all for free!"], ["Reviewed October 28, 2017", 5.0, "The great treat for eye:)", "Living in California for past 10 years, finally made it to this renowned place. This is a beauty and a must see treat for everyone. Amazing architecture with glass floor. The evening lights are mesmerizing. A must visit place and you will love it!"], ["Reviewed October 22, 2017", 3.0, "okay but not a must-see", "I enjoyed walking across the bridge to see the river and had no trouble pushing a wheelchair. The bridge gets dirty under the glass so that makes it less interesting to look at. It was a good local feature to visit but lacked the 'wow!' factor.\nShow less"], ["Reviewed October 22, 2017", 5.0, "Check it out!", "It’s a great place to visit and cross the Sacramento. I visited the gardens and walked the trails a bit, since a didn’t have much time. I’ll definitely go back to hike a bit more and check out the museum.\n\nIt’s a beautiful bridge and defiantly worth visiting.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Worth the stop in Redding", "We made a quick stop through Redding and the Sundial Bridge was on our must see list. It did not disappoint. We were able to catch it in at dusk when the lights started to illuminate it!"], ["Reviewed October 13, 2017", 3.0, "Pretty setting over the river so nice in good weather", "The walk over the river is nice and the bridge is impressive but not much by itself as an attraction. On one end of the bridge is the Turtle Bay museum which is kid centered (like a Discovery museum) and the other end of the bridge has a huge arboretum to explore if you want to see a wide variety of plant of various locales. So, good options for plant lovers or families with young kids.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Santiago Calatrava at work", "The Sundial Bridge is the new landmark in Redding, opened in 2005 as part of the Turtle Bay area. You can walk across the Sacramento River, and the pathway is lit from below at night."], ["Reviewed October 2, 2017", 3.0, "Bridge and park", "We walked over the bridge and into the park. Was a nice little walk. There were some flowers blooming (it was late September) and there was wildlife like deer and turkeys."], ["Reviewed October 2, 2017", 5.0, "We love the bridge!", "We love visiting the Sundial Bridge and nearby Turtle Bay and the arboretum. This is a must-see in Redding."], ["Reviewed October 1, 2017", 5.0, "One of My Favorite Places To Walk", "I have watched the gardens grow and become what it is today and it is quite wonderful. The vantage point of the river from this interesting bridge cools you off on those hot days ~ and the other 9 months of the year you can't go wrong. Don't miss the gardens ~ different all times of the year ~\nShow less"], ["Reviewed October 1, 2017", 5.0, "What a beautiful bridge!", "Make sure to walk over this bridge! It is gorgeous and the views of the Sacramento River are great. You can also visit the arboretum and walk along the river."], ["Reviewed September 29, 2017", 3.0, "Not so fun in 118 degree heat", "beautiful bridge and site but we were visiting during a heat wave and just were not up to spending much time in the heat. Will come visit again when temperature is better"], ["Reviewed September 27, 2017", 5.0, "Loved it!", "The Bridge is awesome and the view as you walk across it is too! One side of the river has waves due to the rocks and the other side is calm and peaceful! You look down as you walk and it's glass that looks cool. The Sundial itself was amazing! It was nice to see how families would explain how it worked to their children...what a wonderful educational place for all ages to visit! We certainly enjoyed it!\nNote: We did see people sitting and eating; looked more like fast food than a restaurant. There was also a gift shop.\nShow less"], ["Reviewed September 26, 2017", 4.0, "Pleasant walk on a hot summer day", "I visited the Sundial Bridge after touring Shasta Dam. It was at least 100 degrees, but I still enjoyed walking across the bridge and down below it. The glass is frosted, so you cannot see the water. It is free to walk across the bridge. The bridge It is a very unique attraction and a must visit while in Redding.\nShow less"], ["Reviewed September 26, 2017", 4.0, "INTERESTING SCULPTURE BRIDGE", "We stopped by to check out this bridge, located a short walk from the Convention center. Very photogenic bridge with a glass deck. However, the sundial was a little fast, it indicated about 1355, but was actually 1343. Still a unique bit of sculture built into a bridge.\nShow less"], ["Reviewed September 23, 2017", 5.0, "Amazing glass bridge!", "On our way through Redding, we stopped to see the Sundial Bridge, which has a glass bottom. It seems to be quite a popular attraction and is located in a lovely area that includes a museum, aboretum, park, and trails. What a lovely place! Redding residents are lucky to have this in their city.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Great views of the Sacramento River!", "Must see place on your visit to Redding, along with nearby Shasta State Historic Park and Shasta Dam. It was soo hot to stand on the bridge on a hot summer day, so please bring enough water especially if you are planinng to do some walking on the many trails. If you don't have plenty or forgot, perhaps drop by at the nearby museum gift shop. Even if you don't have much time, at least walk over to the other side and also drop by the gift shop especially if you are looking for information of the area. They carry many free brochures/flyers there.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Wow, blown away by the park", "I am from New York and only saw pictures of the bridge an surrounding trails. It is even better live in person.\nNot just a bridge, but miles of trails and gardens on the river. Awesome community gathering place but quiet enough to relax. Very impressed and Reading is definitely worth a day trip on a summer or fall day.\nShow less"], ["Reviewed September 18, 2017", 1.0, "Overhyped", "We were staying in Redding for a few days and of course they like to promote their Sundial Bridge as an attraction. I really didn't have a great desire to see it but we happened to be close by eating one evening so we decided to stop and check it out.\n\nI really can't understand what the big deal is. The bridge itself was underwhelming to me. I at least thought you would be able to look through the glass floor down to the river but the glass has a frosted appearance so it's not possible.\n\nThere were also a lot of questionable characters hanging around the parking lot and the park. It's not the kind of environment I would want to be hanging around in especially after dark.\n\nThis bridge seems unnecessary especially when you read the sign at the bridge talking about how much it cost to build. I feel bad for the taxpayers who had to pay for this but as a visitor save yourself the time and just skip it.\nShow less"], ["Reviewed September 13, 2017", 5.0, "\"People\"", "This is one of the few places in Redding where you will see people out walking around at almost any time of the day and evening. You can see the Salmon runs in the river and many types of birds. If you come to Redding, it's a must see.\nShow less"], ["Reviewed September 11, 2017", 5.0, "MUST SEE When In Redding", "Beautiful setting, Incredible Architecture, Well Worth the Stop.\nWe've been blessed to travel many places around the world, and have been able to see many local treasures. This Bridge/SunDial is one of the most Stunning engineering feats we've ever seen.\nSet over the beautiful winding Sacramento River, adjacent to a relaxing nature conservancy, this is one of -- if not, THE -- Highlight of Redding.\nI highly recommend stopping here, even if you're just driving through. Well worth the visit. It's definitely a One Of A Kind structure/setting. A Glorious Combination of Nature and Man's ability to positively impact the environment.\nShow less"], ["Reviewed September 6, 2017", 4.0, "A Great Little Walk", "Easy to get to and a very short walk, the Sundial Bridge is a beautiful attraction. You can look down into the crystal clear waters of the Sacramento River and often observe nearby wildlife. Well worth a few hours any time of the year."], ["Reviewed September 6, 2017", 5.0, "Amazing Bridge", "You can't leave Redding without a walk across the sundial bridge. Truly an iconic amazing structure which projects across the Sacramento River. Amazing colours and contours are on display here."], ["Reviewed September 5, 2017", 5.0, "When in Redding a must stop..", "This was a really interesting piece of architecture that we were glad we visited. We were only stopping over in Redding for one night but I'm glad we did. The girls got a kick out of the pedestrian bridge and world's largest sundial. It was a beautiful site.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Very nice place to visit if you are in Redding", "Definitely worth a stroll across the bridge. Try visiting at evening for the cool breeze and nice walk about. Otherwise if you visit during cooler months you can visit nearby botanical gardens and go on some of the trails"], ["Reviewed September 2, 2017", 5.0, "When in Redding...", "If you're in a road trip, Redding is a good place to stay the night. It's a bit more than halfway from LA to Portland. And when in Redding there's not a whole heck of a lot to do...\n\nBut one thing they have which you should for sure check out is The Sundial Bridge! It's very cool! It's long and has a glass floor… Amazing views! Not only that, but the sundial actually works! There is also a museum here. Make sure you check the time is because it close before we got there last time.\n\nWhen you're driving long-distance is and stopping in Redding… This is just a nice thing to do to stretch her legs before eating dinner and packing it in. The Oxford suites are a good place to look into staying.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Mark it on your dial, for a whimsy.", "This is a bridge to nowhere. It is an ornamental bridge, quite fanciful, constructed across the Sacramento river, in a park. The bridge is at the end of the road leading into the park, and allows pedestrians to cross to the opposite site. If you are in Redding, or pass it and have the time, then you may well enjoy the small detour required to visit the bridge. Parking is very near, the paths are wheelchair accessible, and while this is not the Millenium bridge with St Paul's at one end, in fact having just sand and grass at both ends, it does suit the whimsy.\nShow less"], ["Reviewed August 29, 2017", 4.0, "First Time!", "We have drove through Fwy 5 between Los Angeles and Seattle many times and stayed at or near Redding several times in the past. Never knew about this bridge. After reading about it before our eclipse road trip up to Oregon and Washington, we made it a point to stop here. What a wonderful place! The bridge was the main attraction but there's also the museum, arboretum, etc. on the premises. People were there for all kinds of activities, fishing, hiking, walking their dogs, etc. in this nice park. Easy to find and with good parking. If traveling along the 5, make a brief stop here for a break.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Beautiful and a wonderful adventure to walk around this breathtaking bridge and park", "This bridge is not only breathtakingly beautiful but a very fun adventure to walk around the surrounding area and enjoy!"], ["Reviewed August 28, 2017", 5.0, "Shasta houseboat trip", "Worth the stop. Easy access too. Quick stop to see the bridge. It's a very cool walking bridge. Unique design, nice for a hike or picnic break."], ["Reviewed August 28, 2017", 5.0, "Beautiful Bridge", "Stopping at the park is worth the time to take a break, see the science center and have a cup of coffee. The people who visit the park and the surrounding area are all very nice, mostly families and it's a very safe area. The bridge looks like it was transported from Tommorrowland in Disney. The sundial is great concept and actually lends itself to being a fantastic spot to take some interesting pictures.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Awesome architecture", "Great place to see, very unique bridge spanning the Sacramento River. Very easy access and parking. There is a very nice visitor center with snack bar, coffee, smoothies, etc, restrooms and gift shop. There is also a museum with activities, but very pricey admission so we did not go in. One huge disappointment was when we returned in the evening to see the bridge lighted, we waited and waited until after dark and the lights never came on. A local person passing by said it hasn't been lighted for some time, maybe broken equipment.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Delightful!", "A must see when you're near Redding CA. Clean and bright. Dark at night of course when lights are not working."], ["Reviewed August 26, 2017", 5.0, "2PM on the dot.", "The bridge is an artistic and engineering masterpiece. We visited on a sunny day. It was a pleasant walk across the bridge. Once on the far side, we watched the sun's shadow slide across the grassy \"face\" of the sundial. It hit the 2PM marker at exactly 2PM, according to the iPhone--Apple Time, as we call it.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Eye-Catching Bridge", "We were passing through Redding the day of the solar eclipse and wanted a fun place from which to experience it. I'd heard good things about the Sundial Bridge, so we drove there. We made it to the bridge just as the eclipse peaked and oohed and aahed along with many others who had the same idea.\n\nAfter the spectacle, my husband and I enjoying looking at the bridge itself and marveling at its unique design. As its name implies, it operates as a gigantic sundial. The surface of the bridge is long glass strips, which were really cool to walk on. The park-like setting is nice. So glad we chose this spot to make our memory. We'll go back to see the bridge again the next time we're in Redding and plan to visit the museum there, too.\nShow less"], ["Reviewed August 24, 2017", 4.0, "Nice bridge", "I was in Redding for a wedding. Unless you are there for hiking, water sports or fishing (which I wasn't) there is not really much to do in Redding. I guess the bridge area is a big attraction. Actually it's pretty nice. The bridge is a modern walking bridge with a huge working sundial. It crosses the Sacramento River. There is also a nature museum and some shops. I would have stayed longer but it was really hot. During summer Redding is often regularly over 100.\nShow less"], ["Reviewed August 24, 2017", 3.0, "impressive & interesting but didn't see the shadow", "nice walk across the bridge - quite unique - didn't see any shadow created by the sundial - nice attraction for Redding, CA"], ["Reviewed August 24, 2017", 1.0, "fished under bridge", "Fun time with Forrest in his new boat. The weather was sunny and temperature warm. There were many fish in the river."], ["Reviewed August 23, 2017", 5.0, "A unique structure", "This bridge is unlike anything you've ever seen; it's anchored and supported principally on one end of the structure with cables emanating from a distinctive structure on one shore; a remarkable engineering feat. It's for pedestrian traffic only, conveying you over to Turtle Island and the park there. Redding wanted something to put it on the tourist map, and, wow, did they get it! Don't miss it!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Stopped on route through Redding", "We stopped for about an hour in route through Redding. Well worth it. Looks like there is other stuff do in the area, but we did not do anything else."], ["Reviewed August 15, 2017", 5.0, "Stunning design", "This is a breathtaking piece of engineering art (as long as the sun shines). I marvel at the audacity of creating a suspension bridge that is also a giant sundial. Brilliant."], ["Reviewed August 12, 2017", 5.0, "Landmark pedestrian-friendly bridge", "My husband and I were in Valencia, Spain last October and on a tour, learned about their native son, architect Antonio Calatrava, known for his extraordinary bridge designs around the world. Redding's pedestrian-only bridge crossing the Sacramento River is amazing to view from any angle. We also walked down below to a amphitheater area where someone was giving a talk at the base of the bridge. Redding is truly fortunate to have such a wonderful landmark for its community and visitors in Turtle Bay Exploration Park.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Beauty at sunset", "A wonderful combination of modern architecture and nature. We very much enjoyed our evening walk at Sacramento River."], ["Reviewed August 11, 2017", 3.0, "Just okay", "This bridge looked a lot nicer on the website. I'm glad we stopped to see it, but also glad we did not make a special trip as it was just so so."], ["Reviewed August 10, 2017", 4.0, "What a beautiful bridge!", "It's really an exceptional bridge, both materials and design. Just stopped on our way out of town and spent 30 min walking back and forth. Lots of extra sights there. Arboretum and museum. People were being loaded and river rafts and started their journey down river right next to the bridge, the sun was baking us and we wanted somewhere to buy an ice coffee...\nShow less"], ["Reviewed August 8, 2017", 3.0, "Hot in Redding", "The bridge was very nice, however the museum was not worth the $. Watch out for rattle snakes this time of year."], ["Reviewed August 7, 2017", 5.0, "Unique and Beautiful", "So many things to see from one location. The bridge is a sight in itself. By day there is the beautiful view of the river and the surrounding area and by night the lights of the bridge and the city of Redding. The bridge is located right next to Turtle Bay Museum, gardens and trail system. A must see!\nShow less"], ["Reviewed August 6, 2017", 4.0, "Sundial Bridge was definitely a unique design", "The sundial Bridge was a very unique design spanning the Sacramento River. There's many people out walking the bridge and it made for a very relaxing picture. I think it something everyone should see."], ["Reviewed August 6, 2017", 5.0, "Just killing time", "I have seen this Sundial Bridge advertised in a few places, so on our way to Oregon, we decided to stop an see it. It did not disappoint. Crossing the Sacramento River, it is a work of art. Once crossing, you have an opportunity to explore, for free, the Arboretum and Botanical Gardens. This is a real nice place to spend a couple of hours.\nShow less"], ["Reviewed August 4, 2017", 5.0, "AWESOME BEAUTY", "The Sundial Bridge is one of my favorite places to walk my dog. It's such a beautiful environment. The visitors are so diverse and friendly. It's a peaceful place. The bridge is gorgeous by day and magnificent by night. The floor of the bridge lights up and it's so magical and romantic. I visit the Sundial Bridge almost daily.\nShow less"], ["Reviewed August 3, 2017", 4.0, "A Must see.", "This Sundial Bridge actually tells time corresponding with its shadow. The Aboretum next to it is another place to visit while you're here."], ["Reviewed July 30, 2017", 4.0, "Pretty Cool", "There really isn't much to do in Redding proper, this park gives you a great view of the river and some nice gardens as well,"], ["Reviewed July 29, 2017", 5.0, "Don't miss the Sundial - no matter what the weather", "It was about 110 degrees but I couldn't skip over the sundial. It's a short walk and out on the bridge there was a cooling breeze. Waded into the water of the Sacramento River and splashed myself with the melted snow water.\n\nDepending on season, there is a botanical garden to enjoy.\nDon't let yourself down by missing this amazing artistry/ engineering project.\nShow less"], ["Reviewed July 29, 2017", 3.0, "Another mistake from Calatrava", "My first foot on the bridge was preemptive.... I know this architect! Few step more and my mind switch to Venice .... yes Santiago Calatrava . Another big mistake of his production . Please stop , thanks"], ["Reviewed July 28, 2017", 3.0, "Beautiful sunset", "A must see! Architecture cool and walking is pleasant. Visit museum and store there as well. Temperatures were high when we visited so we went right as sun was setting. Places to sit to enjoy river as well."], ["Reviewed July 28, 2017", 4.0, "Stopover in Redding", "We spent the last night of our trip home to Bakersfield from Victoria, BC in Redding. We heard about the Sundial Bridge and decided to give it a look and it was awesome. We took a walk across it, in spite of the heat, and...More"], ["Reviewed July 26, 2017", 4.0, "It was ok for me", "I would say the architecture is really good and worth the visit. It does go over water and the floor is light green tint glass. I don't walk on glass! Even in Toronto I wouldn't walk on the glass floor of the tall tower downtown,...More"], ["Reviewed July 25, 2017", 3.0, "It's a bridge", "We did not have time to cross the bridge but we wanted to view it from afar and get some photos. It was hotter than heck that day and because it is over a river there was tons of mosquito bugs. This area is nice...More"], ["Reviewed July 22, 2017", 5.0, "Time to Stop!", "This is a beautiful bridge to take the time to stop and walk. Our family enjoyed the bridge and the views of the river below."], ["Reviewed July 21, 2017", 5.0, "Sunset walk", "Excellent for an evening walk in the hot summer. The giant working sundial is amazing. Other attractions nearby."], ["Reviewed July 20, 2017", 5.0, "Great place to stop", "Great place to stop and see the river and a great community asset. We stopped in the evening and watched the sun go down. There were a lot of people, but we were able to find parking."], ["Reviewed July 19, 2017", 4.0, "Great bridge over a gorgeous river", "Definitely worth a visit to walk over the bridge and wander the trails. In mid-july, the river was flowing well and it was great to walk the trails on both sides of the river. Lots of people of all ages were enjoying the wonderful space...More"], ["Reviewed July 17, 2017", 5.0, "Very cool place to visit!", "We really enjoyed our visit to what we were told is one of only three working large-scale sundials in the world. The architecture was very impressive, and the river trail was lots of fun. Worth the stop!"], ["Reviewed July 12, 2017", 5.0, "Visit the bridge even if you go to Redding for nothing else! masterpiece", "The bridge is worth the trip regardless of where you're coming from! A must-see at night. Many excellent restaurants nearby. A short drive to Shasta Lake and Shasta Dam. Drive up to the Vista Point for a breathtaking view of three Shastas (Shasta Lake, Shasta...More"], ["Reviewed July 12, 2017", 4.0, "Lots of opportunities to take interesting photos.", "The Sundial bridge has a unique design making it interesting from a photographic perspective. Depending on the time of day, you can shoot some interesting silhouette photos which make for dramatic B&W photos"], ["Reviewed July 10, 2017", 5.0, "Very unique bridge", "Unusual to see a Calatrava design in Redding, but the glass deck and the harp like support structure, there is simply non like it!"], ["Reviewed July 10, 2017", 5.0, "Family-Friendly Sundial Bridge and surrounding Botanic Gardens.", "The Sundial Bridge and surrounding gardens and river make for a great, free family experience. In the summer Redding is HOT so go early or in the evenings. There are great bike trails and views of the Sacramento River. Take a picnic or maybe plan to explore Turtle Bay to see the critters. There is an additional fee for this. Fall and spring are ideal times to visit. The Botanic Gardens are perfect for letting little ones lead the way in nature. It is great to see do many people and kids outdoors playing and enjoying nature!\nShow less"], ["Reviewed July 10, 2017", 5.0, "An imposing icon bridge of Redding; definitely a must see", "Designed by Santiago Calatrava and opened on July 4, 2004, Sundial Bridge is a cantilever spar cable-stayed bridge that carries bicycles and pedestrians over Sacramento River in Redding, California. It has become iconic for the city. The pylon that holds up the bridge acts as a sundial, albeit accurate only on summer solstice. Additionally, the bridge connects to the Sacramento River Trail, making it popular among bicyclists.\nIf you ever have a chance to visit Redding, Sundial Bridge is definitely a must see due to its dramatic appearance. Be sure to bring your cameras or smartphones as you would want to take photos to highlight your visit. And please consider that the deck may be hot, especially on scorching summer days, so always wear shoes if you cross the bridge.\nShow less"], ["Reviewed July 10, 2017", 3.0, "It's a bridge!", "easy access via GPS. it wasn't crowded so it was nice to get pictures done. Park at the parking lot and walk to the bridge. There's a cafe and museum building where the bathroom is located. It was super hot so the bridge was hot in temperature. It was a nice walk across the bridge.\nShow less"], ["Reviewed July 10, 2017", 4.0, "One of the prettiest parts of Redding", "The Sacramento River flows under the sundial bridge where fishermen, birds, animal and outdoor enthusiasts can enjoy! A 'cooler' spot to spend time on a hot day. The bridge leads to the river trails and has become a hot spot for 5K runs/walks and bike riders too. I've had no trouble with dangerous situations here but have heard it can be unsafe at night.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Sundial Bridge over the Sacramento River", "All ages like this bridge. It is unique to Redding and draws many family, friends and people from all around to enjoy nature while crossing over the Sacramento River--while walking on a giant sundial! Cross over and check out the shadow's mark in time. I have walked on this bridge in snow, when it's covered with leaves, in the spring when green is busting out everywhere, & in the heat of the summer--each experience is unique unto itself. It's a wonderful place to picnic, write poetry, paint, meditate, listen to music, a destination for a bike ride or walk, or an engagement proposal. This Sundial Bridge is wheelchair accessible--so bring one and all to this bridge and breathe in Nature's goodness.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Unique park", "A pretty park with the unique feature of having a bridge over the river and a huge sundial over the bridge. You can walk to the river's edge and watch the ducks swim or wade in the water. There is also a botanical area in the park. Worth a look.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Don't Miss It", "This is the one attraction in Redding that should not be missed. It has an interesting history which can be gleaned online. It was not immediately embraced by the locals, but now, twelve years later, has become the pride and joy of Redding. If you visit in the heat of summer it's the best place to cool off..\nShow less"], ["Reviewed July 8, 2017", 4.0, "Very cool bridge and nice area", "I love the design of the bridge. The green glasses match well with the river color. Super nice walk on it. We went to the botanical garden first and then the bridge. The only thing is at 9am it's already 90s."], ["Reviewed July 8, 2017", 3.0, "Walking bridge with a unique design", "This bridge is in a park and connects two walking areas and parks. I didn't see it at night but was told it's lit and beautiful. This would be a nice half-day stop especially if you have children and it wasn't too hot!"], ["Reviewed July 7, 2017", 5.0, "INCREDIBLE", "I happen to be a Architectural Photographer with a Bridge fixation. One of the more interesting structure I've seen. If you are anywhere near the area you really should go see it. Looks completely different at night."], ["Reviewed July 7, 2017", 3.0, "A bit crowded for our taste", "Pretty bridge, and worth a quick visit. However, we were coming here to start our run on the Sacramento River Trail and were surprised to see a sign that you have to wear a shirt on the trail in the park. My husband runs without a shirt (especially in this heat!) so we had to turn back. We will definitely use the Sacramento River Trail again, but we will start from a different parking lot and skip the crowds at the Sundial bridge!\nShow less"], ["Reviewed July 5, 2017", 4.0, "Pretty cool bridge..invites you to cross over...", "The bridge is unexpected art in Redding. It draws people to it..come walk over the river, see the colored lights or cross to enjoy the gardens, bike or walk.\nThere were\nPokeman people in a group, families walking...it is welcoming, a place to go that is safe and cool.*\nShow less"], ["Reviewed July 4, 2017", 5.0, "Walk bridge only", "It is quite an engineering feat- worth seeing! The cables, the glass walkway, the large sundial structure is fantastic. Something Redding should be proud to have & promote the City. Park and walk across the bridge to the huge structure and wear sturdy shoes because the glass surface is hot - especially in the afternoon.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Good for a stop over", "Absolutely worth a stop on I-5. Easy approach and must see architecture by famed architect (Santiago Calatrava). One of a kind built in California and the location is perfect. It was a little too hot on July to enjoy a hike but the tourist center is a nice place to chill out if you need a break. There is also a hike that seemed popular among locals and tourists.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Amazing architecture!", "This was a must on our day in Redding! I enjoyed walking across the bridge and taking pictures of the river."], ["Reviewed June 29, 2017", 5.0, "Nice landmark feature of Redding", "This was a quirky and unique place to spend a little time at the end of a busy day. Great especially if you like modern architecture. Nice for strolling and relaxing in the middle of town. A café is nearby for refreshments. Just the car park could be a bit bigger.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Engineering and architectural gem", "I love this bridge. Unfortunately we were just passing through and couldn't spend a lot of time but even a short visit is nice. The botanical gardens are nice and include both educational plantings and natural trails. Great for kids."], ["Reviewed June 28, 2017", 5.0, "When Nature Calls", "What a great way to de-stress and to unwind. It is only a few minutes drive from downtown Redding and so worth it."], ["Reviewed June 28, 2017", 5.0, "Worth seeing!", "Birds and ducks galore! My husband and I were able to see bird nests through the flooring of the bridge. One had three little eggs in it while another had baby birds. So neat!"], ["Reviewed June 25, 2017", 4.0, "Great Place to Step Out of the Routine", "You can spend hours on the Sundial Bridge staring at the water, watching the boaters and enjoying the fresh air in a setting that seems far from the city that is just minutes away."], ["Reviewed June 25, 2017", 5.0, "Unique Bridge", "This beautiful bridge is in actuality a giant sundial. On June 21st ( the summer solstice)\nit moves with the sun 6 inches in the morning. If I had know this I might had made my visit later than I did. The walk across is very easy and you have great views both up and down the river.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Beautiful bridge and small park that's worth visiting.", "Beautiful bridge and small park that is worth a visit. Great place for an evening stroll. Could architecture and story behind the bridge!"], ["Reviewed June 23, 2017", 4.0, "A reason to stop in Redding, the Sundial bridge.", "The people in Redding wanted to give others a reason to stop there. They spent 24 million dollars to build something unique. It is a bridge that is a giant sundial that goes across the Sacramento River. It is about twenty stories tall and and has glass walking surface. There is a marked area for each half hour of where the shadow will fall on June 21st. We were there on the 22nd and found it quite accurate. It is not just the bridge that makes it a nice place to stop. Even though it was a hot day there was a nice breeze. There were plenty of ducks and other birds there. There is a large botanical garden there and a museum. There are also miles of hiking trails.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Worth a stop", "This bridge is worth a stop!!! It's really neat to show your kids how a sundial works and the view is lovely. Right next to the Turtle Bay Exploration Park too."], ["Reviewed June 22, 2017", 5.0, "Incredible piece of Architecture", "A friend told us about his, so we stopped by to see and found it far more interesting and incredible than described to us. We were there in June close to the Summer Solstice so the accuracy of the sundial was incredible. The walk across the bridge takes you to the Arboretum and Botanical Gardens and the view of the river from the bridge was beautiful.\nShow less"], ["Reviewed June 21, 2017", 4.0, "Really interesting architecture and beautiful setting", "Unfortunately, our visit ended up being on a day with over 100 degree temperatures, and we arrived at mid-day, so it was uncomfortably hot! But the area is beautiful spanning the Sacramento River, and the visitor center and surrounding area have a lot to see.\nThere are signs posted that the bridge becomes very hot in warm weather and to be careful about pets, so we did not take our dog across, but I saw other people with dogs and they seemed to be fine.\nIt's worth the stop for the beautiful, light-filled view of the river, and if you are interested in the visitor center. Plan on spending an hour or so if you go through the visitor center also.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Blessed to have this jewel.", "Delightful to get down over the river on this lovely bridge. Getting out over the river seeing salmon jumping, mama ducks with their ducklings, deer along the edge. Cooler over the water. Then a hike into the arboretum seeing the plant species. Also visited the nearby Turtle Bay Museum and the butterfly house.\nAll of this connecting to miles of hiking trails following the river, turtle ponds, parks and bridges.\nI live nearby so plan to go frequently.\nShow less"], ["Reviewed June 21, 2017", 5.0, "If it is a hot summer day, dont bring animals...surface too hot on their feet", "Really pretty at night after the sun goes down...and a lot cooler bring you pet dog and lots to drink along the way...Also, a camera...you will want to take shots of the river, bridge at night etc"], ["Reviewed June 20, 2017", 5.0, "Fun and peaceful", "We go here every yr for the last 5 yrs. We now have a family tradition. Beautiful views, trails, and a playground area at end of one of the garden trails. A tip though , if it's 100 degree weather out bring a spray bottle fan and water bottle.\nShow less"], ["Reviewed June 20, 2017", 5.0, "A Design Wonder one Must See", "Walked back and forth to take in the bridge and stand back and just gaze!! Yes this is a sun dial over looking the Sacramento River. This was fun."], ["Reviewed June 20, 2017", 1.0, "Terrific waste of tax dollars", "This is a perfect example of how this city wastes tax money while at the same time neglects the infrastructure and security of the citizens"], ["Reviewed June 17, 2017", 5.0, "AWESOME!", "We stopped to see the Sundial Bridge on our way back home again and got some beautiful pictures of it. It is just the most awesome bridge & wonderful to see up close! And the Sacramento River was full and moving fast after all the rain we got this winter.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Peaceful, beautiful bridge to walk or ride your bike!", "We have visited this bridge each time we have been in Redding. It is peaceful even with many others enjoying it at the same time. You can walk/bike across and then continue on a long, wonderful trail along the Sacramento River. Or you can stand in the middle of the bridge and just enjoy watching the river and looking at the mountains around it.\nShow less"], ["Reviewed June 16, 2017", 5.0, "When in Redding ...", "Yes, stop by Turtle Bay and walk across the Sundial Bridge. I lived in Redding for six years and this had not been built yet so I missed out. But on return visits I usually head over for a stroll across the Sacramento River. It's quite spectacular at night all lit up. Plus the park is well worth a walk through as well.\nShow less"], ["Reviewed June 12, 2017", 5.0, "Cool Experience!", "Beautiful view of the Sacramento river, a must see. Easy access for all, and crosses to a beautiful botanical garden. Hot in the Summer, but river breezes keep it comfortable."], ["Reviewed June 12, 2017", 3.0, "An interesting place for a quick visit.", "The Sundial Bridge (also known as the Sundial Bridge at Turtle Bay) is a cantilever spar cable-stayed bridge for bicycles and pedestrians that spans the Sacramento River in Redding, California, United States and forms a large sundial. It was designed by Santiago Calatrava and completed in 2004 at a cost of US$23,500,000. The bridge has become iconic for Redding\nShow less"], ["Reviewed June 12, 2017", 4.0, "Definitely worth a trip if in Redding", "This is a beautiful and unique glass-bottomed bridge over the Sacramento River, which when we visited in late May was in full flow. It doesn't really seem to lead anywhere, but it is a nice place to spend an hour or so and architecturally is an interesting design.\nShow less"], ["Reviewed June 10, 2017", 4.0, "Beautiful area with an amazing bridge", "Stopped in the area to take a look. The bridge was just too hot to have the dog walk across so decided to take him for a nice walk through the hiking paths in the area. It was so very nice with lots of shade. Spent about an hour here just enjoying the scenery and the peace. The river was high with water fowl present. Looking forward to visiting more of this park area on our next visit.\nShow less"], ["Reviewed June 8, 2017", 5.0, "Revisiting", "I love walking on the bridge. It's pretty lots of birds and we startled a deer near the entrance. Lots of kids around and bicyclists. We were there when the sundial was showing the time at 1:30 to 2:00."], ["Reviewed June 8, 2017", 5.0, "Special Place To See", "You really need to go see this glass floored bridge and experience walking across it and admire the bridge as a piece of art work. When in Redding take the time to go see it is close to I-5 and takes very little time to drive right up to and walk out on. It can be hot in the summer.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Breathtaking!", "What a lovely addition to the area. Wished we had the chance to walk the full bridge but what we saw was not at all disappointing! Next time I am in town, this is my first stop for sure!"], ["Reviewed June 6, 2017", 5.0, "Find the time", "This is truly a very unique attraction. The glass bridge takes you to the sundial and a short walk takes you to the time viewing area. A walk under the bridge reveals silhouettes of people and dogs on the bridge."], ["Reviewed June 5, 2017", 5.0, "Great Place for a Walk or Bike Ride", "What a great place for a walk (with or without you dog) or a bike ride. You cross over the Sacramento River (great view), has a nice picnic area and connects to the Sacramento River trail"], ["Reviewed June 3, 2017", 5.0, "Graceful bridge with lovely view of the river", "Lovely spot to enjoy a view of the Sacramento River. Cross over the river and there is a lovely garden and also access to the river and walking paths. The bridge is quite beautiful."], ["Reviewed June 3, 2017", 4.0, "fun place to walk, or bike", "we had an hour to spend in Redding, and we spent it at the Sundial Bridge. The bridge itself is something to see! clean lines, and it really does tell the time. On a very hot day we cut our visit short, but the babbling river through the park was relaxing, and the scenery delightful.\nShow less"], ["Reviewed June 2, 2017", 4.0, "Beautiful bridge", "A cantilever bridge on river Sacremento offers wonderful view all around.Its construction is superb and attracts lot of tourists world over."], ["Reviewed June 2, 2017", 5.0, "Great trails, beautiful bridge to walk on!!! Highly recommend!", "We walked on a couple of the trails . Visited 3 x's. Beautiful place to take photo's day or night.!!"], ["Reviewed May 30, 2017", 5.0, "Impressive Connector", "The bridge that is fairly new, (2004) crosses the Sacramento River in the heart of Redding. If you happen to be passing by in this town, make time to stop here and check it out. It spans 217 feet tall, this cable stayed bridge connects the north and south end of the city where there is a Turtle Bay Exploration museum. We did not go inside the museum but it is also definitely worth seeing for families. The admission is $16 for adults. There is also a short trail alongside of the river. There were also boat rides. This is a very family oriented activity.\nShow less"], ["Reviewed May 30, 2017", 4.0, "Where to Meet", "What an amazing focal point for this city. A work of art in the midst of a beautiful trail system overlooking the Sacramento River."], ["Reviewed May 28, 2017", 5.0, "Beautiful during the day or at night", "Spent the entire day at the bridge and surrounding areas. Went to the museum, the Arboretum, the bridge, and surrounding area. Then came back at night and saw it all lit up. Very pretty"], ["Reviewed May 26, 2017", 5.0, "Nice Walk", "This was a funny place to take the grandkids, you can walk across the bridge. Go to the small zoo area, see museum. This was a fun day for all."], ["Reviewed May 24, 2017", 4.0, "Creative, beautiful art with function", "This bridge is a must see if you go to Redding. Nice easy stroll. A bit cooler than the rest of the town as it is on the river. Interesting story of it's development."], ["Reviewed May 22, 2017", 4.0, "A good draw for the community", "When they first built it I thought it was huge waste of money, but after seeing handicapped people being able to enjoy the river from the bridge I have definitely changed my mind."], ["Reviewed May 22, 2017", 4.0, "Fun Focus Point and Night Exploration", "The Sundial bridge is a social center point for the town of Redding and an architectural masterpiece of renowned architect Santiago Calatrava from Spain. It is a great place to start and end walks or jogs along the river. At night it is lit up. During the day you can indeed see the shadow functioning as a Sundial at certain times of the day. Locals love to come here to hang out in the cool evenings. Musicians, street performers, and artistic types as well as new age power absorbers come and spend time on or near the bridge in the evenings. The Turtle Bay museum is close and you can see fishing boats bobbing in the current and fly fishermen wading in the river above and below the bridge. Definitely a place to come for a visit or regular walks.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Fabulous at night (dusk).", "This is a great place and fabulous spot on summer evening. It is quite a spectacular location downtown. You can get good restaurants nearby afterward."], ["Reviewed May 21, 2017", 4.0, "Worth a visit (even if it is facing the wrong direction)", "This park in good weather has a lot to do besides the bridge. Yes it is a centerpiece, but there are gardens, hiking trails, biking trails, museums of various sorts etc. If you are short on time, you can cross over the bridge and back in less than 30 min, but if you have the time, it would be easy to spend many hours here exploring. Sadly the sun dial itself faces the wrong direction to actually be a working model, but it is still stunning and worth seeing. A local told us to come back at night as it was lit up and really pretty, but we didn't have the chance to do that.\nShow less"], ["Reviewed May 17, 2017", 2.0, "A lot of money for a watch that's only right one day a year", "It is a nice bridge, but for a sun dial, not so much. it cost $25 million to build, and has some very nice walking trails, and is by the river, but they have no concept on how a sundial works. To work, it must be facing north, it is east to west. making it correct, for just one day a year. sad. should ask for there money back..\nShow less"], ["Reviewed May 17, 2017", 4.0, "Beautiful with the sun shining on it", "Very majestic spanning so white across the river.it was fun to walk across it, people were taking pictures. Across the bridge there were some beautiful flowers."], ["Reviewed May 17, 2017", 5.0, "Beautiful bridge!", "We walked across the bridge to the gardens and ponds, saw baby geese at the water's edge, view of Lassen peak from the bridge."], ["Reviewed May 16, 2017", 5.0, "Perfect", "Every time I visit Redding, I visit here. It's a beautiful place for a walk and for photography. There are places to sit around the park. Always a lot of people"], ["Reviewed May 14, 2017", 4.0, "Great walk", "Lovely walks around this bridge. The bridge itself was great to walk over, and goo views of the river. Popular"], ["Reviewed May 12, 2017", 4.0, "Functioning Artistic Engineering Sight To See", "Interesting suspension type bridge. Takes you from the Turtle Bay Exploration Museum to the park and botanical gardens. An added bonus a lot of water right now, moving quickly."], ["Reviewed May 6, 2017", 3.0, "Nice walk", "After seeing pictures of this bridge in Redding for years, it was a little anticlimactic to be truthful. But that being said, it is a beautiful bridge and nice for photo ops for sure. There are paths nearby to hike/bike. There is also a Botanical Garden, Turtle Exploration, a gift shop/restaurant nearby.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Beautiful setting", "The Sundial Bridge is an innovative and beautiful pedestrian walkway across the Sacramento River. Very popular with locals and tourists alike."], ["Reviewed May 4, 2017", 4.0, "Sundial Bridge in Turtle Bay Park", "Nice place for a stroll out of the heat of the day. Can watch the salmon from the bridge and enjoy all the flowers and trees."], ["Reviewed May 2, 2017", 5.0, "Cable, modern bridge: must visit", "Beautiful California bridge, the Sundial Bridge is a landmark of Redding city, over Sacramento River."], ["Reviewed May 2, 2017", 5.0, "Nice place for a walk", "Passing through Redding and thought we'd stop for some exercise. Very nice walk. Beautiful bridge and freindly people."], ["Reviewed May 2, 2017", 4.0, "Interesting", "Interesting design and the glass deck is quite different from the norm. Makes a nice walk across the river :-) Surprisingly busy on a weekday in April."], ["Reviewed April 27, 2017", 5.0, "Beautiful day or night!", "No matter the weather or time of year, this attraction is great for everyone. Wheelchair and stroller acceptable. All ages. So beautiful. Lights up at night. During the the panoramic views are breathtaking."], ["Reviewed April 27, 2017", 4.0, "beautiful photo op", "we visited on a family roadtrip. the whole park & bridge area was much smaller than I had expected, but no less lovely for it. Very human scale - more a sculpture than an infrastructure part. Fun in the early light, great photo ops. Also...More"], ["Reviewed April 23, 2017", 5.0, "Such a beautiful walk.", "If you love to walk this is a must see.You can park at Turtle Bay an walk across the bridge or you can park in the Sac park an walk to the bridge which is a little hike but is very easy. The bridge is...More"], ["Reviewed April 21, 2017", 5.0, "Amazing piece of engineering.", "The bridge took ten years to build and is an engineering marvel. Check out the bridge and then I would head into Turtle Bay Exploration Park and read up on the facts of building this bridge. It's amazing. After crossing the bridge, visit the gardens...More"], ["Reviewed April 20, 2017", 4.0, "As the name says, it's a bridge that's a sundial. Plus...", "Plus, it has a glass deck. VERY cool way to see the Sacramento River, and if you visit Redding, it's a must see."], ["Reviewed April 19, 2017", 5.0, "Beautiful architecture/engineering in a lovely setting", "Connecting parks on both banks of the Sacramento River, this architectural and engineering work of art is a delightful way to spend and hour. I visited in the spring when the river was full and a few fishing boats added to the scenery. Though I...More"], ["Reviewed April 17, 2017", 5.0, "Pleasant Surprise!", "Just happened to see sign for it on the freeway so we decided to check it out. It was a pleasant surprise to see this unique bridge. I admit we didn't walk very far out on it as it was very windy, cold and starting...More"], ["Reviewed April 12, 2017", 5.0, "A beautiful glass bridge!", "The sundial is a beautiful glass bridge, it's opaque in color, not clear glass, it's absolutely beautiful lit up at night! There is no cost involved and you can take a quick walk across the bridge and back in 15-20 minutes or take a few...More"], ["Reviewed April 9, 2017", 5.0, "Must See", "Easy access and parking, casual walk and great scenery. Take a 10 minute stroll or stay for hours and walk on the trails. Close to Turtle Bay and the Arboretum. Cool on a hot day."], ["Reviewed April 6, 2017", 5.0, "Such a cool bridge!!!", "Way cool but I think they spent too much money for a walking bridge!!!! It's definitely worth going to check out if you're in the area!"], ["Reviewed April 4, 2017", 4.0, "A pleasant walk!", "We went here while in Redding on business. It was a nice walk and the arboretum next to it made for a nice Spring walk."], ["Reviewed March 29, 2017", 5.0, "Beautiful Bridge", "We enjoy walking across the bridge and checking out the river. Very peaceful. Sometimes we go into the cafe for a snack too."], ["Reviewed March 23, 2017", 5.0, "Beautiful Park and Bridge", "This is a convenient must see when in Redding. The Bridge takes pedestrians across the river to the gardens. Both are popular spots, are beautifully designed and maintained."], ["Reviewed March 22, 2017", 4.0, "Relaxing, fun, walk with beautiful views", "Sundial Bridge spans the Sacramento River - we have been out to Sundial bridge in both Spring & Summer & it was an enjoyable walk with beautiful views - worth your time - take a picnic lunch or some $'s for the snack shop"], ["Reviewed March 21, 2017", 5.0, "Awesome!", "This bridge is easy to find...just look skyward and you can meander your way over to this unique bridge. Looking down while crossing the bridge, you will have a chance to see different water fowl. I was amazed at all the clean up crews that abounded throughout the park. Due to the flooding from the two weeks before, there was a lot of clearing of debris that was going on and even so, the park was beautiful, as is the bridge spectacular.\n\nThere are so many different routes to take, so bring good walking shoes. There is a snack shop in the gift shop and I saw a few families with their picnic baskets. A wonderful family adventure with leaning tools along each route, so you can not only enjoy the scenery, but learn as you walk.\nShow less"], ["Reviewed March 16, 2017", 5.0, "A lovely stroll into nature.", "We were passing through Redding & needed a rest stop. This park was the ideal break. The bridge is super cool and the setting is ideal if you're looking for a break from the hustle & bustle. Lots of walking & bike trails, views of Sacramento River. There's a gift store, coffee shop & museum too. Ideal for all ages.\nShow less"], ["Reviewed March 15, 2017", 3.0, "Unique Bridge", "This bridge is known by architects all over the world for its design. It is a nice walk or bike ride over the river and around a paved trail. You can walk down under also. The sundial really keeps time.\nThe Turtle Bay Park is good for young kids.\nShow less"], ["Reviewed March 13, 2017", 5.0, "Road trip up the 101 Highway from San Francisco to Redding", "We flew into San Francisco and drove up the 101 Highway to as far as Redding with several stops such as Big Sur in between. It was an enjoyable trip and the beaches along the coast offered some pretty views of the Pacific Ocean. Didn't enjoy driving though the mountains at night.\nShow less"], ["Reviewed March 6, 2017", 5.0, "Love to walk here", "I have been to the Sundial Bridge many times and I love to walk around here in the paths, sit on the benches, get a coffee from the cafe' and take in the sunshine!"], ["Reviewed February 27, 2017", 4.0, "Beautiful area", "We walked over the sundial bridge and the local park. Nice area to enjoy the Sacramento River and a neat architecturally designed bridge."], ["Reviewed February 26, 2017", 5.0, "WOW...really cool site", "You can see the gnomon--the shadow caster--from quite a distance, so it is easy to find your way to this beautiful bridge. The glass bed of the bridge is interesting, although you can't see through it to the river, but the gnomon is huge and really cool to see close up. The river was very high and running swiftly which was exciting to see up-close as you cross the bridge. The bridge connects to numerous walking paths that criss-cross a oak tree savannah...very peaceful and lovely.\nShow less"]]}}