{"Sunset Cliffs Natural Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Sunset Cliffs Natural Park", "url": "/Attraction_Review-g60750-d2476269-Reviews-Sunset_Cliffs_Natural_Park-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/da/0e/82/sunset-cliffs-ocean-beach.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1736"}, "address": {"@type": "PostalAddress", "streetAddress": "1253 Sunset Cliffs Blvd", "addressLocality": "", "addressRegion": "California", "postalCode": "92107-4015", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 3.0, "Too popular with rule breakers and yackers", "Come for the view, endure the selfie taking, nonsense babbling, danger seeking visitors. I think it is becoming a tick the box destination which is too bad. Parking on a Sat night is awful. Maybe a weeknight has a better experience."], ["Reviewed 4 days ago", 5.0, "BEAUTIFUL!", "HIGHLY recommend this stop! Even if you can't do Sunset. We went at 400, and enjoyed it so much, We went to the quaint shops in town and then went back for sunset."], ["Reviewed 5 days ago", 5.0, "Gorgeous", "It was chilly, and windy, but the wind made the scenery that much more spectacular!\n\nWe had a little trouble finding the exact spot we wanted to go to, which is where people have done some cliff-diving (which is strictly prohibited, by the way).\n\nThere is also a staircase that would take you right to the shore, but it is very steep, and is closed for repairs.\nShow less"], ["Reviewed 6 days ago", 5.0, "Beautiful! You won't see a better sunset...", "Just know that it will be you and many others, but the cliffs spread out and there are several cliffs to enjoy. If you want a sunset, this is it."], ["Reviewed 1 week ago", 5.0, "Worth a trip through the neighborhoods!", "We saw a fabulous sunset here while in San Diego. There is plenty of parking (at least in February!). It is a challenge to find, winding through neighborhoods, but thank heavens for GPS!! If you go, DO NOT leave once the sun hits the ocean - the best part of a sunset comes after that as the light hits the clouds.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Always a nice visit.", "With any trip to the Ocean Beach area of San Diego; Sunset Cliffs should be high on your lists of places to see. The views are out of this world."], ["Reviewed 2 weeks ago", 4.0, "Beautiful location; very windy", "Our son and his girlfriend like Sunset Cliffs so included it in our itinerary. It's really beautiful and the sunset fun, but it was so cold and windy when we were there it was challenging to enjoy it for more than a few minutes."], ["Reviewed 3 weeks ago", 5.0, "Beautiful Sandstone Formations", "This was the first beach we visited during our Winter stay in San Diego. The coastline here is mostly cliffs which have been beautifully eroded by time and wave action. There are naturally forming bridges and outcroppings and we spent the majority of time here trying to capture all of this wonder on film. This was truly a very peaceful and relaxing place, with many spots to pull off and walk.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "One of the best sunsets", "Good point to watch a beautiful sunset You might be able to find a parking spot along the road good place for a relaxed walk,crowded during sunset"], ["Reviewed 4 weeks ago", 5.0, "A definite top 10 event", "We got there about 3:15 to ensure we could get parking. Even on a weeknight the parking lots fill up. We saw a beautiful sunset, enjoyed walking on the beach, watched the surfers and just had a relaxing evening. No bathrooms so come prepared. The houses across the street are also worth glancing at. Its just a beautiful neighborhood. Bring a blanket or chair to sit on.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Mother Nature", "Sunset Cliffs Natural Park is one of the most beautiful places to watch a sunset in San Diego. I enjoy a great walk on the beach to release some stress. So I decided to come check out Sunset Cliffs Natural Park. I have to say I'm glad I made the little drive to Sunset Cliffs Natural Park.\n\nAfter taken a nice walk on the beach I decided to stay and watch the sunset. If you are looking for a romantic place to watch the sunset. I highly recommend Sunset Cliffs Natural Park. You could ask for a cleaner park. The city does a great job of maintaining the Sunset Cliffs Natural Park.\n\nIf you live or visiting San Diego Sunset Cliffs Natural Park is a must. One of the nicest place on earth to me is Sunset Cliffs Natural Park. I look forward to coming back again.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful park area!", "Beautiful park, good walking/hiking area! We walked from Ocean Beach all the way around into Sunset Cliffs. Neat neighborhoods with unique homes."], ["Reviewed 4 weeks ago", 5.0, "Beautiful!", "I am sure this is a great place to visit all day long the the cliffs and tidal pools are incredibly beautiful. We happened by on a last minute search for a spot to watch the sunset and we could not have been happier with our choice. If you go for sunset be prepared time wise for a lot of traffic parking and leaving. But it is well worth it.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Breathtaking", "Breathtaking views of the water from the cliffs! Definitely take in the sunset, but you'll want to arrive early as traffic builds!"], ["Reviewed January 23, 2018", 5.0, "You Can Feel the Ocean", "The stops we made along the Sunset Cliffs offered and experience that was a must see for our group from Pittsburgh Pa. The natural beauty of the park is unbelievable."], ["Reviewed January 22, 2018", 5.0, "A great walk by the sea", "Sunset Cliffs Natural Park is a little unknown but a great place to visit and enjoy the sights of the sea and rugged coast. My wife have long been fans of visiting Sunset Cliffs and enjoying an energetic walk and the spectacular views."], ["Reviewed January 22, 2018", 5.0, "Close to the ocean", "Interesting place close to the ocean, free parking and nice photo spots. some areas restricted due to landslide."], ["Reviewed January 21, 2018", 5.0, "Smuggler Cave", "I'm not saying exactly where, but there is a cave under one ot the parking locations at the clifs. If you find it, you can climb down the cliff with the help of a rope that was placed there by some good samaritan.\nIt is recommended to go at low tide.\nInside the cave the afternoon reflection on the cave walls are impressive. Sparkley purple. After your eyes adjust, you'll see a spiral srair case, of course, going up. Be carefun and use your cell phone flashlight to illumunate your way.. It is kind of spooky but fun.\nIt was used for rum running during the failed prohibition.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Fun to visit - scenery excellence", "Fun to visit - scenery excellence. There are many steps if you want to venture down to the water. There are stairs, with landings."], ["Reviewed January 21, 2018", 5.0, "What a Beautiful Walk", "The day I went visibility was not great, but I loved that I could easily park and take a very long walk around this park. Almost every new section is like a whole new beach with different features from cliffs to rocks and cave like characteristics. Absolutely loved it and cannot wait to return on a nice day for a super gorgeous sunset.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Beautiful, don't miss this opportunity", "What a stunning view. Both we adults and the kids loved taking pictures of the family here. It's quiet and beautiful. God has made something gorgeous here."], ["Reviewed January 12, 2018", 5.0, "Best Place for a view of a gorgeous sunset", "One of the very best places to see a picturesque sunset. Have your cameras ready! If you are going just to watch the sunset give yourself about 20 minutes time to find parking. Quaint shops and nice walks in the area."], ["Reviewed January 11, 2018", 5.0, "Beautiful Views", "We made sure to visit this location after seeing all the reviews. It did not disappoint. It is a beautiful spot."], ["Reviewed January 9, 2018", 4.0, "great views", "Another spot with great views of the city. Cool place to watch the sunset. All types of people out. Loved it"], ["Reviewed January 7, 2018", 4.0, "Beautiful", "Awesome place to view sunset! In January it wasn’t too crowded. We found a place to park where you could actually see sunset from the car. We didn’t do that but could have. Nice place to walk around. No development here, nothing commercial. Just nature. That’s the way I like it. I also recommend if you visit here to first visit the light house at Point Loma. It’s a short drive from here and very nice views and neat history. But it closes at 5:00. Enjoy\nShow less"], ["Reviewed January 7, 2018", 4.0, "Free and Beautiful...", "Sunset Cliffs Natural Park is always a treat, but especially later in the day when the sun softens and the colors of the cliffs stand out. Make time to find this lovely spot."], ["Reviewed January 7, 2018", 5.0, "Missing it!", "Was in San Diego for 3 weeks. My Aunt’s house is 1 mile up the hill from sunset cliffs. Every morning I would make my coffee and walk down to sunset cliffs and have my coffee while watching the waves slam into the cliffs. Sometimes you could actually feel the giant boulders bounce. I really hated leaving. Parking is a premium if your going there to watch the sun set so get there early\nShow less"], ["Reviewed January 7, 2018", 3.0, "Average", "The natural park is about the size of a football field which took us about 30 mins to walk round. Quite pretty but some poor graffiti on the rock in the deeper canyon. Good place to take the dog for a quick walk if you're a local. Free parking\nShow less"], ["Reviewed January 6, 2018", 5.0, "What's not to like when on a coastal hike?", "This is a beautiful little area to hike, walk to the beach,enjoy the original natural coast line without fake tourist enticements. Southern California as it was meant to be seen."], ["Reviewed January 4, 2018", 5.0, "My happy place", "I used to live a few blocks from here, and it's one of my favorite places in San Diego. I love to come and read, write, watch the waves crash, and of course, catch every sunset I can."], ["Reviewed January 4, 2018", 5.0, "Beautiful place", "Sunset cliffs is such a beautiful place if you want to go somewhere to enjoy a nice peaceful view this is a great spot. There was a wedding going on on one of the cliffs when we went that's how pretty this spot is. This can definitely be a fun group activity or a romantic site. The water is beautiful there were people jumping in also and some people just walking their dogs or jogging.\nShow less"], ["Reviewed January 3, 2018", 5.0, "THE ONLY PLACE I LOVE TO WATCH THE SUNSET!!!!", "WOW! SPECTACULAR!!!! BREATH-TAKING!!! God's amazing work!!! You must see this place to believe it exists in San Diego! It is opened 24/7 but it is in a residential neighborhood so be mindful. You can park for free. It does get busy at sunset so get there 15mins early if you can. if not, its ok, you will still find parking you just may need to park in the neighborhood. You can bring food and drinks. I love to bring a blanket and have a picnic. I love to take pictures or just sit and meditate. I have seen people practice dancing on the cliffs, take pictures or bring their fury friend to enjoy the beach and the awesome views. It is a must see. I try and go 2-3x a month! If you are in town you MUST come see the beauty of San Diego at the cliffs.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Beautiful views", "This is a must see when you are in San Diego. The sunsets are amazing. Park at the beginning and walk down such a view. Get there about an hour before sunset if you want to be able to find parking."], ["Reviewed January 1, 2018", 5.0, "Classic place to watch sunset", "It's a great place to watch sunset. A cliff gives you an observation point above the sea, the area has nature, the parking is free - can't be any better."], ["Reviewed December 30, 2017", 5.0, "Beautiful Park to watch the Sunset", "Such a wonderful place to spend with friends and family, get back to nature and get away from it all.\nThe walk is tough and you really have to pay attention to your steps across the big stones to get to the beach, but so worth the trouble.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Beautiful views", "It's free and the views are breathtaking. They have tide pools and many areas of beach to explore. A lot of surfers."], ["Reviewed December 26, 2017", 3.0, "Beautiful view of Pacific", "Great view with lots of surfers, but other places are just as nice. We did not view it at sunset. You are so close to the Cabrillo Monument National Park at the top of Point Loma, I would recommend going there for views, unless you are a surfer.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Beautiful views", "If you're in the area, this is a great place to take a drive by and see. Beautiful views that can be seen when you park your car and walk around as well as driving by."], ["Reviewed December 20, 2017", 4.0, "Nice coastline", "If you are visiting the area don't forget to have a look here interesting coastline mainly rocks, footpaths are sandy so wear suitable shoes / trainers"], ["Reviewed December 14, 2017", 4.0, "Best natural place!", "This is the place where I want to come again and again. It is completely natural with no artificial construction. Not crowded. The cliffs offer a panoramic view of the area. It is the perfect beach to watch the sunset. I have been back a couple of times, with wife , with friends. This is one of those few places where you don't need to spend any money to have fun with family or with friends.\nShow less"], ["Reviewed December 13, 2017", 5.0, "sunset watching", "beautiful views of the ocean and just to see the sunset is phenomenal very popular destination for pictures and to take in the scenery"], ["Reviewed December 12, 2017", 5.0, "Best Natural Place in San Diego", "This is the place where I want to come again and again. It is completely natural with no artificial construction. Not crowded. Hence there is only the ocean whom you can talk to. It is awesome during sunrise."], ["Reviewed December 9, 2017", 5.0, "Sun boarding in action", "This is one of the furthest point on Pacific coast of the continental USA. Sunset in a wide open area from the cliff of the coastline adjacent to a winding road is fairly accessible. If you get there early, you can watch sunset from the car. It gives you an extended look of the sun disappearing from the horizon with exotic colors.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Romantic Place...", "Exactly 32 years after I proposed to my wife on the slopes of this park next to Point Loma Light House National Park, we revisited this significant (to us) park. Beautiful views of sunset, sail boats and surfers, it offers a quiet, peaceful and perfect place to begin a life together!\nShow less"], ["Reviewed November 29, 2017", 5.0, "Sheer Ocean Beauty", "Find a parking space and put on your walking shoes as you'll enjoy the majestic ocean views regardless of the height of the tide. Of course, there are the oceanfront houses on one side of the walking path while you overlook the ocean on the other side. Sidewalks are the safest option as narrow paths wind along the cliffs. What a treat to experience the natural coastline and see surfers attempt their sport.\nShow less"], ["Reviewed November 29, 2017", 4.0, "Great place to see the Pacific Ocean and watch surfers.", "Be careful getting close to the edge - the cliffs are starting to collapse and some areas are not marked off properly. The view is amazing and you can see the sea caves in some areas."], ["Reviewed November 27, 2017", 4.0, "Sunset from this vantage point is a must", "We arrived about an hour before sundown. There were already folks with lawn chairs and provisions to take it all in. Even though it was cloudy we were treated to a wonderful sunset."], ["Reviewed November 22, 2017", 5.0, "So beautiful!", "Just the perfect place for an evening walk or to sit and watch the sunset. The pelicans were feasting when we were there and it was pretty cool to watch them dive into the water!"], ["Reviewed November 22, 2017", 5.0, "Wow what a beautiful view!!", "Stumbled on this driving around town and we are glad we did! Very nice views and an excellant place to just sit and enjoy a beautiful day!"], ["Reviewed November 20, 2017", 5.0, "The hype is worth it", "Sunset cliff is truly worth the hype. It's often crowded but when you find a perfect spot on the cliff, the view is absolutely worth the visit. Parking wasn't too hard to find and the view is picture perfect."], ["Reviewed November 17, 2017", 5.0, "romantic sunset spot", "This spot is so pretty for overlooking ocean and watching a sunset, bring a blanket as the ocean breeze can get cool. Also a great photo spot for any photo occasion"], ["Reviewed November 16, 2017", 3.0, "Let me explain", "The reason I gave Sunset Cliffs an average rating is because when compared to other similar views along the Pacific Coast, all I can give it is average. But it has its pluses, so don't be detoured. The views are pretty good, plenty of parking, places to sit and room to walk. It's also not as crowed as La Jolla. If you're just looking for a quiet sitting spot along the ocean, it's a good place to go.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Gorgeous", "Gorgeous spot. Wear good shoes! Even though we didn't experience a beautiful sunset here, I can imagine how incredible it must be when there is one."], ["Reviewed November 15, 2017", 3.0, "Great views and high cliffs along the coast", "There were some nice views here and a few benches but not much besides that. It's fairly primitive -- just a nice spot with some dirt trails from the road. I can imagine it being a great spot for sunset pictures when the conditions are right. There isn't a lot of parking so that might be a challenge around that time of day. If you are using GPS, you need to select \"Sunset Cliffs Natural Park\" instead of just \"Sunset Cliffs\", which will just take you to the center of the village.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Mother nature will humble you", "The views will have you in awe of mother nature and her beauty. Bring your camera because you're going to want to try getting a shot of the massive crashing waves on the rocks."], ["Reviewed November 10, 2017", 5.0, "Pictures!!!!", "I loved this spot, I got some incredible pictures of seagulls nesting in the rocks with wildflowers in bloom. It was just beautiful there with a fabulous breeze. I could stay all day. Great parking and easy to access."], ["Reviewed November 9, 2017", 5.0, "I have a million pictures of this place", "It's truly beautiful and unique. I love the arches and caves, in the afternoon they are lit perfectly. Go when it's wavy, but don't get too close or you'll get splashed. I always manage to see some birds when I'm there- herons, pelicans, of course gulls. In the Spring the flowers are abundant. Beautiful any time of year.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Get your excercise while enjoying sweeping views of the ocean", "This is one of the most beautiful places in the world. Great place to go for a walk, with your dog or solo. I try to walk here several times a week. Stunning views and excellent photo ops daily! You can see the Pelicans flying over and gulls.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Great place for pics", "Even during the day the views along the cliffs were spectacular and worth the drive. Car parking is free and it is a great place for all photographers."], ["Reviewed November 3, 2017", 5.0, "High cliff view", "Beautiful ocean views. You can walk out on the cliffs and enjoy beauty of the Pacific ocean. Beautiful cliff side homes."], ["Reviewed October 31, 2017", 3.0, "Photo Hot Spot", "A must-see for photographers. It's very pretty, even if you aren't there at dawn or dusk. I thought the parking lot was a little tricky. As someone who is NOT a photographer, I would not necessarily put this as a must-do."], ["Reviewed October 23, 2017", 5.0, "Amazing", "Definitely worth the time and the trip. Part of the fun was sitting in anticipation of the coming sunset. We had dinner a rushed to make it to the cliffs. Parking can be a challenge so plan accordingly. Oh the colors and sounds. Absolutely amazing."], ["Reviewed October 22, 2017", 5.0, "Beautiful cliffs and ocean views", "The cliffs are quite amazing and the area to walk around and view the cliffs is varied and interesting. Great views all around. Great place to walk or just sit and watch the waves crash in!"], ["Reviewed October 21, 2017", 5.0, "Favorite spot", "This is my favorite spot in San Diego. Great place to hang out and watch the surf and waves roll in."], ["Reviewed October 21, 2017", 5.0, "Amazing surfing and views", "We spent an afternoon here watching the waves hit the cliffs and the surfers enjoy the waves. It's a beautiful place that's great to sit and talk, hike, run or jump in and surf. There's a breeze, so take your windbreaker if you're not surfing. Also, bring a camera as there's instagram gold here with the amazing views.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Nhe clouds and thereat if you catch tice place for a beautiful sunset and a glass of wine. But don't be careless,", "Nice place for a beautiful sunset and a glass of wine, but don't be careless. The cliffs are steep. and the views are great if you catch the sunset with the right cloud covering. Try to avoid going on the weekend the and during the day. It's a popular place and parking is hard to come by. Don't forget your camera.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Gorgeous For a Hike", "It's free and it's a beautiful hike in this neighborhood by the ocean. Be careful of where you are walking as there are some areas that are more \"open\" and a fall from any of these places could result in serious or fatal injury. It's all fairly well marked, but still, there seem to be people crossing the road at all sorts of places.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Beautiful", "Parking may be a challenge but once your here it's very nice. Lots of walking, sightseeing to do. The views are fabulous. You can get close to the seals but get ready for their awful smell!"], ["Reviewed October 16, 2017", 5.0, "Beautiful views", "Great place to see the cliffs and the sea. Parking is tight, but good if you find a spot close by on the sea road. Love the views."], ["Reviewed October 13, 2017", 5.0, "Best Views!!!", "We just \"stumbled\" onto the Sunset Cliffs Natural Park while driving along the coast line. What a fine. Great \"HIGH\" views of the Pacific Ocean and wonderful homes in the area. Highly Recommended."], ["Reviewed October 12, 2017", 5.0, "The Ocean from a Different Perspective!", "You are not heading out to sunset cliffs to swim that is for sure. This area is very dangerous. I would not bring small children out here. The cliffs are steep, the water is forceful and there is a real risk of falling if not careful. With all that being said, it is an amazing sight to see. There are plenty of areas to safely walk / hike. There is an area that you can take steps down to the water. Again, it is wet and slippery but the little caves down below make for great photos. It's an amazing place to watch the sunset.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Beautiful views", "Took a ride here and it was very picturesque...scenery was fantastic. Only stayed for a few minutes."], ["Reviewed October 12, 2017", 5.0, "Unbelievable sunset, lively with locals, a must see!", "Arrive early to get a good parking spot and walk down the steps towards the water. You will see the surfers with their lively expression of lust with this time of the day and enjoying the best way to experience it as they told me when stepping down into the Pacific Ocean. I think they are full of courage and adventure so that was super fun to watch. I stayed back but you can make your way through the rocks on low tide to experience the cliffs from a different angle. My husband took great pictures so I know it is worth it. Enjoy a romantic sunset and walk around to get an experience of the local flavor. Enjoy!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Magnificent after good rains in the spring", "Easy to moderate hiking. Beautiful views of the ocean and the eroded hills. Ok to take a dog on a leash. Bring water if it's hot outside. At certain places hold hands with your little ones."], ["Reviewed October 10, 2017", 5.0, "Great sunset views but please be careful", "Having grown up in the area, I've got to say that this is an amazing place to go to watch the sunset. It's also great to go and watch the surfers or just take in the beauty. It's pretty busy and you can expect to share it with a few hundred others if the weather is good.\nYou can climb (it's not an easy climb) down to a few small beaches. Don't pack your sun umbrella though, you probably wont want to climb down with it.\nPlease, be careful and stay away from the edge. A few times a year we have people die when they fall off the cliff. The edge can be slippery and unstable so be aware.\nShow less"], ["Reviewed October 9, 2017", 5.0, "A Definite Must See! 😎🐕🐬☀️🌛", "WOW, this will leave you awestruck, Especially if your seeing the Mighty Pacific Ocean for the first time, or watching the Sunset!\nYou will witness surfers, locals, vacationers and, Mother Nature at her Finest. Many people come to see this from all over the States and the World.\nIt's also a favorite for couples or anyone, to bring beverages and, watch the Sunset, This Is a MUST See! I can't tell you, how packed it gets so, be sure to arrive early as there's extremely limited parking! You'll love it and, Safe Travels!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Hiking Paradise", "Beautiful scenery, and a good place to study the sandstone cliffs that comprise the area's geography. Careful though--the cliffs are eroding, and are unstable, expecially after rains. There is a good hiking path along the ocean, and a few places to get down to the sand, if you know where to look.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Very Pretty", "I really enjoyed this part of my visit to San Diego. It was truly a site to see. I was able to park fairly easily but I’m sure sometimes it can be a challenge depending on the day. Therefore get there a little early if you can.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Perfect view for end of the day!", "Always loved this view! Haven't been in a very long time but it was nice to see it hasn't changed much!"], ["Reviewed October 4, 2017", 5.0, "WOW!! Most amazing sunset view!", "If you are in to sunsets, this is a MUST see while you are in SD! Without a doubt the most breathtaking sunset view I have seen in my life! Be sure to bring your camera to capture the beauty and splendor. Even the most novice of photographers will leave with museum quality photos!\nShow less"], ["Reviewed October 4, 2017", 5.0, "dream rental", "The accommodations as well as the view and the location are just the beginning of a perfect setting. The host and hostess are lovely people who feel like friends, the second you meet them"], ["Reviewed October 3, 2017", 3.0, "Pretty sunset", "The cliffs were really pretty at sunset, but it does get a little crowded for a romantic spot (not crazy crowded, but not private either). But it was still worth the drive out!"], ["Reviewed September 29, 2017", 5.0, "Must go at SUNSET!", "This is the most beautiful and peaceful place and is very romantic.It is a must see while in San Diego. I had never seen anything like it!"], ["Reviewed September 24, 2017", 4.0, "Really nice place for a stroll", "Great place to feel like you're so far away from the city, but still only minutes away. There are places to park and you can soak up the great views of the pacific."], ["Reviewed September 24, 2017", 5.0, "Beautiful views", "This was a beautiful area,we enjoyed the walk, the sunset and watching young kids jump into the water below.We took a bus here from Old Town at the recommendation of people attending the conference. I wouldn't do that again I would recommend a renting a car, or getting Uber, We took Uber back to the convention center.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Gorgeous Views", "This is a perfect place to watch the sunset. The sand, cliffs and ocean make for a gorgeous setting. It wasn't crowded at all when I was there, so it was nice to have some peace and quiet."], ["Reviewed September 21, 2017", 5.0, "Amazing view of the ocean", "If y'all are in the area of Ocean Beach definitely come to Sunset Cliffs Natural Park. The park is well run. It's free to the public. Plenty of parking. Porter party are there if y'all need to use the bathroom. There are trails to walk. Hamlet to sit and enjoy the ocean. There is a beach down below. There is a man made trail down the beach. If you have small kids or elderlies, I wouldn't go down the trail. About 1/4 of a mile is a walk way and steps that is more user friendly. Once you get down the beach it is gorgeous. You can swim, surf, sunbath and etc. Definitely worth coming here. Before this Natural Park, about 1 1/2 miles away from here is Sunset Cliff Beach where folks comes to cliff jump into the ocean. Some cliff jump from 30 feet or higher.\nShow less"], ["Reviewed September 20, 2017", 4.0, "Breathtaking views", "This drive to, walk to spot is beautiful & perfect for the many activities we saw there. From a wedding to those who enjoy the sun & swimming in the ocean, if you can find the spot where you can get down to the water & back, you are good. Even just viewing, which is what we did, was awe inspiring. Check it out!\nShow less"], ["Reviewed September 20, 2017", 5.0, "Simply Beautiful", "A beautiful walk along the cliffs. with little coves if you want to chill or sunbathe. great views of the cliffs, the ocean and of course the sunset! well worth a visit!"], ["Reviewed September 12, 2017", 5.0, "touring city on vacation", "Beautiful place to visit but be careful a lot of dangerous fall off places. As there are really no fences and its a pretty place to see the ocean tho."], ["Reviewed September 6, 2017", 5.0, "Sunset Paradise", "One of the best places on earth to watch an unobstructed view of the pacific sunset...people flock from all over the world just to witness the \"green flash\"...which occurs when the tip of the setting sun aligns with the horizon...gotta be quick, the \"flash\" comes and goes within the blink of an eye...\nShow less"], ["Reviewed September 6, 2017", 5.0, "Beautiful Beautiful Beautiful!!!", "Best sunsets, great walk, refreshing ocean air! This is a must visit in San Diego! Sunset is my favorite time to visit."], ["Reviewed September 6, 2017", 5.0, "Scenic route", "While visiting family and friends we decided to take a walk in this area. What an amazing landscape! Plenty of spots along the way for pictures and just to take in Mother Nature...."], ["Reviewed September 6, 2017", 5.0, "Oh what a sight", "Quick little walk to view. Amazing views, wildlife and relaxation area. The sounds of the ocean made me want to sleep. Don't miss out"], ["Reviewed September 6, 2017", 5.0, "must see at sunset", "This is a beautiful place to see.cliffs.water hitting the rocks.you can see surfers too.it is free and free to park.the view is awesome. Go about a half hour before sunset.follow the sunset cliff road to the entrance..the first.parking lots are small.and crowded.keep going.to the big parking area..it is worth visiting.so beautiful here.\nShow less"], ["Reviewed September 5, 2017", 5.0, "A great for scenic photos.", "Just love this place for our scenic ocean photos. Be patient about the parking. Not always good parking available."], ["Reviewed August 26, 2017", 4.0, "A walk with a pretty view", "I went in August, mid-afternoon with 2 people and a dog so we didn't see the sunset views but it was still lovely to have great coastal views. It was busy but not packed. People jog, bike and walk in the area. There's roadside parking and we had no trouble parking (perhaps it's more difficult at sunset). Enjoyable and I'd go back. Downside for some: I'd keep younger kids under close watch as there is no barrier to stop them from falling off the edge (to put barriers up would spoil the natural beauty I think). We saw people on the beach below and wondered how they got down there. There's a gap to get down but only for the fit and able - if you resemble a mountain goat you'll be fine! Not safe for the very young and elderly at all - stay on the cliffs folks!\nShow less"], ["Reviewed August 25, 2017", 5.0, "Nice View", "We went to Sunset Cliffs several times during our one week vacation as we were staying nearby. In the afternoon it is an enjoyable spot to sit and watch the young daredevils jump off the cliffs into the water below. In the evening it is a popular spot to watch the sunsets. The view is beautiful with crashing waves hitting the reddish brown cliffs. I would not recommend taking young children to the cliffs as you can walk directly up to the edge. If you plan on going at sunset, arrive early as the place gets very crowded and parking lots fill up quickly.\nShow less"], ["Reviewed August 24, 2017", 3.0, "ok", "very crowded at sunset. people climb down the cliffs even though it is clearly marked not to. better places to view ocean sunsets"], ["Reviewed August 23, 2017", 5.0, "The best sunset of my life", "I lived there for 1 month and every day I enjoyed the sunsets... Sunset cliffs is a typical californian city... Awesome"], ["Reviewed August 20, 2017", 5.0, "Awesome views with hidden cave!", "Easy trail, it has a nice scenery. Great view to take your wife for a hike along the cliff trail looking at the ocean. If you willing to be more adventurous and go to the hidden cave you have to ignore the sign that says do not go further. It's well worth it !!\nShow less"], ["Reviewed August 20, 2017", 5.0, "Beautiful views of the rugged cliffs and ocean", "It's both a beautiful drive and walk. You can also get down to the ocean to a small beach and along some rocky benches. Lots of free parking here, but it can difficult to find a spot because of the popularity of the area."], ["Reviewed August 19, 2017", 5.0, "As beautiful as ever", "I have been to the cliffs probably 5 or 6 times in the visits I have made to San Diego over the past 4 years. Very peaceful and stunning to me! I really enjoy just watching the waves crash over the rocks below the cliffs. Definitely wear comfortable, \"safe\" shoes (i.e. with tread) as it can be easy to slip. I would not recommend flip flops unless you are just stopping to take photos and not do much walking.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Take a walk on the dirt side, watch your step ;)", "Absolutely beautiful view of the waves crashing into the cliffs. I haven't made it for sunset yet. Best to visit on a clear day. Parking available along the cliffs; however, difficult to come by at times. You can hike on the dirt path along the road and even make your way down to the ocean in places. It only took me 10 minutes to drive here from Pacific Beach.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Beauty on the edge of urban sprawl", "We've been here often. The cool of the beach will never lose its appeal to the two of us stranded in the Mojave for so long. Not a lot to the beach other than some rugged red cliffs bombarded by crashing waves. But its more than enough for us!\n\nThe price is right too! Free admission and free parking!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Gorgeous.", "This is one of the most beautiful places you'll find anywhere. Watching the sunset in the evening, on top of these massive cliffs, is an experience you won't forget."], ["Reviewed August 16, 2017", 5.0, "The name says it all", "This is one of the best and iconic places for catching a stunning west coast sunset. I would rank it #2 behind La Jolla Cove."], ["Reviewed August 14, 2017", 5.0, "One of the best places to watch a sunset", "I love watching both sunrises and sunsets and I am an amateur photographer so the place I was told to go is Sunset Cliffs. Very scenic and a good advantage for sunset shops. The day we were there there was a marine layer (weather related not military) that set in before the sun fully descended which restricted the potential for a great shot. If going for photo session you might check the weather or locals to see if the marine layers have been prevalent. Clearly the location is great if the weather cooroperates.\nShow less"], ["Reviewed August 13, 2017", 3.0, "Nice rock formations", "Arrived around 7pm the air was cool may want to take a light jacket. Should wear flat shoes, some area may be difficult to walk on( the small kids) But it is a nice area to sit and enjoy the ocean sound and the kids can sit and play wit the sand. Park on side of road.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Stop at the look out points", "If the lot at the Natural Park is full, the look out points just north of the park offer exceptional views as well!"], ["Reviewed August 10, 2017", 5.0, "Wedding pictures", "Superb ocean view and rock formations to set up a great locations for wedding party pictures. The natural nature of this location was the appeal to us."], ["Reviewed August 8, 2017", 4.0, "Beautiful views", "What great views! Did not get to watch the sunset but I could only imagine how beautiful it would be here. I would definitely love to revisit and I recommend to anyone who has the time."], ["Reviewed August 8, 2017", 5.0, "What a way to spend the end of the day!!!!", "The park was enjoyed by all from ages 10-70. The park is on a set of cliffs overlooking the Pacific. We were there for sunset and it was SPECTACULAR!!. There is a set of stairs and it goes all the way down to the ocean. The view with the cliffs, the rocks the ocean is NOT TO BE MISSED. The park is in a residential area and it was nice to be out of the downtown area for a little bit. A little off the tourist trail but well worth it.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Magnificent sunsets", "Get there 40 min before the sunset. You will definitely enjoy the view. Plenty of space to park. Get a chair or something to sit on."], ["Reviewed August 5, 2017", 4.0, "Buena Vista!", "The view of the San Diego bay, downtown, Coronado bridge, all the Navy activity. Plus the history of the area, make a lovely afternoon or morning trip."], ["Reviewed July 30, 2017", 4.0, "Ditch the fine dine restaurants and have a night here....", "We visited this area as part of our 28 day road trip from Seattle to San Diego via the PCH (Pacific Coast Highway) while staying three nights in San Diego and it was a recommendation off a friend which didn't disappoint.\n\nWe're from the WALES (UK) so for us it would have been so easy to spend every night in San Diego at a nice restaurant but we decided to take the advice of a friend and head over to this beautiful coastal spot which seems to avoid the crowds of San Diego.\n\nTake a blanket to sit on, a few drinks and some snacks find a spot on the cliffs and just watching this magnificent sun set and embrace that life moment.\n\nIt's easy to get to and we were staying over by sea world and it was about 10 minutes from there.\n\nFor us personally give me this evening any day over eating $100 dollar oysters in a fancy restaurant.\n\nAll in this well worth a few hours of one of your nights in SD, don't dress up just turn up.\n\nEnjoy and see the peaceful side of San Diego.\nShow less"], ["Reviewed July 29, 2017", 4.0, "A Place to Relax", "Stunning views of the ocean and access to the rocky beach below are the main points for this small park. There is a nice sized parking lot just above the ocean and there are steep stairs that lead to the tide pools and small beach below.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Beautiful Views", "During our stay in san diego, we caught our first California sunset on these cliffs. We were there early so parking wasn't a problem. Well worth the beautiful view!"], ["Reviewed July 26, 2017", 5.0, "A San Diego Must Do!", "If you are in the area and are into National Parks, this is a must see! The view is gorgeous and well worth the drive."], ["Reviewed July 26, 2017", 5.0, "Beautiful View but I stayed back from the edge", "We had this view for an entire week and it does not disappoint. Saw people doing yoga every day, saw what must be engagement photos being taken, saw a wedding party getting photos. Areas are blocked off with high fences due to significant erosion. A local man told us of enormous portions falling off around July 4th. They fell onto a popular public area where people hang and sunbathe. Luckily nobody was there at the time. You can see where large portions of natural cliff and man made support have fallen away. I didn't get too close to the edge that is for sure. A beautiful place. In the future, the houses across the street will be ocean front!\nShow less"], ["Reviewed July 25, 2017", 1.0, "SAVE THE GAS", "There are many cliffs to see in Callie, these arent the ones. Go elswhere. Dont waist the gas or time."], ["Reviewed July 25, 2017", 5.0, "GORGEOUS!", "The walk along the cliffs is gorgeous, relaxing and the epitome of everything San Diego! You'll find the area where teenagers and adults alike brave the fall and jump off the rocks to the ocean below. Thrilling even if you are just watching (like us)!!"], ["Reviewed July 24, 2017", 5.0, "A definate \"Must See!\"", "When in San Diego it is well worth the drive up the coast to visit Sunset Cliffs. The view of the cliffs and the water is worth the drive. There is minimal parking available.\nBe careful if you go out on the cliffs. The waves may surprise you!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Love Sunset Cliffs!", "We travel to California once a year and we always make the drive to San Diego to Sunset Cliffs. It's a gorgeous view and neat to watch people jumping off the cliffs and the seals swimming around. You must stop while in the SD area!"], ["Reviewed July 20, 2017", 4.0, "Popular - Get There Early", "This is a very popular spot to watch the sunset from and it is also not unusual to see a wedding on the cliff, so like so many other places in San Diego the parking can be a challenge. There is a nice walk along the cliffs so recommend you get there early to get parking and enjoy the views from the cliffs, then take in the sunset.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Breath-taking", "Bring Wine and Beer, sit on the cliffs that overlook the Pacific and watch the Sunset. Perfect location for a proposal..."], ["Reviewed July 18, 2017", 5.0, "Best sunset ever", "We were lucky during the June Gloom to catch one night with no fog and beautiful sights! Amazing sunset and can watch the water hit up against the rocks. Unbelievable!"], ["Reviewed July 17, 2017", 5.0, "Worth a visit!", "Sunset cliffs is definitely worth a stop. Even though we didn't go at sunset the views were still amazing and the kids really enjoyed. The park is an easy drive, free parking, and when we went it was not over crowded."], ["Reviewed July 16, 2017", 5.0, "Worth the climb", "If you come here make sure you climb down to the private beach. Dog friendly, beautiful, but bring an umbrella."], ["Reviewed July 13, 2017", 5.0, "Best sunset view in San Diego", "Don't be an idiot like me and forget your camera. You will regret it, best views ever! Don't be inpatient and leave before the sun goes down."], ["Reviewed July 12, 2017", 5.0, "Cliff's a Go", "Visualize a 180 view of the Pacific Ocean, surfers, and a rugged coastline with crashing surf. I stood there and just absorbed the ambiance. Now it's your turn to enjoy the experience."], ["Reviewed July 12, 2017", 4.0, "A Must", "We are from the east coast and this sight was on the list of things to see near San Diego! We were only in San Diego for a few days and I'm glad we saw this sight. When we got to the cliffs it was cloudy, so we did not see the sunset. If you want to see this spot I recommend going for sunset, and if it is cloudy try another night! We did not have time to come back here to see the sunset but it was still beautiful. They have paths to walk and a staircase if you want to go down to the water. (Just be careful, especially with kids!) We sat on a bench and watched the very brave surfers at the bottom of the cliff ride in waves. On the east coast we have nothing like this, it was wonderful to see. Definitely bring a camera and a jacket/blanket, it gets chilly at night (we went in June)!\nShow less"], ["Reviewed July 11, 2017", 5.0, "A Must See", "A local merchant told us about visiting the park at evening. We were very glad he did. Views are breathtaking."], ["Reviewed July 10, 2017", 4.0, "Sunset Cliffs", "Worth a drive & if you have time, walk. The views of the ocean Cliffs are beautiful, there are a couple of beaches people were on. The multi-million dollar homes are breathtaking, definitely worth a look."], ["Reviewed July 10, 2017", 4.0, "Nice View of the Cliffs and the Pacific Ocean", "I've found this wonderful cliffs while using Google Maps. So, I've told my family we should go and visit and we did.\n\nI don't like to go near the cliffs. I feel kinda dizzy just by looking at it and I was not even on the edge. Just stay on the safe side and watch all those warning signs. It was there for a reason. Try walking down the steel staircase and feel the cool sea breeze on your skin. There were few people swimming and a scuba diver getting ready for his dive.\n\nFor me every Sunset locations here in San Diego has its own distinctive mark, so might as well visit them, one at a time. :)\nShow less"], ["Reviewed July 10, 2017", 3.0, "Ocean Views and Steep Cliffs", "Unfortunately both times we tried to see the sunset here it was very overcast and cloudy. It still was very pretty, especially the sandstone natural cliffs and rock formations. there are lots of signs warning tourists to be careful when taking photos as the edges of the cliffs drop off. There is a lot of free parking\nShow less"], ["Reviewed July 9, 2017", 5.0, "Wow! What a view.", "Sandstone meets the Pacific for awesome natural cliffs and rock formations. Be careful when taking photos. Every year the paper has stories of tourists falling while taking selfies. We take out of town guests and enjoy watching the waves hit the cliffs. Locals fish from the rocks. A nice place to walk and you can often find parking.\nShow less"], ["Reviewed July 7, 2017", 5.0, "What a Beautiful Place..", "Sunset Cliffs in a beautiful place. Go enjoy a nice walk, relax and enjoy the beautiful surroundings and ocean. Watch the sunset. A must to see and visit. Had wonderful day with family..."], ["Reviewed July 7, 2017", 4.0, "Great views but don't go on a cloudy day if you want to watch sunset", "It was cloudy when we were there, so we couldn't see the sunset. However, it's still a pretty place. We brought dinner to eat there, but it was too chilly to sit outside. There are lots of free parking along and on the side of the roads if you keep driving down. The light house is not too far from there, but it closes very early, so we missed that too. I wish I lived in one of those houses around there that get to watch the sunset every single evening. One side is residential and the other side is the cliff and the ocean below.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Beautiful but better with beach access", "Beautiful, no beach. Still, if you want a fantastic sunset it is the place to go!!! Not too many people considering it was the 4th of July."], ["Reviewed July 3, 2017", 5.0, "Do you have legs and eyes? Then go here!", "Some of the best views and hiking in San Diego! You can't beat being so close to the water and you'll find something new every time you go."], ["Reviewed June 29, 2017", 5.0, "Lovely!", "We loved walking around here before sunset, and then finding a spot to sit and watch the sun sink into the ocean. Plan on a bit of extra time so you can explore - there are lots of nooks and crannies."], ["Reviewed June 28, 2017", 4.0, "Beautiful", "Nice and different place. Nice view. Be careful with children. Nice place to be quiet Really easy to drive there"], ["Reviewed June 28, 2017", 5.0, "Stunning!", "It's been years since I've visited the cliffs and it did not disappoint. Absolutely stunning and all ages can appreciate the beauty of the Pacific. The cliffs have no barrier, so I do not recommend little ones be without intense supervision. That said, my 10 year old couldn't stop taking pictures!\n\nShow less"], ["Reviewed June 22, 2017", 5.0, "Beautiful park!", "This is a beautiful park and definitely worthy of a visit. When we went, it was a bit chilly but the views were still fantastic. It was easy to find parking and the park extends for quite awhile. You can walk or go out on the cliffs. Would definitely recommend!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Free Natural Beauty and Scenic Ocean Views", "San Diego has a lot of ticketed attractions to visit - this is not one of them. With no admission required, and no ticket to pay for, this is where you can freely admire the natural beauty of the Pacific Ocean while walking on a well marked trail. Saw lots of picnic-ers along the trail too, so you can consider spending an afternoon by the water. There's no bad view along Sunset Cliffs.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Great place to visit", "The view of the surf, rocks and the beach is magnificent. We parked in the designated parking and was able to see everything. There also is a path along the cliffs to check out the scenery. Free parking."], ["Reviewed June 19, 2017", 5.0, "Must See", "This is simply another beautiful beach area in the San Diego area. It was a bit difficult to get there due to a lot of closed roads. We had a navigation system that spent a lot of time recalculating. The cliffs are dramatic and the waves and water beautiful. We missed the sundown which I heard was even more gorgeous. If I return to San Diego, I will certainly make this stop again. I highly recommend it for anyone making this trip.\nShow less"], ["Reviewed June 19, 2017", 5.0, "OMG", "When my Uber dropped me off, I already knew it would be good. I got to sit with my legs dangling off the side of the cliff and watch the sunset. God showed out and I was not disappointed."], ["Reviewed June 16, 2017", 4.0, "Sunset Watcher", "Came here to watch the sunset, just like everyone else. Get here a little early to avoid the parking rush right before sunset. Sunset was good but not spectacular the day we went. Still, always good watching the sun sink into the ocean..."], ["Reviewed June 12, 2017", 5.0, "Awesome View", "We went to Sunset Cliffs during the day. The weather didn't cooperate for a sunset. The cliffs are beautiful and it was fun to see a different shoreline with the cliffs"], ["Reviewed June 7, 2017", 5.0, "A MUST SEE", "Such a breathtaking view! A little too high for me lol!!! but if you don't mind being a dare devil and taking the steps on the side of the cliffs for a closer view of the caves, then so be it! Highly recommend to see"], ["Reviewed June 5, 2017", 5.0, "So beautiful", "Great place to watch the sunset. Remember to get a coat, it can be quite windy (cold wind). But it worths!"], ["Reviewed June 2, 2017", 4.0, "Great natural setting", "Went to the Sunset Cliffs Natural Part while visiting Cabrillo National Monument. What a great hidden surprise. Great views and wonderful people telling us all about the local wildlife and sea life."], ["Reviewed June 1, 2017", 5.0, "Perfect spot for....", "Sunset Cliffs is the perfect spot for.....\n-A date\n-A proposal\n-Watching the sunset\n-Meditating\n-Watching the waves crash into the cliffs\n-Practicing your landscape photography skills\n\nI'm sure my list can go on. It's a beautiful spot to bring your out-of-town guests to showcase why we pay the amount we do to live in this gorgeous city. Of course it's lovely to come here on a warm day, but it's also equally as nice to come here on a stormy day too. I love to watch the waves crash into the cliffs and the sea spray fills the air. It makes you feel alive!!\n\nThe weekends always have the most people, but I've found parking to be pretty easy no matter when you come.\n\nMake sure you bring a light sweater as it does get a bit chilly/windy.\nShow less"], ["Reviewed June 1, 2017", 5.0, "AMAZING", "Many great places to take pictures and people were even fishing. Trails are good for runners, parking may is a bit tricky but tend to open up quickly."], ["Reviewed May 31, 2017", 5.0, "Dramatic view and thrilling walk", "This was such unexpected visit to the cliff as i have never seen any thing like this. The cliff-side offers dramatic view of the pacific ocean, with somewhat visible decay of the cliff side over the years. There are several spots that offers dramatic view on the beach below where you are just baffled how the beach goes and locals get down there!. It is perfectly safe and manageable to walk (for now) along the cliff side for one or two miles, or the entirety if you feel like it.\n\nWe are just constantly amazed at different stages of the cliffs at varying level of decay, some patches were a bit sketch as they don't have a designated walk path. You sort of have to share the road with ongoing traffic and cyclists.\nShow less"], ["Reviewed May 30, 2017", 5.0, "Beautiful view", "Sunset cliffs is great place for viewing the sunset but has much more to offer. It's a great place to go on a walk, run, bike ride or just watch the crashing of waves."], ["Reviewed May 29, 2017", 5.0, "Absolutely Beautiful!", "This was our first visit to the cliffs and the views do not disappoint! Parking is a little hectic when going during \"peak\" time (when the sun is setting) but well worth the hassle!"], ["Reviewed May 27, 2017", 5.0, "exactly as advertised: beautiful cliffs to watch the sunset", "This is a really beautiful place to watch the sunset. We got some great photos. Yes, they are cliffs, but you couldn't hurt yourself here unless you do something really stupid."], ["Reviewed May 24, 2017", 5.0, "Don't miss this!", "This was on our definite to-do list while in SD. Our Uber driver on another day told us Sunset Cliffs wasn't a big deal, you're not missing out if you don't go, etc. SO GLAD we didn't listen to him! We are from FL so cliffs, beach & sunset into the Pacific is a big deal! Took lots of pictures. So peaceful. Just go.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Amazing views of the ocean, not just at sunset", "Sunset Cliffs is one of my favorite spots to visit when I'm in San Diego. It's fun to explore the cliffs and see all of the littles holes and nooks. However, it can be dangerous so be careful. While it is tempting to wear flip flops given that its San Diego and you're at/near the water, the footing can be suspect in parts so good shoes are advisable. There is also going to be a ton of traffic (both auto and foot) so patience is important. Just breathe easy, keep in mind that you're in one of the best spots for viewing the ocean, and relax. Don't be in a rush.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Relieve some stress and go.", "Bring a jacket as the breeze at sunset may be cool. Well worth the time for people watching, listening to the surf and gorgeous colors as the sun sinks over the ocean."], ["Reviewed May 23, 2017", 4.0, "A Fantastic Place!", "Sunset Cliffs is truly a fantastic sight to see with the crashing waves and the view out to the sea. Visited during the day so we didn't see the sunset, of course, but it was still quite beautiful."], ["Reviewed May 23, 2017", 5.0, "Amazing sunset", "This was our first stop, we walked and waited for the sunset, it was simply beautiful. Take a camera and capture the moments of the sunset, perfect outing for a relaxed evening."], ["Reviewed May 23, 2017", 5.0, "Nice relaxing, views!!", "I have relatives in area and spend a couple times a year in area. Amazing views. Have seen some picture taking sunsets over the last few years. Watch your step, as it is very dangerous for young kids, older people.\nGreat place to hang out to enjoy ocean views near a cliff.\nShow less"], ["Reviewed May 22, 2017", 5.0, "My all time favorite beach", "although illegal if the tide is high and the surf is calm you can jump off the cliffs into the ocean. Certainly not for the faint at heart. a very romantic stretch of cliffs that eats away at your soul years after you leave. A must see every time I'm in San Diego.\nShow less"], ["Reviewed May 22, 2017", 3.0, "Okay, just a beachy spot", "This beach, with the pacific cliffs and crashing waves, is beautiful but I'm not sure it stands out in San Diego with so many amazing options."], ["Reviewed May 19, 2017", 5.0, "Beautiful!", "This is such a great place! Breathtaking and must-see at sunset. It's an easy drive and easy walk. It's a great place to unwind."], ["Reviewed May 19, 2017", 5.0, "Best views of the sunset in San Diego", "This was very close to the area where I stayed. I walked down one night to watch the sunset, and it did not disappoint. It was gorgeous. Lots of people gather and it's a really nice place to be. Highly recommended."], ["Reviewed May 16, 2017", 5.0, "Beautiful sunset", "Came and watched an amazing sunset. Parking appeared tight (I walked and took an uber back to the hotel) and would suggest the same if you can (or get there early). I was there over an hour ahead of time and could read while sitting on some rocks it was very peaceful.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Worth a trip", "These cliffs are certainly an attraction for a photography enthusiast. It can be very windy so pack a jacket. You can come here to catch the beautiful sunset after a trip to Cabrillo National Monument."], ["Reviewed May 12, 2017", 4.0, "Gorgeous views!", "Make sure to check out the sunset if the fog/clouds allow for it. Easy access and a fair amount of parking."], ["Reviewed May 11, 2017", 4.0, "Sunset cliffs a must do!", "Great place fabulous view unfortunately it was cloudy the days we were there but still very much enjoyed the cliffs, very scenic!"], ["Reviewed May 10, 2017", 5.0, "Cliffs", "Nice rock formations from the erosion and even a tunnel. The flowers that are growing on the hillsides make for some pretty good photos."], ["Reviewed May 10, 2017", 5.0, "One of my favorite spots", "Even though you definitely don't have to go to this specific area to watch the sunset in San Diego, I absolutely recommend it because the view here is gorgeous!! One of my favorite spots for sure.."], ["Reviewed May 2, 2017", 5.0, "OMG- WOW what a place. Not to be missed ever", "Do not miss this place, it has to be one of the most beautiful places to see the water and land meet with the sunset in the backdrop. Awesome cannot begin to state its natural beauty. Not to be missed for sure."], ["Reviewed April 30, 2017", 5.0, "Pleasant visit", "Cool place, don’t need to spend much time here. This was a neat place along the coast and would be perfect to watch the sunset. There isn’t much parking, but we just parked on the street in a neighborhood a few blocks away. There was no designated seating that I could see, so if you are wanting to sit and watch the sunset, I suggest bringing a chair or blanket if you do not want to sit in the sand or on the rocks. There are a few signs warning of unstable cliffs. There were also a few small beaches I saw people on, but did not see how they were able to get down there. I would assume with some very safe climbing. I saw a surfer with a surf board, but saw no way for him to get to the water was it was a drop off at most places. You could probably walk from one end to the other in 30 minutes or less.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Sunset Cliffs", "Worth driving there! Beautiful. I didn't even plan to stay, just drove by park (all the parking was free), and enjoy a nice walk."], ["Reviewed April 26, 2017", 5.0, "Amazing...must see in San Diego!", "I tend to be cynical about \"must see\" places that end up being lackluster but let me confirm what many others have said---this is a must see site in San Diego!!!!\n\nI went on a not so busy weekday after work to watch the sunset. There were sunset yogas classes on the cliffs. The area is roughly 1 mile worth of coastline with the Pacific Ocean jutting up against it. There a unstable cliff warnings all over so mind these. My advice for those who want to walk, or jog as many did, the coastline (which I suggest); drive or have Uber drop you off at the Sunset Cliffs Nature Park and then walk the mile back. Or you can do the reverse depending on what direction you'll ultimately want to be in at the end.\n\nIt's a totally walkable coastline. There are stairs where you can walk down closer to the waves. Not many people on the small slither of beach. I enjoyed sitting on the stable cliffs and watching the sunset. I did get a little red dirt on my exercise pants but not a big deal. You can always bring something to sit on or use one of the benches scattered about.\n\nDon't forget your camera and make sure it's charged up as the views are plentiful and stunning!\nShow less"], ["Reviewed April 24, 2017", 5.0, "Dynamic Beauty", "We Floridians love the beach. The Pacific is some kind of beautiful. Plenty of free parking. We took hundreds of photos. The views will blow you away."], ["Reviewed April 20, 2017", 4.0, "Lovely Spot", "There are several places along the cliffs to park, and as the name suggests this is a great place to watch the sun set. bring a blanket to sit on and a few layers to stay warm. Arrive early if you want to be able to park legally and leave your car without any worries - it gets crowded.\nShow less"], ["Reviewed April 18, 2017", 5.0, "So pretty. Free. Relaxing", "We walked down the many steps and then carefully over rocks to get to ocean, but there were other ways to get down to beach. It is a nice little area. And plenty of nearby quaint food as well as cheap fast food. We actually had a few hours to kill before our plane took off so it was perfect (10) minutes from airport.\nShow less"], ["Reviewed April 15, 2017", 3.0, "Great view on the cliffs", "Awesome views. Area is more rugged but that made it less crowded. The surfing looked great. Access to the shore was limited but we braved it anyway. This was a more laid back place but lovely just the same."], ["Reviewed April 15, 2017", 5.0, "Stunning sunset views!", "Please go at sunset and marvel at the glorious views! So easy to drive there and parking was ok too. Walk to the cliff side (be careful but not too scary) and soak up the nature. We saw surfers far out among the waves. Very cool local vibe!\nShow less"], ["Reviewed April 11, 2017", 5.0, "Amazing views", "Definitely a must see if you are in the area. The views here are absolutely amazing. I went on a Monday and it wasnt very busy, had no trouble finding parking."], ["Reviewed April 10, 2017", 5.0, "Do Not Miss This Very Scenic Beach.", "My favorite beach in all of San Diego. From tidal pools to wind eroded sandstone cliffs, open arches, rocky and sandy beaches and native vegetation, it can't be beat. A great bird watching beach and place for viewing surfers riding the waves, there are pull-outs all along Sunset Cliffs Blvd., each with their own unique trails and views. Hike out to the cliff edge, down to the beach at ocean level or stay safely back, you've still got enigmatic ocean views, sounds and smells.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Watch the Sunset", "Get there early (45 minutes b4 sunset) to find free parking. People are friendly there. Check when the sunset time is."], ["Reviewed April 10, 2017", 5.0, "Great views", "Like the name says, go at sunset and you will not be disappointed. Lovely spot to walk around and take in the ocean breeze, sights and sounds."], ["Reviewed April 10, 2017", 5.0, "Unique beauty so close to the city.", "No mystery about what the attraction of Sunset Cliffs is. Rugged cliffs above a rocky coastline facing due west over the Pacific, an amazing spot so close to the city."], ["Reviewed April 10, 2017", 5.0, "Beautiful Views", "It was worth the drive from our hotel in West Mission Bay to come see the cliffs in the evening. We have a 7 year old son, so we didn't venture out onto the cliffs, though some people were out there. I recommend keeping young kids close at hand.\nShow less"], ["Reviewed April 9, 2017", 5.0, "Breathtaking!", "This is a beautiful place to walk or run. The views are fantastic, especially the sunset. Parking is easy to find."], ["Reviewed April 6, 2017", 5.0, "Gorgeous!", "Went on a Saturday night at sunset. Parking was super easy to find, folks walking were friendly and amazing photo locations"], ["Reviewed April 4, 2017", 4.0, "Nice Cliff Walk", "This is a pleasant way to spend a few hours though is more of a walk than a trek. Nevertheless, some beautiful scenery though some of it will be missed if the tide is in and diversions are necessary. Overall a part of San Diego not to be missed!\nShow less"], ["Reviewed March 30, 2017", 5.0, "Beautiful", "Awesome place to visit. Beautiful views cool caves. The trail along the top of thecliffs is relaxing."], ["Reviewed March 30, 2017", 5.0, "One of my favorite spots", "Beautiful views and another must visit area in San Diego. You must take a walk and take the rope down to the bottom of the cliff and walk along the ocean. It is so nice!! One of the more romantic places to visit day or night, but the park closes around 9.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Great walking, shoreline, sunsets", "Called sunset cliffs for a reason: beautiful cliffs, one of the best spots in San Diego to watch the sun set over the ocean. Parking can be iffy. Nice area to walk or run."], ["Reviewed March 28, 2017", 5.0, "Cloudy but perty", "Caught an Uber to catch sunset but on our way the clouds were rolling in. No sunset but still a cool view watching the surfers!"], ["Reviewed March 28, 2017", 4.0, "Pretty, but not during the winter", "We visited in March of 2017, the marine fog made it not that enjoyable. The park itself and the cliffs are beautiful, and I am sure the water would look more inviting when the sun is out! Wear sneakers to walk around the cliffs!"], ["Reviewed March 28, 2017", 5.0, "Awesome view from the Cliffs !!!!!!", "My son took me to the Sunset Cliffs Natural Park and I was amazed at the breath taking views of the cliffs and the crashing waters from the Pacific sea coming into the basin of some of the cliffs. They had an area called the tide pools which is really cool and you can see where the water from the seas collect and then go back out. I love going to the edges / ledges and seeing the ocean from the very edge.\nShow less"]]}}