{"The Queen Mary": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Queen Mary", "url": "/Attraction_Review-g32648-d104802-Reviews-The_Queen_Mary-Long_Beach_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/43/89/26/the-queen-mary.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2559"}, "address": {"@type": "PostalAddress", "streetAddress": "1126 Queens Hwy", "addressLocality": "Long Beach", "addressRegion": "California", "postalCode": "90802-6331", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 3.0, "quite fun", "We pre-booked our visit which is advisable and spent a leisurely day going round the ship. Despite assurances to the contrary, several of the \"speciality tours\" are repetitive but that did not spoil our day. A free shuttle to close to our hotel was a bonus\nShow less"], ["Reviewed 5 days ago", 2.0, "Worn out.", "We had several hours between the time we disembarked our ship and our flight time, so we decided to visit the Queen Mary. We paid the admission ($32 USD pp) and entered the ship, looking for a restaurant to have breakfast. We eventually found the Promenade restaurant. We ordered from the menu rather than eating at the buffet. The food was really disappointing. I had the chicken and waffles. The over cooked spinach overpowered the flavours, and the waffles were soggy. The chicken was undercooked. My partner ordered the eggs benny. The hollandaise tasted like it was from a package, and the potatoes were brown on the outside and raw on the inside. We brought this to the attention of the waiter who shrugged his shoulders and brought us our check - no discounts applied. We proceeded to the tour area where we were informed that the self-paced audio tour wasn’t available due to the renovations (badly needed), however we were not informed of this when we purchased our tickets from the ticket booth. We toured the Princess Diana exhibit, which I would rate as a 5 out of 10, the proceeded to the 4D theatre for the historical show. The 4D aspect is more annoying than entertaining. They spray water in your face, blow air on your neck and sweep your legs with an air hose. At this point we decided that our limited time in SoCal was too valuable to spend any more time at this pathetic exhibit, we retreated to our car to pay $8 US for parking, after having our ticket validated at the crappy restaurant. Without the validation, to would have cost $18 to park. SAVE YOUR MONEY!!!!\nShow less"], ["Reviewed 6 days ago", 5.0, "Factually Intriguing", "Went here to have a look around this old girl, fascinating in the way that as soon as you step foot on her you feel like you are back in time. They have kept her true to the time she was still sailing the seas. I highly recommend taking the tours of the ship, not sure about the \"haunted\" stuff... I didn't feel jittery at all lol but the old antiquities you come across on her are amazing.\n\nIf you dine in at one of the restaurants you can have your parking ticket stamped so you won't have to pay for parking also :)\nShow less"], ["Reviewed 1 week ago", 5.0, "Truly wonderful.", "What an amazing opportunity to see and stay onboard a real piece of history.\nThe ship is genuinely an Art Deco marvel and exudes charm.\nWe stayed in the Eisenhower suite and it was wonderful.\nThe ship could do with new carpeting and decking in some areas, but given her age, it is quite remarkable that she is in such good shape.\nDining in Churchills was top notch and F&B generally was strong.\nWe walked out of a tour with the 'Staff Captain' who was ridiculous and disengenous at best, but did the late night ghost tour with a normal guide and it was such an interesting experience - highly recommend, if not for the ghost content, but for the opportunity to see 'behind the scenes'.\nI cannot recommend it enough, if you love ww2 / naval / Art Deco history, then you will love it - if you want a modern hotel stay and don't care about the former, then you may be dissapointed.\nShow less"], ["Reviewed 1 week ago", 3.0, "OK", "Had to make a point of staying on the \"old girl\" while in Long Beach. Historic and quite enjoyable, although none of the olde worlde charm and charisma unfortunately exists any more. Far too commercialised and touristy for my tastes. Put in a very pokey cabin with no porthole. Cleaning standards could have been better, room dusty. No hot water one morning. A one or two night stay for the experience, but no more. Food and drink options limited and expensive, however, Sir Winstons restaurant superb. Reviewed seperatly.\nShow less"], ["Reviewed 1 week ago", 4.0, "Very Enjoyable to Even Just Walk Around Inside", "We had one night before our cruise and wanted to stay at the Queen Mary but there were 5 of us and we needed 2 rooms, one for 3 people. They said they could not accommodate us so we stayed elsewhere. Morning of our cruise we asked about tours but they don't start until 11 so they suggested we just walk about the ship. That was fine with us and we felt we did see a lot. You can almost see the people of many years ago walking by on their way to dinner all dressed up in their finery. The model of the ship that was in a glass case was so surprising...be sure to walk around to the other side where you can actually see right into the ship and they show where the dining rooms were and the different class rooms, etc. Fascinating. I did take some pictures but I think the ones already on here are much better than mine.\nShow less"], ["Reviewed 1 week ago", 5.0, "Definitely worth a visit to see this beautiful ship", "Before setting off on a cruise we decided we would have a tour of the Queen Mary and see how it was done in the heydays of the Atlantic crossings. We were not disappointed, what a beautiful ship, so pleased it has been declared a national monument. The tour was excellent, our guide was amusing and entertaining but still got the important information across.\nThe engine room is very impressive and the walkways allow you to see a great deal of what gave this ship it's power to cross the Atlantic in record times. The way the propellers are displayed was particularly good.\nWe also did the ghost tour which again was well done and takes you into some different parts of the ship to the general tour. Again the guide was very good. A well worth visit that took up most of the day. Highly recommended.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing", "I bought a package but think I got ripped off as some of the things I was told I would receive were closed for the day and I blame Viator who sold it to me a few weeks back. The ship is huge and I am not sure I was able to see all of it. I went from about 10 and stayed till about 3 pm. I was given the hunted encounter tour by a gentlemen who kept it interesting and scary. The tour was made for families as they have another one which is a bit more adult themed. However some of the stories we were told were scary noatter your age. The 4d theatre showings were quite fun and you should do both the kids one and the history of the queen mary one. I also did the Winston Churchill exhibition which was very interesting and you could see all the things they used in the recent movie that came out about the PM.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An old Beauty", "To look around was wonderful, you could tell how beautiful the ship would have been in her haydays but you can tell how old she is getting"], ["Reviewed 2 weeks ago", 5.0, "Make sure you take the historical tour, its fascinating and the tour guide is a crack-up!", "We stepped right off our Carnival Tour and walked across the parking lot and went onto the Queen Mary--well worth it! We were gone so long that when we went to get our parked car and pay for it, we didn't have to pay for it because they thought we were dropping people off for the next cruise and they waved us through--awesome! Anyway, the historical tour was really good and our tour guide was amazing and very funny! We also did the ghost tour and it was good too! Next time I come I want to stay on the Queen Mary, i didn't know until this time that it is a hotel as well as something wonderful to see! I really enjoyed it! I highly recommend it--especially right after a Carnival Cruise!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Love of ships", "Last time I was on board the Queen Mary was as a child in the 80’s. If you love ships and the golden age of cruising this is a must. The Queen has gone through some hard times as a museum but the new lease owners are starting to bring her back to life. Many areas are either off limits or part of the hotel but you can still stroll the decks and explore many rooms. Guided tours of her history or haunted tours depart regularly throughout the day or just go solo and transport back in time. There are restaurants and a bar on board so you can stay all day and enjoy the ship and look across to Long Beach.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "If you like history, stop here", "This ship is fascinating! It's a page right out of a history book. This is how travel was done before jets - luxury travel and also transport during WWII.\n\nWith paid admission, there is a self guided tour with headsets. Since the ship was undergoing restorations, the headsets were not provided. The crew said the restorations closed parts of the ship and caused many of the directions narrated in the recorded tour to be obsolete. My partner and I were given a map with points of interest and we wandered the ship by ourselves. That option was fine for us, we loved exploring.\n\nThere were other tours available for additional fees. We choose the ghost tour. Neither my partner or I are believers, but it was a great tour to see into some creepy parts of the ship. Our guide was very knowledgeable on all topics ship related.\n\nLike I mentioned earlier, the ship was undergoing restorations and it wasn't possible to see ALL of the ship. I'd definitely go back again sometime to check it out.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Must see even if you don't like ships", "Not a big fan of old ships BUT this one has so much history and stories to tell. Go to the movies and see them all. Take the Ghost tour. We were spooked. Many stories. The ship really is a living thing and holds many stories of many lives.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Beautiful historic landmark", "I took the Glory Days tour of the Queen Mary while we were staying at the hotel. The tour guide was very informative and interesting. This was a walking tour that lasted an hour. The tour was on 2 decks and there were a few stairs.\n\nThe tour covered the history of the ship, and focuses on the first class areas. These rooms are beautiful and reflect the elegance of the best of trans-Atlantic travel in the 1930s.\n\nI also walked around myself, following the ship map approximating the audio tour. (The audio tour is not currently offered due to renovations.) Some areas of the ship that are not part of the hotel have not been maintained well - and look run down. Quite a few renovations are underway in these areas that will hopefully preserve this historic treasure.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best Trip", "I saw this ship in a YouTube video, and I kind of wanted to go there because of the history that goes with it. I think around 2-3 years later, my parents were planning to go to the Long Beach Aquarium, and this ship happens to be near the location, so it was a great trip. I know the Queen Mary has a hotel also, but haven't stayed the night there yet. Maybe I'll consider it in the future.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good Food & Drinks in Authentic Ship Setting", "We had dinner in Queen Ann room (delicious) - authentic ship setting with harbor views; and then drinks in the retro bar. In between, you walk through Queen Mary's shops and displays. No admission price for this (tour of entire ship does have admission price)."], ["Reviewed 3 weeks ago", 4.0, "History on the water", "It was wonderful to spend time on the Queen Mary. We had a very nice lunch and then took one of the haunted tours. As you tour you can imagine how she must have looked in her glory days and what it must have been like to be a passenger. The next time we go we want to stay overnight. A definite piece of history\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Lots of activities. Great historic activity", "Third time we have visited. Buy the passport and do all the tours. They are all fun. James is a great tour guide. Plan to spend 6 hours to do it all."], ["Reviewed 3 weeks ago", 5.0, "Absolutely a Go-To", "The only problem I have with the QM is the distances to walk. It's a long walk from the parking lot, and a long walk around the ship. So if walking is a problem, keep that in mind. Wheelchair friendly, of course, and service is good w/handicapped. The vistas are lovely and peaceful from the decks; the cabins shown on the tour are appropriately dated and sparkle. The ship's chapel is lovely for a wedding (I went to one there) so keep it in mind if you're planning a wedding. Sir Winstons (high-end dining) is superb.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Step Back In Time", "First off, this is a relic ship with a ton of history, a living museum. We stayed one night in a Mini-suite ... bedroom with sitting room, two bathrooms. The portholes are operational which is a huge plus since the was no air conditioning other than directional tubes that blew air (hot or cool). All décor is art décor with original fixtures & furnishings. There is so much to explore & experience of past glamor day gone by that this grand ship has to offer & the history of this great ship is amazing. She is currently receiving a much needed restoration. Don't expect a 5star hotel but appreciate the grand stratus that this ship once had & all who sailed on her....a classic!!!!!! Do valet parking definitely!\nShow less"], ["Reviewed 3 weeks ago", 1.0, "As a place to stay its a tourist trap", "No amenities rooms are dark and small and the front desk does not move very quick\ndon't get up to take an early shower they turn off the hot water at night\nno where to hangout except the bar or a tour no pool lounge chairs etc\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Pre cruise stay", "We spent two nights on the Queen Mary prior to a Carnival Cruise. We were intrigued by the history of the vessel. It was like stepping back in history. It is time-worn, but that is part of the charm. The furniture and fixtures are authentic to the time period. There are tours and activities to enjoy while on board. We particularly enjoyed the “haunted history tour”.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Cool History here!", "OK so its a boat...a HUGE boat! From the time you pull up to the parking lot until you walk off the gangway back to your car, you are struck by the enormity of this thing. Very cool tour!"], ["Reviewed 5 weeks ago", 3.0, "Looking sad", "I was looking forward to this stay but was disappointed on arrival. Th Queen Mary looks well past it's sell by date.\nIt is certainly not an ideal hotel,threadbare carpets,missing a lot of paint . The bedroom was too hot without any way to turn the heat down,the eating places consisted of only one place as the rest were all closed.The food was quite expensive-approx.$100 for 2 (dinner) breakfast approx. $50 for 2.Food was good.\nas a museum it was interesting but not so good as a hotel as parties are being shown around all the time.\nAll in all I enjoyed it as a novelty,my wife was not impressed at all.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Very interesting!", "We took a self guided tour on the Queen Mary and we were amazed at the size and good condition the ship was in. The historical information was extremely interesting. The pictures and furniture, the dishes and glassware.....WOW! A lot of star climbing, but there are elevators for those needing them. The engine tour was especially interesting and we spent most of our time there . We also stopped for lunch in the Promenade Cafe and the food was sooo good, especially the clam chowder soup. The Russian submarine looked like a toy next to the ship. The shops, the people, the food, all met or exceeded expectations! We wished we would have had more time to explore.\nShow less"], ["Reviewed January 23, 2018", 2.0, "Extremely Disappointing", "My husband and I are natives of Southern California, we both graduated from CSULB and have always loved the Queen Mary, in fact we were married on the QM. We have always loved the history and had a wonderful experience at our wedding, everyone stayed on the ship, enjoyed the piano bar and in general had a great time. In college we took tours of the ship and loved it. In December 2017 we went to see my mom who still lives in SoCal. We thought it would be enjoyable to take her and my aunt, both in their late 70's, on the tour and have lunch. To begin with the cost of the tickets was very expensive for a tour (a movie was to be included, more on that later), over $100 for the four of us, but we had such a great time in the past and none of us had been there in years so we decided to go ahead. We started with lunch which was good and it was a beautiful day so it was nice to sit and look out at the ocean. On our way to lunch we passed a tour group and the guide was so loud and obnoxious that we all commented that we hoped he would not be our guide (unfortunately he was). Our tour began at 1p and this is where everything deteriorated. The tour guide, although very knowledgable, was more interested in trying to be funny and make it about himself to a point of being obnoxious, so much so that 30 minutes into the tour we couldn't stand listening to him anymore that we left the group. He wasted a lot of time standing around and when he did begin to share some information about the history of the QM his tone and way of storytelling was so distracting that it was hard to listen to him. We were all so incredibly disappointed, we had really looked forward to it and for the money we spent it was definitely a huge let down. Because we left the tour early and didn't have anything else to do, we decided to go watch the movie we had been told about and that, was included in our price, about the QM. After receiving poor directions on how to get to the theater and not having good walkable access, especially for anyone who has trouble walking (both my mom and aunt do) we find out that a Sponge Bob movie was playing and it would be another 2 hours before the historical movie would be played. At this point everyone was so annoyed by our experience that we decided to leave. What was supposed to be a fun filled afternoon left us all very disappointed. Our 20 year wedding anniversary is coming up in 2019 and we had planned to have a reunion with our wedding party and family but are now seriously re-considering it. If the tour was that bad, what is everything else like? I hated to write this because as I stated in the beginning, I have always LOVED the Queen Mary, it holds a special place in my heart which is why this experience was so disappointing but someone needs to pay attention to what is happening on these tours because it is a huge disservice to anyone who does not know the history of the QM or is experiencing it for the first time.\nShow less"], ["Reviewed January 23, 2018", 4.0, "On Board or On Land?", "Prior to sailing on our Carnival Cruise we chose to stay a night in The Queen Mary Hotel that is located next door to the Carnival Pier. It was an easy transition from the parking lot at the Queen Mary to the Carnival high rise parking next door on sailing day. It was a unique experience to sleep in a stateroom of the early 1900s. I'm sure there were many upgrades to make it safe and comfortable but the porthole window and many fixtures were original. Food on board the Queen Mary was more than acceptable but priced somewhat high for my preference.\nShow less"], ["Reviewed January 22, 2018", 3.0, "Great Ship, But Don't Take the Tours at Certain Times", "We love touring classic/historic venues, so we thought the Queen Mary would have be awesome. For us it was simply OK, because too many of the public viewing areas were closed for private functions. We made the mistake of starting the tour at 4:15 PM on a Saturday. Literally every single public area that would normally be viewable was closed due to being occupied by wedding groups, corporate functions or whatever. We had a good tour guide, and he was apologetic for what we couldn't see, but literally we saw just a bunch of hallways and stairways. Don't bother taking a Queen Mary tour during busy times.\n\nOn top of that disappointment, parking is outrageous if you are just there for a tour. $18 for about two hours. Not sure if the cost of drinks for food would have made up for the parking validation discount that they offered, but it probably wouldn't.\nShow less"], ["Reviewed January 21, 2018", 5.0, "nice tour", "It was nice to see how this were in the past. They said they had ghost but I didn't see any. it made you feel like you were on a cruse."], ["Reviewed January 20, 2018", 2.0, "Tour is nice, but not a great place to stay", "We went and spent a night on the Queen Mary. It was not a great night. The walls are paper thin, and the beds are mediocre at best. On the plus side, the tour was very informative (however pricey) and fun. The restaurants on the Queen Mary are also pricey, but our meals were very good. I just would never spend another night sleeping on that ship.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Awesome Tours", "We did both “The Glory Days” tour and “The Haunted Tour and thought both were good. The first one was “The Haunted Tour” and it was funny & a bit creepy. During one part the lady in front of me kept saying ”I feel something touching me.” Her partner wasn’t close by and no one was between us & there was a distance. The second tour, “The Glory Days” was awesome for the most part it was our Tour Guide James who made it so. He knew his stuff. His love for this beautiful ship showed and made the tour the best ship tour I’ve ever been on. Thank you The Queen Mary for keeping us entertained on a cold, rainy Monday!\nShow less"], ["Reviewed January 19, 2018", 3.0, "A bit disappointing", "We booked to stay on this retired cruise ship for two nights. The cabins are cute as they’re a throwback to the 1930s. Be warned that quoted prices are for a room without a window we upgraded and were so glad we did as even the larger room was very small and stuffy . Don’t expect luxury either the fittings are very old and decrepit and it comes with a rather high price tag of £200+ per room . All in all I would not recommend staying here .\nShow less"], ["Reviewed January 18, 2018", 1.0, "Tour of the Queen Mary", "Way overpriced for just a tour and to make things worse they charge you an additional $18 just to park for a couple of hours. Save your money and go somewhere else. There is just not much to see here."], ["Reviewed January 17, 2018", 5.0, "Faaaaaantastic Experience and history", "I was very excited to be at the Famous Queen Mary, but we didn't have idea what about to expect.\nWas really a such pleasant experience, out bedroom was quite original, but very comfortable and clean, the view from the ship was incredible, all the crew was very nice and friendly, even explained to my son to use the Morse code. We did the tour and hear and feel all the history behind was amazing. Also interesting that in a certain way, Queen Mary will be survive for a long time.\nWe plan to be back soon!\nShow less"], ["Reviewed January 17, 2018", 2.0, "Paranormal ship walk", "BUY YOUR TICKETS ON GOLDSTAR because they're $22 instead of $45! This two-hour tour was not even worth the $22, though. It is a lot of walking and a lot of stairs, so if you're elderly or have trouble walking and standing for long periods of time, this may not be the tour for you. Wear comfortable shoes! Now, the negatives: this tour is about walking up and down the ship's hallways (which you can do for free) while a guide tells you 4 or 5 stories about ghosts that were spotted in those locations (ex: ghost in white was seen here, moving on, ghost in white was seen here, moving on). You don't get to go inside any haunted rooms or even see the inside of a hotel room - just stand outside the door of both the Eisenhower suite and Churchill suite. Literally - you look at the door. You move from top floor to bottom floor (7 levels) of the ship. While it is labeled a \"paranormal\" walk, the \"paranormal\" activity comes from the tour guide turning off the lights, telling you to take pictures of mirrors, and going home and checking if any ghosts appeared in your photo. She/he proceeds to do this throughout every \"spot.\" Many of the short stories of supposedly seen ghosts don't come with a \"spooky legend\" but just a speculation about who the ghost might have been and how they might have died. As a young adult who is scared of even the Haunted Mansion ride at Disneyland, this was a boring disappointment. Much of what is shown can be seen for free. You pay for the history of the ship... which can be found online (like who built what and who painted what). Also, much of the history is about older celebrities who once visited the ship and in my early 20s, I did not recognize a single name and therefore was not impressed. Definitely felt like an older, family activity! While the staff here is very kind, this tour is unnecessary and outdated. The ship itself is very old and dilapidated. It seriously needs a remodel which I hear is due next year (save the trip for then...). Overall, walking from top to bottom of the ship without any spooky stories or legends or ghost sightings or even a feeling of slight nervousness was simply beneficial for the exercise.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Queen Mary and the Chill the December and January Event", "My 2 daughters and 3 grand-daughters (ages 8 and 11) drove to Long Beach to go to Chill next to the Queen Mary. Chill is an event for Dec and Jan Chill was $25.00 per person but you could also go on the queen Mary. I thought it was kind pricey . They had lots of sparkling lights Xmas music .They had inter tubes sliding down little hills, bicycle riding on ice. Ice skating, bumper boats on ice, Zip Lining. Lots of places to eat and things to see,\nShow less"], ["Reviewed January 14, 2018", 2.0, "Old accommodation", "It sounded like a great idea to have the family stay onboard a cruise ship without the seasickness.\n\nThe facilities are really old (not just old-fashioned). Beds creak, mattresses are lumpy and hallways are long and narrow.\n\nIt's far away from everything. The SpongeBob show for kids is good, but the other historical activities are full (unless you are a true history buff o princess Di fan).\nShow less"], ["Reviewed January 9, 2018", 2.0, "State room accomodation", "Staying overnight in the Queen Mary sounded like a fun thing to do but it wasn’t that great. We opted for the more expensive staterooms with porthole view. Be aware though some of these rooms are under a promenade deck. We woke to the sounds of chairs and tables being dragged around above us.\n\nThe ship is old so I guess it’s no surprise the rooms are too. In our room Plugs literally fell out of the electrical sockets and the enamel on our bath was half off making having a shower a hazard to your feet.\n\nThe food on board wasn’t too bad though the fries we had were sea food flavoured.\n\nStay for novelty factor and ask for starboard rooms as these face away from the dock and would be quieter. Staff were nice and friendly.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Queen Mary", "We chose the $20 self-guided tour of the Queen Mary. We felt that was a little high, but we were there, so we figured we might as well. If I returned, I would probably pay for the guided tour, as it was hard to follow the map and get around on our own. I believe we missed quite a bit, as we got frustrated and decided to leave. The employees were nice and the areas were clean.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Dark harbor", "Visited the Queen Mary for a great Halloween weekend! The mazes were amazing and the staff was great! The bars were easily accessible and the wait was quick! Definitely going again next year!"], ["Reviewed January 5, 2018", 3.0, "Dissappointing", "We attended a group dinner on the Queen Mary. Dinner was delicious, after they finally served me. They served everyone else at my table and went on to another table! I had to ask for my plate! We were hoping to be able to walk around and look at the boat but were never given the opportunity.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Wow!!", "Didn’t get to have our champagne Sunday brunch on this trip as friends were poorly. But well worth it if you are thinking of it. We did however drive down to re look at this majestic ship. Free parking for 30 mins."], ["Reviewed January 3, 2018", 5.0, "Amazing tour guides", "Do the tours for sure. You get so much more info rather than walk around the ship lost. The ghost tour is fun, but use your imagination and have fun with it. The Queen Mary is a historical treasure, one not to miss. Checking my visit off my bucket list.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Mindblown", "Wow. What can I say. A spectacular museum and fantastic historic guided tour. However I wish the group size was a lot smaller (about 10 people, not like 20-25) HIGHLY recommend going!"], ["Reviewed January 1, 2018", 3.0, "Majestic Old Ship", "The Queen Mary has a great history. I personally like their haunted tour. I personally do not believe that the ship is haunted. But, you do get a great deal of insight to some accidents that have happened on this ship. I also really liked watching a film in their 4D theatre.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Busy Place !", "As tourist we didn’t do our homework very well - arrive at this attraction just at dark on 12/30 Saturday night - big event going on so Place was crazy - charging $20 to just park -"], ["Reviewed December 28, 2017", 4.0, "......Excellent engineering for its time....", "The tour of the ship is fantastic, in size, grandeur and it’s quit an engineering marvel considering the time it was built.\n\nFood for thought is that, there were no computers at the time, but the accuracy and finesse of this machine is a wow experience.\n\nIt has a rich history, ferrying Royalty, cruises, troops during the war.\n\nMost importantly is the method of decommissioning of this legend, it’s a hotel, Museum, shopping Centre, church, restaurant, pub, and an amusement park!\n\nLook out for the horn when you visit\nShow less"], ["Reviewed December 28, 2017", 5.0, "Great tourist attraction in Long Beach", "I work there in the late 70s early 80s as a waitress and love to take people and show him the big ship. A piece of history and our wonderful tour site with a few great restaurants. Perkins rather steep so my suggestion is to take local City bus transportation\nShow less"], ["Reviewed December 27, 2017", 4.0, "A Christmas Staycation", "This is the second time we have stayed at The Queen Mary. We were given room A122 which had 2 portholes to look out of and was across from Chill. We heard nice music while the portholes were open and they had fireworks too. My boyfriend found out that they only had the fireworks on Sundays so I was glad I leaned out to view them as they were a little to the left of our window.\n\nOur room was connected to another room with children but they were not loud and with the TV on, didn't hear them enough to complain. The room was beautiful with a very Art Deco look with the wood and green fixtures. I'd be back more often if not for the high daily parking and resort fees but it was a nice two day stay Christmas Eve and Christmas Day and only 37 minutes away.\nShow less"], ["Reviewed December 26, 2017", 2.0, "Christmas trip", "Last year was our 1st trip at Christmas and we loved it. Not too many people and perfect weather. This year it was way over crowded. Not sure if the owners are brewing up business on purpose but it was overly crowded to say the least. We go to the ship every year for our anniversary in February and we were married on the ship in 2012. We have seen many changes in just those few years. Although it seems more commercialized we enjoy our getaways to Long Beach and the Queen Mary.\n\nThis time was too much. There was blood on a bathroom towel, the bathroom tile was lifting from what looked like crooked flooring. We seem to have the rudest neighbors the last 3 or 4 stays (we know it's not the ships issue), and although we understand the attractions bring business there is just too much noise now and I mean WAY too much to relax and just enjoy.\n\nThe parking was an utter fiasco and made no sense what so ever. As many times as we have stayed we have ALWAYS parked in the same area which we were directed to this time. There were about 10 cars parked there and a \"parking police\" kind of guy came whirling around to us, \"you can't park here, it's for Chill. To park here costs 27 dollars, if you stay I have to give you a ticket!\" And yes he said it that way and was rude. Even after explaining we did not know and that we have ALWAYS parked there. We were directed to a place right outside that area with about 20 spaces or the lot way far out. Luckily we found one.\n\nLet's just say the only reason I'm giving this trip 2 stars and not less is due to the fireworks on Sunday which were amazing and somewhat of a repreave for the ship. Folks these were literally right above us!\n\nQueen Mary has some work to do!\nShow less"], ["Reviewed December 23, 2017", 3.0, "Decent attraction", "The ship was pretty at night but boring once inside. It’s also a hotel but it smells stuffy so I don’t have a review for the hotel."], ["Reviewed December 23, 2017", 5.0, "Majestic Lady", "Wonderful representation of a bygone era. She was the fastest most luxurious ship built in her day. Nice to see her still around and maintained or years for future enjoyment."], ["Reviewed December 21, 2017", 5.0, "amazing", "love this place there always updating this place so its up to date with fun things to do and see. all the area is perfect hotels restaurants bars etc..."], ["Reviewed December 21, 2017", 4.0, "Pre-Dinner Christmas.", "This was, purportedly, across the street from our hotel & convenient to others who lived in California and with whom we planned our pre- Christmas family dinner."], ["Reviewed December 17, 2017", 4.0, "beautiful ship but felt like waaay too much nickel and diming....", "I hadnt been to the Queen Mary in many years and-with an out of town visitor in tow-off we went last week. My impression was that she looked run down and clearly due for the renovations going on all over the ship. That being said, you are still charged the full amount of admission (for about 3/4 of the ship being avail to see) AND asked to pay for lots more while you are there. For an admission cost of over 30 dollars a person you would think they could include at least one of the exhibits (the Princess Diana one would have been nice) but nope...you have to dish out more cash to see that...or the Churchill exhibit or the ship gallery etc. There are several \"levels' of passports you can thus buy-and yes, the price keeps going up. We DID have the \"4-D\" movie included though=which was pretty cheesy what with water getting blown into your face and the seat shaking (for \"atmosphere\")\nThe only tour we took-and that i liked btw-was the one about ghosts and legends. We were the only 2 on the tour and you do get to see/experience some rather isolated (and creepy looking) things as you hear the stories that go along with them. Go late when it's dark-it adds to the experience, definitely!\nOverall it was okay but I felt sorry for the old girl; she was once the height of glamour, speed and elegance on the seas but that has almost totally fallen away (although there are still beautiful rooms aboard to see) -and the \"for profit\" aspect has taken over..\nShow less"], ["Reviewed December 15, 2017", 4.0, "An Interesting Place to See", "What an amazing boat this is with all the history it has. It looks huge as you begin to walk towards it. Once on it we purchased the audio tour which takes you around the boat telling you interesting facts along the way. I find stuff like this interesting so for me it was a great tour. It took over an hour to walk round and we also sat and had lunch in one of the restaurants on board. Really enjoyed this and I would recommend to others. If you do visit this make sure to go and view the propeller in the glass encased area. It's under the water still but looks astonishing.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Many tours available", "There is plenty of parking available, but you must pay (I paid $18). Part of the ship is a hotel, parts are restaurants, and parts are set up for tours. I went for the historical tour. There are several other guided tours and, apparently, a self-guided tour. There is an all-day package if you are interested in spending the day taking the various different tours.\nShow less"], ["Reviewed December 3, 2017", 4.0, "The Queen", "Spent a day exploring the Queen Mary. They offer several different options for tours we choose the full experience which includes 2 guided tours along with access to Diana’s exhibit and the titanic exhibit along with a 4d movie\n\nThe guided tours took an hour each and were very informative\n\nThe ship has seen better days and they are all in the process of refurbishing with certain areas closed off\n\nThere is a lot of history here and I would recommend anyone with a day to spend to enjoy\nShow less"], ["Reviewed November 26, 2017", 4.0, "Very nice attraction", "Stopped by for an overnight visit. The accommodations were great. There are many things to do on the ship from Ghost Tours to bars and restaurants to exhibits. There is s free shuttle from there to downtown. It is a bit pricey."], ["Reviewed November 25, 2017", 4.0, "Free after 6pm", "Visit in the evening for drinks and exploring on your own. Just off the free passport bus so it's a cheap date! $7 draft beer seems fair to me"], ["Reviewed November 22, 2017", 5.0, "Dinner on the queen of the seas", "Had an excellent meal in the Churchill restaurant. The service was excellent. A very good Bloody Mary. And a fabulous steak. Really enjoyed the whole experience. Not cheap but worth every penny."], ["Reviewed November 21, 2017", 1.0, "Tour the USS Iowa instead", "“Tour” is a misleading word to describe what we got! Most of the ship is apparently the hotel and is totally off limits to tours. The ship is undergoing some restoration so there was very little to see, basically the engine room and a few hallways. The audio tour wasn’t available but we still had to pay full price. We took the haunted tour of the ship as the one we wanted didn’t start for 21/2 hours. The guide was interesting and answered all questions, but he could have given the tour in the parking lot for all that we saw. We toured the USS Iowa earlier in the year and it was great! Go there instead.\nShow less"], ["Reviewed November 18, 2017", 4.0, "What an amazing opportunity to experience history", "We had the opportunity to spend a couple of nights on The Queen Mary. Most of the ship has kept its charm as it has been renovated here and there but so much of the original interior has been kept in tact. Quirky but fully equipped staterooms offer a look into the past. Throughout the ship is tidbits of its history. We visited the engine room to see what made this ship the fastest of its time. They offered free guided tours on the ship. They had several places to dine. It is located right next door to the Carnival Cruise line's port so could be a great stay for either before or after a cruise. The city of Long Beach offers free bus shuttles to the local areas/restaurants.\nShow less"], ["Reviewed November 16, 2017", 3.0, "Catch a Good Guide", "I think I got an awkward mix of a group of two and a guide who had an off tour. Seems like there’s great potential for learning but I missed out."], ["Reviewed November 15, 2017", 4.0, "Still the Queen Mary", "Been here various times over the past 45 years. The updates and rehab definately look good, but the back half is greatly lacking. They are in the process of building outdoor stage areas which kinda messes things up a bit"], ["Reviewed November 10, 2017", 5.0, "walk back in time", "This reminds me of what the Titanic was most likely like what a grand ship for so long ago and even today"], ["Reviewed November 10, 2017", 5.0, "Can spend as long as you want", "The ship itself is very interesting. You can do self-guided or pay extra for a guided tour. Either way, you can spend as much time as you like looking around. Great views of the City of Long Beach, marina, cruise ship port and ships coming into the port.\nShow less"], ["Reviewed November 9, 2017", 3.0, "Cool to tour on own and no cost. Also free shuttle drops you off right by entrance", "Went to see the Queen Mary later in the day so there was no admission cost. Unfortunately, many area were close or blocked off. It still offered charm and a glimpse at the past. Glad I added this."], ["Reviewed November 9, 2017", 2.0, "Disappointed in prices", "When we dot there the parking was $18. I knew it was about $20pp to walk around so i stopped to ask a couple if it was worth it and they said no. We did not have to pay for parking as we exited within 5 mins. They give you up to a 1/2 hour for free so you can walk around and ask questions about tours, etc before you commit.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Date night", "Went for my wifes birthday. Had dinner at Winstons. Great food & wine. Excellent service. Saw exhibit about the ship & how it helped during WW2. Then music & dancing to 40s music. Overall a wonderful evening."], ["Reviewed November 7, 2017", 2.0, "Chaotic Expensive Disapointing", "We had a Groupon, so the damage was only $24 for two I hoped.\nBut on top of that you have to pay $18 for parking! That is outrageous even for pricey California!\nThere is no red line one could follow. We went back and forth on the ship, the \"map\" didn't help.\nIt is also a ripoff because the standard price to get on board is $27 but they sell all the interesting rooms to private parties, so you can't go and visit them.\nThe interior that you can see is interesting art deco.\nThe 4D movie was OK too.\nBut again: for the money you spend there is no value!\nShow less"], ["Reviewed November 4, 2017", 5.0, "Historical Tour", "Took the one hour historical tour of this grand ship. Learned a lot about the ship. Cody was a great guide."], ["Reviewed November 4, 2017", 4.0, "A Step back in time", "We were staying in nearby Carson and noted that the Queen Mary was close-by, so whilst not on our planned schedule we decided to visit before leaving LA. You can take a range of guided tours but we only had a couple if hours so elected to take the self-guided tour. The ship is now a floating hotel but there are many areas open to the public so we wandered the decks and took in the history. The vessel is in very original condition and whilst some areas are under repair and others are inaccessible, many of the key areas are worth a visit, including the engine room and a look down at one of the huge propellers. A real step-back in time.\nShow less"], ["Reviewed November 4, 2017", 2.0, "Disappointed", "My son is obsessed with the Titanic and the Queen Mary and other old big ships, and he watches videos about them nonstop on YouTube. He's never seen one in person, so we decided to surprise him with a visit to the Queen Mary while we were in California. I knew it would be an old ship and have dated decor and facilities, so I didn't expect much....but I was somehow still disappointed. I thought my son would enjoy the Titanic photos exhibit on the QM...but we arrived to find out the exhibit was closed for maintenance. So, we decided to go visit the bridge, which he wanted to see...but it was CLOSED for maintenance. So, we tried to get up on the bow (my son wanted to do the Leo DiCaprio \"king of the world\" thing, of course)....but access to the bow was CLOSED FOR MAINTENANCE. It was like, are you kidding?? We paid full price for half of the attractions to be closed - \"sorry for any inconvenience\" signs taped up all over. And there is a \"4D\" theater on board, and you'd think they'd be showing some kind of ship-related show...? Nope - they alternate SpongeBob SquarePants and an episode of Planet Earth.\n\nSo, honestly, the only thing my son really liked on board was the Queen Mary Lego model in one of the rooms. Which we didn't need to travel to California and pay admission to see. :/\n\nWe didn't eat on board, but did buy some drinks from the Starbucks....which is barely a Starbucks. They serve Starbucks beverages....but that's as far as the brand goes for the little coffee shop.\n\nWe were there during the time that they also have their \"haunted\" Halloween stuff - which is a haunted maze INSIDE parts of the ship, as well as a cheap-looking (but probably rather expensive) carnival-type amusement park setup right outside the ship. It was clear that THAT was the draw, and not the ship itself.\n\nIt's my feeling that the QM could be an AWESOME attraction, with a little TLC. And maybe it is normally, and our timing was just really bad. But we all left disappointed, for sure.\nShow less"], ["Reviewed November 2, 2017", 2.0, "See the boat but don't eat anything!!!", "It was amazing to walk among the past that this amazing ship holds. We were enthralled by the carvings and decor. Unfortunately we thought we would have a fancy dinner on the ship and it was some of the worst food we have ever eaten. I have been really trying to eat healthy and had decided to splurge on one extravagant meal on our visit...I wish I had eaten a hamburger somewhere rather than the swill I paid very good money for on the ship. I do not say this lightly...and I highly recommend you visit the ship. It is beautiful! Just I honestly spoke to a local tour guide about our experience and he said that unfortunately that is what he hears - it's so sad.\nShow less"], ["Reviewed October 30, 2017", 1.0, "Disappointing", "Do not waste your time and money visiting the Queen Mary. There is just nothing interesting inside. You will pay $30 per adult and $20 per child to walk on the promenade, see a ship made of LEGO and visit the engine room. Nothing special. I believe it is one of the biggest tourists trap I have seen in my life\nVery disappointing. A fair price would be $10 per adult, $5 for kids.\nYou can’t visit officer quarter or a room.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Worth A Look !", "We were in the area and had to check it out. We did not go inside though. Just walked around it. There is a old submarine parked next to it too and that was cool as well. Great views of the water all around."], ["Reviewed October 25, 2017", 5.0, "Better than the Titanic: it did not sink", "A great hotel, tourist stop, and restaurants. You can even get married on this ship. Owned by the city of Long Beach. The first class cabins make you feel first class. Not cheap but worth every $."], ["Reviewed October 22, 2017", 3.0, "Tour only: Greeters friendly, tourdesk and 4Dmovie employees couldn't be bothered, Daniël tour guide the best !", "If this wasn't for the tourguide Daniël, with his magnificent voice and exceptionally good explenation of things to see, this was a major bummer. The three girls at the tour desk where chatting with each other when we entered. We stood at 1 yard from them, No hello, no I'll be right with you...nothing. After a minute of being ignored I said quite loudly \"Hello\" well, that annoyed one enough to snap a comment at me....okay we got the directions for the tour start and there the crowd grew and grew. we had our doubts but decided to wait and see and that was a lucky guess this time. Daniël the tourguide is wonderfull, attentative and made the trip worth the money of the tourticket. The 4D movie was okay. The parking price was ridiculous !! $ 18,00 for 2 - 3 hours. Outrages !\nShow less"], ["Reviewed October 21, 2017", 5.0, "Well worth the money and time", "We did not stay here but treated it like an attraction. We did the two tours and had a great time. Learnt heaps. Went to the Princess Dianna display and the Titanic attraction. Well worth the dollars."], ["Reviewed October 18, 2017", 4.0, "A prize for the city of Long Beach", "The Lady The Queen Mary has been here for years. We have stayed on her, had a wedding reception there, and have been on her tours. We spent many days walking her decks, and She is a must see in Long Beach. Come and see the Queen Mary, she is a beautiful Lady.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Great historical rooms", "For a great trip back in time with nice rooms and great food this is the destination and it’s a historic landmark!"], ["Reviewed October 18, 2017", 5.0, "Great tour", "Myself and friends took the queen Mary tour we saw the Haunted tour, the princess Diana museum, the Titanic display and the 4D movie it was an amazing day! Worth every penny!"], ["Reviewed October 17, 2017", 4.0, "Bought the First Class Passport", "Paid $34 at the door for the First Class Passport. Less fees and more options at the door than buying ahead online. You can choose from several options for this passport. We chose the Glory Days tour, instead of the haunted tour and chose the Princess Diana exhibit instead of the Titanic exhibit since we had seen the Titanic exhibit before. On the Glory Days tour they stopped at 4 or 5 locations and gave history about the boat. It took about an hour. The passport we chose also came with a 4D movie, you can choose between Planet Earth and the Sponge Bob movie, we chose Planet Earth. It is a very short movie but is 4D. There is a short movie before the movie in the lobby near the theater about movies filmed on the Queen Mary. It is a little cramped as you need to stand in front of one of the small screens without blocking someone else from their screens as there are screens on both sides but they are down low instead of up high. It is a large, beautiful boat, undergoing some construction because of age. Really enjoyed the Princess Diana exhibit, had a lot more to it than was expecting. There are also several smaller galleries of model ships to view included with the passports. They recommend at least 3-4 hours for this passport. We spent about 4-5 hours on the boat. There is a lot to see.\nShow less"], ["Reviewed October 16, 2017", 4.0, "Dark Harbor Fright Night", "The Dark Harbor mazes have an eeriness that is unique all in its self because the Queen Mary is old and already gives off that vibe and smell. The mazes were pretty cool but the make up the staff wears is really very good and some are so into their characters that don't out of them. I was by myself on the mazes and psyched myself out. The part that scares is when you can't see whats coming or should I say what. There is always another corner to turn, a passage to go down and lots of the unknown. You can spend as much time as you need at the outside venue. Watching acts or just getting smashed with all of the cocktails that can be purchased. All of the extra eats and drinks get pricey very quickly. Cocktails are $10 to $13 each Milkshake was $9 and a chicken burrito was $10. A can of soda costs $5 and a bottled water was $3. There is lot's of fun to be had as long as you know it will cost you.\nShow less"], ["Reviewed October 16, 2017", 3.0, "It was okay", "Maybe my expectations were too high, but I didn’t really find the Queen Mary worth the visit. The ship has some old time glamour, but generally has the feel of a commercialised amusement park now. The tour was interesting, but we never saw any of the guest rooms which we were hoping for. There was a lot of renovations going on too which is probably needed as some parts of the ship were in poor shape. Considering the price paid for entrance and parking, I was expecting this piece of history to have a more quaint feel without a garish looking Starbucks inside.\nShow less"], ["Reviewed October 15, 2017", 4.0, "Queen Mary 2 night stay", "Loved this wonderful ship & I really enjoyed the original fixtures in our room. There were 4 different knobs to turn on the water to fill up the tub; 1 hot salt water, 1 cold salt water, 1 cold fresh water & 1 hot fresh water! They didn't have running water, but how neat to see the way it used to be. Our bed was comfortable & we had 2 chairs & a table.\n\nOur room was large & had 2 port holes that actually opened! Our wonderful view was of Long Beach across the bay. Don't forget to ask about the Red Bus. It is free and will take you from the Queen Mary to Long Beach and back.\nShow less"], ["Reviewed October 15, 2017", 3.0, "The old Queen Mary", "Booked via See tickets and got a good deal but the paperwork wasn’t clear, we arrived at 9-30am and not much was open . We had a look round the Titanic display which was OK but would have been disappointed if we paid the $15 asking price . We went to the 4D theatre thinking it would be a film about the Queen Mary but it was a documentary about whales and the 3D glasses got splashed every time a whale swam by .\nVisited the engine rooms .\nThe best part of the day was the guided tour , very informative and entertaining. Bit disappointed that a lot of the ship is off limits .\nShow less"], ["Reviewed October 14, 2017", 4.0, "Fun browsing", "If you are really cruise ship lover and ship history buff then it is worth browsing the ship. I would say about 90 percent of the ship are retained original. Able to visit engine room with a view of a huge propel."], ["Reviewed October 14, 2017", 5.0, "Great Liner of a Bygone Era", "Stayed two nights on board and loved every minute of it. We had the Churchill Suite which was comfortable and very spacious.\nRefurbishment work is in progress on the ship so some areas are out of bounds but there is still plenty to see. Especially enjoyed the \"Titanic\" exhibition and in particular seeing the last remaining White Star Line lifeboat.\nWe will return.....\nShow less"], ["Reviewed October 12, 2017", 3.0, "Just an average place", "The Queen Mary must have been quite spectacular in her heyday. But now she's just an aging, floating hotel that is under renovation and charges extra for everything (there's a $16 fitness charge every day, charges to see exhibits and lots of shops!!) . Her bones are good but inside she's dull and lifeless, not resembling the polished shiny pictures on her website. Our room was quite large and clean (deluxe king with harbor view) and the bed and linens were comfy and nice. But the hotel itself offers no niceties...no free coffee anywhere, no chairs for sitting anywhere on the ship in the common areas, and the front desk staff either has no knowledge of the ship or artfully evades your questions. I do have to praise the concierge staff at the gate tho. Those guys were fabulous...knowledgeable, helpful, friendly and professional! Kudos to them! They made our one day of local sightseeing a great success and instructed us how to check out and arranged transportation for us to our cruise ship. They explained the free shuttle to Long Beach and what to do there, etc. they went out of their way to help us. The food in the Promenade Cafe was nice and service was good but a little pricey. $19 for the breakfast buffet. All in all, it was an average, unique stay but I wouldn't do it again.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Ghost Tour Fun on the Grand Ole Lady", "We took the Ghost Tour and had an enjoyable time. The guide, dressed in period costume, was engaging and knowledgeable of the ships history, quirks and ghost tales.\n\nThe ship itself is definitely aging but one can only imagine how grand she was in her heyday. The entire experience was worth the admission but if you are claustrophobic, I would not suggest touring the engine room as it is a busy place with piping, etc. on both sides of the walkway, as it was originally. However, the payoff in doing so is a peek at the last remaining prop.\nShow less"], ["Reviewed October 9, 2017", 1.0, "Don't bother", "We had a stay on this on our tour with Great Rail Journeys, we were one of the lucky ones in our group as we were given our room as soon as we boarded at 12:30 but the majority of the group did not get their rooms until after 16:30 after a lot of going back and forward to the reception to complain, especially after other people coming on board were given rooms. Luckily our friends could leave their overnight bags in our room, so they did not have to carry them around with them. We still did not get our suitcases until everybody in our tour group were given rooms, this meant that we were all stuck on board paying extortionate prices for drinks while we waited.\nOnce in our rooms there was no hot water to shower or bath in, after running it for over ten minutes there was some Luke warm water. I would not recommend this to anyone.\nShow less"], ["Reviewed October 8, 2017", 1.0, "Expensive", "Staying on the queen Mary, really not worth the money... what a rip off.... looking very tired needs updating. Beds terrible. Carpets beyond dirty won’t walk on them yukkkkk."], ["Reviewed October 7, 2017", 4.0, "Aged but Opulent", "Toured the Queen Mary which included great examples of how luxurious Transatlantic travel could be before the arrival of commercial flight. Beautiful woodwork and artistry. Definitely worth the time."], ["Reviewed October 6, 2017", 4.0, "Birthday Celebration at Chelsea Chowder House", "The Lobster & steak were delicious. The view overlooking the harbor was magnificent. Service was excellent."], ["Reviewed October 5, 2017", 4.0, "Nice ghost tour", "Wanted to visit the famous ship and it was interesting to see. We went on the ghost tour and it was fun to hear the history of the ship and the possible ghosts that roam the boat. They were all ready for halloween with the haunted mazes and from what I saw those wont disappoint people!\nShow less"], ["Reviewed October 2, 2017", 1.0, "over priced and unhelpful", "On arrival had to wait 45 minutes to check in. Arrived in room at far end of ship, good size but modern and no better than a basic Travelodge. Paid 40 dollars extra and got one of the original style rooms. Beautiful and comfortable. Sadly adjoining room had a baby that cried constantly so poor nights sleep.\nThe ship is beautiful and full of history. However despite being a guest you still have to pay for the tours and due works on the ship lots of places closed off. Also had to pay 25 dollars service fee for WiFi that didn't even work in the room.\nOn arriving home I've discovered they have taken 4 different payments off my credit card. My bill, lunch after checking out - both fine but they have also taken 2 deposits on hold of different amounts. I've emailed them about this and nobody has had the decency to contact me.\nSuch a beautiful ship. So sad that the people who run it have let it down.\nShow less"], ["Reviewed October 2, 2017", 5.0, "I Love the Queen Mary", "One of the last of the luxury liners and a heroine in her Owen right. Beautiful Art Deco throughout the stately ship, a fanciful bar overlooking the proud prow and you can explore the decks and stand in the pilot house and see the maps and how the ship was steered across the Atlantic Ocean over and over. She was called The Grey Ghost ferrying soldiers over to fight in WWII and bring wounded soldiers and later wives back to America safe and sound. She was never fired on once and Hitler put a bounty on her. All hail the Queen!\nShow less"], ["Reviewed October 2, 2017", 5.0, "WOW !", "Hubby and I loved it ! Such a beautiful ship A little tired in places but beautiful! We also done the history tour around the ship and the is we highly recommen"], ["Reviewed October 2, 2017", 4.0, "Dark Harbor Review", "We had the opportunity to go and experience Dark Harbor. It was creepy, scary, and truly haunted. Knowing the Queen Mary is haunted, or at least that is what they say, having the Dark Harbor Halloween attraction is a great fit and was great fun. While the mazes on the ship were cramped and hot, they were spookier and felt more real, if that makes sense. I would definitely check it out, if you haven't ever or at least this year.\nShow less"], ["Reviewed October 2, 2017", 2.0, "Overpriced & Disorganized", "My boyfriend and I bought tickets for the Queen Mary's Paranormal Shipwalk Tour for $44 each. The tickets indicated they included access to the 4D theater, with the last showing being at 7:00 p.m. There were multiple times listed on the ticket for the tour itself. At the top, the event was stated to start at 10:00 a.m., and at the bottom, it stated the tour started at 9:30 p.m. I called and clarified that the tour started at 9:30 p.m., and the person who took my call suggested we arrive a little early because of other events going on that might limit parking.\n\nWe decided to have dinner at one of the ship's restaurants before the movie and the tour, so we arrived at 5:30 p.m. and were shocked to be told that parking was $40. The dollar amount for parking was not on the ticket or disclosed to me when I called. Their website indicates it is $8 to self-park with a restaurant validation. However, when we told the attendant that we were eating at the restaurant, we were charged $18 for parking and told that we had 3 hours to put the validation sticker on our car.\n\nWe ate dinner at the Chelsea Chowder House. A burger and fries cost about $15 and was acceptable, but certainly not the best burger I've ever had.\n\nWe returned to our car and placed our validation sticker and then made our way back to the boat to locate the theater. We were stopped at the door and told that, in order to go the theater, we had to have tickets to another event - the Dark Harbor. When I showed the security guard our tickets and that they plainly stated the theater was included in the cost, they sent us up to the tour check-in on the 4th floor to inquire further. There, we were told that the last showing for the theater was at 5:30 p.m., not 7:00 p.m. as printed on our tickets.\n\nSo, then we had 2 1/2 hours to kill before our tour... We walked all over the boat (which is massive), although there is really not much else to do unless you have tickets to other events or are renting a hotel room. We spent a little time at a bar, and it was $4 for a cup of coffee and $3 for a coke.\n\nWhen the time finally came for our tour, we were surprised and disappointed over the size of our group - about 40 people. Luckily, our tour guide had a loud, booming voice, but it was still a lot of people to manage, especially since we were routed through other events going on and placed into small quarters at times.\n\nWe went through the Titanic exhibit in the dark - literally. Another attendee asked why we were seeing the exhibit in the dark, and the tour guide indicated that he did not know where the lights were. This seems odd, given that the guide has worked on the ship for 11 years. I kept waiting for someone to trip or knock over a display case or something, with so many people in the pitch dark, using their cell phones as flash lights. It was impossible to view any of the exhibit.\n\nWe then spent considerable time in the engine room, where my boyfriend and I did have experiences, although it is obviously difficult to investigate or ghost hunt with 40 people and several other loud events going on nearby.\n\nAfter that, we were walked up to the isolation room, which we were told security had accidentally locked. As a result, we were unable to participate in that portion of the tour. Again, we were disappointed, since that sounded like one of the most interesting rooms.\n\nWe were walked past the most haunted room on the ship - B340 - and again, denied access. We couldn't go in the swimming pool area, which is also normally a part of the tour, because of construction. So basically, we paid over $100 to see one of the haunted locations and hear a few ghost stories by a stairway and in a social event room, and that was it. The total duration of the tour was about 1 1/2 hours.\n\nAfterwards, we watched the Ghost Adventures episode where the Queen Mary was investigated and discovered how much key information about the ship was left out of the tour. On the tour, we were told there were only 56 recorded deaths on board. We were told nothing about the Queen Mary's collision with a companion ship that killed 338 people.\n\nSo, if you're going to visit the Queen Mary, I recommend, instead of taking a tour, doing your own research and then just visiting the boat in general. Be prepared to be gouged for parking or find another place to park nearby and walk over. It was suggested to me by a paranormal investigator friend to rent a hotel room there and do your own investigating - in the middle of the night, when the activity from the events has subsided for the evening.\nShow less"], ["Reviewed September 29, 2017", 3.0, "Vast Old Lady of the Sea from a Bygone Era", "Booked a space on the Glory Days Tour as part of my admission ticket. Our tour guide was really good and full of information about the ship and her colourful history. The ballroom remains largely in its original decor and is beautiful. Along with the main entrance on the ship both create a good impression of how the ship looked back in the day. Sadly, the self-guided audio tours were not available the day I visited. Which was a pity because there is more of the ship than was covered on the tour. What's left of the engine rooms is quite dark and can be a bit creepy. There's not actually much to see down below.\nShow less"], ["Reviewed September 28, 2017", 3.0, "MrGG-Queen-Mary", "This is an interesting visit, more interesting than Aquarium of the Pacific. This history tour was interesting. Recommend eating at the restaurant on the ship."], ["Reviewed September 27, 2017", 5.0, "little California vacation", "In town for vacation and stayed 2 nights oon the Queen Mary. My wife and I have been on many cruises. This was the first stationery one.And the oldest ship.Rich in history with many original parts. No air conditioner in room, which can be a factor. Loved reading about the history and celebrities that had been on board. If we're in long beach again I believe we will stay on the Queen Mary. we really really had a great time.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Vacation", "Great place friendly staff lot of history amazing sights amazing views make sure you take a Harbor Breeze tour"], ["Reviewed September 25, 2017", 3.0, "Beautiful ship but bars and restaurants could be better!", "Entry to the Queen Mary is free after 6.00 pm and we had a good sightseeing walk around the 4 or so decks or at least the open parts before drinks and dinner. The ship is undergoing extensive renovation which id being done very well. The ship is very small compared to modern cruise ships and only comprises about 4 decks. Easy to get around and signage is good. had a glass of chardonnay in the art deco bar which was lovely but a bit dark. Service was below par as I had to approach a waiter to come and take our order even though the bar wasn't busy. Prices were high at $14 per glass for very average wine. Proceeded to dine at Sir Winstone's restaurant which again had been recently refurbished but in an excellent manner. Service was attentive although by quite mature waiters! Menu was extensive with several specials like filet mignon and chateaubriand. Starters around $10,mains from $40 and deserts $11 and below. We skipped starters and had beef wellington. Unfortunately this was average and overcooked - disappointing! I had bread pudding and my wife a selection of ice cream to finish. Nice bread whilst waiting with sorbet between courses and chocolate strawberries to finish. This was a classy establishment and a pity that there were only a few couples dining. Well worth splashing out for - our bill was $150 for 2 courses + 2 glasses of wine - pity about our choice of main course!\nShow less"], ["Reviewed September 24, 2017", 4.0, "Great historical tours aboard Queen Mary in Long Beach, CA", "Great walking tours aboard Queen Mary in Long Beach, CA. Lots of photos and history. We did Princess Di tour and it was very informative. Tickets can be pricey, so look for discounts ahead of visit."], ["Reviewed September 24, 2017", 5.0, "A great ship with much history", "This was one of the largest ships, and it is fascinating to see how gigantic she is. It took thousands of crew members to staff her, and that is what caused her to loose money. She was a grand way to travel, and the visitor learns how elegantly her guests were treated. It is very impressive to see.\nShow less"], ["Reviewed September 21, 2017", 4.0, "More interesting than I thought it was going to be", "Took my teenage daughter. Both of us had just walked off the helicopter at Island Helicopters nearby (see my review of their operation). We were looking to just go for a little walk before departing.\n\nAt first, with the cost, I almost walked away. It's a little steep in my opinion (but then again, multiple operators of this ship have financially struggled with it over the past several decades, so all the entries are probably not even paying the maintenance fees).\n\nOnce you're on board, you pretty much have free reign to go wherever you want. Part of the ship is a hotel which I did not stay at but I did check out some of the rooms. I would only stay here if I fully understood what the size of a cabin berth on a 100-year-old vessel is. Once again, each room in the entire operation is a maintenance nightmare so you should only expect an experience not luxury.\n\nI did enjoy all of the models of various ships on one of the decks. These are huge, cross-section models some perhaps 15 to 20 feet long. All of them outfitted and labeled meticulously with markers to allow you to understand all of the various levels in the rooms and features. I really enjoyed this part and in fact, had I more time, would've spent at least two hours reading through all of the histories of various ships.\n\nI did not have time to go into the for the theater. I think that perhaps is one of the highlights but I did not have time. I did however, enjoy going into the deep parts of the ship and seeing various engine rooms and inner workings of such a vessel. If the entry fee does not bother you, then I think this is a great way to spend 2 to 4 hours.\nShow less"], ["Reviewed September 19, 2017", 1.0, "Worst Customer Service Ever", "Upon arrival, we were put into a room that the phone nor the tv worked. Hector the maintenance guy was awesome and so polite. He couldn't get the tv fixed. So he recommended we move rooms. It was on level B...so needless to say it was a country mile walk back to the reception desk.\n\nThen they proceeded to put us in a smaller room where the air conditioning didn't work so we returned back to the desk where we asked for a manager. We were fet up with moving rooms and we wanted to make sure the next room we got had AC and the tv worked. The girl at the desk, Cody, she was rude and short. Almost to the point, where she made me feel like it was my fault and responsibility to report rooms that aren't up to livable standards.\n\nShe then proceeded to tell me that the manager was on lunch and couldn't be bothered. I told her I needed another room and that if I had to come back I was going to get a full refund and leave because no one should have to move three times with luggage and four people to different rooms.\n\nThe last room was fine. We were tired of moving so we made it work. I understand the ship is old but dang, I thought they would renovate it to meet today's standard.\n\nWhen we woke up the next morning we toured the ship. Tons of areas have been blocked off for construction so we didn't get to enjoy it all. Not to mention, when we went to leave a crane was blocking our parking lot. We made it out and learned that we were charged $38.00 to my credit card. 17$ for wifi and $22 for parking. I was irate. Was a major disappointment.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Princess Diana exhibit", "The Princess Diana exhibit was good. Seeing the gowns and tiaras she wore, especially on the tv specials the next day gave me goosebumps. Except for the tiny elevators, the ship seemed to be easily accessible as I was with my parent in a wheelchair. The Clam Chowder served in the restaurant was outstanding.\nShow less"], ["Reviewed September 17, 2017", 5.0, "What an amazing piece of history.", "I found the tour interesting. I would like to find out even more about this remarkable ship. The restaurants seemed pricey and I was with kids so I avoided them. Make sure to go to the engine room. That was my favorite part, it keeps going and going!\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great Venue!", "I attended a professional conference on The Queen Mary. The staff were accommodating, the food was really quite good, and the surroundings were fabulous!\nI loved the various exhibits and historical accounts scattered around the ship. It was a fun and interesting location for a conference and training event.\nI was really pleased with the experience.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Rehearsal Dinner", "Our son & daughter-in-law got married on the Carnival ship Paradise in 2007 and we had the rehearsal dinner & spent the night before the wedding on the Queen Mary. Dinner was exceptional and the overnight stay was excellant!"], ["Reviewed September 13, 2017", 4.0, "Best views of Long Beach", "When friends/family visit, we usually take them for dinner or drinks at the Queen Mary. The views of the city across the channel at night are stunning, and the Art Deco bar has that \"wow\" factor, too. Well worth the parking fee for a few hours. If you are a history buff, the tours are excellent, too. We've gone to many special events held here, from the Halloween fest to private parties, and it's always far more fun than some humdrum hotel banquet room.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Eightieth Birthday Bash on the Queen", "In August this year we rented enough rooms for friends and family and staged a wonderful dinner for 25. Two of our party had actually sailed on the Queen, one in l962. We accidently hit it on the weekend of Aug. 19th and it coincided with their yearly Art Deco weekend. Folks of all ages paraded the decks in period costume and many dealers were selling the real clothing, hats and jewels. Food was excellent and the original decor fabulous. Rooms a little funky but totally in period. Each room had something different in furnishings, etc. One family member even stayed in a haunted room.\nShow less"], ["Reviewed September 13, 2017", 2.0, "Cool museum - horrid hotel", "Quite possibly the worse hotel I've ever stayed in. Visit the ship for the one hour museum like experience but be sure to leave. Check in was 20 minutes with two people in front of me - one person working the desk even as a large sold out conference arrived for check in. Predictable is preventable. Rooms are horrid. Dirty. Small. No internal room A/C control. My room is roughly 62 degrees and it's a typical perfect 85 degree LA day. Front desk says no temp controls in the rooms but they can bring extra blankets or engineers can turn temp up or down floor by floor. Shower knob fell off when I tried to turn it on. Chair in room appears filthy dirty, 100 years old ripped and looks like it was found in the dumpster. Curtains don't close. Windows don't close. Bed is same size as my suitcase and made for 1930's sized human. The food and beverage situation is non existent - basically have to cab or free shuttle off campus. No coffee in room or in site other than room service as far as I can tell. My fingers are tired of typing. Don't stay here if you can avoid in any way. So happy I'm only staying one night. Many of my colleagues are here for 4 nights. Ugh.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Great ship, great views but won't stay again.", "Great for a day's visit. The decks offer a great view of the bay. I would not stay there again, not for the price I paid. Food is good and our experience at the restaurant was great thanks to a very caring waitress. In all fairness, management made it right by giving us a refund of our night's stay.\nThere is a more detailed review that is being approved. Stay tuned.\nShow less"], ["Reviewed September 12, 2017", 4.0, "GREAT TO EXPERIENCE", "Two options - one can go in and walk along the pier and take some photos or you can mortgage your house and get a ticket to tour the inside. Actually 3 and this is the best, go to one of the restaurants and enjoy some great food and then wander the ship. Plan on spending some time just sitting and imagining it during its glory days. We love the time around sunset as it makes for spectacular photos of both the ship and the panorama of Long Beach.\nShow less"], ["Reviewed September 12, 2017", 4.0, "Very interesting and unique place! Didn't realize the ship was that BIG!", "This was very unexpected....We were only going to take pictures there since we thought you had to pay but when we got there, we found out it was free after a certain time! So we had a great time exploring the ship, even going WAY UP on top outside the ship from the deck. Didn't realize the ship was SO BIG!\nShow less"], ["Reviewed September 11, 2017", 5.0, "Historic tour of the ship", "The Queen Mary's was retired from service in 1967 and looks it. It is being renovated, ie, the massive amounts of chipping and pealing paint is being scraped off and painted little by little, but a lot late. From a distance, tbe ship looks regal. From close up, it is sad. That being said, it is a historic ship with great memories. The rooms are large by cruise ship standards, and most of the original lights, fixtures, closets, etc. are original. Meaning older looking which may put some people off. The self directed walking tour takes you from Captain's quarters, to radio room, to uniforms, and much more. Decks are pretty barren with no lounge chairs, no pool. It does have great views of the harbor, coastline, and shipping rigs. Worth a one day visit.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great Time", "The tour is worth taking and it was really great to see and hear about the Queen Mary in person. Gotta stop off at the bar for a drink or a few. If you are lucky to be on the queen Mary when the cruse ship is there. You get first hand on how small the queen Mary really is. If you are in the area for the day, to a tour of the queen Mary or have a few drinks and chick out the lights of Long Beach\nShow less"], ["Reviewed September 6, 2017", 5.0, "So Much History, Such a Beautiful Ship, Come Support the Grand Queen Mary!", "The Queen Mary is one of the most storied ships in world history. Its story encompasses grandeur (one of the largest ships of her era), luxury and style (a floating museum of Art Déco, a passenger list incorporating royalty, war heroes, movie stars and all sorts of celebrities), and bravery (its service as a troop carrier during World War II is legendary). Now it is dry-docked in downtown Long Beach, serving as a museum and tourist attraction; it also hosts a hotel and several good restaurants (including the wonderful Sir Winston's Restaurant and Lounge). The Queen Mary is still a grand old gal, even though she's famously getting on in years and is getting ready for some heavy-duty refurbishments. Her history alone makes her worth a visit; she's a faded beauty, but still extraordinarily beautiful. Come soon for a stroll on her decks!\nShow less"], ["Reviewed September 6, 2017", 5.0, "What a wonderful time!", "My husband originally booked a room over Labor Day week-end. Once we were there, we heard some of the other patrons stating the inside rooms were very warm and very small. (Not sure what they were expecting, but it is a boat!) Anyway we decided to upgrade and get an outside cabin that was quaint; clean and the A/C worked fine-almost too much. Luckily we had the \"portholes\" in our room to open and let some warm air in. The bed was comfy and it was really a neat feeling being there and trying to image what it would have been like to traveled in those days. Definitely something to experience at least once. You definitely need to eat lunch and/or dinner in the restaurants, walk the decks, check out their shops and all the history that is abound on the ship; is just such a great experience. Just remember, this is a ship that has been around since 1936 and they are doing a great job at keeping her restored (and updated with modern day amenities), not a super luxury hotel...but definitely something to experience at least once in your lifetime! We are hoping to attend the Ghost Ship Event in October and maybe even to the New Years Eve party they throw every year.\nShow less"], ["Reviewed September 6, 2017", 5.0, "You can explore a lot of this ship.", "You do not need to have reserved a room on the cruise ship to see a lot of what is on board. The part of the ship set up as a museum tells the story of the Queen Mary ship. But as you walk around this part of the ship, you can view the propeller which has been preserved - children are fascinated by its enormity. There are 2 exhibitions at the moment - Princess Diana and The Titanic. You can pay different ticket values dependent upon whether you wish to view one or both of the exhibitions. We saw the Titanic exhibition, which has some artefacts on display and lots of stories and facts to read. There is only one DVD that plays information about the Queen Mary which is interesting, but there are no seats here. Perhaps a few more DVD clips would be engaging, particularly for children. It was interesting to see how important this ship was during the Second World war and how crucial she was for Victory!\nShow less"], ["Reviewed September 5, 2017", 3.0, "Great Once....", "Very interesting place to visit and enjoy the walking tour and historical significance. The engine room walk is really something! The rooms at nice but noisy. The two I stayed in were both adjoining and the walls were paper thin. First room had late night partiers next door and didn't get much sleep. The graciously moved me to a bigger room a long ways away!\nFood service is poor. Got in somehwhat late and everyone wanted to close up and go home. Problem was it wasn't closing time and the bar wouldn't get me a bite to eat. The restaurant was out of the first two things I asked for, etc. etc. Pricey too. A cup (CUP) of chowder was $10. Good but $10 for a little cup isn't reasonable to me. Still worth a stay one night and take the time to walk around and see the fascinating history of a really sweet old liner.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Just, WOW!", "Loved staying here!! SO much history to this ship!! I could have walked around it for an entire day or more! The rooms are authentic so don't expect luxury but if you can appreciate its history you will really enjoy it!"], ["Reviewed September 3, 2017", 4.0, "Floating History", "I booked an interior room, the weekend of August 26th, for a dance party that was happening on board. I was pleasantly surprised that it was the size of a regular hotel room. The only difference is ceiling height, but then you ARE on a ship. :D I did not take one of the ship tours, though there are several available. I did wander around and enjoy the beauty of the ship, on my own. They have a couple of art & history exhibits going most of the time. They are also renovating it, so be patient with parking and some areas being off limits. I enjoyed my stay.\nShow less"], ["Reviewed September 2, 2017", 5.0, "A step back in time", "We had a 2 day stay in Los Angeles and opted for a trip to visit The Queen Mary.\n\nAllow enough time for the drive to Long Beach as it took us over an hour and a half from downtown LA\n\nThe signs to The Queen Mary are a little flakey in places as the ship is quite close to the main working docks area.\n\nCar Parking is very close to the ship and the ticket office is well signed.\n\nWe opted for one of the timed guided tours but had enough time to wander through other parts of the ship covered by the tour. Check out the engine room if you've time as it gives you a real feel of what it must have been like to work down there back in the day.\n\nThe guided tour was very friendly and numbers are limited to give everyone a good opportunity to see everything.\n\nThe ship was undergoing some refurbishment during our trip so some areas were closed off.\n\nIf you are into ships or history at all then visit this iconic ship, you won't be disappointed\nShow less"], ["Reviewed September 2, 2017", 2.0, "Dirty rooms x3", "We came to long beach for our honeymoon and thought it would be wonderful to stay on such a historical landmark....unfortunately, we were wrong. We initially had a reservation for 6 nights and left after the first night to find a new hotel.\n\nIn our first room, the bathroom floor still had hair on it, and the room was hot and stuffy. We found out that the air conditioning had been broken and the front reception was more than willing to move us to another room. When we arrived in the second room, not only was there hair in the sink, but the throw pillows were stained. We also discovered that the door chain was literally snapped (broken), and there was dinting in the door as if there had been a struggle. They again were more than willing to move us to another room. In our final room, there were long black hairs on the shower wall (I am blonde) and the toilet did not flush solid matter without extra effort (not a romantic experience on a honeymoon). At least we can say that we got a wonderful tour of the Queen Mary as we were lugging our luggage around the ship.\n\nWhen we went to the front desk to check out 5 days early, they did not inquire further about how they could improve the experience for future guest. We were disappointed by our one night stay, but even more disappointed by how little they cared about why a honeymooning couple would check out 5 days early. Clearly, they do not care about the comfort or well-being of their current or future guests.\n\nOn a positive note, we did have wonderful service from the wait staff at the \"Chelsea Chowder House\". We would recommend walking around the boat and seeing the historical wonder, and maybe grabbing a bite to eat. We would not recommend staying abroad the Queen Mary!\nShow less"], ["Reviewed September 1, 2017", 5.0, "Amazing history tour!", "We took the free Downtown Passport shuttle to the Queen Mary from our B&B on East Broadway. We booked the Glory Days Historical Tour and absolutely loved it! Our tour guide was very informative with a great sense of humor. The history and grandeur of this ship is amazing! After the tour, we continued to explore the engine room and check out the propeller. Certainly worth looking at!\nWe took many amazing photos and finished off the day visiting the gift shops (reasonably priced). The Queen Mary was the highlight of our stay in Long Beach!\nShow less"], ["Reviewed August 29, 2017", 4.0, "History", "The QM is free after 6 pm, so during the summer months it is a great bargain! Parking will be validated if you spend $20 at the bar. Amazing historical ship. Kids and adults will find it interesting."], ["Reviewed August 24, 2017", 1.0, "Disappointing", "We had high hopes for this visit as our family spoke highly of it. Unfortunately many areas were closed off for maintenance and no employee informed us before we paid almost 30 dollars each to enter."], ["Reviewed August 23, 2017", 5.0, "memory maker", "Very unique and very very fun. We really liked our room even with a bit of a slant. All was so nostalgia."], ["Reviewed August 21, 2017", 3.0, "Mrs", "Was not impressed with our Queen Mary stay. We were subjected to Vacation club sellers as we arrived in reception. The walls in the cabins are paper thin and had to listen to the going ones in the neighbors cabins. The air con had one temperature and that was on freezing. Our repeated complaints were ignored. Hopefully the renovations going on will make lots of improvements as the concept has great appeal.\nShow less"], ["Reviewed August 19, 2017", 4.0, "Glad I went", "I agree with the many reviewers who commented that this piece of history should not be missed. We had a nice lunch at Chelsea's Chowder House, then started the tour.\n\nI would give the efforts of the staff and the nostalgia of the ship a 5. However, we were very disappointed that we paid regular ticket price and several areas that would have been on the tour were blocked . This was due to the Art Deco Festival and other events.\n\nOtherwise, I recommend visiting The Queen Mary. Make sure you are rested and ready for plenty of walking and stairs - you can use the elevator but we enjoyed the interior staircase . Be sure to take time to sit and reminisce . Last , take home a souvenir - many of them are tasteful and reasonably priced.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Great experience.", "Went here while we were in Anaheim. The Queen Mary shouldn't be missed on a visit to the L.A. area. We toured the ship and took in the 4D movie and the Titanic Exhibit. All excellent. There is a self-guided audio tour of the ship that is offered but unfortunately was not that day because of renovations that were going on. So we went without it. There are tours that are offered as well with a guide (with lots of information). The ship is a sight to see in all of it's majesty. Would highly recommend a visit to the Queen Mary. Make sure that you visit the radio room. Bill and Bill are wonderful!\nShow less"], ["Reviewed August 17, 2017", 3.0, "Nice but expensive", "It was really interesting to see how luxurious this boat would have been almost 100 years ago. At our arrival we were a bit astonished by the entrance fee of 29 dollar. And to see everything the income price was 39. By checking on the website we were even more surprised to see that the income was free after 6 pm. We decided to come back a couple of hours later and we had also a nice self guided visit and had a good impression of the Queen Mary too !\nShow less"], ["Reviewed August 17, 2017", 4.0, "Sail the seas without getting sea sick", "The Queen Mary offers a great opportunity to see a grand ocean liner and in all of its glory without setting to sea. The history and grandeur of the ship show how ocean cruising used to be."], ["Reviewed August 16, 2017", 4.0, "Highly recommended.", "Great tour. Very knowledgeable tour guide. Do miss the self quided trip of all the model ships. Would highly recommend."], ["Reviewed August 16, 2017", 5.0, "Fun time exploring the ship", "The Queen Mary is a must visit in Long Beach. My family and I had a great time exploring the ship and taking pictures. We took advantage of the free visit after 6 and just took our time exploring."], ["Reviewed August 16, 2017", 5.0, "Grand old ship", "I live so close but haven't been there since a 6th grade field trip. Wanted to see the princess Diana exhibit. Also did two guided tours. Great visit especially if you're interested in The Titanic or history. The bar and the restaurant were also great. Would recommend and I'm definitely going back.\nShow less"], ["Reviewed August 14, 2017", 5.0, "The Phantom of QM", "This is the twin of QM NY. I was an alone tourist in Long Beach that day. And I stayed on the game. I made the tourist. Snuggled by the personnel, walking through the famous swimming pool (why is it so famous? Discover it!), listening to the saloon history, stroke poses with cast, phantomed by Hostess' tell i let myself go in the history of Jews, wars, Churchill who travelled under nickname, cigars, hats, dresses, shops and 4D underwater movie with water on your body. It's good to become a tourist for one day. Great choice for all!!!\nShow less"], ["Reviewed August 13, 2017", 3.0, "Size of ship is amazing, but plan your visit right.", "Tips to make the most of your stay:\n- Plan to be at the Queen Mary for at least half of your day. I would recommend eating on board at one of the restaurants.\n-Do a guided tour if you can as the self-guided tour without an audio guide is very confusing and doesn't really teach you much about the history of the ship.\n-Parking costs less if you eat on board the ship and have proof of receipt.\n\nThe enormity of the Queen Mary is amazing as you approach. Even knowing what you are going to see, the size is hard to grasp. I purchased my ticket through the LA Go Card which gave you access to the ship with a map and one exhibit.\n\nParking on the grounds was confusing even with cones up, but staff in the lots are very friendly. When you get your tickets, you are given a map, but the map was also unclear and I found myself wandering around the ship unsure of where I was supposed to go since most of some of the decks are part of the hotel.\n\nI had tickets to see the Diana exhibit which was supposed to open at 11 AM, but didn't open until 11:30. Since I had to leave by 11:45 due to my own scheduling, that really cut my time down. The exhibit has a lot of things that I didn't have time to look at and a handful of Diana's dresses which were really the highlight. I wish I had more time to explore.\n\nParking costs $18 if you stay for more than an hour. I think if you follow my tips at the top, your experience will be good. I wish I had known about those things prior to going. While I enjoyed my visit, I could have enjoyed it more.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Spooky fun", "My friend and I went on a birthday chick trip and decided ghost busting on the Queen Mary was in order. We had a great time! The views toward Long Beach are pretty day and night. We took the 8:00 pm ghost tour, and I got pinched in an area of the boat where the engine are and where a guy (John?) was crushed in a door. I was standing by an escalator. I'll post a picture...of the escalator. I kept quiet about it because I don't like attention. Maybe a bug bit me, I don't know, but I got pinched. It's a good time and even interesting without ghosts.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Back in Time", "This was an amazing place to visit. Walking on all the uninhabited decks and levels was eerie... You could imagine the ghosts of former inhabitants roaming the ship. There are some parts which still house hotel accommadations for current guests...glad to see it is still used in this way .\nThe gift shops on board were so of the time...they even still use the bar...which was so authentic.\nThere was a Princess Diana exhibit, which was so amazing...from her dresses to the personal lives of the Royal Family...being an Anglophile my entire life...this was a real treat for me!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Romantic date with the hubby", "Had an amazing night with my husband we spend the night in on of the rooms and service was amazing everything was so clean it was just perfect for our romantic night 👍"], ["Reviewed August 9, 2017", 5.0, "A wealth of history", "It was a long time ago that my daughter and I visited the QM. We walked through the museum, looked at all the pictures, learned so much about history, all things I was never taught in school in Europe. This is a wonderful way to educate our younger and not so young generation about the QM and it's history. I suggest that everyone goes on a tour guided or self-guided at least once in their life time. Spend enough time (several hours) to make the most out of your stay on that ship and enjoy everything you get to see and learn. Many opportunities are offered: weddings, parties, etc. etc.\nShow less"], ["Reviewed August 8, 2017", 1.0, "Poor value, wasted potential.", "We visited the RMS Queen Mary as part of a combo package with the USS Iowa. This review in no way relates to the USS Iowa which was wonderful and well worth a visit.\n\nOur visit started badly when we were told that our tickets (with bar codes) had to be exchanged for Queen Mary tickets via a long queue. We were then offered our choice of tour at a time about four hours after our arrival. We chose the Glory Days tour because we were actually interested in the ship. We were then ushered onto the ship without a map (they had run out) and left trying to work out what we were supposed to do for four hours.\n\nThere is currently lots of work going on aboard the ship which made navigation difficult with wooden walls blocking many routes. We also discovered that the bridge was closed, no audio tours were available, the staterooms were off limits due to functions and that the only place to buy food was the hideously expensive Sir Winston Churchill restaurant. We eventually discovered some exhibits in the bowels of the ship.\n\nHaving exhausted the entertainment options with two hours to go until our tour, we decided to leave feeling very very ripped off. I'm sure our American cousins love the Diana tour, but we came to see a famous ship with an incredible history and received a shoddy experience in what is clearly mainly a hotel. My advice would be to do something more interesting and rewarding instead like visit the USS Iowa.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Princess Diana Tour", "The history and information was thrilling, could have spent all day there! Next time I would take a guided tour to get the history of the boat."], ["Reviewed August 6, 2017", 5.0, "Loved the history and the tour on the Queen Mary!", "The tour staff and iMax staff were very friendly. The tour was fun and Daniel (our tour guide) was great. We had such a great day on the Queen Mary!"], ["Reviewed August 6, 2017", 1.0, "Queen Mary", "Enjoyed the visit for the most part... There's no doubt that this ship has her place in history and the engine room,QM Voices and certain beautifully preserved Art Deco detail were a must-see...\nHowever, some \"renovations\" sit uncomfortably with the original Art Deco and more care could be taken in renovating within the period style.\n\nA hugely upsetting experience within the Diana Exhibition.... We were enjoying browsing the exhibition, when out of the blue we were told we had to leave because the security girl had received \"complaints\" about our party. (As you enter the exhibition, all guests are told there is to be no photography of any kind... something we were all mindful of, and at no time did we attempt to take any photos).\n\nIt turned out that my teenaged son had taken out his mobile phone to check the time... none of us had taken any photos, nor had any intention of doing so (I had not even touched my phone the whole way round) but we were made to feel like criminals and treated very shabbily. We are law-abiding citizens and were very shocked and upset to be addressed as miscreants and asked to leave. I'm afraid I found it very distressing.\n\nIn fact at first I found the whole thing hard to believe and wondered if it was some kind of \"candid camera\" set-up...!\n\nSurely, if you are going to accuse guests of not complying with the rules, you should check that you are correct in your accusations... a thoroughly unpleasant experience, I'm afraid.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Don't miss this Ship", "This will really make you appreciate old craftmanship. It will be free after 6pm but you are on your own. Parking is $18. Worth the free walk around. Food and Lounge is kinda expensive. Might consider the Hotel next time."], ["Reviewed August 4, 2017", 4.0, "Nautical history", "We used the metro to get to Long Beach and then a shuttle bus, Uber may have been better option and not really walkable from town centre. The ship itself is amazing and you are taken back to the glory days of trans atlantic luxury travel. The place is disorganised, and combined with a lack of signage outside (like prices/option, entry) and inside (like directions to next place to visit), could have been much better. The tour didn't add much to the experience and accessed only one room not able to be seen self guided and too slow. Nice to have a small cafe on board. This is a great piece of history which needs some work to improve the experience (unless you like getting lost). They should also open up more of the ship and a few berths for inspection as well.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Great place to spend a couple of hours", "My husband and I were in Long Beach and decided to take a trip out to the Queen Mary at 6 PM when admittance was free. It is a great place to spend a couple of hours exploring the ship and reading all the historic facts about it.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Very historical", "We took a personal tour after hours which is free we had an amazing time bought a bottle of wine and they have a beautiful bar as well this is a five-star location and they have plenty of hotel rooms as well you must check it out\nShow less"], ["Reviewed July 30, 2017", 1.0, "Boring and not worth the money to visit", "We spent $150 on tickets for a family of four, plus an additional $20 for parking, and found this not worth the money. The universal consensus was it was boring. There are very few things to see when you are on board and the extra exhibit we tried to tour was a joke. We chose the Titantic exhibit and all it consisted of was a room full of photos and the power was off in 2/3 of the exhibit!! It was difficult to find things on board and even more difficult to find someone to direct you.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Awesome!", "We walked around the ship on our own for about an hour then took the Glory days tour. James was our tour guide and he was amazing! He was very knowledgeable and articulate. He made the tour interesting for our children by being very dramatic. \"This way my familyyyyyyyyy...\"...you will understand after you take James's tour.\nShow less"], ["Reviewed July 25, 2017", 3.0, "Entertaining if you're looking for something to do.", "We visited the Queen Mary for the evening ghost tour they have. We went to the bar (not the resturaunt) to have a drink before our tour. The staff at the bar and tour check in left much to be desired. The boat could use some renovations. The carpet is worn badly and had a smell to it. They did mention during our tour that they will begin painting the boat soon. The ship has some exhibits onboard and those were very interesting to see. The tour guide was entertaining and fun. We didn't see or hear any ghosts but we did have fun.\nShow less"], ["Reviewed July 24, 2017", 3.0, "Good tour but renovations are in progress", "We enjoyed touring the Queen Mary. We explored much of the ship before we took the history tour. It definitely is not a wow! attraction. They are starting renovations on the ship. So you may want to wait until these are completed. The special exhibit on Diana and the Royal Family was very good to see.\nShow less"], ["Reviewed July 23, 2017", 3.0, "Ok", "Interesting to see but not as \"wow\" as I thought it would be. The historic tour was good. The ghost tour was ok. The guide was good but basically there isn't anything paranormal here so they tell a few \"maybe\" stories but nothing scary. It's a nice stop. Don't spend the night.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Go after 6pm!", "I was happy we went after 6pm (based on our hotel recommendation) when it's free. The history is neat to see and, as a cruiser, it's amazing to see how ships still look so much a-like after 100 years. That said, the QM needs a little bit of work. It was confusing to know what you could or couldn't visit (still never found the bridge, despite following signs). The engine room visit is amazing, although there's not much in terms of descriptions. Maybe a guided tour would of helped. Didn't see much hand's-on things for the kids to do. More an adult visit.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Iconic, needs some TLC", "This was one of my must-sees I had planned on a recent road trip. From the outside the ship is impressive. First on my list was seeing the Princess Diana exhibit. To start the exhibit, there was a lot of memorabilia, photographs and history of the royal family. You can spend a lot of time here if you want to look and read everything that is displayed. At the end of the exhibit Diana’s dresses were beautifully displayed. Most of the displays had a picture of her showing when she wore the dress. We choose the historic tour next. It lasts about an hour and tours a few parts of the ship, including the ballroom. The tour was filled with interesting history and facts about the ship. Unfortunately, all the hotel rooms were occupied so we didn’t see any staterooms. If you get a chance, take the self-guided tour through the engine rooms – this was very impressive. The tea room was closed so we went to the Starbuck’s on board and enjoyed our coffee/tea on the deck. Parking costs $18.00. The ship definitely needs some TLC (especially painting) but for me it was worth seeing this piece of history and imaging what it was like back in the day.\nShow less"], ["Reviewed July 21, 2017", 4.0, "Queen Mary Hotel", "Absolutely love all the history of the ship and all the tours that are available..\nIt's a beautiful old ship ...\nThe rooms are clean and have lots of the original wood in them ..\nIf you don't mind staying in some history with some updates you'll love it !! We like staying on the ship ..\nBut.... my experience in trying to take a shower was not pleasing at all !!\nIf you don't mind a bath it's fine .\n\nI think for the price $$$ that we paid the shower should work or they should give you a heads up !!\nShow less"], ["Reviewed July 21, 2017", 3.0, "Disappointing from the outside", "Had expected more of the QM. We specifically drove there to do one of the tours, but it all seems very old and not so well maintained. When we noticed the prices of the various tours (starting at US$ 29.95 per person) we figured not to take the chance and spent over US$ 120,-- for the four or us. All based on the appearance from the outside, it all looked a little worn down and old. On the other hand, it's always nice to be able to have seen some history, even if it's only from the outside.\n\nIt looked like the hotel inside attracted quite some guests, although the bell boys on the outside of the hotel gave me the same feeling as the QM itself, not very well maintained. I suppose it could say a lot about the mentality inside, as a hotel manager I would take care that the staff on the outside wear fresh and well washed clothes, to me it did not appear as such.\nShow less"], ["Reviewed July 20, 2017", 5.0, "A must see!", "I had the pleasure of hearing the Captain speak about this beautifully restored vessel. What a treat. The service was great, from the gift shop to the food. A must see!"], ["Reviewed July 19, 2017", 4.0, "\"Her\" History is Amazing!!!", "We were looking for a family outing somewhere cooler and along the coast. The Queen Mary was suggested and so glad that we drove about an hour to get there away from the 100+ weather inland. There were five of us ages 19-70's and felt this was very interesting, especially since we all enjoy history. And the QUEEN sure has made some amazing history!!! She has played many roles throughout her illustrious career. For many years she was considered the grandest ocean liner ever built and many Hollywood stars made memories aboard ship. With the outbreak of WW 11 the QUEEN was transformed into a troop ship and transported more than 800,000 troops. Some slept on cots up to seven cots high!!! She retired in l967. Be sure to see the fun 3D movie and take a tour. Very interesting and we all learned so much.\nShow less"], ["Reviewed July 18, 2017", 5.0, "A step back in history", "We spend the weekend aboard the Queen Mary, and it was great stepping back in time, with plenty of opportunities to immerse ourselves in the history and legends of the ship. Particularly nice was the forward Observation lounge, which we found ourselves enjoying several times over the weekend for everything from casual happy hour drinks to evening karaoke. Another stand-out is the nighttime shipwalk ghost tour, a longer experience, and in the dark of night really enhances the spooky stories... this was a lot of fun. Then there is an abundance of historical displays and original furnishings and decor that are wonderful to just stroll around and see in your own time (the audio tour was offline for construction, but there were information placards everywhere). We didn't have time to do everything in two days, so there is plenty to see and do aboard the Queen Mary!\nShow less"], ["Reviewed July 17, 2017", 4.0, "Walking through history", "We took a tour of the immaculately preserved Queen Mary. Our guide, Doug, was knowledgeable and funny. It was incredible to see how the upper class traveled across the Atlantic in the 1930's. Doug took us throughout the ship, though the grand ballroom was certainly the highlight. We were not able to see the staterooms, as the ship is now open as a hotel.\n\nOn the lower decks, you were able to take a self-guided tour through the engine room and see one of the massive propellers in a special tank made on the side of the ship. The tour also took you through the medical center, the quarantine unit and the open decks.\n\nThe Queen Mary is a piece of history and an engineering marvel; history buffs and even modern day cruisers will enjoy learning about the history of what is now a favorite form of vacation.\nShow less"], ["Reviewed July 17, 2017", 4.0, "Great attraction for hotel guests", "If you are staying at the Queen Mary, all the many attractions are will worth it. Just walking around the ship is worth the ticket price. If you are not staying on the ship/hotel, the attractions seem pricey for what you get. I would have been a bit disappointed if I had paid full price for the tours.\nShow less"], ["Reviewed July 16, 2017", 3.0, "Interesting", "We visited as part of a package with Aquarium tickets. The 4D movie was interesting. There was also the choice of a Titanic or Princess Diana exhibit. There was not a guided tour available so we had to find the available locations on our own."], ["Reviewed July 16, 2017", 5.0, "Walk through history and then dine", "Great way to get a glimpse of times past when folks major method for crossing the oceans was a luxury liner. Rooms filled with displays and fantastic artifacts from a period now past. Restaurants and bars open, gift shop available, and a good view of the harbor.\nShow less"], ["Reviewed July 15, 2017", 2.0, "Princess Diana Exhibit at the Queen Mary", "I brought my mother to the Princess Diana Exhibit at the Queen Mary. We were both disappointed. There was a large amount of photography and memorabilia on other British royalty, but not much for Diana. Some of the pieces in honor of Diana were almost laughable. Like a dress that somebody made for their doll that was somewhat similar to one Princess Di wore. There was a small collection of her dresses near the end, but I was expecting more. I'm glad I purchased this with a Groupon. I would have felt ripped off paying full price. I was glad to be able to walk around the Queen Mary, a beautiful ship made in the days when quality mattered.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Dining with the spirits", "I celebrated my birthday recently at Queen Mary’s Sir Winston & did “Dining with the Spirits” which included a 3-course superb dinner and a paranormal tour of the ship. Everything went very well from the planning stage to the final celebration. Karen Sellers & Michelle Mahurin were very helpful in planning the event & offered helpful suggestions (like doing the tour at 5pm instead of 7pm, since some guests had a long drive home). We had a photo shoot before the very informative tour. Our Tour Guide Tony took us to nooks & crannies in the Ship (not open to everyone), and had a very interesting story to tell at each stop. Dinner entree selection included vegetarian as well as steak, salmon & chicken – so there was something for all types of palates. Our servers were very attentive and even took pictures of the group. All-in-all a very memorable and wonderful experience – a great way to celebrate a happy occasion! Thank you Queen Mary!\nShow less"], ["Reviewed July 12, 2017", 4.0, "Hands on history...", "This is a great visit especially if you have teenagers with inquisitive minds.. the tours are fun, but wandering the ship checking out what made it 'tick' was the real fun for us..."], ["Reviewed July 12, 2017", 4.0, "Queen Mary not a ghost ship.....", "she is just a old girl who deserves love and attention. If you are only going for the ghosts, they may not show up.\n\nOne time I stayed there, my daughter couldn't get to sleep (jet lag) and so I walked around with her in my arms trying to settle her. It wasnt until about 20mins later that I remembered the ship was ment to be haunted, and so like a coward I ran back to my room. I couldn't believe I'd forgotten. But I never experienced anything supernatural.\nShow less"], ["Reviewed July 9, 2017", 3.0, "Management has gotten lazy", "I loved the idea of staying aboard such an historic ship. What a great idea to turn it into a hotel.\n\nBut holy smokes does it need attention. Carpets are worn thread bare, duct tape is used throughout for patching and the bars smell like the day after a New Years party.\n\nThe rooms are pleasant and the staff attentive, but whoever manages this place needs to find a new gig. Someone needs to come in that gives a care.\n\nI'd bet the excuse is there's no money to make repairs. But if you look at the pricing of things throughout the hotel that argument falls flat.\n\nI get that it must cost a ton to keep this place up, but if you can't make repairs to the place, no one will spend a dime here and you might as well mothball it.\n\nShow some attention, show some passion and commitment and at least care about the place. The ship deserves much more than a dial it in kind of laziness.\nShow less"], ["Reviewed July 8, 2017", 1.0, "Don't get your hopes up.", "I usually try not to write a really bad review, but our afternoon on the Queen Mary demands this. We were prepared for an audio tour, which was not available. We were told we could do a self tour, but most of the ship was closed. The only restaurant available had Formica topped tables (not what one expects for a mid-range restaurant on the QM). We did have a guided tour later, but the leader was so into his memorized script that he was rude to anyone who asked questions. The desk clerk at the hotel part of the ship was equally as rude and condescending. We were treated like we had third class steerage.\n\nThis COULD be a beautiful piece of history and culture, but the deferred maintenance (floors, decks, railings, paint, you name it --) has gone too far. That added to the attitude of the few staff we met makes this an easy one to cross off your list of things to do.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Piece of History", "I attended a conference in Long Beach earlier this year and decided to have stroll on the vessel. Due to the conference admission was free, so I don't know how much they charge.\nThe vessel itself is impressive, esp. the 16 ton anchor and chain or the old pictures and the miniature vessels on display.\nI would recommend to have a closer look at the Lego replica and maybe you can find the cat? I did.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Dining at the Observation Lounge", "The lounge is located forward and has a great view overlooking the bow, its decorated with original \"art-deco\" paintings, lights and fixtures...a treat for the eyes! The food and drinks were fine!"], ["Reviewed July 7, 2017", 4.0, "Great ship!", "It was cool to see this ship. We got tickets for the tour that they offered, but honestly you can do the tour by yourself, without paying the fee. While waiting for our tour to start we were allowed to check out the ship ourselves. After the tour I realized that the only thing that we did see extra was the ballroom. So, don't waste your money! Tour it by yourself! You will save money and time!\nShow less"], ["Reviewed July 4, 2017", 1.0, "Vip is not that VIP", "We went to July 4th event. and got the VIP ticket, which is $50 extra. According to the website this extra $50 is for \"exclusive access to premium firework viewing.\" But after we finished our dinner and head to VIP area at 8:45 (the firework start at 9), the guard dont let us in, said it is full. So have to stay at gerenal admission area. This is how they treat the VIP. We wasted extra $50 for doing nothing.\nAll I want to say is, If you dont have that much space for VIP, dont sell that much VIP ticket.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Look around.", "The models are my favorite, tour fine, but this was once a ship that sailed and the floors, the walls, even the painting in the observatory room ( lounge) is original. Take your time, and look, imagine."], ["Reviewed July 3, 2017", 4.0, "well worth visiting, but the quality of the tour guide will affect the experience", "Our visit to the Queen Mary was an interesting one and we were glad that we decided to take the tour. The ship offers a variety of tours--haunted (heaven knows why), Princess Diana (seriously? What relevance does she have for a ship whose heyday occurred and ended before she was born?!), historical, and one or two others. We opted for the historical tour, which lasted for about an hour. The tour focused on a little bit of the ship's history and took us into a few areas that were not otherwise available to the general public. But it also completely neglected all coverage of things like what life was like for the crew or passengers' experiences on the ship. The tour did not cover much of the ship's physical space, leaving more questions than it provided answers. The art deco décor of the ship was lovely to see and we did learn about the ship and its history while there. Our tour guide was fun and good at his job; but for the price paid (which was not inconsequential for a one-hour tour), we were left wanting for more.\nShow less"], ["Reviewed July 2, 2017", 1.0, "I want my money back", "Worst experience ever, 60 bucks to the trash can,all were closed due to a private event,so I paid 60 for enter the ship,use the elevator and that's all and don't forget the 18 dollars parking,waste of money,really I want my money back."], ["Reviewed June 29, 2017", 3.0, "Great for historical visit BUT.", "Booked in for 5 days so we could visit all of LA region. Boat is fantastic and state rooms comfortable. But be aware..walls are thin and most rooms have adjoining doors which means you hear everything next door. You are charged parking at $15 per day hotel rate. Everything on board is expensive even at L.A. standards. Shops open at 9 and shut at 6 if they feel like it. Boat is used for weddings and conferences which is not good as you are not treated as a guest. Please note the sunday brunch is just a $60 PER HEAD BUFFET. Nothing else. It is packed but no queues for food. We were impressed with the boat but not the hotel experience. We drank at the bar on 2 occasions where line american guys sat swearing at each other at the bar. Sorry but now we have visited we would not return\nShow less"], ["Reviewed June 24, 2017", 4.0, "An Icon Comes to Life", "So glad we decided to go on the Queen Mary. First it was \"let's just see where she is\" and then you see here and say, I need to se more! We learned so much about here and the fight for supremecy on the ocean as the fastest luxury boat. For any engineer, someone who likes engines the tour into the engine rooms, seeing the anchor, seeing all the work and knowledge it took to run a steam engine boat with the size and needs to do so and the knowledge the workers had (no push button job with computers running it) was so worth seeing. The stories from the service men who used the Queen Mary during WW11 was very heartfelt. Walking the hallways and seeing the beautiful woodwork was so enjoyable. PLUS we caught the Princess Diana display with her dresses and so much more, that was a bonus!\nShow less"], ["Reviewed June 22, 2017", 4.0, "A must-do in Long Beach", "This cool tour of an icon boat is well worth your time. They also do special events from time to time."], ["Reviewed June 21, 2017", 5.0, "Worth Seeing this History", "The Queen Mary ship never seems to disappoint. From attending a wedding or out on a date, you can spend almost an entire day on the ship and explore its wonders."], ["Reviewed June 20, 2017", 4.0, "School Based Health Conf", "This was an amazing tour of one of our historical pieces in the U. S. Long Beach is lucky to have the Queen Mary. Lunch at Chelsea's Chowder on the ship was delicious. Our paid tour called \"Glory Days\" was well worth the time with a very knowledgeable guide.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Worth the Effort", "I've visited the Queen Mary often over the past 10 years. The restaurants are excellent. The rooms are quaint, but a fun experience. They have excellent buffets. I would skip the ghost tour, it's pretty hokey. You can still explore the ship without going on the tour (minus the pool, unless they changed that). We always enjoy eating Thanksgiving dinner at Sir Winston's restaurant which, in my opinion, is worth the price.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Best thing in Long Beach", "Whether you're a history buff, a fan of ships, old Hollywood, the U.K., the paranormal, or all of the above The Queen Mary is a must-do! It is absolutely gorgeous! We stopped by in the late afternoon and it was free admission (check the website for times and dates). Only down side is we only had about an hour or two to explore the entire ship. We could have spent many more hours there! Entire family enjoyed it\nShow less"], ["Reviewed June 15, 2017", 4.0, "Worth A Stop Just For The History Of This Great Ship", "We actually stayed on the Queen Mary and although I wrote that hotel stay up separately, I will say I did like staying in the Winston Churchill Suite. I heard a tour go by and they said all the suites were taken so they can't show you the bath knobs as there are 4 of them, 2 for salt water and 2 for fresh water. Of course, I witnessed that myself in my room. Too bad because I think the tours get cheated if all the suites are taken and if the 1st class lounge and smoking rooms have a party in them (which apparently they do most weekends). You can take a self guided tour through the ship so there is no extra fee but I think you may miss a lot since many areas are locked. Even with that, there are a lot of pictures and history signs posted throughout so you can see and read for your tour. We took a private self guided tour so that way I can have someone get us in to the areas I wanted to see unless they were being remodeled as the bridge was (which was a bummer - I wish they would list the place that are not open on the tours). The engine room is fascinating. So I think if you are in the area, it is worth the time to see the Queen Mary if you like history.\n(To Travel Is To Live)\nShow less"], ["Reviewed June 11, 2017", 1.0, "Don't waste your money", "They used Princess Diana as a drawing card, knowing people would respond. The exhibit however has very little to do with her, and very few items. It is a hodgepodge of stuff from many members of the royal family. Mostly, it is bric-a-brac and tons of Diana dolls. Well, I guess you could go to a toy store if you wanted to see dolls. They have a few of her dresses, and pictures that everyone has seen a million times in various newspapers and magazines. It costs close to $30 to see this, and let's not forget the almost $20 for parking. It is a complete waste of money, as there is nothing to see her folks.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Be ready to break out the pocketbook", "What a nice place, nice hotel, nice restaurant, nice exhibits.\n\nWhat great history, Cunard Line, Queen Mary is its finest.\n\nThe downers\n\n$18 parking if you stay over an hour!\n\nPushy staff who aren't friendly, would not let my wife use the bathroom while I was on a phone in the parking lot. The acted like we were trying to getaway with something for free when we came to enjoy experience.\n\nDo you Want to go to just the restaurant and spend $150 in meals and drinks? That ain't happening either without some ridiculous policies about paid entry which i paid anyway. Get ready to be hassled over it.\n\nThey could use some policy changes to be more customer centric. I don't mind spending for an experience but I do mind a dealing with a crusty customer service approach, thus why isn't getting a five star from me.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Interesting piece of history", "If you are a bit of a history buff you will enjoy visiting the Queen Mary. We rushed through our visit and spent most of our time at the Princess Diana exhibit in March. TO be honest I would be very interested in staying at the on board hotel to get a proper experience. Our short tour was enough to likely lure me back again someday, maybe even to stay the night and take in a ghost tour.\nShow less"], ["Reviewed June 6, 2017", 4.0, "A little disappointed", "Visited QM many years ago just after she opened as a hotel and was disappointed to see she was needing a lot of TLC. However when taking the tour the guide advised that they were to start a refurbishment programme soon. The QM is still impressive inside and the exhibitions are informative and give you a sense of the period she was built and the work she undertook during WW2.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Beautifully kept piece of history", "This ship has so much to offer. It was part of the ocean liner race, part of WWII, and is now sitting docile in the port at Long Beach. We were able to see the quarters, the bridge, the engine room, and it's also opened to the water so we could see one of the propellers which are MASSIVE. There are plaques up throughout the ship telling history and ghost stories. There is also a room that has models of other ships and a cutaway of the Queen Mary herself.\nShow less"], ["Reviewed June 6, 2017", 2.0, "A re-visit to the Grand Old Lady after 30 years", "We last came here 30 years ago when it was lovely and really good value for money. We were utterly disappointed this time. She needs either serious money spending on her to bring her up to scratch and safety - a lot of the decks were rotting, paint peeling, or she needs to go to a watery grave. The last time our entrance ticket allowed us to view the ballrooms and other rooms inside. This time, we only saw a very dingy corridor. The restaurants were totally overpriced, so we didn't eat here. Being a couple of people who love ships, we really wished we hadn't come. Wake up Long Beach, you still could have a very good attraction if only you were prepared to spend some money on this lady to bring her back up to scratch.\nShow less"]]}}