{"The Huntington Library, Art Collections and Botanical Gardens": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Huntington Library, Art Collections and Botanical Gardens", "url": "/Attraction_Review-g33029-d110203-Reviews-The_Huntington_Library_Art_Collections_and_Botanical_Gardens-San_Marino_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/2a/09/f0/statuary-garden.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "2042"}, "address": {"@type": "PostalAddress", "streetAddress": "1151 Oxford Rd", "addressLocality": "San Marino", "addressRegion": "California", "postalCode": "91108-1218", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed today", 5.0, "Looove it!", "The Huntington Library is definitely one of my favorite places to visit in LA County. My first visit was in February 2017 and I enjoyed it so much that I became a member. As a member, I have visited several times in the past year and I have enjoyed every visit. The Japanese and Chinese botanical gardens are absolutely beautiful. All other botanical gardens are also pretty great and the few cafes available serve tasteful and quality food. Whether you want to enjoy art, exhibitions, botanical gardens, or a good book or picnic on one of the lawns/gardens, this is a great choice that will never dissapoint.\nShow less"], ["Reviewed 4 days ago", 5.0, "Gorgeous grounds and really interesting museum", "This is a beautiful place and an oasis in crazy LA. Spent about 5 hours. They have a variety of beautiful gardens.....Chinese, Japanese, Desert, Austrailian, etc. Just wondeful. Art collections in the museums are amazing. Had a nice lunch at one of the outdoor grills. Beautiful photo opportunities everywhere.\nShow less"], ["Reviewed 5 days ago", 5.0, "Extensive Buildings, Impressive Exhibits & Grounds", "We visited the Huntington Library on Sat. 23 Sept. 2017. There’s free parking on site. Especially delightful was seeing the many excellent displays of rare and original manuscripts & publications. Placards described the importance of the work and provided context to the times. It takes a lot of walking to cover the many buildings holding American and European art and the extensive Chinese & Japanese gardens. We spent five hours including lunch and saw about 75% of what is there. Weekday admission $25 Adult, $21 Senior (65+) & Students, $13 Youth (4-11), weekend & holidays additional.\nDid this review earn a “helpful” vote?\nShow less"], ["Reviewed 6 days ago", 5.0, "Went for afternoon tea and found so much more", "We travelled up from the beach to the Huntington Estate which took an hour with no traffic hold ups. If we had caught traffic it would have been a disaster as you need a full day to scratch the surface of this wonderful estate. We had been given entry tickets ($21 each seniors) and the price of afternoon tea in the rose garden ($35 each) as a present and it was one of the best presents we have received in a long time. The gardens were fabulous, even though it was too early for most things - imagine what it will be like in the summer, there was so much to see and explore. The Japanese garden was our favourite with a remarkable collection of bonsai and sympathetic planting. We could only wiz through the two main galleries and the library as we had so little time but, although they make a big thing of having Gainsborough's Blue Boy, there are a couple of Turners and Constables too. Our afternoon tea was a great success and so well delivered - make a reservation as you could be disappointed. We can't wait to go again in November when we are next over in this part of the world.\nShow less"], ["Reviewed 1 week ago", 5.0, "The Hunting library tour was excellent and informative. We had such a lovely time and I can't wait to go again.", "It was a wonderful tour and I would recommend this to anyone. Our tour guide was so informative and polite. We had such a lovely day."], ["Reviewed 1 week ago", 5.0, "Great Day in a Great Place", "My wife and I recently took the garden and estate tour, and afterwards visited the galleries. What a lovely place to spend a day. The docent (Virginia) leading our 4 person tour was truly outstanding, with just the right balance of facts, stories, and quiet time while we enjoyed the beautiful surroundings of the gardens and buildings. The galleries stunningly present the collections in a way that makes them easily accessible and interesting. Don't miss it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful place to visit while in Los Angeles", "I have lived in LA all my life and never went to the Huntington. What a lovely place to spend the day. The gardens are just wonderful. The artifacts they have on display are fascinating and you could spend several days there without truly seeing everything.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing Gardens and Amazing Art Collection", "We are here at East Los Angeles College for a four day swim meet and found out about this place and decided to sneak there for a couple hours between the morning and evening swims. We wish we would have had more time. The gardens are beautiful. We were limited on time so went to see the Japanese Gardens, where there are some wonderful bonsais, the Chinese Garden, which was so beautiful. We ate lunch at the Freshwater Dumpling and Noodle House. No reserved seats, but were able to find a table outside overlooking the pond. We shared a winter salad and a Hunan Rice Bowl. The Huntington Mansion houses wonderful art, including the piece called Pinkie and Blue Boy. Our only regret is that we didn't have enough time to see more. We were there 3 hours. Indeed we were a bit frustrated at first trying to orient ourselves but if you read the map that you are given, it isn't to hard to figure out. There were many people around to ask and they were helpful in guiding us to place. We wanted to eat at the Rose garden Tea house bt did not have reservations, so I would recommend them, we would have been seated a couple hours later but we were on a time crunch. Parking was free and admission was 25.00 per adult. A beautiful place in a big city........\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Brilliant", "This should be on anyone's itinerary in the Los Angeles area. Gardens great (also being extended) other displays of art and the libraries with world class items make this a real gem. We've done all the usual in LA area (Getty, Natural history etc.) and this is the pick of them all, mainly because of such a variety things to see. If you are visiting from Europe this doesn't seem to appear on itinerary lists from the usual travel guides. Just read a review saying it was difficult to navigate and the \"staff\" were unhelpful. Not our experience! Map is dead easy to follow and the staff (mainly volunteers after all) were very helpful!\n\nLoved it and a day wasn't enough!\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Shame on you, Huntington Gardens!", "The grounds and botanical gardens are spectacular, without a doubt (which is why it gets such continued good ratings) BUT: this place is confusing, with maps that don't take you anywhere, and with a staff that doesn't know where they are, or how to tell you how to get to where you want to be. There was little to no signage on buildings--we had no idea what was where, and the directional signagle was basically non-existent. During our entire visit we continually came across others who were lost and asked us for directions. We paid almost $100 for 3 people on a Sunday that touted a camelia sale and display. We found the camelias by accident, and when we stumbled upon the \"sale\"--we found that there was more variety, healthier looking specimens, and better prices at the local nurseries. The citrus gardens were completely off-limits, and while we were told they have a wonderful art collection, we could never figure out which building it was housed in. The gift shop was expensive, but beautiful, with a nice selection, although numerous items had no price tags. Again, the grounds are gorgeous, but their management should be ashamed of themselves for not having proper maps, plant identification signs, and trained staff. WIth these kinds of prices, they certainly should be able to afford it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A wonderful experience!", "If you are in the Pasadena/San Marino area this is a MUST! We spent the better part of a day there and didn't see anywhere near all that could be seen. The art, the different gardens and the restaurants are all delightful. DON'T MISS THIS GEM!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Books, Botanticals and Blue Boy (art & antiques)", "Beautifully landscaped sculpture garden. Lots of paths designed with period and cultural aspects. The art is expectional (broad range). From European to American and exhibit galleries. The antiques (furniture and objects) are quintessential to the property. What a nice broad range. The library and rare collection of first edition books is a must! One must visit this gem property with plenty of time to take in all its facets and features. Images below\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Above and Beyond", "I have been to the Huntington Library and Gardens on two occasions. If you appreciate gardening, this is the place for you! The museum buildings are impeccable and the art work and library titles are simply incredible.\n\nOne should know that you will not see all of library/ museums/gardens in one visit. ( I would say this a place to be savored over at least 5 visits/ different trips.)\nIt is easily a full and greatly appreciated experience for a day.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "The desert garden is spectacular", "I went with my family and we enjoyed all the gardens, but specially the desert garden, the jungle garden and the children's garden. I really enjoyed the classical sculpture dotted around the grounds. There was so much to see we never made it to the art collection or the library.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Commination of arts and gardens", "Good historical heritage you can't miss if you travel Los Angeles. The landscape divided into several independent theme park, indoor botanical and museum. I personal like the desert garden since very seldom to travel in dry desert, there is a lot of difference kind of cactus which never seen before. Chinese garden still increasing, lot of construction site going on. Volunteer tour guides are helpful and friendly. Free parking is a great offer.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A gem, not to be missed in Southern California", "Born and raised in Southern California, it wasn't until I moved away that I visited the Huntington Library for the first time in my long 65 years. And I was totally blown-away! While only a short drive from the centre of Los Angeles, it will transport you miles and miles away from the hub-bub of the city. It's spectacular and should be added to everyone's \"must-sees\" during a visit to Los Angeles. Or even for those day-tripping Angelenos looking for something to do on a beautiful day. An entire day can be spent, meandering the gardens - the best desert garden I've ever seen - including the botanical gardens in Phoenix and Palm Springs - Chinese and Japanese gardens are spectacular! It's a feast for the eyes and the senses. The mansion is extraordinary with a fantastic art collection. Tea in the Rose Garden Tea Room was a lovely throw back to an earlier time - delicious and great service. A wonderful day - a true gem of Southern California.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Allow Enough Time", "The Huntington Library is a great place for a long visit. There is so much to see and do. The exhibits are excellent and the grounds are wonderful. The are several famous pieces such as Blue Boy and a Guttenberg Bible as well as many others. Don't miss the manor house and its interesting history.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A gem, a highlight, must do thing in L.A.", "One of the best memories from L.A. It is mansion that consists of botanical gardens (rose garden, Chinese garden and desert garden), art collection (Blue boy painting and European palace style interiors) and library (Gutenberg Bible) where each part worth a full day. Volunteer tour guides are amazing. Their Café is a thing on it's own, with fancy organic food and terrace facing botanical garden. Gift shop is full of beautiful things that are just pure joy to see and touch. Amazing place.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Very Positive Surprise", "We were going to spend a few hours here, but ended up rushing at the end of the day to complete seeing most of it. Very beautiful gardens, and the library will blow you away...."], ["Reviewed January 24, 2018", 2.0, "Confusing, Expensive.", "Our tour visited the Huntington Library and some of us gathered for lunch at the 1919 Café. I found the ordering system to be confusing and the prices too high for lunch. There are areas set up for the type of food one wants whether ethnic; Asian, Mexican, or something else. Prices are on overhead boards and if you chose the Hamburger Plate, there are slips of paper for you to indicate how you want it prepared. Fries and cheese are extra. These are cooked to order and then you decide on dessert in a different area, drinks from a third place, and pay in another. The order is called when finished. All this to avoid a wait staff, but the prices could have paid for wait persons. Then, one buses their own dishes.\nThe food was OK, but not worth the hassle or the cost. Nothing was special or remarkable. A disappointment.\nShow less"], ["Reviewed January 21, 2018", 5.0, "The Huntington Library in San Marino", "The is the best garden in southern California and a hugh collection of arts other than the Getty Museum. But the garden in the Getty Museum is no way compare to the garden in this Library. This Library is also located in the heart of the city, very convenient location. The houses around the Library are also in higher class community.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Gardens, books, and art", "I can’t believe it took me so long to visit this stunning property! Plan to spend at least three hours here – there is so much to see! The gardens are absolutely lovely, from the cactus and succulent garden, to the Japanese garden, and everything else. Even in December there was still much to be hold. We enjoyed afternoon tea by the beautiful rose garden as well. Spend time in the library where there are so many rare books, including the Gutenberg Bible and Canterbury Tales. Then there are multiple art exhibits, both American and European, all worthwhile. Don’t forget to take in Pinky and Blue Boy. Truly priceless works of art. The admission is very reasonable for everything you can see and do, and includes audio guides for the art exhibits. There are other places to stop and eat throughout the day if you need a snack as well. Definitely worth a visit if you are visiting anywhere close by in Southern California.\nShow less"], ["Reviewed January 17, 2018", 5.0, "What a fabulous surprise", "We have visited many gardens, many art museums, and a few libraries. This is all rolled into one glorious property. You will need the entire day to explore all the riches it offers. Walk the gardens early in the day, before it gets too crowded. During the hot part of the day, do the museums and library. The museum of American Art is spectacular. Do not miss the library. It is filled with treasures.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Relaxing, amazing range of attractions", "We have visited the Huntington several times over the past 6-7 years, and have found something new and interesting each time.\nIf you are a gardener, this 208-acre beautifully-landscaped parkland should be a compulsory stopover - although a single visit will hardly scratch the surface.\nIf you are interested in history and art, the galleries are also wonderful.\nAnd if you need some sustenance, the cafe and tearooms offer a delicious array of food and drinks. Highly recommended!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Incredible", "Our first visit was amazing. We started by walking the gardens. The cactus garden was more than amazing, nothing compares. Other highlights were the Chinese garden, palm garden, rose garden. Plan to do a lot of walking. We also saw the library collection which is so special. We plan to do the art collections on our next visit which we are already planning. I envy those who live close by! What a great place to spend your day.\nShow less"], ["Reviewed January 15, 2018", 5.0, "One of the most magical places in Los Angeles", "I can spend hours here. I can keep coming back and I often do because you can make each visit different. Beautiful gardens, great art collection, super family friendly, high tea and other restaurant options all make for great visits."], ["Reviewed January 15, 2018", 5.0, "Overwhelming Amount of Beauty, Culture, and Knowledge", "If there’s any place I know of that truly deserves a five-star rating, it’s the Huntington Library. It is huge and grand in scope, with Japanese and Chinese gardens, art galleries, the main Gilded Age house owned by the Huntington’s, and of course the library with a whole assortment of famous texts. Pinkie and Blue Boy are famous paintings that both reside here; there is also a pretty large American art gallery and the library has some absolutely stunning books and writings including a copy of the Declaration of Independence, Shakespeare’s first folio of plays, the Canterbury Tales, and of course one of only 21 copies of the Gutenberg Bible to be completely intact. There was an exhibit about the Protestant Reformation with Martin Luther’s writings (not Martin Luther King obviously even though today is his birthday) which I thought was pretty interesting and I also really enjoyed the scientific discoveries exhibit which had writings from Galileo, Copernicus, Kepler, Newton, and Charles Darwin. There is still so much that I wasn’t able to see and I believe I spent about 4 hours here, so that tells you just how massive this place is. This library shows you so much and beckons you to return so that you can uncover even more things that you missed the last time. The admission price may be a bit steep ($29 on holidays), but with how much this place has to offer, it is money well spent. Overall, I’m extremely impressed and will definitely return in the future.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Library, Art, Gardens - It has it all", "A terrific place to spend a day. Several hundred acres of botanical gardens, fabulous artwork and a library that includes a Guttenberg bible. Don't expect to see it all in a day or two or three."], ["Reviewed January 14, 2018", 5.0, "Get just the highlights in one visit.", "You can’t do it all in one day. There is simply too much to see and learn. This is one of the most incredible venues in the world for experiencing the development history of this area of California, view a huge variety of botanicals arranged in biome settings, and experience works of art that provide experiences you have never had previously. I can’t say much about the actual library because that is an area of the site I have not experienced.\nStart out in the orientation center and watch the short video about the Huntingtons. They impacted Pasadena and all of Southern California in ways that have had lasting impact. I was particularly impressed with how their wealth affected the landscape and people. Be sure to pick up a map, I found the directions arrows to be limited in their guidance but the map helps you find your way.\nThe gift shop is very impressive with a variety of books and objects not typically found in other shops.\nThere are several cafes and places to get a drink.\nAll of the buildings have clean washrooms.\nOn busy days the parking can be difficult and you may need to walk quite a distance.\nShow less"], ["Reviewed January 13, 2018", 2.0, "False advertising", "While the overall package is impressive and the grounds are undeniably beautiful, I am unimpressed with my visit.\n\nTwo separate people at the information booth, one consulted first thing and one mid-afternoon, did not have information on what I was asking about. The expensive estate tour I paid $24 for wasn't very different from the free garden tour I started out on, and it ran 63 minutes long in spite of the website claiming it to be approximately 90 minutes. Finally, I bought a ticket with some signage indicating that a membership pays itself off in under three visits. When I went to get a membership mid-visit, having taken a leisurely lunch since I was convinced I'd be back multiple times, I learned that $159 is the minimum price for a membership. That would be more than six weekday visits to pay off membership. There is no membership offered for an individual.\n\nKaryn deals with guest experiences, and our phone conversation about what I dealt with was cordial, in-depth, and heartfelt. Her e-mail to the powers that be? It sits unanswered more than 48 hours later. Says a lot.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Serene", "What a beautiful place. A gem in the city. 200 acres of beautiful flowers, scenery and water. The total package. Lovely to stroll and jog. Don’t miss it!"], ["Reviewed January 13, 2018", 5.0, "Gem art collection and inspire gardens", "When it was still possible to buy masterpieces like \"Blue Boy\" and \"Pinky\" the Huntington's amassed an impressive collection. What make the visit so rewarding is the wonderful near by gardens that give the tourists a spot to reflect on all the art and enjoy the wonders of nature. On my first trip, I remember seeing succulents which I never saw back in New Jersey. Important stop for visitors!\nShow less"], ["Reviewed January 11, 2018", 5.0, "Our first visit", "We were visiting our son and girlfriend in California and he put the Huntington on the list for this trip. I have wanted to come here for years. It was beyond my expectations. We limited ourselves to the Chinese garden and the American art building due to time constraints. We loved it. I can’t wait to go back.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Beautiful garden!", "The collection is very valuable and worth viewing. The pictures are so beautiful, the gardens are so beautiful! The customer service is so friendly. The food is delicious, too. We enjoyed our wonderful time there."], ["Reviewed January 9, 2018", 5.0, "Birthday surprise", "My husband surprised me with a visit to the Huntington Library before the exhibit Visual Voyages closed. We were delighted and also saw The Reformation and a couple gardens. A full and enjoyable day."], ["Reviewed January 8, 2018", 5.0, "An amazing gem, not to be missed", "Where to start? Over two hundred acres featuring many types of beautiful gardens: japanese, chinese, desert, palm, rose, etc. Many museum buildings featuring outstanding art, including the original Huntington home. The library museum featuring many rare books, including a Gutenberg Bible. Restaurants and gift shop. Guided tours available. Probably too much for only one visit. Highly recommended.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Beautiful place", "We were with a tour group for the Rose Bowl and opted to visit the Huntington. We did not have enough time to really see all there was to see. We saw the exhibits in the library which were so interesting. We are book collectors so it was fascinating to see the books there. We also got to see a temporary exhibit on rock art. The gardens are beautiful, it it would take at least a day to see some of them. We stopped for coffee, and enjoyed the people who shared a table with us. A wonderful place!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Beautiful!", "We visited Huntington as part of a tour group, so we didn't have much time there, but the time we did have was fantastic! We started off with a tour guide, but about 10 minutes into the tour, we opted to go off on our own. This was due to nothing the tour guide did, but since we only had a couple hours, we wanted to see the art galleries and the gardens. We could have spent 2 more hours just walking through the gardens. The grounds and galleries were well-kept and clean. If ever in the area again, I would certainly re-visit Huntington to see what we were not able to see on this trip.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Botanical gardens are spectacular especially the Desert section", "Four of us wandered around here for a few hours and we enjoyed it immensely, especially the succulents area which is extensive. The Jungle garden was disappointing.\nWe ate at the Patio Grill, tucked behind the tea room. Food was great (particularly the home-made soup) as was the outdoor seating and the pleasant service.\nToo much to see in one visit!\nThe only disappointment was waiting for a free tour we were told would start at 11:30 but no one showed up to lead it. When I asked, I was told that the volunteer had not showed up. They should have let us know we were waiting for nothing but they did not.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Stunning Gardens!", "Our family visit included 2 seniors, 4 millennials, a 5yo and a baby. It was truly enjoyed by all! Nice, smooth concrete & asphalt paths for the stroller, plenty of benches in strategic locations for a rest, wheelchair ramps for the stroller, both sunny & shady areas and water fountains. The cactus & succulent garden is outstanding - especially the barrel cacti. So glad the rose garden had not yet been pruned. The Children’s Garden was great fun for both the 5yo and adults. Can hardly wait to return to see plants in other seasons! While admission is a bit pricey, it seems to be well spent on upkeep (imagine the water bills alone!) & education.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Lovely", "Perhaps I was expecting too much but after hearing friends from the west coast rave about the Huntington for years , it fell a little short for me. Yes, the home and various gardens are lovely and interesting as is the library collection and the art, but while I was there two out of six of their top features were not on display and were instead replaced with facsimilies, namely Blue Boy and the Chaucer. Although it doesn't seem to be well promoted the Dibner history of science exhibit is well worth taking in.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Beautiful Art and glorious Botanical Garden at the Huntington Library", "The Huntington Library, Art Collections and Botanical Gardens is a collections-based educational and research institution located in Pasadena City. The Garden itself is dreamy, beautiful, and lovely, a perfect mixture of find arts, and nature...good for your soul and your creativity. The place is quite large to explore, so plan your time accordingly, and wear comby shoes.\n\nSpend a beautiful day here, and it will take your breath away.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Outstanding in every way.", "We visited the Huntington mainly for their library. I knew about the Chaucer manuscripts, Gutenberg Bible, Shakespearean folio, rare maps, and historical prints. What I wasn't prepared for was the size and variety of their magnificent gardens. With fifteen separate gardens the senses are overwhelmed. Our favorites were the Japanese, Chinese, and Shakespeare gardens, though that might change if we had time to see all of them. The Huntington mansion house, which holds an outstanding art collection is equally worthwhile. While all the art is amazing and irreplaceable, we were especially surprised the collection houses Gainsborough's \"Blue Boy\" (1770). The only problem with the Huntington Library, Art Collections and Botanical Gardens is that no matter how long you stay, you won't have enough time (we were there for 5 hours). We have been to museums, art collections, and gardens around the world, and while individually there are more magnificent examples of each, you will not find such an outstanding combination of all three anywhere!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Wonderful botanical garden and interesting expositions in the library and gallery", "The park is wonderful to walk and enjoy. They have several gardens, we love the the rose garden, the desert garden, the Australian garden, the Japanese garden, the Chinese garden. The last time we went, we walked again in the library where you can find interesting old book editions, and then went to the exposition Viewing stones. We also loved the Octavia E. Butler exposition, and read her books afterwards.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Beautiful Walk on a Sunny, Warm December Day", "Sister-in-law and her husband suggested this to wife and me. We drove from Westminster CA. to San Marino in a little over an hour. Very surprised at large numbers of people of all ages swarming the entrances and parking lot. Luckily parking is free and admission is $25 per adult. As first-time visitors, we chose the walking tour conducted by a volunteer guide. The tour takes about 2 hours and there is no additional charge. He was knowledgeable about how the gardens were constructed under the sponsorship of an early 20th century railroad tycoon, Henry Huntington. The gardens have several distinct themes and vegetation, e.g., Chinese and Japanese gardens; Desert garden; Rose garden, etc. We were very impressed with all of the beautiful landscaping. There are also buildings with indoor plants, paintings (Blue Boy is highlight), and a vast library of valuable books. Could spend several days more exploring this wonderous place. There are numerous food offerings and restaurants. We visited one that offered sushi, burgers, pizza, and sandwiches. Very happy with cheeseburger and fries. Sister-in-law and husband had soup (asparagus) and sandwiches. Note that these meals ran about $15 per person and they serve beer!\nShow less"], ["Reviewed January 3, 2018", 5.0, "The Disneyland of the Art World", "I've been here as a young romantic couple, with my in laws, with my entire family over the years. The gardens are world-class, as is the art offering, which now includes modern art. They opened a Craftsman permanent display a few months ago (Greene+Greene) which also is world-class. It's close to an all day visit. There's no way you can see both the gardens or the architecture in one day. Highest reccomendation\nShow less"], ["Reviewed January 3, 2018", 5.0, "World Class Art", "Absolutely beautiful and a world class art museum! A must see for anyone visit going Southern California."], ["Reviewed January 2, 2018", 5.0, "Just wonderful!!", "So many different sections to see here at the gardens .... everything is so beautiful and well kept.., if you like outdoor gardens and beautiful things , this is for you!!"], ["Reviewed December 31, 2017", 5.0, "Always Wonderful", "My niece made a dedication donation to the Huntington in my mother's name. My son wanted very much to see just that dedication plaque, and the Library management was gracious enough to allow us in for the short visit without an admission charge.. very classy!! Then staff graciously guided us to the site!! Everyone was so kind! Amazing!!\nShow less"], ["Reviewed December 24, 2017", 5.0, "Gorgeous", "We didn’t have nearly enough time here but it was a gorgeous garden with so much to see. We had tea, which was delightful. Beautiful spot and well worth the stop."], ["Reviewed December 21, 2017", 5.0, "Cafeteria now worth a visit", "The Huntington Library, Gardens, and Museum has always been a fabulous place to visit, but not a place to eat (other than a tea room). I recently went to their refurbished cafeteria/café. They did a wonderful job in providing a great variety of choices in a comfortable setting. The day was lovely, so we sat outside. Now a place to eat as well as tour.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Amazing", "If you’re looking for an oasis inside the city, this is the perfect place, excellent lunch at the great at elegant rose tea room, humming birds around the roses, the most extensive collection of succulents, plants, cactus and other plants. If you are looking for art, the library and house are a great place to enjoy it. It close to little paradise.be elegant and comfortable. Be ready to spend the whole day\nShow less"], ["Reviewed December 16, 2017", 5.0, "Medical history", "Check out the library. So awesome. For every profession. I was more interested in the medical sec Japanese and Chinese gardens are beautiful. And Desert too."], ["Reviewed December 13, 2017", 5.0, "Exceptional", "The Huntington is one of the most beautiful and interesting places to visit in Southern California . World class gardens are incredible. The art collection is fantastic. And the rare books and manuscripts are priceless . This is a photographer's paradise. Be sure to see \"Blue Boy\" and \"Pinkie\"...2 famous paintings . There is also a children'ps area. We have visited here many times and always enjoy our day here. Very peaceful setting. Nice cafe also. I guarantee you will have a great time.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Beautiful place to walk and explore", "The gardens are beautiful. You feel as though you have travelled to Europe. We took our mother and she loved it."], ["Reviewed December 10, 2017", 5.0, "Wonderful day", "This was our first visit. We will be back. Great experience. Walked in the gardens which are beautiful and easy. Roses, herbs, Japanese, Chinese, American desert, all wonderful. Staff all very attentive, knowledgeable and eager. Free and easy parking A Great day activity walking outside in Pasadena. Pleasant and educational. We went to the American art gallery and it is very very nice.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Birthday celebration", "Completely in love with this place. So busy but you always feel like the only people in the world. Thank you."], ["Reviewed November 28, 2017", 4.0, "Take A Stroll In A Peaceful Setting", "The Huntington Botanical Conservatory has many orchids on display and a number of educational exhibits. Be sure to walk through the Rose Garden and the Desert Garden. The Art Museum contains many oil paintings of the 1%ers of yesteryear. One of the best things is science exhibits at the library. You can view many historical texts and displays. This is worth the trip alone.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Best museum ever!", "I took my friend from South America to see all the wonders of Huntington Library. The paintings, the Japanese Garden, the Chinese Garden, the plants, the views, everything was the best ever. Highly recommended to anyone including children!"], ["Reviewed November 22, 2017", 5.0, "Wonderful art and gardens", "The Huntington has something for everyone, European and American art, stunning Chinese, Japanese, Rose, Desert gardens, and a library full of books and other treasures. Hard to do in just one day but definitely worth a visit."], ["Reviewed November 20, 2017", 5.0, "Pleasant oasis of plants and wild birds.", "I only have got as far as the botanic gardens but so far I have visited twice. The ambiance of the place is like a world exploration. It has jungle, desert, woodland, lakes and hill. Each place attracts different wild life.\nThis is a great place to wander and then stop off and sit on the veranda of the Queen's House . From there I watched and listened to the birds active around the lake.\nShow less"], ["Reviewed November 18, 2017", 5.0, "A walk into Cultural Gardens", "I could have spent the weekend here! My sister and I explored the grounds and took a tour. Such a nice man with so many questions for us and education on the Gardens, Huntington history and fascinating facts about each garden. I recommend for a day filled with enchantment and history. Can't wait to go again.\nShow less"], ["Reviewed November 15, 2017", 5.0, "More Than I was Expecting", "The Huntington Library was absolutely incredible. I was in awe at how big the property was, the diversity of the gardens, and how much amazing art and literature they had housed on site. This is the kind of place that you could walk around all day and still not see everything. I will 100% be back to check out more of this amazing place.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Worth the visit", "Our visit was to see the Tiffany exhibit but touring around to see just some of the other exhibits was wonderful. There were some Bertoia sculptures that were very unlike his typical work and amazing to see. The collection of arts and crafts and Frank Lloyd Wright furniture was also wonderful to see. The real thriller were the grounds. It wasn't possible to get around to see the entire place but we will be back, you could literally spend the entire day there.\nShow less"], ["Reviewed November 12, 2017", 5.0, "God's beauty", "As a married couple seeking to have a marriage based on love and faith this experience gave us a time to see God's creations and be in His presence. It brought us closer and we felt God strengthening us by being there. We didnt get to visit the library as long but its still a flection in oir mind and we're coming back in January.\nShow less"], ["Reviewed November 9, 2017", 5.0, "An Absolute Must-See!", "I am embarrassed to admit that I have lived in California my entire life and never had visited here before. It is simply amazing. We only spent about three hours there so saw a small portion of the 200 acres. But everything we saw was spectacular. The exhibit at the library was riveting (I imagine that this changes regularly and yet is always riveting), and the Chinese Garden is exquisite. Although the parking lot was busy when we arrived, there is no sense of too many people, and they all spread out among the many attractions and the grounds. I only wish that their tickets were for 24 hours so that you could return for a bit the next day.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A World Class Gem", "Top notch Library, Museum and Gardens all in 1 accessible, family friendly place. This is a treasure and allow yourself many hours to view all the exhibits, art and grounds that will engage the whole family."], ["Reviewed November 8, 2017", 5.0, "A nature and lanscape photographer's paradise.", "The gardens are well worth your time and cost of the visit as a nature photographer. This short review covers only the two Asian (Chinese and Japanese) gardens, which is a subset of all botanical gardens in Huntington Library.\nThere is a gap close to 100 years when the two libraries were built. The Japanese Garden reflects an orderly, simple, serene and tranquil qualities of a typical Asian garden in early 1900. As you compose the photo scenes, there is always a focal element you can easily capture to demonstrate a harmony between men and nature. The Japanese dwelling architecture, internal furnishings and external layout of rocks and greens symbolize a culture at ease with the natural elements on earth.\n\nThe newer Chinese garden, on the other hand, packs a lot of scenic content into a small place. With every twist and turn on your path, there will be lots of subject content to focus on. At times, scene composition can be complex among the willows, lake reflection, bridges, stationary boat, tea house and waterfall rocks. Suggest a photographer takes the time needed to absorb what comes along before their work. Phase II of this garden is still in progress. Plan your visit again at a later time.\n\nTo cut it short, both gardens present a well-orchestrated sensory and scenic experience. Enjoy!\n\nShow less"], ["Reviewed November 8, 2017", 5.0, "Enjoy this year 'round", "You can enjoy Huntington Library year-round. My favorite time is when the rose gardens are in bloom, but there are attractions that are to be enjoyed no matter what the season. The cactus garden is like an alien landscape, not to be missed. We enjoy the museums when the weather is hot or rainy. Here you can see the famous paintings of Pinky and Blue Boy, a Gutenberg Bible, and lots of beautiful stuff I'm happy I don't have to dust.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Wish I had two days here!", "It is hard to prioritize what to see when you visit the Huntington - it not only has a world famous library (the Gutenberg Bible, manuscripts of works by Jack London, a letter from Charles I to a supporter shortly before he was executed, the First Folio of Shakespeare's works, to name just a few), but also two world class museums. The European museum is, of course, the most well known think Gainsborough, Reynolds, Van Dyck, Ramsey, Sevres porcelain, Wedgewood.... And then there is the American Museum, which was an impressive collection of quilts, early American furniture, glass by Tiffany (including a temporary collection that is mind blowing), and contemporary American art.\n\nBut there are also the gardens - one showcasing roses, another cactus, and special gardens in the Japanese manner and also the Chinese manner. There are a couple of greenhouses - one for tropical and rain forest plants, another for cactus and succulents.\n\nOf course, there are places to eat, 5 in all, including- a noodle and dumpling cafe at the Chinese garden, the Rose Garden tea room for a proper British tea (make a reservation in advance!) the 1919 Cafe serving sandwiches , pizzas, salads, and the like, the Red Car, serving coffee, and the patio grill. All of these offer the opportunity to sit down and refuel.\n\nHere are some suggestions:\n\n1. There is one free day each month (First Thursday). On that day your must sign up for the free ticket in advance, and none are sold that day - so, if you don't have a free ticket and show up hoping to buy one, you are out of luck, as we discovered!\n2. Admission cost includes maps of the garden, however, be sure to visit the orientation gallery, just past the ticket booths before starting your visit so that you will have a better understanding of the Huntingtons and the things you are going to see.\n3. Wear good walking shoes, a hat if you plan to explore the gardens, and carry water.\n4. You are not allowed to wear backpacks, even if they are just small backpack purses, in the galleries. (You can sling the purse over 1 shoulder and hold it under your arm, however).\n5. Water bottles may not be carried in your hand in the galleries. They have to be put into your purse, or left outside.\n6, There are free lockers in the galleries into which you can place your backpacks and/or water bottles.\n7. FREE Accousteguides are available in both the European and American galleries. Be sure to take one, because it will add greatly to your enjoyment of the art.\n8. There are free docent lead tours of the gardens. Check the website for times, and plan accordingly.\n\nThe Huntington is a treasure house! Allow plenty of time to enjoy its riches.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Amazing place !", "We enjoyed the experience overall, but do to the expansive facilities a shuttle service of some sort would have been indispensable. Perhaps that was what the golf carts were for, but it was unclear. Thanks. Otherwise 5 $tars *****"], ["Reviewed November 7, 2017", 5.0, "See the Gardens for FREE!", "If you are lucky enough to visit the Huntington Gardens on the first Thursday of the month your admission price is on the house. Wells Fargo sponsors this wonderful opportunity to see these most beautiful gardens.\n\nAlthough it is free, you must have a ticket, which you obtain online using their website.\n\nA limited quantity of free passes will be available the first day of each month at 9 a.m. preceding the month you want to visit. (For example, if you want to visit on August Free Day, you may reserve tickets beginning July 1). They go quickly so I suggest you try promptly at 9am.\n\nExpect lots of visitors on Free Day, but it is well worth the price of admission!\n\nShow less"], ["Reviewed November 6, 2017", 5.0, "Serenity", "Wear comfortable shoes and plan on a day of serenity. This place was recommended by a friend and pleasantly did not disappoint. It is romantic, peaceful, beautiful. The caretakers were knowledgeable and friendly. I have nothing but positives to say about this wonderful treasure."], ["Reviewed November 5, 2017", 3.0, "Beautiful gardens", "Spent the afternoon here with friends waking around and enjoying the gardens. The Japanese garden is beautiful, the rose garden is fragrant. Bring water and wear good walking shoes."], ["Reviewed November 4, 2017", 5.0, "You need more than a day to do it justice!", "We had visited Pasadena before but didn't know this lovely place was 1.7 miles from our hotel; we were looking for new places to visit and found it on Trip Advisor.\nIt really is a hidden gem.\nThere is so much to see here and so many beautiful and large gardens to visit that even though we went early in the day, we didn't see all of it.\nThere is plenty of parking at the entrance.\nThe Chinese and Japanese Gardens are simply stunning, and on a very hot day there were plenty of places to sit in the shade.\nThe Palm House is lovely and there are good labels full of information on everything.\nThe Art galleries are another great way to cool down, but you can see some very interesting and unique works of art by Hopper and Warhol among others, there really is something for everyone.\nThere is a good choice of places to eat and the dim sum looked fabulous!\nThe mausoleum is undergoing work at the moment but it is very interesting to see.\nThe shop has a wonderful variety of very good quality items.\nI will definitely return to see the rest of the gardens, if I was a resident or lived nearby it would be worth signing up for the pass they sell for multiple visits.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Huntington Library", "Our visit Huntington Library was an amazing experience. The highlight was our lunch at The Tea Garden."], ["Reviewed November 2, 2017", 5.0, "An amazing treasure", "The Huntington, covering some 200+ acres, established by Henry Huntington in the early 1900s, is a MUST visit. The site comprises a variety of different-themed botanical gardens; Huntington’s San Marino villa with its magnificent collection of European art and a superb library that houses a number of different exhibitions. The gardens are outstanding and full of interest, ranging from the desert garden, with a spectacular collection of unusual cacti and succulents, to the serene, quiet and exquisite Japanese and Chinese gardens with ponds, a Japanese House and ceremonial Tea garden. My wife and I were struck particularly by the Huntington villa, with its grand hall and dual staircase and the drawing and dining rooms. But the highlight is undoubtedly the art on display. Henry Huntington was obviously an Anglophile as the collection includes a number of portraits and landscapes by Thomas Gainsborough - unfortunately, the famous “Blue Boy” had been removed for restoration - Joshua Reynolds, J.M.W. Turner and John Constable, among others. Other European art includes paintings by Watteau, Canaletto and van Dyck, magnificent tapestries, sculptures and collections of wonderful Sevres porcelain ware. We visited two of the permanent exhibits in the library. The “Remarkable Works, Remarkable Times” exhibit contains some extraordinary works, including a beautifully, decorated manuscript of Chaucer’s “Canterbury Tales” (ca 1400-1405), a Gutenberg Bible (ca 1450-1455), a first edition of Shakespeare’s collected plays (1623) and a wonderfully illustrated “Birds of America” by Audubon. The “Beautiful Science; ideas that changed the world” exhibit with works and letters - original and facsimiles - by Ptolemy, Copernicus, Galileo, Kepler, Newton and Einstein, which we both thoroughly enjoyed (being science instructors!).\n\nThe Huntington should be top of your agenda if you are in the Pasadena area. We didn’t have time to visit the on-site restaurants as we were too busy enjoying the exhibits and gardens although we did manage to grab a coffee in the Red Car coffee shop while we waited to be picked up after a most exhilarating and full day!\nShow less"], ["Reviewed October 31, 2017", 4.0, "The Huntington", "Very good time great for walking on beautiful SoCal days, lots to see and take in. You'll want to bring a fully charged camera or phone because you will be using it, a ton of photo ops. And FYI The Tea Room is amazing and totally worth it!\nShow less"], ["Reviewed October 24, 2017", 5.0, "Huntington Library and Botanical Gardens", "I can spend a whole day exploring the treasures contained in this diverse venue. There are a various gardens to walk through and savor the beauty of each area. The Library with the fine collection is worth a slow walk through. One of the Guttenberg Bibles is the centerpiece of the library collection. The main house is filled with European art, furnishings, silver, dishes and other 18th Century European items. Take the free self-guided audio tour and go at your own pace. Fine American art is housed in another building. There is a cafeteria style café with excellent food. It is one of those museums that begs a leisurely stroll rather than a quick look-see. Although it may appear expensive with general adult admission of $25/person and $29 on weekends, it is well worth the one day vacation.\nShow less"], ["Reviewed October 23, 2017", 5.0, "curiosity won ! 3 hours", "what a nice experience not to far from Pasadena easy ride you can experience acres of trees plants cactus each area defined desert asia Australia great walk the library - museum is great different small places t grab a bite and they have a border grill restaurant! !!\nShow less"], ["Reviewed October 23, 2017", 3.0, "Irritating", "Purchased tickets online in order to avoid waiting. Was sent to 3 different places for the tickets to be scanned."], ["Reviewed October 17, 2017", 5.0, "A Treasure in Pasadena", "This is an amazing treasure, with books and art which reminded us of Europe. The gardens are spectacular and I imagine in the Spring they are even more beautiful. We traded our day passes for an annual membership because we just have to see the seasons change in the gardens. This is not to be missed.\nShow less"], ["Reviewed October 16, 2017", 5.0, "What a gem!", "A visit to the Huntington library was recommended by a friend and a short Uber drive from downtown LA brought us there. Absolutely wonderful gardens, galleries and to top,it off an great restaurant. Not to be missed,"], ["Reviewed October 16, 2017", 5.0, "Great place to visit", "We spent hours along the Huntington Library, walking around and listening to a very refined guide who taught us about the building of the magnificent gardens and the unique library. Unmissable."], ["Reviewed October 15, 2017", 5.0, "What a lovely day!", "4 older adults borrowed 2 wheel chairs and spent the afternoon having tea and walking the gardens, the )Huntington mansion and the Library. Wonderful visions and everyone was very gracious and helpful. There are several days worth of activities and visions but it was a great afternoon for us oldsters!\nShow less"], ["Reviewed October 14, 2017", 4.0, "Pretty area for a visit", "The Huntington Library, Art Collection and Botanical Gardens is a pretty stop while you are in the Pasadena/San Marino area. It offers several settings for your enjoyment and some nice outdoor areas."], ["Reviewed October 13, 2017", 5.0, "Fabulous gardens", "We spent a wonderful day visiting these expansive gardens. Be prepared for lots of walking if you want to view everything. Lovely library buildings and museums where you can visit and escape from the heat. Has a beautiful tearooms in the rose garden. We enjoyed a superb afternoon tea here. You have to book tearoom in advance. Tickets for the gardens can be purchased online. It has a cafe and gift shop at the main entrance serving very nice coffees. It gets very hot so bring a water bottle with you. You can refill it at the water fountains dotted around the gardens. Plenty of shady areas to relax and have a picnic too. Great photo opportunities in all the gardens. The Japanese gardens are not to be missed with their beautiful pagodas and lakes.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Unique place", "This is a very unique place to have vision enjoy much. They collected many masterpieces of art. You can walk outdoor to see many beautiful flowers and plants in different gardens also. Good for whole family to visit."], ["Reviewed October 12, 2017", 5.0, "A must see!!", "I was so impressed with the grounds - they are absolutely beautiful! Staff were very friendly and welcoming."], ["Reviewed October 12, 2017", 4.0, "Put on your Walking Shoes To Cover Complex", "This is an amazing place. The collections are extensive, easy to spend the majority of the day. Art Gallery wonderful, try to take a guided tour to get the most out of it.Relax and take a break from the educational overload on a garden bench or enjoy a cool drink and snack at an outdoor table.\nBring extra cash, their shops are chuck full of lovely items. Many small unusual items perfect for stocking stuffers and books for all ages you would normally not find. Lovely textiles, linens and scarves which are light and easy to pack in a suitcase.\nHad a private tour of a special Regency Jane Austen collection of items that experts gave background on in one of the archive display rooms. Very worthwhile. They do special programs for groups.\nThe luncheon was tasty they offered for several hundred of us, but I imagine based on your needs any request can be met.\nThe Huntington is one of America’s treasure spots, well worth a visit wether for a family with teens or a large conference group. Even if on your own, the complex is so large you can find a quiet spot to take it all in.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Great Art, Books in a terrific Setting", "We visited as a 3 generation family on a very very hot Sunday in September. We would have liked to explore the wonderful gardens more ......... but the heat with very young children in tow drove us into the fine Art galleries and the world famous Library. Never thought we would get to see an original Gutenburg Bible or early printed Chaucer. WOW!\nLoved the Art galleries and really pleased to see British Art being appreciated.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Hanh's Huntington Library Review", "I was amazed at how kept everything was and how security guards were friendly enough to give people directions. I am a bit disappointed at how many trashcans are around the area however, it is also to help prevent people from throwing trash around as well. I loved the history and descriptions of gardens throughout. The Australian and subtropical forest were hard to determine what they were supposed to look at. I felt like I was just walking through grass and trees without no real way of knowing where I was going so I saw no difference between the two. Overall, I was definitely amazed at both the gardens and library buildings. I can't wait to take my parents here when they're more settled.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Beautiful property in need of better signage and navigation aids.", "The gardens, art, and architecture were absolutely stunning. You need to work on peoples’ navigation aids. The distance between buildings was hard to judge and the best path to use wasn’t always clear. How about an app with a map, you-are-here tracking dot, and a walk-time to various buildings?\n\nLoved our visit!\nShow less"], ["Reviewed October 8, 2017", 5.0, "amazing", "this place is filled with beautiful scenery and people as well . This is a must see ! I spent the day exploring It was so much to cover I knew I had to come back from time to time so excited to buy a membership package!\nShow less"], ["Reviewed October 6, 2017", 5.0, "Wow! I had no idea how great this place was", "Spent a day with a friend at his suggestion in summer. When I looked online before hand it looked interesting, but the website does not do this place justice. It's a fantastic garden and library. It's definitely world class and if you're into art and botany/gardening, you could easily spend a day here. I was most impressed with the rose, Japanese, and Chinese gardens, but the whole place is amazing. The kids garden is also fun and so was the American art museum. Overall, I highly recommend this place as a must visit if time allows it.\nShow less"], ["Reviewed October 4, 2017", 5.0, "A Beautiful Day", "This was my children's' first visit to the Huntington Library. I say children but they are 18, 16, and 12. Last time I was here, I was younger than all three of them but I had lasting impressions, specifically the paintings Pinkie and Blue Boy. I especially wanted to share the experience of viewing all the beautiful art with them so they too, could remember there is an outside world from video games. I will say there was some reluctance on their part, but that all vanished the moment we walked into the rose garden. It was a beautiful day and it was very dreamlike how pretty everything was combined with the statues and gorgeous fountain. We made our way to the Tea Room and my son proclaimed this the best day ever in the middle of our scrumptious tea and sandwiches. Everything was wonderful, including the service and ambiance. Afterwards we visited the European Art Gallery and we were overwhelmed with the grandiosity and beauty displayed there. Every inch of the place had been addressed in its structure and I can only imagine the work that went into constructing it. On top of that, so many portrait paintings and stories to go with them, I could have stayed there all day. My only disappointment was that Blue Boy was not there due to a certain project, but I was able to revisit Pinkie and reminisce. I didn't do the audio tour but I plan to on my next visit. I realized how much I had missed when I was here as a child, you really can't do everything in one day. We went through the very zen Japanese Gardens but didn't have time to visit the Chinese Gardens. My kids are all begging to come back soon and I'm pretty sure I found the next incentive for good grades this year. I highly encourage anyone who hasn't been here to take a day with your friends, family, or loved ones and make some fantastic memories in this idealistic setting.\nShow less"], ["Reviewed October 3, 2017", 5.0, "A Must!", "I live in southern California and many of my friends and relatives have never heard of this place which is a shame because going to the Huntington was one of the best experiences I've ever had. You won't be let down with the enormous area you get to explore. It's an amazing place to just relax and enjoy nature. I highly recommend.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Tranquility", "A perfect day in a perfect place. The Tea Room was better than ever. The newish Chinese garden was serene and very well done. Liked the way the pathway lead us right to the Japanese Garden, which is always beautifully peaceful."], ["Reviewed October 3, 2017", 5.0, "Worth the membership", "For a number of years, I have been a member of this place. The library, mansion, Chinese garden, Japanese garden, and art galleries are magnificent. But, my favorite is the Desert garden. This place has been used in numerous films, and has had many a concert held there. There is a delightful children's section and a huge greenhouse, presenting different biomes. You can eat in the cafe, or have a Victorian tea. This is a must-see!\nShow less"], ["Reviewed October 2, 2017", 5.0, "A great destination!", "Whether your interest is fine art, literature, one of a kind gifts, or specialty gardens (European, Japanes, Chinese, Australia, desert, etc.), Th Huntington has something for you - and that does not cover music and other special events. I have been coming back time after time since 1972.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Beauty everywhere you look.", "This Art and Botanical Gardens is a well kept go to place in San Marino, Ca. As Pasadena gets all the glory for its Rose Parade and Norton Simon Museum, this gem of Gardens and Arcitechture, art, is well worth the visit."], ["Reviewed October 2, 2017", 5.0, "My absolutely favorite destination in the L.A. area", "The price for admission may seem steep at first, but is absolutely worth it! The botanical gardens are amazing! The Chinese garden makes one almost feel like being in China, and the Japanese Garden in Japan. These are not small gardens, either. The succulent garden was the largest and best I had ever seen. We had only about four hours to spend, and it was not nearly enough time, even just for the gardens. We never got to visit the art galleries or library. In short, words cannot describe it. An absolute must go to destination when in the L.A. area.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Too Much to See in One Day!", "From gardens to art and furniture to historic texts, there's so much on offer that nearly everyone will find something over which to marvel. And, if you love it all, you'll need to come back again and again. There's certainly no way to see it all in one day!\n\nYou can certainly get lost on the many trails through the gardens. So, bring your walking shoes, sunscreen, and a water bottle. The Desert Garden and the Japanese Garden and Bonsai Court are the highlights for me. If you're running short on time, I recommend skipping the Australian Garden since it requires a long walk and is probably the least impressive section of the grounds. You might also skip the Chinese Garden since much of it is still under construction and the flora in the completed section is not yet well established. But, don't miss the Brody Botanical Center as it houses a rain forest, a cloud forest, and a bog along with some great interactive exhibits that are educational for the young and old alike!\n\nThe Huntington Art Gallery (European Art) and the Scott Art Gallery (American Art) both house excellent representative collections of art, sculpture, textiles, furniture, pottery, and tableware from various periods throughout history. The variety and quality of these museums is a delightful surprise with pieces by the likes of Thomas Gainsborough, Sir Thomas Lawrence, Mary Cassatt, Edward Hopper, and Frank Lloyd Wright. The Library is equally exciting for bibliophiles with The Gutenberg Bible and Chaucer's Canterbury Tales on display.\n\nThere are three different cafes and several other locations with coffee available on the grounds. Some, but not all, of the trails are wheelchair accessible. And there is a special assistance vehicle for those who might have difficulty walking long distances.\nShow less"], ["Reviewed September 28, 2017", 5.0, "A joy and a gem - finally visited!", "Our travel book gave kudos to the Huntington, so we had three hours on a Friday morning to spare. We got there before it opened, picked up a their map at the entrance and decided to visit three/four gardens first: Australian, Desert, Japanese and Chinese. Then on to the American art building. Blue Boy was removed due to temporary restoration but we saw the other artists. We were glad we fit this in but need a return trip and a couple days to explore all the beauty and culture and art the Huntington offers. The gardens were exquisite, the grounds incredibly impressive, if you love gardens and the outdoors, this is like Paradise! The Huntingtons' legacy benefits all garden and art lovers. Thank you.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Beautiful Gardens", "This is a really beautiful place. The gardens are superb. Fantastic photo opportunities. Beautiful galleries and interesting museums. We had a beautiful afternoon tea in the rose gardens. I would highly recommend Huntington."], ["Reviewed September 26, 2017", 5.0, "Wonderful Huntington", "This was our first visit in 10 years, and we found the place much expanded and developed. The gardens seem endless, a destination in themselves. We saw a friendly guide just setting off on a tour that would be 2 1/2 hours, but he invited his group to follow him as much or as little as they liked. Our main interest was in the art collections, European and American. The European collection is housed in the mansion where the Huntingtons lived in railroad-money splendor. It is excellent and well explained. Visitors can walk close to the art and take photos without flash. The same is true of the American collection, housed in a newer building. The library building has a wealth of fascinating historical exhibits, all beautifully displayed and explained. The only criticism is that it is unclear what is an actual document and what is a reproduction. This hardly matters because the point is education. The whole place was quiet and seemed uncrowned although there were plenty of visitors. One reason is that selfie sticks are not allowed, a policy that more sights should follow. There are several lovely places to eat. The museum shop is huge and really varied. We're planning to go back just to spend more time in the shop and the nearby cafe, which does not require a fee. Admission price is pretty steep, but worth it. It can be converted to a yearly membership which would pay for itself in less than 3 visits. If we lived anywhere nearby, membership would certainly be worth it.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Lovely place", "I love that place and I got my membership, so I can go every day if I want. I recommended for every family and nature lovers."], ["Reviewed September 24, 2017", 5.0, "The Huntington", "Best gardens, especially the cactus,Japanese, bonsai, roses, herbs. I thought the book collection was fantastic."], ["Reviewed September 24, 2017", 5.0, "Surprise birthday for my wife", "My daughter and I planned a day at the Gardens and celebration at the Tea Room. Total surprise for her. Great service at the tea room and she was awed by the gardens because it had been such a long time since the last time we were there. We now plan on becoming Members.\nShow less"], ["Reviewed September 22, 2017", 5.0, "outstanding museum and gardens", "One of the great collections of rare books and art in the U.S. Fabulous gardens that require at least 2 days to see. World class items include a c Guttenberg bible, several excellent paintings and the Huntington house and furniture. Nice food services in including high tea.\nShow less"], ["Reviewed September 18, 2017", 5.0, "The 1919 Cafe at The Huntington Library is very good; so are the Gardens", "The 1919 Cafe has some nice choices of food for lunch or even sometimes early dinner at The Huntington. It is operated by Border Grill and we ordered the sirloin burger and the turkey burger at the Grill. The two burgers were just grilled to perfection and just tasted so good. When it first opened, the 1919 was not as good, but now it is operating at a high standard and worth a visit for a hardy meal when visiting the Huntington. After lunch, we enjoyed a Garden Tour with Keith, one of the volunteer docents and found out lots of things about The Huntington we did not know.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Classic Gardens Beautifully Maintained + World Class Exhibits + Great Docents", "The names says it all about the three aspects of this world class venue - and each is worth a visit on its own.\n\nWe pre-booked a tour of the Japanese Gardens knowing that this would just be the start of our visit here. The amazing docent Darlene Kelly had a deep knowledge of not just the Japanese Gardebs themselves, but also of the cultural, religious, and symbolic history of this enhancing place. We thought we knew something of Japanese gardens before the tour, so we were amazed what more we learned from Ms Kelly.\n\nThe recently opened (and on until Jan 08 2018) exhibit \"Visual Voyahes - Images of Latin American Nature from Columbus to Darwin\" exhibit was next on our agenda. Well done and unique art and artefacts.\n\nTime for lunch took us to the Noodle and Dumpling restaurant in the Chinese garden with a limited but excellent menu - we sat outside overlooking a beautiful pond and Chinese buildings - Stunning.\n\nExcept for a brief visit to the amazing gift shop, this was it for this, our first, visit to the Hu tington, we will be back to explore the library and more.\n\nImportantly everything here is well maintained and spotlessly clean - including the toilet facilities.. Friendly and genuine staff enhance the Huntington as a place you want to visit again and again.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Beautiful", "Only had time to check out some of the gardens. I proposed to my girlfriend here and am so happy this is where I did it. Can't wait to come back and check out everything else it has to offer"], ["Reviewed September 15, 2017", 5.0, "Art, Culture and Gardens", "This should be the top destination for visitors to Southern California. I always encourage visiting family and friends to spend at least a day enjoying this world-class museum.\n\nThe art collection alone is worth a visit. There are works by great European artists including Thomas Gainsborough, Joshua Reynolds and John Constable. Their collection of American artists includes John Singer Sargent, Mary Cassatt and Edward Hopper. They have several Hudson River School paintings on display.\n\nThe main gallery was once the home of Henry and Arabella Huntington, a Beaux-Arts mansion considered one of the great Gilded Age residences of America. This building now contains over a thousand objects of art.\n\nThe general public can see well-curated permanent and temporary exhibitions that highlight the most rare and historic materials in the Library collection. The Ellesmere manuscript of Chaucer’s Canterbury Tales, the Gutenberg Bible, Shakespeare’s First Folio, John James Audubon’s Birds of America, and Henry David Thoreau’s manuscript of Walden are on permanent display.\n\nWear comfortable shoes and prepare to cover a lot of ground to see the gardens, which are varied and extensive. The desert garden is filled with bizarre spiny cacti that seem to create an otherworldly landscape. The Japanese and Chinese gardens are evocative and peaceful. The rose garden when in bloom fills the air with fragrance.\n\nTea at the cafe in the Rose Garden requires advance reservations. However, no reservations are needed to eat at the fine 1919 cafe near the entrance.\n\nThere is an entrance fee. See their website for details.\n\nAlso see the website for details about current Free Day policies. At this time, Free days are every first Thursday of the month, and those tickets must be bought in advance online. The downside to this is that on those days, people who walk up cannot buy regular tickets and will be turned away.\n\nMembers are welcome on Free Days and do not have to reserve a ticket in advance. Memberships are available for purchase and renewal on Free Days and every day.\n\nThere is so much to see and do here that you could spend the entire day. Make sure to come early, because they close early. Hours are 10am to 5pm. They are closed on Tuesdays.\n\nParking is free. They have a lovely gift shop with a great selection. You do not need to buy an admission ticket if all you want to do is shop.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Fantastic Extensive Gardens", "Huge area of extremely well cared for gardens. We started with Children's Gardens. Out grandchild loved it (1 year old). It have tunnels to crawl thru, chimes to drop pebble on, lots of small pools/fountains to splash. Large area and safe for the kids. We also loved the enormous Chinese Garden, the Japanese Garden (tea house worth a stop for fluids and enjoying the view), Desert Garden. There are many others also good but these were our favorite. The mansion is interesting and has a few good art works. The manuscript building had a great display of books including a Gutenburg Bible.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Serene walk through history", "Beautiful trails, lush gardens, big shaded trees & interesting history in the old mansion. Great day for a leisurely stroll (wear walking shoes)!"], ["Reviewed September 13, 2017", 5.0, "Cultural excellence in Pasadena's own backyard.", "The Huntington Garden's Art and Librery collections are an amazing draw all by themselves, but the Japanese and Chinese gardens are also worthy of a visit all by all means. Don't miss the Bonzai tree garden and be astounded by their age and dignity. Allow plenty of time for an unhurried immersion into Cultural excellence.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Review", "Have always loved this place! 1300 acres! Suggested time to explore 3-4 hours, we ran thru in 1.5. Would return"], ["Reviewed September 8, 2017", 5.0, "Stunning", "This Library and museum gets better every year. The grounds are emaculate, you can walk around and enjoy the numerous gardens. Then go inside to view the massive art collection on display."], ["Reviewed September 7, 2017", 5.0, "Enjoyed the art work", "Like the art work, the gardens, library which even has a lot of unique collections. Fun for kids, seniors, adults to spend a day. The food in Chinese garden is a bit expensive. Everything else is great!"], ["Reviewed September 7, 2017", 5.0, "ONE OF THE GREAT BOTANICAL GARDENS IN THE WORLD", "I've heard of this place for a number of years and finally got a rare opportunity to visit the Botanical Gardens for the first time. I will return, though! It's a huge place, so if you can, schedule several days to take in the Gardens and Museum. I must give you a disclaimer though. I was there with a master gardener special visit on one of the Huntington's typical closed days. So, we had the entire Gardens to ourselves, along with enjoying the 1919 Café and Store. Sadly, the museum was closed. Next time, though.\n\nMake sure you obtain the free map of the Huntington before you start walking around. This is particularly useful when you start going through the many sub-gardens. Our group got a grand tour of the Rose and Shakespeare Garden. If you love roses like I do, this is a MUST! Admittedly, one could spend one whole day just walking through each row of roses here.\n\nAfter resting and eating lunch at the 1919 Café (a nice place for lunch), I walked in the afternoon through the Palm, Jungle, and outskirts of the Desert Garden. The walking paths that meander through and among these various gardens facilitates the walk. However, you will need to take off the beaten path to really get a feel for these other gardens. The Jungle Garden is a great place for some quiet, solitary time...and some shade on a warm or hot day. On the walk back to the main areas, I was enticed by the Desert Garden succulents along the path. They truly are beautiful and some you may never have seen with your own eyes.\n\nI just didn't have time to visit the other gardens which are probably just as nice (i.e. Japanese, Chinese, Australian, etc.). I'll do that next time. On the way back, I spent time in the Store. This is really a great store and you're sure to find something to buy and enjoy representing the gardens or museum.\n\nFinally, I should mention the Children's Garden. This truly is a magical place for both adult and child (but, mostly the child). It's actually constructed for the child in mind, including height and access. If you're an adult, you will need to duck your head in places. A child will be just fine. Please see my photos of this wonderful garden. It's fairly new and it may not be on your map. It's located directly outside the Brody Botanical Center (another place to visit and learn).\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fun for all occasions", "I love this place for its gardens and atmosphere. THey have a great art selection in the grand mansion and the botanical gardens are breath taking. My favorite is the Chinese garden and the Japanese garden both have lots of history and are a replica of the ones in those countries. Food is ok nothing special this place requires a full day there are over 5 botanical gardens and a lot of walking acres and acres of land with all scenic routes and a great place to take pictures for all occasions.\nShow less"], ["Reviewed September 6, 2017", 5.0, "The Best", "The biggest challenge with the Huntington is that there is far too much to see and experience in one day. We like it so much that we bought a sustaining membership so we can make shorter visits more frequently and enjoy the entire place. The new cafeteria/restaurant is superb.\nShow less"], ["Reviewed September 6, 2017", 5.0, "World Class Museum and Gardens", "A trip to Southern California without at least one visit to the Huntington Museum, Libary and Gardens is not complete. The Huntington is a priviately owned institution that provides richly researched and curated exhibits. Depending on the time of year one should be prepared to say for several hours since there is such a variety of activities with a varied set of interests. Art, Gardening, Architecture and History are all readily available. There are also ample spots to have food, drink and other refreshments. There are enough sites and activities that all ages should find something of interest. The bookstore is worth a bit of time for exploring all the aspects of this venue. Of special interest are both the Japanese and the Chinese Gardens. Both are excellent examples and thelocal community has generously donated to both.\nShow less"], ["Reviewed September 4, 2017", 5.0, "A Must Visit Attraction", "With only a limited amount of time available, I walked the grounds, visited two of the gardens, and stopped at the Gift Shop before leaving. The grounds and buildings are beautiful and well maintained. The staff, wherever I encountered them, were extremely friendly and helpful, and the gift shop is large, well organized and has a wonderful selection. I visited the Japanese and Chinese Gardens and LOVED both experiences. The gardens are extensive, beautifully designed and manicured, and bring a wonderful sense of serenity to the visitor as one slowly tales it all in. Though simply a matter of preference, I especially enjoyed the Chinese Garden. I wold encourage anyone visiting the area to put this on their agenda.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Spectacular Garden & Art", "Though it got to 113 degrees, the gardens and art collection were wonderful to see. We had a delightful tea & lunch in the charming & comfortable tea room, and the lovely Huntington Mansion was a perfect venue for the incredible art collection going back to the 1400's.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Not to be missed", "It is not every day you can view the Gutenberg Bible, view magnificent paintings and feast your eyes on spectacular gardens. This is definitely an art lover's paradise for the taking in the LA area."], ["Reviewed August 28, 2017", 5.0, "Well Worth the Visit", "I came here with some friends and was extremely happy with the visit. It was $29 to enter the park (weekend rate) and you got access to all gardens, observatories, etc. The place is giant with gardens from all around the world that are extremely well maintained and clean. The observatories you can enter are fascinating with information on all different plants and amazing things they can do. The small cafe is a little pricey for drinks but overall this is an amazing visit. Bring good walking shoes, sunscreen, and water! Also parking is free here.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Beautiful grounds, you can spend all day here", "Impressive sprawling gardens with several themed areas. Japanese and Chinese gardens are especially well done and authentic. Lots of great photo ops. The 2 on-site art galleries are impressive and included with admission, so you can get out of the heat and enjoy some great art. I only wish more of the original Huntington mansion was preserved; instead they gutted most of the interior to convert it into art galleries, leaving only the 1st floor main rooms as original.\nShow less"], ["Reviewed August 22, 2017", 5.0, "The beautiful place", "I have been there for twice. I went there myself first time and I went there with my son second time. We love the Chinese Garden best! We had very happy time in there!"], ["Reviewed August 22, 2017", 5.0, "Wonderful Day", "Such variety, beauty and lovely grounds. Really a nice way to spend the day. We also enjoyed our lunch at the Cafe. They have a wonderful gift shop also. Having the mix of the art galleries and the gardens made for a relaxing but interesting time.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Very good for Photography", "I visited this place with my friend. As a photography learner it was a heaven for me. There were very scenic places"], ["Reviewed August 21, 2017", 5.0, "Too much to see.", "Spent last Sunday at the Huntington with friends. Went through the American and European Art collections. Very inclusive and impressive. Toured the house with its furniture, silver and china. Enjoyed the Library with its Gutenberg Bible(s), scientific works, maps and objects (like a Galileo telescope). Great collection. Texts are good for older children. Toured the Chinese Garden and had lunch at the 1910 Restaurant. All Excellent. Don't know how much it cost as we went on a member-friend's pass, but a bargain at almost any price.\nShow less"], ["Reviewed August 21, 2017", 5.0, "An American Classic", "Don't miss the Huntington. The gardens are a treasure. Don't miss the dessert, Chinese or Japanese gardens. Also look at their great art collection and have lunch at Border Grille. Fantastic way to spend the day and incredibly Instagrammable."], ["Reviewed August 21, 2017", 5.0, "Must to see", "Beautiful place to visit. Unforgettable impressions! Parks and museums are beyond description. Strongly recommended!"], ["Reviewed August 20, 2017", 5.0, "Afternoon Field Trip", "As always this was a great field trip for our students. Jane the Group Specialist took well care and made sure the tickets were at the admissions window. The trip went well for our group of students."], ["Reviewed August 16, 2017", 5.0, "Nature Paradise in LA County", "A truly restful place yet where one can walk all day (and get your day's exercise); Ehime enjoying nature and the same time getting some \"culture\" from the various arts exhibits."], ["Reviewed August 16, 2017", 5.0, "Not To Be Missed", "Worth the time to get to San Marino. Extraordinary gardens and libraray. Original Cantebury Tales on display as welll as Gutenberg Bible.\nNew Chines garden is a rif on Suzou China home of I M Pei who did a museum there. This will give you a taste.\nThe whole of this is a marvel given the time at which it was begun and the story behind it.... part of the gilded age.\nIncredible foresight to see what later made California the populous place it is.\nA super good visit. Go\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wow! Worth the price.", "The admission price is steep ($25 for adults in 2017), but this place is worth it. There are 3 buildings with collections of art and books - the library, the mansion, and a museum of American Art. The Boone gallery was closed during our visit and we did not go into the Botanical Center. Do get the free audio guides to make your visit worthwhile.\n\nThen there are the gardens. Even on a hot day, these were wonderful. The day we were there, a musician was playing a Japanese zither-type instrument in the Japanese garden and it was ethereal.\n\nWe were able to see the library and the mansion (European art) in about two hours and then we had a lovely lunch in Visitor Center cafe. The food was very good and fresh. There was both indoor and outdoor seating.\n\nAfter lunch, we wandered the gardens for about an hour and a half and then toured the American Art Museum. The collection of early American art and furniture was really great. So glad we went here.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wonderful Day", "Beautiful gardens with a nice variety of plant types. The Chinese and Japanese gardens were excellent. Enjoyed the art galleries and what an excellent gift shop."], ["Reviewed August 12, 2017", 5.0, "So much to see and do!", "The galleries are gorgeous, the gardens are amazing! The library is phenomenal!!! We were here for a day, and couldn't see it all. Stroll the garden paths, and relax. If you want to have tea in the English Garden - make reservations ahead of time. The restaurant food is good, and fairly priced. The coffee shop is also great, and has gelato!!! Their gift shop is full of unique finds! Just lovely! We look forward to going back.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Great estate with galleries and gardens but mediocre food", "This establishment is absolutely beautiful, well organized, and gives you a full insight into H. Huntington's vision and wealth back in his era. It's absolutely worth of a visit! I would have given 5 stars if not for the very mediocre restaurant in the Chinese garden. Glass noodles were soggy, egg rolls tasted refried and low quality, though they were definitely premium priced. I hope they can improve the food quality.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Science Exhibits Are Outstanding", "The Huntington has enormous grounds with extensive walks around the gardens. Beware the afternoon heat in August can be extreme. There are long walks between buildings with the various exhibits.\n\nWe focused on the library. The small book section has such things as a Gutenberg bible, a Shakespeare folio and a history of early books before and after the invention of printing.\n\nBut the science section is much larger. It features key books in the history of science with excellent AV hands on interactive exhibits: earth as center of the solar system, sun as center of solar system, solar system in the galaxy, early human anatomy and medicine, plants and animals, electricity, etc. Many of the books are from the Bern Dibner collection and is one of the most extensive collections in the history of science.\n\nThe science museum is worth the visit alone.\nShow less"], ["Reviewed August 11, 2017", 5.0, "AMAZING COLLECTION AND GARDENS, BUT SOME ADA CHALLENGES", "We found that the Library houses one of the finest collections of manuscripts, rare books, documents covering early science, and European master works of art. The large botanical gardens area is stunning; however, some of the most scenic spots, including but not limited to the Japanese Gardens, are too steep for guests utilizing wheelchairs and the Library's Special Assistance Vehicle (\"SAV\") lacks a ramp. The Gift Store is world-class. Finally, the Visitor Services and Membership representatives proved to be very helpful - with special kudos to Vanessa. If the Library would kindly consider adding a ramp-enabled SAV, we will be excited to return.\nShow less"], ["Reviewed August 8, 2017", 5.0, "The huntington library.", "It was a great experience. We are in a group of 8 people, and everyone of us had a good time. I particularly liked the Japanese garden and manuscript collection."], ["Reviewed August 8, 2017", 5.0, "Love the gardens!", "Wonderful place to spend time and relax. We had a nice romantic afternoon and finished up with some Tea :)"], ["Reviewed August 7, 2017", 4.0, "Art and Library are Beautiful", "We started with a walk though the gardens. In July, on a hot day. I wouldn't recomend a July visit, but if that is when you're in the area then go. The Chinese gardens are undergoing a huge development. The existing garden is very well done, the bridges and pavilions are nice. but everything looks a little new. I would like to see it again in 5-10 years. Enjoyed the Japanese, rose and herb gardens. next inside to a cool house. The artwork is amazing, the collection of Reynolds is not to be missed. Upon entering the library looks modest and then you start to read the items on display and the magnitude of the collection is almost overselling. So many historical document and books that we can look at and read. Amazing that its so accessible, Plan to spend at least an hour in the library.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Hot, humid and Magnificent!", "I had been a year ago and last Friday I brought my friend who had never been. Such a treat to someone view the Gardens for the first time. It was hot and humid but we wore big hats and pretended we were on an exotic island! When I shared the photographs, some people thought I was in Japan when I showed them the pictures taken in the Bamboo. It was a magical day and the food at Susan Feniger and Mary Sue Milliken's restaurant was fabulous! we sat in the Tea House overlooking the pond. Truly an amazing day. Filled with memories and photographs.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Just Go!", "This place is incredible and has so much to offer. There's something for everyone here: of course the incredible gardens and fine are, but there's literature and science and horticulture, you name it. You will have to walk a lot, but that's the nature of a place like this. And you can do most of it in one day BUT, two days is even better. Weekdays are generally less crowded.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Absolutely LOVED Huntington Gardens", "Visiting Huntington Library & Gardens is worth every penny. The staff is extremely friendly and there is plenty to do. You can easily spend 3 hours here and I would recommend that you stay for as long as you can. There are so many different and beautiful gardens to walk through with plenty of stops for bathroom and to fill up on water around the entire grounds (definitely need water on hot days. There are plenty of spots to sit and the shade and relax or read if you want. On weekends it does get crowded as the day goes on, so maybe go a bit on the earlier side if you are looking for solace.\n\nThe art collection and library are also impressive and included Chaucer's Canterbury Tales Manuscript, original drawings from a Charles Dickens novel and handwritten letters from Susan B. Anthony and Abraham Lincoln. Staff in the library was extremely knowledgeable and friendly, making recommendations to make sure you saw what you came to see.\n\nThere is an on-site restaurant with plenty of food options, including that tacos that I ate which were delicious. This is a must-see if you have the time while you are in LA.\nShow less"], ["Reviewed August 6, 2017", 5.0, "So much to see", "We made our first visit to the Huntington and there will be more in the future. We simply did not have enough time to properly see everything the complex has to offer, but the three gardens and two galleries we visited were spectacular. We strolled the gardens and got many good ideas for our landscaping at home. Next visit we will budget more time so we can see some of the things we missed. It is well worth the trip.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Day Camp Field Trip", "It was great. The kids learned a lot and many thought the trip to the Huntington Library was the best group trip with friends that they ever had. Many committed that it was the most beautiful library that they have ever seen. The garden areas were great for the kids also. So many types of gardens to see. Everyone left happy and extremely excited. The adults committed that it was great to be away from the city and the gardens were so peaceful and tranquil. They plan to make a return trip. Actually, everyone wishes to return. It is a great must see.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Lovely even in the heat", "Beautiful gardens any season. Very knowledgeable docents. Garden tour is great orientation to all that is available. Nice cafe with many selections."], ["Reviewed August 5, 2017", 5.0, "Beautiful estate with historic library, galleries and botanical gardens.", "Visited with 4 generations of family. The first Thursday of every month is a free day. You can get tickets a month ahead and an exact hour online. Check the website for details. If you become a sustaining member you can take guest in on the free day and get 10% off gift shop purchases.\n\nWe visited the Library exhibits including historic documents e.g. The Canterbury Tales. We the. Walked to the European paintings gallery where we saw the renowned \"Blue Boy\" and \"Pinkie\" starring at each other across a room. Later we went into the\nAmerican gallery and saw lovely painting including Mary Cassat'a\" Breakfast in Bed\" and Wharhole's modern painting. We walked fe building g to building g through the beautiful gardens. Gone are the roses. Replaced by beautiful plants and flowers native to the dry climate. We didn't get to the Japanese gardens as it was very hot and humid outside. We did make several purchases in the lovely gift shop.\n\nThe Library is easily accessible to guests in wheelchairs and strollers.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Multiple Days & Audio Gatden Tour", "The HLG is an incredible place that I always take visitors to, but it's really too much to see in one day. Maybe there could be a multiple day pass offered so that people who want to return to the HLG have an opportunity to do so. Also, going on a two-hour garden tour is really too long, even if you can jump off the ride at any time. Perhaps there can be an audio tour available for that, much like the art museum.\nShow less"], ["Reviewed August 2, 2017", 5.0, "Gardens!", "We spent 4 hours at the Huntington strolling through the fabulous gardens (Chinese, Japanese, Rose, Jungle, Lilly Ponds) and having lunch. The gardens alone were so enjoyable that we will have to return to venture inside to the exhibits. Well worth the admisison fee!"], ["Reviewed August 1, 2017", 5.0, "House and Garden visit by two couples.", "Excellent in all areas. Succulents were outstanding and well cared for. The main gallery on the Huntington House is or favorite. Thank you for the audio tape feature. Very well done.\nTea room was fun. I graduated from Arcadia High School so we know the area and the Library.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Huntington Library", "Enjoyed the American art the best, the gardens, and the Gutenberg Bible. Was able to use one of the wheelchair and lockers which was a nice bonus! Nice audio tours with players and headphones for many of the art pieces. We were a bit uncomfortable in the European Art collection as there were so many docents around (felt like) watching us all so carefully! My daughter and I are thinking of going next time without the kids to look at everything more carefully. The kids we took ranged in age from 5-8.\nShow less"], ["Reviewed July 28, 2017", 4.0, "Nice but probably better seasons to go", "Two people (unknown to each other) recommended I go here and I am glad I did. The prime reason to go was to see the gardens. The Japanese, Chinese and Desert gardens were the ones recommended. Whilst the Asian gardens were nice, I found the desert garden amazing (Ok I am from Australia & we do not have cactus, yucca, aloes etc naturally). Heaps of the cactus's were flowering which just seem to pop out of the plant. Colours are spectacular.\n\nI suspect the gardens would be even more impressive when the flowers and fragrances where in season, but I also suspect the gardens would be very crowded.\nI am glad I went & will & will return when next in California. It would be very easy to spend the whole day here if not more just so you can absorb the ambience of the variety of gardens of which there are 12. & all this is before you look at the Art which is in buildings around the property.\n\nCost per entry is $29. There are options to become a member so if you think you will go more than 4 times with in a year it would definitely be worth considering.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Best kept secret attraction in LA", "The Huntington Library and Gardens is one of the best kept secrets in the LA tourist scene. We visited LA 5 years in a row and never heard about it till the last time and even then, from a local person. This property used to belong to a local businessman, Mr Huntington who had strong interest in literature and arts. The library is magnificent and has a collection of the oldest books - when printing started - like the first printed Bible. Book lovers will not want to leave the library!! The gardens are equally beautiful - several hundred acres and separated on various themes - Japanese, Chinese, English, Rose garden, etc. A beautiful, beautiful, place to visit in Pasadena, few miles from downtown LA. Only word of caution - summer months can be too hot to enjoy the gardens specially since they close at 5pm when the LA sun is very strong.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Amazing gardens and library", "Simply put this place is amazing! Art,gardens, history and a beautiful landscape in a single location. We walked through the gardens and explored the art and did not have enough time. Want to go back soon."], ["Reviewed July 25, 2017", 5.0, "Gaden and prints are excellents", "The rose garden is wonderfull and science is very impotant and the pictures are beautifull Japones garden is excellent"], ["Reviewed July 24, 2017", 5.0, "Brilliant!", "One of the best days spent in California! Parents should be prepared for long walks with kids. Possbily the most qualified museum shop you can find in the US. Nice ice cream shop for the kids at main gate. Overall 5 stars! Definitely recommended!"], ["Reviewed July 24, 2017", 5.0, "Plants and Art - great combo", "Fabulous and historic venue. Enjoy the many varied gardens, as well as architecture, art, special presentations, and gorgeous ground."], ["Reviewed July 24, 2017", 4.0, "World class collection of art in majestic gardens in a residential area", "While the place is ever evolving and getting larger though not always better, the collections and gardens are impressive. You can spend days and even weeks here, though most visitors just browse at the major artworks and walk some of the gardens. New visitors should begin with the short introduction video of the history of how Collins Huntington family amassed its wealth and how the nephew married the widow of his uncle at age 60 and left the bulk of their estate to the state of California.\n\nThe library has an extensive collection of rare books and pictures including a copy of the Gutenberg Bible in vellum. There is also a vast collection on the history of California.\n\nWhile the residence is not as grand as the tycoon mansions in Newport, RI, it is still quite impressive with Gainsborough's Blue Boy and Pinkie. This is a must see for all interested in arts and culture.\nShow less"], ["Reviewed July 23, 2017", 3.0, "Gardens and museum changed", "I appreciate the gardens for what they are. The art collection is limited but the house does give a glimpse of the private rooms of a mansion at the turn of the 20th century. What I find has changed is the number of people who think it is ok to bring their screaming, crying child to a museum and not keep them under control.\n\nI have to admit the sheer volume of middle class helicopter moms has exploded and is now infecting the presentations of culture in our society. Never more than at the Huntington. Gone are well mannered parents who use the opportunity to teach civility and manners to their children. They have turn a public place into their back yard where is is permissible for them to lay the child down anywhere and change their soiled and smelly diaper on the lawn, table, bench or wherever they please. Don't think these parents are capable of finding a garbage can anywhere either. They also allow their children to run loose and unsupervised much like the antivaxer parents on the west side who feel entitled to subject everyone to their out of control children and have tried nothing to keep them under control and are all out of ideas.\n\nOther than these observations the gardens and house were nice way to spend the afternoon.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Where is that rating of six on Trip Advisor?", "If the Huntington was only its Botanical Gardens it would be one of the top places to visit in the world. Leave yourself a full day to stroll the grounds through the Chinese Gardens, the Japanese Gardens, the Australian Garden, the Dessert Garden, and the Rose Garden. You can start earlier than the Museum and Gallery spaces open. This is definitely one of the top gardens in the world. Warning especially if you are a gardener yourself, you will be totally surprised and awed at every stop. Take your time and remember to pick your jaw up off the ground before you stroll on.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Lovely", "Beautiful. Just simply beautiful with quite a history. The estate tour was informative and educational."], ["Reviewed July 23, 2017", 5.0, "Lovely grounds", "Such a great place to visit & great to make a day out of! Great for all ages. Lots of walking but there are benches everywhere."], ["Reviewed July 20, 2017", 4.0, "A walk in the park", "The Ultramarine blue Edward Hopper used in his work, 'The Long Leg' hanging in the American art gallery took my breath away from across the room! (Overall a lack of signage throughout the grounds kept me++ disoriented ) A+ gift shop"], ["Reviewed July 19, 2017", 5.0, "SoCal's BEST Kept Secret", "I grew up in this area and moved away. My regret was that I did not visit the Huntington Library and Gardens earlier. This is one of the greatest sites in southern California! I am blessed to have visited the Louvre in Paris and the Hermitage in Russia and can tell you with confidence. The Huntington should be mentioned in this august list of great centers in art, culture and science. I primarily went to see THE Gutenberg Bible. I was unaware of the number of original manuscripts and premiere editions of historical publications were also included in the library. I knew that \"The Blue Boy\" and \"Pinkie\" were exhibited at the Huntington. I was stupefied at the number of great paintings keeping them company. The themed gardens were a stunning surprise, too! There is a clever one dedicated to the children. The eateries and store are worth visiting on their own accord. They are available to the public without the price of admission. The entrance fee per individual is what you probably pay in one week for Starbucks visits. If you live in the area, you should spend the $139 for membership. This is the kind of real estate that should be visited weekly. The Huntington is open from 10 a.m.-5 p.m. but check the website for seasonal changes.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Something for just about everyone", "We visited the Huntington Library and Gardens this week and I'm so glad a friend of ours recommended it. More than anything, the scope of what is there to see and learn about is astounding: if you like history, it's there; if you like science, it's there; if you like art (so many Gainsboroughs!), it's there; if you like gardens; they're there, too. To top it off, the variety and quality of the food in the restaurant was remarkable. We spent half a day on the grounds and easily could have spent more time if it was available.\nShow less"], ["Reviewed July 16, 2017", 5.0, "Amazing, beautiful garden, galleries", "This is an amazing place to spend the day, and you will not be able to see everything. Gardens are immense, it is unbelievable how beautiful and how well cared for they are, the Japanese and Chinese are amazing.\nThe galleries and library are filled with interesting works.\nAfternoon tea at the rose garden tea room was a perfect finish.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Beautiful!", "This is a great place to spend the day with the kids. The gardens are beautiful to walk through. There's a place to have afternoon tea if you'd like. In the summer, there are concerts and you can picnic on the lawn and relax to the music.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Gorgeous Gardens", "The Huntington Gardens and library is one of the best attractions in the Pasadena, San Gabriel area. Beautiful grounds, lots of parking, food, a bookstore; a lovely place to take out of town guests or just go to enjoy by yourself.\n\nTheir library is world renowned and the Old Huntington mansion is open for tours, they have a good collection of paintings and other artifacts. The Japanese and Chinese Gardens are some of the most authentic outside of there respective countries.\nShow less"], ["Reviewed July 13, 2017", 5.0, "My Visit to the Huntington", "Fantastic venue. Beautiful gardens and galleries. I couldn't see everything in one day. The Japanese and Chinese gardens are spectacular. Don't miss the Huntington if you are in the area."], ["Reviewed July 12, 2017", 5.0, "Special Birthday Event", "Four of us women brought my best friend to The Huntington Library for her birthday. We went on a special Estate Tour lead by Judith Cobb. She made our visit so meaningful. We enjoyed hearing about the Huntingtons' and seeing each of the gardens. My favorite garden was the Chinese Garden and the history and making of this place. After our tour we enjoyed a lovely English Tea at the Rose Garden Tea House. My friend said this was one of her most memorable birthday celebration. We look forward to visiting again.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Pleased", "The grounds were well kept and there was such attention to detail. I appreciated the complimentary water stations during the hot summer day. All the staff were more than helpful and nice. A great first trip to the Huntington."], ["Reviewed July 12, 2017", 5.0, "Octavia Butler Exhibit was very special", "We came back to the Huntington especially for the Octavia Butler exhibit. The personal notes, drafts, and self affirmations from this Pasadena native and renowned author would have made the trip worthwhile in and of themselves. Add the always beautiful gardens and we spent a wonderful afternoon!\nShow less"], ["Reviewed July 11, 2017", 5.0, "nature, art & education", "All in one extraordinarily beautiful place! There is so much to take in with all the gardens, and various exhibits -- allow yourself plenty of time, and more than one visit to explore. But, even if you only have time for a short visit, the beauty of the gardens is always a special and remarkable treat.\nShow less"], ["Reviewed July 10, 2017", 3.0, "Awesome Environment", "The surroundings were sp beauitfui; Haven't been in years. Went on a mothers day that my husband took me, his mother and his grandmother to. We all dressed in beautiful outfits that I selected and he paid for. He was so proud and happy to be able to take us out and show us off to the world.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Estate Tour", "We did the Estate Tour on a Saturday morning with Marilyn, then went on our own into the residence and collection. The whole experience is very worth it. The tour and our guide were excellent. The Chinese and Japanese gardens were definitely the highlights for us. We also loved the history of the Huntington and how it was built into what it is today.\n\nThe residence art collection was pretty amazing. The permanent collection is amazing. The Gutenberg Bible, Shakespearean manuscripts, and the letter from Henry VIII are definite highlights. The store is very well-stocked, albeit a bit pricey. The Huntington is really worth the visit.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Extraordinary place", "Many different Gardens, a mansion with extraordinary paintings, a hands on children's garden, American, contemporary and English art. Very good cafeteria and Chinese restaurant. Lagoons, rivers, Lincoln, Washington, Mark Twain letters, Gutenberg bible. Fabulous gift shop. An unsung jewel"], ["Reviewed July 10, 2017", 5.0, "Beautiful collection of art and gardens", "We had a beautiful afternoon experiencing the amazingly huge collections at this site.\nThe gardens were incredible as well (but I would recommend better signage through the trails...we were there on a really hot day this summer, and it seemed no matter what directional we followed we just kept getting deeper into the trails and farther from our destination).\nShow less"], ["Reviewed July 10, 2017", 5.0, "Exceptional!", "We visit family in San Marino at least once every two years, and this is a favorite place to see. The gardens are expansive, and we particularly enjoy the spectacular Bonsai collection."], ["Reviewed July 10, 2017", 5.0, "what gardens!", "most outstanding desert gardens anywhere. old and undulating. other gardens are spectacular as well, and the art museum is amazing in its quality and quantitiy. you can spend hours there. don't miss it!"], ["Reviewed July 9, 2017", 5.0, "Absolutely Stunning", "Beautiful manicured grounds The mansion full of art and antique furniture The Library. Go in the winter for the camellia bloom. Its a must see over and over and over. Worth every penny and minute of time"], ["Reviewed July 8, 2017", 5.0, "Amazing gardens", "We went on a warm day, so we visited the gardens first until it became too hot for walking outside. Even so, we only saw a portion of the collection and are looking forward to going back when it is cooler in the fall. The Desert garden is spectacular with the largest collection of cacti and succulents that I have ever seen. We also saw the Japanese and Chinese gardens which are relaxing and lovely. My only complaint is that the area is so large, it was easy to get lost and few more signs here and there would have been welcomed. We also went into the museums housing American art and European art where we saw familiar pieces such as Blue Boy and Pinkie.\nShow less"], ["Reviewed July 6, 2017", 3.0, "Average", "I had come to the gardens to bring my family for the first time. I wanted to take a tour of the gardens. The website said that the tour hours were between 12 to 2. I arrived at 11:30 and had been told that the tour was at 10:30 and the 12:30 tour was cancelled. This was very disappointing especially when the website says one thing and the workers there tell me another!\nShow less"], ["Reviewed July 6, 2017", 4.0, "A day well-spent", "It really was a day well spent. The gardens are huge and various (Japanese, Chinese, Dessert, Tropical etc) and very relaxing, I spent a lot of time visiting them especially the Chinese one which provides shade and a few places to sit and enjoy the view in a hot summer day. And if you are a fan of Chinese cuisine there is also a Chinese restaurant in the Garden. There are a few museums included like the Museum of European Art and that of the American Art and provide a decent collection of paintings, and other historic collections. You will also find there some restaurant choices with generally good food. For closure if you want to take a souvenir for yourself of buy a gift for someone, go at the library and you will find a great collections of gifts on a variety of prices, sometimes a bit pricey but definitely unique.\nShow less"], ["Reviewed July 5, 2017", 5.0, "Desert Plant Sale Saturday", "Wonderful food in 1919. Great help in getting directions and a wheel chair.\n\nOne guard overheard us talking about where to eat and misunderstood what we were saying and interrupted to tell us where we could eat food. Just unnecessarily intrusive.\n\nAlso, we bought plants and pots at sale.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Always a Great Visit!", "If the weather's nice, explore the gardens. The aloe collection will blow you away. If it's too hot or too wet to do the gardens, do the library and museum."], ["Reviewed July 3, 2017", 5.0, "Expansive Gardens and World Class Art", "I have lived in SoCal for 15 years and just made my first visit. We spent the entire day in the gardens and quickly skirted through one museum. There just is not enough time in one day. I was impressed with every Garden and plant collection we viewed. It was a lucky cool day in Pasadena, which made the day that much more enjoyable. Wear comfortable shoes bring some sunscreen and enjoy!\nThe Chinese garden had lotus in full bloom, the Japanese Tea Garden was on the quite beautiful also. Soaring specimens of exotic trees dot large expanses of grass. A waterfall under a large jungle canopy of rubber trees tumbles through a cool shady hillside.\nThe desert garden is stark yet full of cacti and succulents.\nIt's a Disneyland for botanist.\nLooking forward to exploring the museums on my next visit.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Estate Tour", "Delightful venue and well versed / pleasant tour guide Teresa. Enjoyed being provided with all the history and stories behind the Library. Appreciate the free audio for the home. Very well done!!"], ["Reviewed June 29, 2017", 5.0, "Enjoyable day with many highlights!!!", "What a treat!!! Beautiful gardens, excellent setting and a wonderful experience for the advance or novice gardener!"], ["Reviewed June 28, 2017", 5.0, "A really nice surprise for the day", "I have to say I was not liking Los Angeles a lot, but a friend of mine brought me to this oasis and I could not enjoy it more!\nThe botanical gardens and its peace, the mix of grass, cactus and trees, the nice restaurants, the delicate gift shop... everything in there was made to be liked.\nIf you are sick and tired of cars, empty streets and smog, just go there and enjoy your day.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Incredible gardens and handicap friendly", "The different garden areas are spectacular but are at different elevations that could prevent seniors from seeing it all. The tram service was so helpful. We just called the main phone number and minutes later the driver was there to take us to the next garden or art exhibit.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Terrific daytime date", "My boyfriend and I went to the gardens and library for a daytime visit and it was spectacular! Stunning gardens and interesting exhibits that satisfied his interests in art and my interests in gardening and science. I recommend planning ahead: it's a large facility that encompasses several types of gardens and diverse exhibits. Planning ahead of time could help you get the most out of your visit.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Beautiful place", "Well worth a visit. The gardens are amazing with really unusual plants and flowers.\n\nIf you going in the heat of summer take plenty of water.\n\nIt can be accessed by metro and a mile walk but in 40C heat we opted for a taxi which was really cheap\nShow less"], ["Reviewed June 25, 2017", 5.0, "So much to see and experience!", "We were so delighted that we only finished a potion of the gardens and have much more to see the next time we come. We also loved the European Art Exhibit and look forward to the American Art Exhibit the next time we visit."]]}}