{"The Getty Villa": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Getty Villa", "url": "/Attraction_Review-g32676-d1067416-Reviews-The_Getty_Villa-Malibu_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/37/ec/c2/the-getty-villa.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2023"}, "address": {"@type": "PostalAddress", "streetAddress": "17985 Pacific Coast Hwy Pacific Palisades", "addressLocality": "Malibu", "addressRegion": "California", "postalCode": "90265-5708", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Stunningly Beautiful", "The Getty Villa is very very interesting and incredibly beautiful. Our docent led tour was very informative, and after I lingered in the gardens imagining that I was indeed in Pompeii! Note! You should have reservations for parking before you come, or you may not be allowed in. Entrance is free but parking is $15. The highlight for me was the plants, but of course the architecture and relics were stunning. I highly recommend the Getty Villa for a good 1/2 day....or longer!!\nShow less"], ["Reviewed 4 days ago", 4.0, "Limited in scope, but high quality in its collection", "As anticipated, the collection was limited to Greek and Roman antiquities. In an absolutely beautiful setting, try a docent led tour of the highlights of this collection. Entrance to this museum is free, but there is a $15 parking charge. A breathtakingly beautiful setting, this exhibition and collection offered a wonderfully intriguing a peaceful hour or so.\nShow less"], ["Reviewed 4 days ago", 5.0, "Riding the coast line", "This was a great find while we were riding the coastline in California. Beautiful setting, lovely art pieces and does not take more than 2 hours if you have places to go. The cost was only to park but you need to reserve before going in case the lot it is full.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fabulous collection in Malibu", "Came here on Presidents' day so it was very busy but the venue is large and accommodating. The foliage was rather muted as this is winter but the gardens are excellent. The art is beyond compare. Be sure to see the film about J P Getty's plan to build this fabulous building for his magnificent art...a gift to the people\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful grounds and museum", "We had a wonderful visit to the Getty Villa. The grounds are absolutely beautiful. The museum collection is very interesting. There is not an entry fee. You do need to go online to reserve your ticket time. It was a perfect day."], ["Reviewed 1 week ago", 4.0, "Beautiful grounds/buildings, sophisticated art collection", "As others have noted, admission is free but you need to book online ... you'll show your free ticket (printed or on your phone) at the parking entrance. Parking is $15.\n\nThe mansion that you see on the hill from the Pacific Coast Highway is NOT the Getty Villa. The Getty Villa is just beyond that. The whole property has been built to mimic an archaeological dig ... you go down from the parking area to get to the various buildings containing the art collections.\n\nThe art is primarily Greek and Roman with much of it being anatomically correct, if you catch my meaning. The collections include paintings, sculptures, jewelry and other artifacts which were painstakingly sought out by Mr. Getty (who, by the way, died before seeing the completed complex).\n\nDefinitely take one or more of the guided tours and also watch the 12 minute video ... this will help you get the most out of your visit in the shortest amount of time. Our volunteer docent, Louise, was terrific and we learned things we wouldn't have otherwise.\n\nThe only reason I am giving the Villa 4 stars instead of 5 is because many of the exhibits/collections were closed during our visit. And while there were children there, the collections are very sophisticated and probably more suited to adults. That said, it appears that they host many school children during the year. Just something to consider depending on the interests of your own children.\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful place, free admission", "Didn't really understand why we had to order $0 tickets online, but pay $15 for parking at the gate and nobody asked us for our reservation/ticket info. But, regardless, we enjoyed seeing the Getty Villa. The buildings, art, gardens were all very beautiful. The only disappointment was the reflecting pool, which is the centerpiece of the garden, was under construction.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Museum along the Coast", "With reservations online and plenty of parking once we arrived in mid afternoon, we explored what exhibits were still open as many were being rotated or changed. They have very old pieces, sculptures, jewelry from BC. We only spent an hour there this visit but we loved the grounds and the exhibits we did see. I cannot believe I have never gone here before. When the visits are full again I will return and spend more time there. ,\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Getty Villa by bus - don’t", "The Getty Villa itself is lovely with a very interesting collection.\nGetting back to Santa Monica by bus was impossible and really marred the overall experience.\nWe successfully caught the bus TO the Villa. On leaving we just missed a bus then waited 45 minutes by the busy main road for the next one only for it to be full and not stop for us or other waiting passengers.\nWe eventually caught an Uber. I strongly suggest Uber or a taxi if you don’t have your own vehicle.\n\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Little Athens in Los Angeles", "Sometimes one visit is enough to understand the scope of their collection, but at the Getty Villa the displays are ever evolving to adding new items. While I have been there before, I focus more on the gardens than the collection. This trip was on a windy cold day, and it felt good to be inside away from a February cold snap. I saw more clearly the transition from the Egyptian to Greek art because I had time to study it in Athens. The later Greek braided hairstyle seem settled after seeing the Porch of The Maidens there and head in this collection. This is a little unsung gem that is a study in making a masterpiece collect as Mr. Getty did!\nMake time for this one!!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful", "Even though some of the gardens were under redevelopment, I still really loved this place. Great art collection and architecture. I saw the resident wild deer heard playing together next to the East Garden. Coffee was good, as was the bread pudding ! Will return again when the gardens are reopened.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Getty Villa by the Beach", "I've heard a lot about the Villa. At one point it was under construction, so I wasn't able to visit. Getting a ticket is required and free. Parking is $15 and saving your parking receipt and taking it to the front counter will get you free parking at the Getty Center on the same day.\nIt was a very well designed Villa. The museum aspect blends real life artifacts and collections with some items that were reproduced to add to the ambiance.\nYou can bring water and a picnic. Leave the food in your car, or carry it in a backpack. Then enjoy the surroundings with a picnic.\nThey offer many guided tours with regards to different aspects of the museum.\n\nIf you get there early enough, you get an ipod to use through the museum where you punch in numbers of the exhibit and there is a mini video about it.\nComfortable shoes helps.\n\nI'd recommend it for family, friends and couples.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "History", "The Getty Villa exhibits an ambiance of Roman times. I can only imagine watching a small intimate performance in the amphitheatre and courtyard. The gardens were carefully designed; and the art work is similarly of that time predominately.\n\nThe Getty Villa makes for a very good day; one filled with serenity, and takes one out of the fast pace of Los Angeles.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful villa and galleries", "A beautiful replica Roman Villa, complete with amphitheatre. The Getty Villa has lovely formal gardens and cool inner courtyards. It houses an extensive collections of Roman mosaics, statues and other relics. A “must” for anyone interested in classical antiquities. The setting is perfect with beautiful views. It is easy to find off the Pacific Coast Highway at Malibu.\nCar parking is free if you visit the Getty Centre in the same day - perfectly feasible.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing", "Went to the villa after the Museum. What an amazing collection of art. It boggles the mind knowing one man collected these pieces and, seemingly, loved every one. The collections were varied and beautifully displayed. And very different than what’s in the Getty Museum. The gardens were lush and lovely from what we saw. Renovations were underway so parts were closed off. But it was so worthwhile seeing this beautiful villa that I highly recommend putting this on your bucket list.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "History", "This a great place to hangout with friends that like art and history. Love the outdoors. Visit Totally worth it."], ["Reviewed 5 weeks ago", 5.0, "Lovely gem", "I've always meant to go to the villa and never gotten around to it until recently, as it was somewhat off the beaten path. That is one of the things in particular, though, that makes it such a nice place to visit. Tucked into a beautiful canyon with a glimpse of the ocean in the distance, it's an idyllic retreat from the bustle of LA. Add to that the incredible art, lovely gardens and the fascinating exhibits, it's the perfect place for a day out!\nShow less"], ["Reviewed January 24, 2018", 5.0, "Feels just like Italy!!", "Had an amazing time at the Getty Villa. Its a beautiful place with great views and I felt just like I was in Italy! All of the staff was incredibly friendly and I liked that besides the $15 in parking, admission was free. Definitely book ahead as it gets really crowded!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Take a docent lead tour!", "Friendly docents give tours everyday starting at 10am. Take a tour of the gardens, the galleries or the architecture of this recreated Roman villa. It's fascinating!"], ["Reviewed January 22, 2018", 5.0, "Lovely and Free", "We chose to visit the Getty Villa because we’ve been to Pompeii and thought it would be interesting to see the replica of the ancient Villa de Papyri, which was buried by Mt. Vesuvius at the same time. It’s absolutely perfect and really brings the ancient world to life!\n\nWe were delighted to learn it was free (timed tickets required) with $15 for parking. We went on a Thursday at 11:30 am. There were several school groups there for about an hour and then the place emptied out.\n\nThe Villa was under reconstruction during our visit and some of the galleries were closed, but there was still more than enough to see and experience to make it worth the trip. (We spent 5 hours there!) We took two free tours: the architecture tour and the garden tour. Both were educational and interesting, lasting about 40 min each. The pace is very slow and good for seniors who may need to sit occasionally.\n\nThere is a cafe and a food cart - both are very expensive (two sandwich combos and two beers cost $50).\n\nOne thing I highly recommend and nearly overlooked (show in photos below): On the second floor of the museum, there is a small room with coins and amulets. There are touchpads next to the displays where you can select the item from the case and view high resolution images of them with the option to zoom in. The tiny details are exquisite! Don’t miss this.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Nice garden", "We were a little disappoint at this once famous garden because the pond/fountain were completely dry due to drought condition in SoCal. Summer in SoCal is extremely hot, we were hoping to get some mist from those fountain..."], ["Reviewed January 16, 2018", 3.0, "Nice and free", "I can't give it 5 stars because I've seen better but it is very nice and it's free. The other Getty Museum location is a true museum and one of my favorites with amazing views.\nI've been to The Getty on the other side of town many times and finally decided to visit the smaller one. Nice gardens and mosaics. Nice outing but it won't blow your mind. It's worth visiting though.\nShow less"], ["Reviewed January 15, 2018", 3.0, "Well kept museum and interesting if you love greek and roman antiquities", "We visited here with our kids because it was rated high. Good thing it was free. If you are in the area might be worth it but I wouldn't go out of the way to visit. Tickets for entry are timed. We took a garden tour and I lost interest.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Magnificent Museum on Pacific Cost Highway", "We had a wonderful visit to the Getty Villa. We haven’t visited in 10 years. The Villa is FPA RT of the Getty Trust establishes by J Paul Getty as his legacy. The Trust is dedicated to the arts and humanities. As part of Getty’s requirements, there is no admission to the museum. However, the community limits access so there is a fee for the limited parking. You MUST make a parking reservation.\n\nLocated off Pacific. Coast Highway a few miles north of the\nSanta Monica Pier, the property offers beautiful views of the Pacific, including Catalina Island.\n\nThe Villa was the home to Getty in the 1930s. He commissioned the building of the museum as the home of Roman and Greek antiquities. The museum was finished in 1974. But Getty never saw it. He spent the last decades of his life living in London, never returning to the US. Upon his death the Getty Trust became and continues to be the wealthiest Museum in The world.\n\nStart your visit with a tour. We enjoyed the video of the museums history, the general tour, the Herb Garden tour and the architectural tours. The docents are excellent. You can use an iPod free of charge to roam the Museum galleries. There are rooms full of Greek and Roman statues and art, including well preserved Hercules and Baccus and many other gods.\n\nStroll through the gardens and enjoy the beautiful fountains. The museum is modeled after an ancient palace at the foothills of Mount Vesuvius in Italy. When Vesuvius erupted, the ash covered the building which was only unearthed\n\nThe Villa was designed as An archeological excavation site on multiple levels.\n\nWe enjoyed a fabulous lunch of Risotto with scallops, flatbread pizza and a burger. Visited the shop and bought some interesting things.\n\nThis is a must see for museums and antiquities and all things beautiful and historic!\n\nShow less"], ["Reviewed January 11, 2018", 3.0, "Free entry but $15 for parking", "Perhaps the story of the getty family is more intetesting than the villa and collectables. Some of the rooms had not opened on our visit and the pool was drained. So not quite as impressive as ut could have been."], ["Reviewed January 8, 2018", 5.0, "Beautiful Visit - Lifestyles of the Rich & Famous !", "John Paul Getty was the wealthiest man alive in his day. Visiting his home overlooking the coast gives us a glimpse into the privileges of incredible wealth. Breathtaking views , majestic construction and peaceful nature high atop pacific hills...and all just a short walk from the beach. The art collection is interesting, and impeccable maintained and displayed. This is a well organized and well kept museum.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Truly magical", "I find this one of the most enjoyable museums in the USA because its setting is simply unrivaled. The museum is an attraction, all unto itself. The landscaping complements the statuary and I loved the special mosaic exhibit. Unreal. A little crowded with out of state tourists and didn't appreciate the $15 parking but considering the admission tickets are free, there is very little to complain about. Do not miss this spectacular venue if you are interested in ancient art.\nShow less"], ["Reviewed January 1, 2018", 4.0, "very unique but small, need to see once", "Another one of our things you should do once, after years of living here. Wanted to see something we never did previously, and we already went to the big Getty, so we tried this.\n\nAlthough it was interesting, and something to do if you are into old artifacts, it is rather small but interesting.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Incredibly Beautiful Property; Mosaic exhibit is stunning", "Most people are drawn to the famous Getty Center main museum at Mulholland Pass.... but if you have time in your schedule while visiting LA or rediscovering LA as a resident, be sure to go to the Getty Villa.\n\nPrior to 1997, this was the only Getty collection we enjoyed and it has always been a treasure!!\n\nThe Villa now houses the antiquities collection of statuary as well as many fine arts and exhibits.\n\nWe just saw the Mosaics of the Roman Empire and it was exquisite.\n\nThe gardens are also beautiful and so much renovation has been done in the last 15 years. Addition renovation work and new installations are under way now in late 2017 and into 2018.\n\nThe cafe is lovely and the gift shop is really wonderful.... I wish we had had mire time, but we had squeezed in the both the main Getty Center as well as the Villa all in one day which is quite an undertaking.\n\nRegarding logistics, this information is important when deciding to go to the Getty Villa:\n-YOU HAVE TO GO ONLINE AND SIGN UP FOR AN ADMISSION TIME-It’s free (as is the main Getty museum), but YOU HAVE TO BRING AN ADMISSION TICKET FOR A SPECIFIC ENTRY TIME by going online and signing up at the GettyVilla.com\n\n- Parking is available in the Villa’s garage, however, if like us you have been to the main Getty Center earlier in the day, bring your your receipt from the paid parking from the Getty parking garage and you’ll get to park free at the Villa!! It’s a two-for-one deal!!\n\n-Just don’t forget to bring the printed admission passes for your entry time. Don’t worry if you’re a bit early or late due to traffic. It’s a ballpark entry time when driving in LA!!\n\nEnjoy!!\nShow less"], ["Reviewed December 30, 2017", 5.0, "Beautiful architecture, great exhibits", "For the price of parking, you get to enjoy a wonderful setting with lots of ancient Roman, Greek and Etruscan artifacts. Tours are provided, as well as an iPod Touch for self guided tours - headphones are provided, or you can use your own. Pack a lunch and eat at the picnic tables. Note that you can only get here from north-bound Highway 1. Cellphone signal may be non-existent depending on your carrier (T-Mo has no reception here) but free WiFi is available at most places. Don't miss the marble sculpture (replica) that you're invited to touch located at the south end of the Villa, at the end of the Outer Peristyle.\nShow less"], ["Reviewed December 30, 2017", 5.0, "Peaceful and informational at the same time", "Lovely gardens and historical museum of ancient times. Spent a couple hours exploring and looking at displays. Gorgeous setting. Make reservations online (free admission), parking $15. Renovations taking place right now."], ["Reviewed December 27, 2017", 5.0, "Beautiful Villas Some Renovations In Process", "We made reservations (free) on their website to visit the Getty Villas on the day after Christmas instead of the normal shopping routine. The Villas was approximately half hour drive from our hotel in Redondo Beach. Part of the drive was along highway 1 which takes you by the Santa Monica Pier and a number of beaches. Had the day been nicer (smog or haze from the Santa Barbara fires?) then we could have gotten nicer photos of the Pacific Ocean from the Villas.\n\nOnce we arrived, we waited in a queue on a slight incline. At the gate, I gave the first person the printouts of all of our tickets. The driver in the car in front just showed their phone so printed tickets may not be required as outlined In the email confirmation? Once verified she passed us to the next booth where we paid the $15 parking fee.\n\nWe were then directed to park in the central structure nearest to the entrance. There were a lot of open spots that day.\n\nWe decided to climb the stairs to the Villa but you can also take the elevator. At the top there is an amphitheater and you just walk down to the main entrance or turn to the right to walk through the herb gardens. The garden was nice with a small fountain good for photos and a view to the pacific ocean at the end. We entered the villa through the outer peristyle but the central pool was under renovation so we were not able to take any good photos. We found out this also affected a number of galleries as the Getty were making changes that will be completed sometime in Spring 2018.\n\nOnce inside the Villa there is a smaller peristyle and a lot of people were taking photos here or just socializing. Galleries were located in the corners and there was one for kids. Each section has Gold Roman numerals on the floor to tell you the year that the exhibits came from. There were good signage and descriptions of the displays and period that the audio tour was not a necessity. The highlights for us were the mosaics which had been removed from different Italian Villas. On the second floor there were more displays mostly focused on statues, jewelry, etc. The east garden was quiet and people were seen reading on the benches. There was also a nice fountain and mosaic inlaid structure that served as a popular backdrop for group photos.\n\nOverall we spent about two hours here. It kept both adults and the teens occupied. Definitely will come back again after renovations done.\n\n\n\n\n\n\n\nShow less"], ["Reviewed December 23, 2017", 5.0, "Christmas Visit - Spectacular & Not Crowded", "Must have a reservation (to park) but free once inside the gates. Amazing collection of antiquities dating back to collections before Christ that were acquired by oil tycoon - Getty."], ["Reviewed December 22, 2017", 5.0, "Mommy daughter day", "It was our first time going and we loved it! It’s free to get in just go online and print out your pass, yes people print out the pass! Pay for parking and enjoy. My daughter and I enjoy a good museum, especially when it has views for days. Plus it’s such a short distance away. This is a great place for a lunch and watch the sunset, you can bring food and chill or they have a cafe to grab some grub. The museum itself is beautiful, you can spend some great time looking over everything. I really enjoyed my time there and will definitely be back with my boyfriend to watch the sunset. Expect to spend make a day of it there is a lot to see!!! I won’t give it all away you have to see it for yourself.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Great place to visit if in LA oR near Malibu", "This is a wonderful place to visit, the staff and the docents all do a great job at telling the Getty Story just as he would have wanted it to be told. We took three tours and each was excellent & well worth it if you have the time. A great place to take children too - less costly than a trip to Paris or Rome to see and learn about antiquities. Plan at least 4-5 hrs if you want to do all of the tours.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Go back in time!", "We were glad we took the time to visit the Getty Villa. It's beautiful and amazing. I don't know if I would take my grandchildren, but my husband and I thoroughly enjoyed the many displays and especially the gardens."], ["Reviewed November 25, 2017", 5.0, "Getty Villa is amazing but not worth it while renovations take place", "The Getty Villa is one of my must do’s in LA. Whether to see the exhibit or listen to a lecture or just stroll in the amazing gardens. That said I don’t recommend going until renovations are done. When I was there 11/17 all the downstairs galleries were closed, all Greek and Etruscan work was closed and the most of the garden. It really was 1/3 of itself.\n\nThe website said some would be closed but I never imagined so much.\n\nGetty Villa is a treasure. Go when it can be treasured...not now.\nShow less"], ["Reviewed November 16, 2017", 4.0, "A slice of the ancient world in Malibu", "This was my second visit to the villa while I was on a tour. It had been overhauled since I first saw it about 20 years ago. Sadly, this time around, we could only see about half of the art exhibits because the galleries are being redone so it is advisable to check the status of the renovations if you're coming primarily for the art (if you're been to Italy and other Roman sites or to European or American museums like the New York or Boston collections, you probably won't be particularly amazed). But the site and the gardens are lovely (serious warm climate gardeners might find the plant list of interest) and it is an unique example of what a rich person can do to create a special place. We had a very good introduction to the site by one of the docents. The cafe's menu is limited and in the opinion of one of my fellow travelers, unsatisfactory. I was pleased to see a special area for schoolchildren, who clearly are getting to take advantage of this unique site as part of their education.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Ancient Rome in Malibu", "The Getty Villa is a transformative experience that will take you back 2000 yrs to ancient Herculaneum (modern day Ercolano) with breathtaking architecture copied from the Villa dei Papyri buried by Mt Vesuvius in 79 AD. Save yourself a trip to Italy and visit it in Malibu. You can take gallery tours, architecture and garden tours or do NOTHING and just enjoy the cafe and views of Malibu. The docents are experts. You only pay for parking and if you are in Los Angeles this is a MUST do. You can bring kids but in my opinion this is more adult, nevertheless kids LOVE pretending to be Hercules or Achilles. There are no lines, you just drive in and park then descend stairs into the theater area. You can book group tours as long as you have more than 10 or just join any of their hourly tours, or do your own with an audio guide.\nShow less"], ["Reviewed November 11, 2017", 5.0, "I love it", "Another great surprise in LA peace of treasure in Malibu for free part of Getty experience is a must! Parking can be for Getty center and villa if you have a full day visit both grate arquitecture and gardens volunteer elders lovelly plus kindnes and help\nShow less"], ["Reviewed November 9, 2017", 5.0, "Fascinating!", "The fact that this entire set of buildings was intended as a copy of a villa in Hercanuleum, which was covered after Pompeii, only makes it more interesting. Getty and his builder did an amazing job of recreating the spaces. And, oh the wall paintings. They are such a beautiful alternative to the heavily painted European ones that came later. Be sure to look up -- and talk to the docents. We would have taken a tour but for time.\nShow less"], ["Reviewed November 9, 2017", 5.0, "The Getty Villa", "Wonderful collection in a recreated Roman Villa . Must do the tours the get all the insight to make this a superb visit"], ["Reviewed November 8, 2017", 5.0, "Great lesson in architecture", "The villa is worth a visit to see the grounds and attend the architecture and garden tours. Cafe food is so-so."], ["Reviewed November 8, 2017", 5.0, "Don't just go to the main Getty - stop here", "You'll have to navigate the weird parking situation, but you will see some amazing artworks from the ancient world. Beautiful location and views."], ["Reviewed November 7, 2017", 5.0, "Feel like a roman", "The museum is just beautiful!\nGetty wanted the visitor to feel as if he was in an Roman Villa and that is just the feeling you get when you enter the grounds.\nThe artifacts are great too, but the buildung and the gardens steal the show.\nIf you arrive past 3pm parking is only $10.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Lovely gardens and views, but many sections closed", "There is no question that this property, replicating an Italian villa near Pompeii, is beautifully designed and in a lovely setting, but when we were there, several exhibition rooms were closed, and the garden was undergoing renovation. There are definitely some lovely, authentic mosaics, but a number of pieces in the museum are replicas. Having recently visited Italy, I enjoyed seeing more of what I experienced there, but I wouldn’t put a visit to the Getty Villa on the top of my list of museums. Also, given LA traffic, it’s not an easy drive to reach this location.\nShow less"], ["Reviewed October 26, 2017", 4.0, "A nice visit, but a bit disappointing", "We were so excited to come here as it was mentioned as it being one of the must see cultural destinations to visit. We called to make our reservation(the museum is free) and they gave us a liberal window of time. Driving in California can be horrendous! We paid our $15.00 parking fee(there is no admission charged for the museum), but we did not know that the entire 1st floor was closed for renovation except for the gardens. The gardens are all beautifully landscaped giving a nice peaceful feeling. There is no view of the ocean from the villa but it is in a tranquil location. The villa is modeled after the Villa dei Papiri in Italy. There are sculptures and antiquities on display. Several dining options and a nice museum store.\nShow less"], ["Reviewed October 25, 2017", 4.0, "The Villa @ Malibu", "The Getty Villa is located in Malibu, CA off of the Pacific Coast Highway. It is out by Arnold's place, so you can stop and say hello !!\n\nI had not done sufficient homework to know that this was not Getty's villa, as in a place that he lived. It is a recreation of a Roman villa based on plans that were found in the excavations in Herculaneum near Pompeii, Italy. This truely is a unique place!!!!\n\nThe tour is excellent with a very nice gift shop.\nShow less"], ["Reviewed October 25, 2017", 5.0, "On a recommendation", "My wife was given a recommendation to visit this museum and we are certainly glad we acted on it.\nIt is out of town but worth the effort I would suggest taxi which can drop you off at the entrance if you don’t have a car. Uber is cheap.\nIt is basically Paul Getty’s house that has been turned into a museum and is fascinating. It is a villa built as a replica from the Pompey era and is so detailed it’s hard to believe.\nThere is a short video in a small theatre you can view which details the history so I won’t spoil it for you.\nIt is immaculately looked after and all the staff are very friendly.\nTo say it is unique is an understatement, I am not a regular visitor to museums but enjoy this ver much as did my wife.\nPlan up to 3 hours for the visit as time just flys as you go around.\nThere are two places to eat a restaurant and cafe and the prices are not exuberant.\nThere are many exhibits with artefacts that are astonishing.\nThere are rest rooms dotted around so no worries there.\nAll in all a real eye opener and so glad we visited.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Lovely place with great view", "The Getty Villa is located on Pacific Highway. It was commissioned by the Oil Giant Mr Getty. He never got to see it finished though. You could book tickets online and I think it is free. Once you are at the premise, there is a documentary video explaining the history of The Getty Villa. The outdoor garden has a great view of the Pacific Coast. There are many artifacts collected by Mr Getty while he was in Italy. My suggested itinerary if you have never been to the Getty Villa is 1) visit the Getty Villa in the morning 2) go for lunch at Nobu or Dukes 3) Roam around the Malibu Pier 4) there is a shopping mall near Pepperdine University (ranked number 1 most beautiful campus in the USA\nShow less"], ["Reviewed October 17, 2017", 5.0, "unique museum and gardens", "I always thought museums were a place where you went to look at artifacts from previous eras, that were meticulously labeled, laid out, and exhibited. I also thought there were house museums, where you could see original structures as well as period or reproduction furnishings. After the Getty Villa, I am coming to understand that there is a different type of experience, one that has an emphasis equally on museum-level objects, as well as an emphasis on the exterior gardens, and how people interacted with them. Slightly overpricced but high end food. Didn't know you needed to have reservations in advance. Stunning views, wish I could have come back and just sat and enjoyed the gardens without the pressure to see everything.\nShow less"], ["Reviewed October 15, 2017", 3.0, "Bit of a let down after all the hype", "I love Italian and Greek antiquities and was told this is a must visit to experience an amazing collection. After battling the Malibu traffic (not always fun on a sunny weekend) and navigating the somewhat tricky entrance to the Getty Villa, I spent about 45 mins wandering around the many levels of the museum and associated buildings. Its an impressive structure - the many levels and layers do evoke the architect's vision of exploring a big dig near Pompeii, but overall it was a bit enigmatic. Most of the art work was replicas and not originals and many of the exhibits were closed for renovation. I'd probably be more upset if we'd had to pay to get in, but still, time is short and when you make a half day travel commitment to something that is not what you expected its annoying.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Really great museum", "Went to the Getty Villa in Malibu today. Really great museum. Unfortunately parts were closed for repair.\nThe cost is free but parking is 15.\nBut if you do both the villa and the center in 1 day you only pay once.\nThey do require you to get reservations. Just go on their Web site and pick a time. You also have to print it out.\nShow less"], ["Reviewed October 13, 2017", 5.0, "Educational, enlightening, and fun", "About half of the villa/museum was closed for rennovation when we were there, but we saw a lot and enjoyed seeing everythihg. Strolled the gardens and had a very nice lunch in the cafe. Pefect weather too! And while there is signage all over the place we still found ourselves getting lost. You enter at one level, then go up and come down to get to the museum. Many helpful docents along the way.\n\nBE AWARE: They want to take your tickets as you arrive at the parking \"guard station,\" which we were not prepared for. So we had to move out of the line, unpack a bit, find our tickets, and then enter the entrance drive. That was awkward (we were expecting to have to hand our tickets in, on foot, when we approached the villa).\nShow less"], ["Reviewed October 10, 2017", 5.0, "Lovely villa and grounds", "The Getty villa has a spectacular setting on the hillside near Malibu. The villa itself, Roman in style, is quite lovely. Although Neo, a great deal of attention has been given to detail with some beautiful and peaceful inner courtyards. The collections are extensive, with many Roman frescoes.currently there is an exhibition of Hockney portraits which is interesting to view. Admission is free but you pay for parking. This is halved if you visit the villa and Getty Centre on the same day, which is what we did. A great day!\nShow less"], ["Reviewed October 2, 2017", 5.0, "A National Treasure", "The Getty Villa is truly a national treasure. A perfect place of beauty, solace, inspiration and awe. The Villa itself is an experience they transports to a higher level of appreciation of creativity and the priceless works of art are not only protected and preserved but also beautifully displayed. Numerous descriptions, lectures, workshops and such make the experience even more rewarding. Music and theater in the courtyard and amphitheater complete the experience. A perfect place to visit soon and often.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Beautiful", "I loved this place. It was peaceful, not over packed and interesting. The artifacts were nothing less than stellar.\nAlthough the main garden water feature had a big tent over it, it was still enjoyable. The herb garden was a dream.\nThere were many small groups of children so this is a perfect learning experience.\nShow less"], ["Reviewed September 28, 2017", 1.0, "Only because we never entered...", "I was so excited to visit, we registered, printed the tickets, everything was fine until the moment we reached the gates. I have to mention, we are europeans, we walk everywhere, for us it is an option to walk even 10 miles just to get somewhere. We stayed at our friends house that night, which was not so far away from the Villa (\"not far away\" by our european standards) Unfortunately, the guards told us that we can only enter if we drove a car, had a bus ticket or presented a bike as a proof that we haven't parked a car somewhere in the neighborhood. As we mentioned we walked, they asked us to prove that we stayed at friends house by printing out the water bill. How absurd is that? Of course we get the rules, there is a city law not to park in the area outside Getty but we found it so funny that it is so hard to believe we just came here walking. It doesn't even make sense to question whether we came from a friends house just around the corner or from a beach from Santa Monica. That's our choice to make. Isn't that supposed to be encouraged in America (I mean, walking), where one third of the people or even more, I believe, are overweight and Los Angeles is covered by thick smog because of so many cars there? Anyway, sadly, we visited Los Angeles for a few days and were very disappointed that we had to be treated as liars near the gates just because americans don't walk anywhere and for that reason weren't able to enter the Villa. I felt really discriminated. I can understand that US has it's own culture (driving so much everywhere) and I don't want to come across as being rude towards that but I believe that such cultural places, museums should be more open minded towards people that came to visit by traveling half of the world and weren't able to have this experience just because of their ignorance. Instead of letting us see the beauty inside, the guards kept on going about the parking laws, treating us badly as if we were criminals, though we didn't even have a car at all and being from Europe, never even imagined that you can be prohibited to enter because you walked there.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Beautiful ancient art and building", "The beauty and quality of the ancient roman statues, mosaics and art was impressive. The building and gardens were great reproductions of ancient Italy. The self guided tour was easy to use and informative. Liked the video at beginning."], ["Reviewed September 23, 2017", 5.0, "SPQR in Malibu", "For a avid Roman fan this is highly recommended. The Roman relics on display, the museum has 44000, outshine museum collections in Italy. But for me the star of the show is the museum building which is a true copy of a Roman villa. It was wonderful to get a feeling of what the originals must have looked like. Oh yes access is the cost of parking your car. So a bargain\nShow less"], ["Reviewed September 20, 2017", 5.0, "Beautiful villa, wonderful exhibits", "Perched up on a hill overlooking the Pacific, this place is just amazing. The garden, the flowers, the exhibit. It's worth a drive."], ["Reviewed September 18, 2017", 4.0, "Beautiful re-creation of Roman Villa and Gardens with much ancient artwork", "This is a beautiful setting of a Roman Villa and surrounding gardens, housing an extensive collection of Roman Sculptures and Mosaics. The Greek and Etruscan collections are in the first floor galleries, which are closed for renovations, and the pool in the largest garden is also under repair, restricting access and causing much noise. The docent tour was very good - the people at the front gates need some customer service training. Watch out that you don't miss the poorly marked entrance on Highway 1. You think you need to go to the stoplight, and that is too far. Not as great an experience as I was expecting. The Getty Center was better.\nShow less"], ["Reviewed September 18, 2017", 3.0, "Getty Villa", "The Getty Centre is my favourite place in LA to visit , this was my first visit to the Villa down the road , beautiful location and if you're into roman artifacts etc it's the place to go. Mr Getty's copy of some roman Villa is bit naff in my opinion - more money than sense .\nThat said the gardens and water features are lovely and you have some lovely views of the coast.\nYou can visit The Getty Centre for no extra cost , there is no admission charge but the parking is $15\nThe Villa is better value when visited alongside The Getty Centre . NB The Getty Centre is closed on Mondays\nShow less"], ["Reviewed September 17, 2017", 5.0, "Beautiful place, worth the visit", "Loved the visit here. I hadn't been since I was a kid and it was just great! Slightly bummed that the main outside pool is under wraps for reconstruction but I got over it. The grounds are beautiful and the collection is excellent. Parking is $15 but tickets are free to enter. Well worth the visit in Malibu.\nShow less"], ["Reviewed September 16, 2017", 3.0, "Interesting", "It's a beautiful location and modeled after a villa buried in Pompeii. Unfortunately the gardens are under repair and the main floor exhibits are being redone. But the admission is free except for a $15 parking fee. You need reservations too.\nThe grounds that are open are nice and there is a very large herb garden.\nThe second floor is open and has a nice exhibit of statues and frescoes. We enjoyed what they had on display.\nShow less"], ["Reviewed September 16, 2017", 5.0, "We went for the play!", "We went to see the Greek tragedy at the villas outdoor theater. The actors did a great job and we really enjoyed the production. The people working there were very friendly and helpful. I highly recommend seeing a performance there!!!"], ["Reviewed September 14, 2017", 4.0, "Returns time after time", "The renovation of this beautiful part of the water dam, and of course limits the overall impression. Certainly, it gives more time to study other parts of the content.One late afternoon one hour before closing, you have almost the whole area for yourself."], ["Reviewed September 13, 2017", 5.0, "Great Place to Spend a Morning or Afternoon", "Beautifully situated above the Pacific Ocean in Pacific Palisade this museum is very different in style and in its collections from the much larger Getty Center. Be sure to pick the right museum if you are interested in a particular collection, otherwise, do both! There is a nice cafe on site which we enjoyed thoroughly as well.\n\nTip: if you visit both the Getty Villa and The Getty Center (about 30 minutes from each other with light traffic) you can use the same parking pass - just be sure to have it validated before leaving the first museum you visit. 2-for-1 - can't beat it!\nShow less"], ["Reviewed September 12, 2017", 5.0, "Must see in Santa Monica", "We planned a visit here for many years. Made it!\nWe had a garden tour with lovely Christiane who was very knowledgeable and absolutely charming.\nUnfortunately the splendid front pool area was under repair, but I guess all things need repair. Such a pity not to have seen the reflections, however that didn't detract from the whole experience. Again, most unfortunately the lower museum area was also being reorganised, and again although disappointed it was still a great place to visit. Lots of interesting people, exhibits and dear Charles a volunteer who was a really lovely man who chatted to my husband. Getty you have a great place here, and really lovely people throughout. Don't miss this - oh! Get your tickets free first as they have timed entrance.\nShow less"], ["Reviewed September 11, 2017", 4.0, "Great visit back in time", "Make sure you get your online tickets before you go. We arrived from the north so you need to pass the Getty and make a U turn at the first light. Beautiful grounds, herb garden and views of the ocean. Currently the large pool is under renovation but will be beautiful when finished. WE went for extra credit for my junior high daughter's art class and they will give you a written credit for that. The downstairs galleries are under renovation but we spent about an hour walking the grounds and the upstairs galleries. The kids really liked the smells of ancient times display and had fun with that. Since you get parking for $15 you can also go to the other Getty about 30 minutes away and they validate your parking so you don't pay another fee. It was a full day doing both museums in a day but doable.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Spend a nice afternoon!", "Visited on an afternoon. Nice place to visit on a date for a couple of hours. The museum is really nice and their restaurant is a great place to relax and chat for lunch."], ["Reviewed September 9, 2017", 5.0, "More intimate than larger Getty center", "The Getty Villa requires reservations- it's still free but since its smaller than the larger center, is based on time of entry (but they allow you to stay as long as you want). The centerpiece is their museum/villa and the garden. Take a free guided tour to get a better feel about its history. (parking is $20).\nShow less"], ["Reviewed September 7, 2017", 3.0, "Nice spot", "The Getty Villa is a fun spot for a stop to enjoy some nice art and also a beautiful setting overlooking the Pacific Coast Highway and the ocean. Great stop while visiting Malibu."], ["Reviewed September 7, 2017", 4.0, "Interesting look at ancient Roman art", "Beautiful campus of villa and gardens and ponds and fountains.\n\nSculptures and art work of ancient Rome are displayed, but most interesting to me was the architect detail of the villa itself and the manicured grounds.\n\nTip: There are several hills and steps to navigate. There are several elevators - look for them.\nShow less"], ["Reviewed September 3, 2017", 3.0, "For devotees of Ancient Rome", "A number of galleries were temporarily closed for renovations so my rating and review may not be representative. The villa itself is a wonderful building constructed on a hillside in the Pallisades. It contains a large collection of sculptures, mosaics and artefacts from The Roman Empire, all beautifully displayed. Entry is free. Parking $15. Weekends are busy.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Breathtaking", "A wonderful reconstruction of a Pompeian villa complete with Mediterranean gardens, fountains and theatre. It is a museum as well with items from Naples Bay area including frescos and statues."], ["Reviewed August 28, 2017", 5.0, "an afternoon with the gods", "We spent a beautiful Sunday here and Im glad we went early. Summer was just warming up and traffic on Pacific Coast Highway was heating up too. Six of us, all different ages experienced a very pleasant morning looking at the gardens and ancient art. The house in the museum was done to resemble an actual mansion from Pompeii.There are docents to lead and answer questions. There are many steps but also an elevator. An herb garden is a sweet smelling walk. There is food(expensive)available, but bring your own picnic.There is no fee to the museum but you must pay for reserved parking so call ahead for reservations.\nShow less"], ["Reviewed August 28, 2017", 5.0, "A gem in Malibu", "The Getty Villa is a great place to experience history. The only problem is we didn't allow enough time. Beautifully located just off PCH. The exhibits, gardens, and tours are excellent and worth coming multiple times. Check their website for special events throughout the year. While entrance is free, be aware that parking is $15.\nShow less"], ["Reviewed August 27, 2017", 5.0, "J Paul Getty's Museum of Antiquities", "This is the smaller of the two Getty institutions in greater LA and also on the site of his original museum. Both institutions are similar in that they offer free guided tours staffed by volunteers. The tours at both institutions were excellent.\n\nThe Villa is currently undergoing some major rearrangements which are understood to be driven by the new curator's vision. As a result, much of the 1st floor was closed off. There is, however, things to see in the 2nd floor and the multiple gardens in the complex. The gardens and inner courtyards were the highlights as they went well with the theme of the facility and the weather was really good on the day.\n\nThey seem to have a few events and in the day, we were able to make perfume as they did back then which was interesting. Will have to make a return visit to catch the sights of the 1st floor.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Lovely and elegant gardens, fountains, antiquities", "Love this place. Feels so spacious and beautiful. Love the tiles and outdoor fountains, fruit trees, and gorgeous art. The staff are helpful and knowledgeable - the food at the cafe is pretty good though not as scrumptious as I was led to believe. The salads were best.\nShow less"], ["Reviewed August 22, 2017", 4.0, "A peaceful stop despite current renovations.", "A beautiful place, but if you have the option I would wait until the renovation is done and the Roman pool is filled with water. If your only in town for a short time still worth the stop, was very quiet and peaceful on a Monday morning.\nShow less"], ["Reviewed August 16, 2017", 5.0, "One of THE Best Museums in the LA Area", "Old Man Getty was one of the last of the Robber Barons. Who followed form and donated a large part of his fortune to Civic Improvement.\n\nWhat he gave to us is just a marvel of what a Classic Roman Patrician Villa would look like during the Augustinian Age of the Roman Empire.\n\nSo if The Early Empire Stage of the Romans is of any interest. Than I most highly recommend coming to this beautiful, well set and run Museum.\n\nNow for some advice. Go during the Weekday between say 10 to 3 pm. As the Traffic getting there can be a nightmare.\n\nMake sure you have reservations otherwise you will be out of luck.\n\nWear some comfortable shoes and pace yourself. As while the place looks small it isn't.\n\nAlso stay fluid as the beach area there can dry one out. Sunscreen is another good idea.\n\nThey also have a very nice and reasonably priced Gift Shop with some interesting books and other nicknames for sale. I got a lot of Xmas Presents there for Family & friends there.\nShow less"], ["Reviewed August 16, 2017", 5.0, "A Stunning Must See On the Coast Of Malibu", "The stunning Getty Villa is an easy must see while you experience the amazing Ca Highway 1 drive north, or south. Located in a great location you are walking distance to Will Rogers State beach, food, and fun. Sunsets are among the finest in the world.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Nice and worth a visit", "Very impressive collection displayed in a beautiful surrounding. Absolutely worth a visit when in Malibu."], ["Reviewed August 16, 2017", 5.0, "Fascinting Recreation", "This is definitely worth your time to see how a roman villa was created in CA! A beautiful setting with fine art and gardens. Being there does feel a bit like you are in Italy where such palaces first existed."], ["Reviewed August 15, 2017", 4.0, "Relaxing experience", "The Getty Villa is situated on the eastern end of Malibu Beach, LA California. It is one of two Getty Museums in LA. Built by the famous philanthropist Paul J Getty , the Getty villa provides a relaxing outing for the family. However Malibu itself is famous for bumper to bumper traffic and getting to the Villa can be time consuming so plan accordingly.\nThe museum has many interesting artefacts and the display is done very systematically. There are audio and video guides also available.\nThe location provides a great view of the ocean as well.\nDo carry snacks and water as everything is a tad expensive inside.\nOverall it was a very good experience for us.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Wow! Just Wow!", "This is an absolute must for a trip to Malibu! The art work, statues, structures and Gardens!! Just breathtaking. Be certain to get your admission tickets in advance. We truly didn't want to leave. It felt like a European museum. Very impressive."], ["Reviewed August 12, 2017", 3.0, "Worth visiting if you are heading to Malibu", "A nice museum to visit and spend few hours there. It's a free admission, but you need to pay for parking ,$15 .\nKids will love going through it, especially the brief show about the history of the place.\nThe only downside of the place was the contradicting instructions and rules you have to follow by the staff there. My selfie stick caused more confusion that in any place I visited, which didn't allow the stick that extends. I was told no to extend it, other staff told me not allowed at all. It was frustrating despite not extending the stick, and abide with whatever they wanted visitors to do. They should have more words to their staff on what's is allowed and not.\nShow less"], ["Reviewed August 11, 2017", 3.0, "Depends on your interests!", "Visited the Getty Villa based on a recommendation of \"things to do in LA\"\n\nThe history of the Villa and the philanthropic efforts are notable but this wasn't really an attraction for me.\n\nWe wondered around for an hour, looked at a few interesting artifacts and left.\n\nIn the end this is really just a replica of a number of historical items and houses in Europe. To be fair there were a few genuine artifacts but overall meh!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Bacchus uncorked", "Great series offered at the Getty Villa. Attended the ancient Brews evening. Strolled the villa grounds first. Then went to the auditorium and listened to an interesting lecture about what kind of alcoholic beverages people drank in Europe in earlier days. Then we sipped brews (some made especially for the evening by local breweries) based on ancient European recipes, out on the upper deck. Great appetizers and conversations with the lecturers. Interesting brews. Perfect night out!\nShow less"], ["Reviewed August 8, 2017", 5.0, "Great Greek and Roman History", "Get reservations and just GO. This is a must see place in the LA area. The garden is fantastic. Even the gift shop is good."], ["Reviewed August 7, 2017", 5.0, "Getty Villa", "Beautiful Mediterranean style Villa converted into a museum. Just make sure you reserve online, it is free but online reservation required. I think the best way to visit is through joining their guided tour. It was wonderful learn so many amazing things from their tour guide. I never knew what \"museum\" means. It is coming from the word: -muse( inspiration) and museum means house of inspiration. What an amazing description..\nShow less"], ["Reviewed August 6, 2017", 3.0, "Overrated", "This is a huge roman style villa built by Mr Getty to display his Greek/Roman ancient art collection. The villa is a reproduction of a Pompeii villa. If you have ever been to Italy or any museums which has Roman/Greek arts, the villa is not worth visiting. If not, go for it as it is a good preview of what Roman/Greek architecture is.\nShow less"], ["Reviewed August 6, 2017", 5.0, "We really enjoyed the villa, as did the children.", "We weren't disappointed by the exhibits, displays and villa. Unlike some who failed to look into it before their vista, we knew what to expect. Despite what's been written by some on here, their website clearly states that parking is $15, that you need to orebook your tickets, and that there is one specific entry point for the few visitors who arrive on foot. When you book your FREE tickets online, all of this is explained quite clearly.\n\nAll of that aside, we really enjoyed the exhibits, found the audio tour informative and quite funny, and the staff friendly and helpful. It's probably nit the kind of place that we'd keep going back to, but we're really glad that we went, and enjoyed our 3 hours there.\n\nGetting there early was a good move, as we'd pretty much finished before the place became crowded. The staggered entry surely helps with that. The security checks were thorough, and unexpected, but due to the staggered entry, this was all done without delay or lines. We found the museum to be well set out and well managed, and the staff to be efficient and friendly.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Visit", "Beautiful property. Be sure to make reservations ahead of time on weekends. Took a guided tour of the mosaics. It was great. Looks like it is a great venue for concerts that they hold. Staff was very helpful. Really nice exhibits of early Roman and Greek artifacts. Very nice garden.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Hidden gem", "Beautiful place combined with a museum and peaceful gardens. It is not crowded even on weekend so you can relax and spend a day for all the antiques. Guided tour is available for easy understanding of the villa. Remember to book your ticket in advance"], ["Reviewed July 31, 2017", 5.0, "Such a beautiful place", "Gorgeous artwork on display. Beautiful grounds. Amazing buildings. I think I liked this place better than the Getty museum. they had several displays closed for renovation but there was still plenty to see. Quite an enjoyable visit."], ["Reviewed July 28, 2017", 5.0, "Antiquity heaven", "Spent a day here and could easily have come back the next day and done it all over again. Huge car park where parking is $15. The higher you drive up, the closer to the entry point (this is counter to most places). Free entry to villa. You can do guided tours but I opted for the iPod self guided tour. This gave me the freedom to meander around in an unstructured way. That said, I would definitely recommend the short intro film in the theatre. It provided a great overview of J Paul Getty, the Villa, The trust and more which was especially useful for an ignorant person like myself. (Thank you Charlie - volunteer - for recommending how I maximise my time.)\nThis is a remarkable place. The artwork is impressive and I like the way the site is dedicated to the antiquities. The building, structure, gardens, presentation - impeccable. I found the stained glass fascinatingly intricate - it is amazing what these artisans could do with so little so long ago.\n\nThe Getty Villa is a very inspirational place.\nShow less"], ["Reviewed July 28, 2017", 5.0, "restful gardens, beautiful antiquities.", "Great place to escape the hustle and bustle of LA. The Getty Villa is full of priceless antiquities housed in a Roman-style villa, complete with Mediterranean gardens. We went on a Monday and it was pretty quiet and peaceful. You must book tickets in advance though or you will be turned away.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Nice Roman sampler", "The Villa is a lovely spot to visit including lunch at the Cafe. You will get to see a decent collection of mosaics and artifacts from the Roman era. Quite a few halls are being renovated now, but there is enough to see during a visit now. Don't miss the walk in the Roman Aisle and the herb garden.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Weekday visit - not crowded", "I went on a Thursday. It was crowded but not enough to cause problems with seeing the beautiful artifacts. Remember to read the signs about the rooms that hold the items. The rooms are also replicas of different houses in Italy. The audio tour was helpful and gave more background info about the different areas of the villa. Also - vets do not have to pay for parking in the summer!\nShow less"], ["Reviewed July 24, 2017", 5.0, "Worth It", "Parking is $15 but the museum is free. Getty never saw the Villa completed. Good for a couple of very pleasant hours."], ["Reviewed July 23, 2017", 5.0, "Beautiful place to visit", "I went to visit Getty Villa in July 2017. If Mr. Paul Getty was still alive, I would write him a letter, thanking him how generous he was for sharing this beautiful property and priceless collection with public for free (the only fee you pay is parking for $15).\nThere were some repair in progress and some galleries were closed as they were reinstalling the collection. Still, with the collection that I was able to see, I personally could be there for more than 3 hours if it wasn't for another event that I had to attend.\nThe property is located right across from the Malibu beach which makes your visit even more enjoyable with the ocean breeze cooling off the temperature during summer time.\nVisit the website for sure for instructions and obtaining tickets before you just drive up there (you need to print the ticket in advance).\nShow less"], ["Reviewed July 21, 2017", 5.0, "Spectatcular in every way, on top of being FREE!", "If you are looking to visit the Getty Villa, please make sure you program your GPS correctly, as the Getty Center (or Getty Museum) is not far away and is a different attraction entirely. The Getty Villa is a built from scratch replica of an Italian villa that was excavated near Pompeii that had been covered by volcanic lava from the Vesuvius eruption 2,000 years ago. John Paul Getty built it to house his personal extensive collection of antiquities from Greek and Roman times. It is a superlative and impressive collection of sculpture, mosaics, and other artifacts presented in an absolutely incredible setting of buildings set into a hillside at the southern end of Malibu that overlook the Pacific Ocean, which can be seen from the higher elevations of the villa. All of the grounds are equally spectacular with fountains and gardens literally everywhere. Apart from the $15 parking fee, this attraction is free to enter. There is a nice café on the grounds, so if you spend the day or several hours you can take a break and eat and drink. We toured the villa with my 90-year old mom, who has mobility difficulties, but the facility is friendly to such individuals in that it has elevators and ramps that provide access to those who require such conveniences.\nShow less"], ["Reviewed July 21, 2017", 5.0, "My dream home", "In the gift shop I offered to buy the villa and put it on my credit card but offer refused. LOVE this place. Would volunteer if we lived closer."], ["Reviewed July 16, 2017", 4.0, "Beautiful location and collection", "This is a fabulous place to visit for an hour or 2. There is no admission charge - you just need a timed ticket. Parking is $15. The cafe offers nice selections - not inexpensive but certainly tasty. The gift shop has lovely and unique gifts.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Exceptional Antiquities Collection in Stunning Setting", "It's an easy and beautiful drive Along Highway 1 to the Getty Villa in Malibu, best approached from the south. Book your tickets ahead of time otherwise you'll be turned way if the garage is full. We were able to park free with our paid receipt from the Getty Center garage where we were earlier in the day. The villa is a replica of Roman villas unearthed in Pompeii and Herculaneum, with gorgeous gardens, a reflecting pool (empty at the moment) and rooms full of Greek and Roman art. Many of its galleries were closed for reconstruction when we were there so we didn't see the entire collection, but what we did see was very impressive. I imagine it will be even more spectacular when the renovations are finished. Still very much worth a visit, even with its current limitations.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Beautiful views and perfect to roam around", "this is my first visit here and was astounded by the roman mosaic exhibit as I have been to both greece and italy including pompeii/rome. it was not overwhelming and plenty of space to view the different rooms and exhibits. be sure to roam the gardens and enjoy the wind coming off the ocean.\nShow less"], ["Reviewed July 13, 2017", 1.0, "Unbelievably rude people and not worth it", "I visited with two other young women and we were absolutely horrified by how the parking and security guards treated us. Rather than helping us to enter properly (since it is for some still-unknown reason impossible to walk into the grounds on foot), they simply yelled at us and laughed maliciously at our discomfort. Some other visitors saved us by offering a ride into the grounds. The art is fine and the gardens are decent (although I did find the villa pretty tacky), but none of that made our truly scarring interactions with the guards worth it. They yelled at us again on the way out when we tried to figure out where to have our Uber rescue us from (no signage about it, yet you can't have them pick you up near the parking garage). I really don't understand how they found a collection of staff with so much hostility. Wondering if they train them to be cruel so they don't have to deal with crowded spaces on the grounds. Good luck if you decide to go. Maybe book an appointment with your therapist for the day after.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Beautiful", "This is an amazing beautiful place. You cannot even tell you are in the middle of Los Angeles. A must see for visitors to LA"], ["Reviewed July 11, 2017", 5.0, "Wonderful scenery", "The Getty Villa is worth your time. It is easy to get there and walk around. Be sure to watch the movie offered to get the background. Amazing!"], ["Reviewed July 10, 2017", 5.0, "Stunning Museum - Gardens", "A stunning building, gardens and complex. Shows no expense spared. It's free to visit but there is a $15. parking fee. A reservation to visit is required. The place is not over run with visitors. Stay as long as you want. Building and decoration is patterned after a Roman villa. Combined with the exhibits its a great museum experience.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A trip to Rome, back in time!", "When you visit the Getty Villa, you take a trip to Rome in the style of living of the rich and titled, with the reproduction of a Roman villa filled with antiquities and having a beautiful garden as it would have looked in 1000AD. The staff is helpful, the parking ample, though you do need a reservation. Great fun to test the amphitheater for it's acoustics.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A MUST SEE", "I know that there are many must sees along the PCH but The Getty Villa stands out. Not only are the antiquities and art of the very best, you are outdoors most of the time in settings that only Roman emperors experienced. Beautiful, peaceful, astonishing and fun. As I said, a must see.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Wonderful Museum", "This museum is the museum - surrounded by gardens & architecture you can walk through & experience the sights & smells of Ancient Greece & Rome!"], ["Reviewed July 10, 2017", 5.0, "Amazing Art and History Attraction", "We enjoyed a 2 hour visit and tour of the Getty Villa during our trip to Malibu. The history of the Villa and the amazing collection of artifacts were well worth the time. Call ahead for parking space."], ["Reviewed July 10, 2017", 4.0, "feel like a roman", "This museum really gives you the feel of visiting a Roman Villa. There is interesting Roman art there, with great explainations of the history and significance. A nice place to visit!"], ["Reviewed July 9, 2017", 5.0, "Oasis of Natural Beauty", "This was such a wonderful place where art and nature weave a beautiful tapestry for people to enjoy. The gardens are amazing as well as the museums within the grounds surrounded by exquisite architecture. A lovely place to visit and a must see!"], ["Reviewed July 8, 2017", 5.0, "Had to see the original Getty", "My mother-law has enjoyed this place since before the Getty Center was built and because of this I've always wanted to come here. I have been to the Getty Center, but the timing never worked out to\nVisit the Getty Villa until now. So glad I finally got here. The buildings, the grounds, the views, his collection of Greek and roman antiquities is amazing. Highly recommend you watch the history of Getty when you arrive. We had reservations and I appreciated the way they manage crowds. We felt like we had space to look at the things we wanted.\nShow less"], ["Reviewed July 7, 2017", 5.0, "Stunning!", "What a gift! While entry is free, a ticket is required to limit the number of people on site at any given time. So grateful for that! It made strolling the campus and looking at the antiquities so relaxing. There is a lovely restaurant, but they also have a picnic area, so you can bring your own. Be sure to check out the video about the history. It's only 12 minutes long. Stroll the gardens and soak in that you are looking at art that is thousands of years old.\nShow less"], ["Reviewed July 5, 2017", 5.0, "A gem in Malibu", "Went in without a reservation on July 4th weekend, free entry, parking is $15. A chance to see Getty's philanthropic work, wonderful manicured grounds, thespians performing and a chance to see art work and statues two thousand years old."], ["Reviewed July 2, 2017", 4.0, "On the Hill", "We were tracing north on the Pacific Hwy and saw the Getty Villa from the road. But we arrived too early in the morning and could only see the outside. It opens at 10:00."], ["Reviewed July 1, 2017", 5.0, "Incredible", "The place (architeture) is unbelievable! the history and marble pieces from mitology are amazing as well and the gardens.....wow!!!!!!!!!!!!!!!\nyou have to book your visit on their website but you can do just one day before the visit. 2 or 3 hours are enough at the place and worth the visit!\nShow less"], ["Reviewed June 30, 2017", 5.0, "Enlightening", "This was my first stop on my agenda the day i landed in LA. Located off the Pacific HWY in Malibu. I thought i needed a ticket for entry but the free ticket was provided at drive entrance.. did pay for cover parking though. The Villa was enlightening, like stepping into different era. Getty even has stage for theater plays outside. Enjoyed the history of ancient Greek & Romans. Got pic of Venus, Goddes of Love ♡. But be aware, no cameras with a flash allowed inside the building. The botanical garden placed me in their times. Sadly the pool was out of water due to conservation (pic) Great educational museum. Do recommend as a tourist.\nShow less"], ["Reviewed June 30, 2017", 5.0, "Getty Villa", "This was built before the Getty Center. It's beautiful and definitely worth the visit. Make sure you go online and get your free tickets beforehand. Take your time going through it. If you love pants and architecture - this is a must."], ["Reviewed June 30, 2017", 4.0, "Beautiful villa", "Personally, the villa itself was much more interesting than the actual museum. The villa is a great example of Mediterranean architecture and the detail is amazing!"], ["Reviewed June 29, 2017", 5.0, "Are you ready to be pleasantly transported to another time and place while still being local?", "The Getty Villa is a must see! The art collection is exquisite as expected. The actual villa is stunning, and dozens of gardens are gorgeous as well as revitalizing! Handicap friendly and just the right size where minimal walking is necessary. Pack a lunch or plan a picnic to enjoy alongside the Coy pond. I highly recommend visiting this local gem.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Lovely Place!", "After visiting both Getty Center and Getty Villa, I found the Villa more manageable than the Center for a day trip (not to discount how much I love Getty Center, though, i just wish I had more time in the Center).\n\nThis villa is very beautiful with unique gardens. There are still plenty of exhibitions in the galleries that kept me occupied for a full day. The visitor center provides in-depth self audio guide on iPhone, which you can easily loan it for free with a valid driver's license. The docent-led tours are hit-or-miss, depending on who provides it. I had a wonderful, interactive, and informative garden tour, but the architectural tour was so dry and boring that I decided to drop out in the middle.\n\nThe place is located a short drive from Santa Monica, or, if you are adventurous like me, a bus ride can still take you here. Definitely plan a day to visit this place, it's a hidden gem!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Very Nice and wonderful place to see", "This used to be the location of the getty museum until it moved many years ago to west LA, it is the original home of J Paul Getty, and a great place to see.. I think this is a must!"], ["Reviewed June 19, 2017", 5.0, "so unique", "lovely hidden gem, beautiful buildings and great art. The buildings are in top condition, with fantastic gardens."], ["Reviewed June 18, 2017", 2.0, "I was not very impressed", "We started with a tour guide for the gardens and ended up walking away and exploring on our own. It is a beautiful place.... but there are so many other beautiful places and gardens I have seen that this paled in comparison."], ["Reviewed June 15, 2017", 5.0, "Amazing collection of greek and roman antiquities", "Unfortunately many galleries were closed during our visit but the ones that were available offered and outstanding collection to enjoy."], ["Reviewed June 13, 2017", 5.0, "Wear your toga", "This space has the ability to transport you back in time to the splendor that was Roman country life before Vesuvius erupted in 79 CE. Picture yourself walking these colonnades with Caesar's father-in-law (so they say). We visited on a sun-drenched CA day (first in a week) and the sights were spectacular. Although the view of the Pacific is interrupted by quite a few trees, the feeling of gracious country life is palpable. There were wandering actors, a ceremonial sheep (on wheels), jugglers, all creating a wonderful atmosphere. Entry is free (amazing) with a $15 parking fee. Reservations required.\nShow less"], ["Reviewed June 7, 2017", 4.0, "Beautiful!", "The Getty Villa is beautiful and is perfect for pictures. There are museums in the villa as well so you can definitely spend an hour or more there. We arrived after 3pm so parking is only $10 ($15 before 3pm). There is no admission fee but you do need to make a booking online first before you can access.\nShow less"], ["Reviewed June 1, 2017", 4.0, "Beautiful location but limited exhibits", "Visiting the Getty villa is a good way to kill 2-3 hours in Malibu. The grounds and the building are beautiful but it gets a bit hard to appreciate this when it is crowded. The intro film is very interesting and a must see to get some context on what a Roman style villa is doing in Malibu. The collections are a bit limited but interesting but the gardens are definitely the biggest draw.\nShow less"], ["Reviewed June 1, 2017", 5.0, "A great place to visit.", "After seeing the Getty Museum, a few years ago, we wanted to see the Villa. It is a beautiful estate residence that has now been made into a museum. The grounds, flora and fauna and artifacts help place you back in time to a Roman Villa. And if the weather cooperates you can be transformed in time and space to another era.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Beautiful venue, Beautiful Art, Free bu need reservations.", "No matter if you're from out of town or local, this is a must visit if you're in the area. Its not technically in Malibu but it doesn't matter. Must have reservations, parking costs $5 I recall, but there's NO ADMISSION charge. You can show up without reservations if you've taken the bus. Lovely art antiquities and nice grounds. Not to be confused with the Getty Center, this is smaller in structure but more eloquent in its architecture and sizable in acreage.\nShow less"], ["Reviewed May 30, 2017", 4.0, "A rather unique museum experience", "While the Getty Center houses vast majority of Getty's collection, the Villa provides a unique experience to the visitors that most traditional art museums don't: you get to experience how Roman live.\n\nCompared to the Getty Center, Villa maybe a more interesting place for young children to visit, since it has beautiful gardens to explore with less restrictions. It is delightful to walk through the herb garden surround by the herb aroma, and imagine how Roman lived 2000 years ago.\n\nDo take the guided tours. I did both architecture and garden tour back to back. Good place to refresh lessons took on Greek mythology too.\n\nIf going to the Getty Center on the same day, don't forget to ask one of the staff for a parking voucher by showing your paid parking receipt.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Stylish Gem", "Roman-inspired architecture and original artwork awaits you in this quiet gem close to the Pacific Coast.\nWe took the 45-minute free architectural tour which was very informative and inspiring. After the tour, we walked through the premises. Gardens and buildings are very nicely done. The galleries on the top floor would have been interesting, but were not accessible. You can buy food at the café or bring your own to the picnic area.\nIt is probably a good idea to go mid-week during the summer.\nShow less"], ["Reviewed May 28, 2017", 2.0, "WAS CURIOUS TO SEE", "Stopped past the Getty Villa given a recommendation to do so. There was a modest museum and outdoor garden to tour. You could barely hear our tour guide going through the garden. The only good thing is we got there early to avoid long lines. Glad we went but definitely something only worthy of an one time visit.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Very interesting and inspiring 'thing' to do!", "The Villa houses the Getty collection of antique artefacts, sculptures and pieces of art, and is set up as if you were in a Roman villa.\nGreat location, superbe grounds and infrastructure and a great shop and café.\nForesee about half a day to enjoy and wander around.\nThere is a day program.\nBest to make reservations and come before the crowds.\nShow less"], ["Reviewed May 27, 2017", 4.0, "Beautiful museum villa", "Took my best friend for a visit and we loved it. Beautiful villa with great Greek art and artifacts. $15 per car to enter museum. Can't park outside the villa. Had a delicious pasta lunch and highly recommend - A must see after or before visiting the Getty Museum.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Wonderful...", "This was an unexpected highlight of our LA trip.\n\nThe entrance/parking fee of fifteen dollars is well worth the experience.\n\nThe villa has a beautiful setting with views of the ocean. The museum pieces on show are beautifully displayed, well labelled and organised. There are four stunning gardens to enjoy - the East Garden, the Herb Garden and the Inner and Outer peristyle gardens. Staff are knowledgable, polite and respectful. You can wonder for as long as you wish.\n\nThe visitor centre is clean and modern. We didn't use the restaurant but the cafe offers drinks, fruit bowls, hot dogs and panninis at average prices. The shop offers books and souvenirs are average prices too.\n\nThe vistas are stunning from every angle. A photographers and historians dream!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Beautiful History Lesson", "The Getty Villa is beautiful. The Villas has an intimate atmosphere and is so relaxing you will want to stay all day. We took a guides garden tour which was very informative. I preferred this location over the Getty Museam in Los Angeles."], ["Reviewed May 23, 2017", 4.0, "Under construction but still good", "There is a lot of the villa closed to the public at the moment, so if you are a local, it's probably best to wait a few months. But if you're visiting from out of town, don't let this put you off. The gardens are beautiful and the collection on display is still worth a visit. Try to join on of the tours for extra insight into what's there and the history. The cafe isn't bad too.\n\nFree entry, free tours, $15 parking. Very good value.\nShow less"], ["Reviewed May 20, 2017", 2.0, "Overrated", "While I hold a great interest in art history, I felt the few artifacts while being very unique, interesting small collections.. not worth the visit. Parking is $15.00 before 3, $10.00 after 3.. felt like I was donating to the Getty oil tycoon fund."], ["Reviewed May 19, 2017", 5.0, "Even with Construction, Lots to See", "Driving through the extreme traffic of the PCH, one thinks, this better be worth it - and it definitely is. Even thought there was a lot of construction work underway at the museum, there are still tremendous works of art to see (everything is over 2,000 years old our docent told us) and the gardens are magnificent. I took lots of pictures hoping to transform my yard into something a fraction as grand as these gardens. As other posters have indicated, you must go online and reserve your space, parking is $15 per car and there are bag and purse checks (backpacks must be checked in). This is an adventure that will absolutely make you take a deep breath and relax just a little bit - a welcome relief from So. Cal traffic.\nShow less"], ["Reviewed May 17, 2017", 4.0, "Nice, quiet afternoon", "One of those museums you can see in just an afternoon. Lots of close up exhibits and check for special visiting art. Also check for live drama in the outdoor theatre. Skip lunch here - limited Cal-deli sort of food. Instead, hold your hunger til you can get down the hill (at Topanga) to the Reel Inn for a casual fresh fish dinner!\nShow less"], ["Reviewed May 16, 2017", 5.0, "Awesome Day at Getty Villa", "Most places were closed on Mondays, but The Getty Villa is open.\nIt is closed on Tuesday.\nYou pay $15 to park in their garage and the rest of the experience is free!\nThere are guided tours to take, self- guided audio tours(free), and gardens and grounds to explore.\nThe Getty Villa has a cafe.\nThe food is good but pricey.\nIt closes at 3 do get there before then.\nThe Getty Villa stays open from 10 am-5pm.\nWe spent the whole day here and loved every minute.\nOf course there is a medium sized gift shop.\nShow less"], ["Reviewed May 16, 2017", 4.0, "Amazing place", "Amazing place to visit if u can squeeze in all the other attractions that LA has. We spent at least 3 hours doing guided tours n enjoying all the beatiful artefacts n arcutecture plus gardens etc."], ["Reviewed May 14, 2017", 5.0, "What an Experience", "Such a beautiful place and wow, so much history. This museum is so nicely done, truly. I just can't say enough about how lovely everything was done. Part of the museum was closed during our visit but what we saw was great. Some beautiful pieces of history here. If you appreciate history at all, it is one you should add to your list. It's more than just the pieces themselves it's how they have placed them and the grounds and museum itself. Just amazing.\n\nThis attraction is free but you do need to get advance tickets, which you can do on line at their website. There is a $15 parking fee though.\nShow less"], ["Reviewed May 14, 2017", 4.0, "Piece of history", "We did not expect to visit a museum during our visit with a friend in LA but were pleasantly surprised. Taking in the short film before the visit is a must as it puts everything into perspective. This \"Villa\" has a lot of history and what Mr. Getty accomplished is admirable. This is a relatively small museum so if you want some culture but don't want to spend hours and hours in a museum, it is worth the detour. The grounds are absolutely wonderful. Tip: go early in the morning, you won't need to book in advance, and you'll be out before lunch.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Lots of free and interesting tours!!", "Thanks you Ms Lucy for spending close to 1 hr showing us all the 4 gardens in Getty Villa. It was interesting and educational. We also joined their Architecture tour and Curator tour.\nThe staff are all passionate and eager to share their knowledge of the place to you. Even though the 2nd floor was closed when we visited we still spent half a day there.\nTry to save on the $15 parking fee by going to Getty Center and Getty Villa on the same day.\nShow less"], ["Reviewed May 11, 2017", 3.0, "Kind of disappointing", "The first time I went here was 20 years ago, missing the huge concrete auditorium, restaurant convention centre type bolt on it has now. It had charm, a little run down perhaps and gave a really feeling of what a roman villa would have felt like. It is now slick, entering requires you to drive or come by taxi. There are two check points to negotiate! It's very busy. Feel they are now better off back in Greece, Italy and Egypt. This is a pointless establishment, without a purpose.\nShow less"], ["Reviewed May 7, 2017", 1.0, "Boring, not much to see", "Very boring, not many antiques. No paintings just sculptures and vases. I don't recommend going far to see this. It took me 20 mins to see everything."], ["Reviewed May 4, 2017", 5.0, "Wonderful way to spend an afternoon", "Free to visit the villa, but $15 to park. Reservations are usually required, but we showed up and they invited us to enter without reservations since they weren't busy. There is a 12 minute introductory movie. Then just spend your time wandering through the rooms and appreciating the art collection and the beautiful setting. There are tours available as well. Don't miss this lovely place.\nShow less"], ["Reviewed May 4, 2017", 5.0, "Beautiful vires", "It's worth a visit. I believe it's free and it has beautiful grounds and views of the ocean. We went near closing time so didn't have time to read and learn everything about it but the grounds alone are worth seeing."], ["Reviewed May 2, 2017", 4.0, "Peaceful, beautiful visit to Getty Villa", "We had a very pleasant 2 hours at Getty Villa. An impressive array of Greek, Roman and Etruscan treasures are on display. The second floor is closed so it was easy to check out the lovely gardens and treasures in the Villa. The second floor cafe was very good and admission is free. Easy to get to and easy to park. Just make reservations in advance.\nShow less"], ["Reviewed May 2, 2017", 4.0, "Classical Art and Architecture Meet Stunning California Coastline", "The Getty Villa houses antiquities dating back thousands of years in a recreated Roman Villa. The experience of wandering through the gorgeous gardens and viewing phenomenal works of art and architecture are enough to make you feel transported to Rome herself. I would recommend a visit to anyone (from scholar to sixth-grader) interested in Greek, Roman, and Etruscan antiquities. Tickets are free and must be reserved ahead online. Parking ranges from $10-15.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Wonderful. Reservations required.", "It's free to enter although it cost $15 to park. Reservations required. We took both the garden and architecture tours. Each lasts about 45 minutes. There is quite a bit of overlap between the two. I would probably take the garden tour over the architecture if you were choosing only one. There is a 12 minute film on the making of the Getty Villa. While it opened in 1974, Getty never visited the Villa before his death in 1976. He was quite involved though in almost all aspects from a distance. While I liked lots of the collection, I was very taken by the beauty of all the different colors and locations of the marbles. There is one room, #CIV, which has mostly a display of many kinds of marbles. There is a cafe on-site. We had bean soup and the Mediterranean platter. I am sure there are much better choices.\nShow less"], ["Reviewed May 1, 2017", 4.0, "A lovely place to pass the afternoon, splendid villa, nice cafe", "We went over to this well known museum in Malibu, yesterday.A tasteful display of antiquities ( Part of the personal collection of the oil tycoon Paul Getty), it was designed ( Using the original plans)and built to house the Getty art collection, recreating the Villa dei papiri, in ancient Herculaneum, which was buried when Vesuvius erupted.\n\nParking is limited, and it's better to call ahead to avoid disappointment, costs 15$ ( Inclusive of same day parking at the Getty Center) while admission to the museum is free ( Advance, Free, timed entry tickets online enable easy access if there is a rush).No walk ins are allowed, and if reaching by public transport the driver has to give you a note certifying this!!! ( You have to submit a receipt along with the free ticket if a taxi drops you off)-something about an agreement between the museum and the residents of the neighbourhood.\n\nThe is a short introductory 12 minute film,( viewed in a small hall to the right of the entrance, just beyond the portico of the villa)which explains how the museum came to be, and the story behind its vision and construction.The exhibits which include marble statues, terracotta vases and delicate metalwork, are beautifully displayed in cool and exquisite, marble floored and walked chambers. Exquisite marble panels!The architecture of the villa itself is to be marvelled at, the recreation of the splendour in which the aristocrats among the ancient Romans must have lived The lovely pools in the courtyard gardens flanked by the colonnaded peristyles evoke visions of a bygone era.The view of the sea from one end of the villa is splendid.\nThe museum exhibits can be covered in about 2 to 3 hours. And don't forget the herb garden ( could have been cared for better)with a collection of herbs used in Roman times, many which we still use today.You can have decent food at the Cafe in the Villa, or bring your own ( Or at least some seemed to have), to enjoy in the lovely sunlit area that we did.\nAll in all you could find worse ways to spend an afternoon.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Wonderful day trip", "If you have never been - go! Words cannot describe what a unique experience this is. Even having been there before, it's always an enjoyable day. The gardens, architecture and art make this place one of my favorite memories of my trip to LA."], ["Reviewed April 27, 2017", 5.0, "Lovely", "$15 parking with online reservation buys a few hours in paradise. Go at 10 when they open, then take your parking receipt to the new Getty and get free parking there. Well worth a day for both, have lunch at the villa or in Malibu at Gladstones for a complete SoCal day.\nShow less"], ["Reviewed April 27, 2017", 5.0, "World-class tourist site", "Putting aside the fact that JP Getty was an all-around not-nice-guy and an anti-semite (he was Hitler's guest at the 1936 Olympics), this place is magnificent! The glory of ancient Rome -- right here in L.A.\n\nThe grounds are spectacular, the exhibits rare and worthwhile, and the free guided tours interesting and entertaining. You can spend anywhere from a couple of hours to a whole day there, depending on your interest in Greek and Roman antiquities.\n\nJust make sure you make a reservation -- cuz you won't get in otherwise!\nShow less"], ["Reviewed April 27, 2017", 4.0, "Worth the stop", "The Getty Villa was beautiful and we were free to walk the grounds at our leisure. You must reserve a spot before going. We spent about two hours here"], ["Reviewed April 27, 2017", 3.0, "Worth seeing", "If you love ancient history this is place for you. Well laid out with gorgeous gardens, intimate display rooms and magnificent marble floors and walls. Free. Parking $15. Easy to access. Well designed. Views of the ocean were spectacular. But. Very clinical/collector style of presentation rather than informative. Details on the providence of the piece. I guess it is showcasing an amazing collection not a museum.\nShow less"], ["Reviewed April 22, 2017", 4.0, "Lovely place to visit, but try going to the Centre too", "Lovely setting with art and sculptures, the $15 allows you to get into both if you show your ticket. Makes a change from the normal tacky tourist trail!"], ["Reviewed April 21, 2017", 4.0, "Very good although Center is a touch better", "I visited the Center first, going there for 2 hours then down here for lunch. It's only 25 minutes between the two and the parking charge of $15 covers both if you register with the office.\n\nIts a beautiful spot and with a nice layout and a good cafe, but to be honest I was a little disappointed. There was refurbishing work going on and not an enormous amount to see, with the Center being considerably larger.\n\nBut, it is free and it's a beautiful spot!\nShow less"], ["Reviewed April 21, 2017", 5.0, "Wow", "Wasn't sure we would like this place. But it is truly amazing. The views are spectacular. And the galleries are unbelievable. A must see if you in the area."], ["Reviewed April 21, 2017", 4.0, "A place for contemlation", "Undoubtedly an attraction worth a visit, even for the not completely art history versed.Beautiful historical objects in original or well-made replicas.Stylish park complex, however, lacks water in its pool facility"], ["Reviewed April 20, 2017", 5.0, "Beautiful Roman Villa with antiquities", "If you're into seeing art in sito or in its natural environment, or you want a fabulous space that the visionary J Paul Getty created to house his amazing personal collection of antiquities, go to the Getty Villa. You need to go online and reserve your entrance time. The museum is free but the parking is $15 per vehicle. After you print out your free ticket you can enter. We went in April and there was availability on the same day basis. Check the weather in Malibu, it is different then Los Angeles as to when the fog comes in\n\nIf parking in the left-hand structure, I would suggest parking at the very top of the parking structure, so that will get you where you will exit the parking garage. As you walk along the walkway to the museum, look to your right to some amazing views of the ocean through the narrow canyon that the Villa is situated in.\n\nBecause they want you to explore the Villa as if it were an excavation site. You start at the top and then have to take an elevator or stairs down to the Villa. There are free tours – architectural, garden, and special highlights that take about 40 minutes and are free. They are located just across from the gift shop. Just be aware that the special highlights tour only looks at a few pieces but it looks at them with a lot of detail. Right when you enter the Villa, to the right is a small theater that you can see a 12 minute video on J Paul Getty and his inspiration for re-creating a villa exactly as it was discovered in Pompeii. There are also headsets.\n\nI took the architectural tour. It was led by a lively woman named Phyllis who provided all sorts of detail to the life of a Roman living in the Villa.\n\nUnfortunately. A large part of the collection is currently unavailable to see until Spring 2018 because the top floor is going through a collection adjustment – previously the collection it was thematically arranged and they are going to change the way that the collection is presented. The upstairs is not decorated in a villa themed environment, more a standard museum environment so you're not losing any of the Villa my not going to that part\n\nBut the bottom part of the Villa, and all of its villa decorated rooms and the iconic pieces of the Getty Villa are all on view.\n\nThere is a large interior courtyard with the long water feature – it is dry because it is not cool to have excessive water when we had a drought for seven years in Los Angeles. Even though most of the drought is over, they still have not filled the water fountain. What I did learn from the architectural tour is that this pool in the original Roman villa was 8 feet deep and housed fish for eating. At the end of the courtyard is another beautiful view through the canyon to the ocean if you are there on a day where the fog has lifted.\n\nThe museum also has an upscale somewhat pricey cafeteria available and a coffee cart outside. I found the food to be fresh and quite good. There is indoor and outdoor seating.\n\nAfter a leisurely lunch and wandering through the collections, I had a refreshing day near the beach with a beautiful view looking at unbelievably amazing antiquity pieces.\n\nI probably go to the Getty Villa once a year with friends or family visiting. It is a unique space not only for Los Angeles but for the entire country – nothing really like it anywhere else outside of ancient Greece and Rome. Even in the ancient world, it is not in pristine condition. On a previous visit, I came with my mother who had just come from Greece and Turkey. She wished she had seen the Getty Villa before her trip so she knew what all the antiquities really were supposed to look like in their day.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Amazed", "Remarkable opulent collections of art & sculptures. Take plenty of time to appreciate the entire surroundings."], ["Reviewed April 19, 2017", 5.0, "Wonderful half day visit with young children", "Having seen the original villa in Herculaneum, it was wonderful to see this recreation. Entry is free although parking is charged. The villa itself has beautiful gardens and quiet areas, and the small rooms contain a variety of antiquities. A family room had lots of activities for our young children, including decorating Greek vases and creating a shadow theatre. Lots of people on hand to answer questions. There is a cafe and a small, but well-equipped shop. All in all, we spent about two hours there - a lovely morning and one that we will all remember.\nShow less"], ["Reviewed April 19, 2017", 4.0, "A Roman Holiday Worth Exploring", "There is no question The Getty Villa on PCH, the original Getty museum, is one of L.A.'s premier destination landmarks. The relative recent addition of an authentic Roman Centurion villa, complete with slave quarters in the basement, is remarkable. It was recreated from a recently unearthed Centurion \"estate\" in Italy. As magnificent as this domain is, they did not have air conditioning and dentistry had a looong way to go. My last visit and my only qualm was the tour guide spoke over the heads of most folks in attendance, assuming we we all had PHD's in cultural anthropology. They should know most tourists do not and I would have appreciated a more colloquial narrative. One would do just as well with headphones where you can go at your own pace and interest. The grounds and landscaping are magnificent.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Museum", "The Getty Villa was an amazing experience. The Italian influence is everywhere. The food at the cafe is also a treat."], ["Reviewed April 17, 2017", 5.0, "Easy to get to on the 534 bus to Malibu, from Santa Monica", "You must have a ticket booked before you arrive, unlike the Getty Center. The bus driver will give you a ticket which you show to the security at the gate, the send down a van to pick you up. The garden is exquisite, for me it is up there with Villandry in France. Easy to get back to Santa Monica on the bus as the bus stop is just outside the centre\nShow less"], ["Reviewed April 16, 2017", 5.0, "Could be in Italy!", "The Getty Villa is a reproduction of an Italian summer villa complete with sea views, herb gardens, and long pool garden. Upstairs are amazing mosaics and the whole grounds are sprinkled with Roman statues. This is full of Getty's personal collection, which outgrew his original house. This place was custom-built to show off his collection of Roman artifacts. The grounds were renovated to include an amphitheater and many levels upon which to view the villa and grounds. The museum is free, but parking on grounds is $15, but $10 after 3pm. You can't park in the surrounding neighborhood so don't bother. There is a good cafe on premises, along with a gift shop. Great place to spend the afternoon.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Beautiful Place To See", "This is such a beautiful place to see. The paintings and sculptures are magnificent. It somewhat gives you an idea what Pompei and other Greek cities were like back in the day."], ["Reviewed April 15, 2017", 4.0, "A Beautiful Vision Fulfilled", "The Getty Villa is the culmination of J Paul Gettys re-creation of an Italian villa in Malibu. It is superbly built and furnished with many museum pieces inside and around the grounds.\nAdmission is free but a reservation is required. Parking is $15 per car.\nJust off the PCH north of Santa Monica it is a great visit and should take a couple of hours to see everything.\nModerate walking with some stairs is required though ramps and elevators are available if needed.\nShow less"], ["Reviewed April 14, 2017", 4.0, "Good Clear weather event", "Per the web site, you make a reservation to access the Getty Vila but as we came on a weekday and I think maybe 15 cars were in the lot, they did not pay much attention to the time we arrived. The place must be a zoo when the lot is full, we found it great to have it so empty so weekdays may be the key!\n\nWe walked around and ask about the deal with tours as we had signed up for a tour. Seems they have a move to get \"the story\" and depending on timing you can do that when every you have time, it runs all the time so no big deal. You will not screw up life if you do a tour without having done the film yet.\n\nSeems the experience on a tour depends a lot on who does the tour. They are done by volunteers and the program is ....somewhat flexible. We did an architecture tour and it was very good. Guess we got a good egg.\n\nLater, we did the garden tour and he went on and on about mythology and we thought it may talk about oh maybe plants or you know, gardens. Oh well, you pay for parking and not tours so you get what you pay for.\n\nThe place is very nice, has great art and is not huge so you can wonder around as you like. I might skip it if it was a rainy day as a lot is outside. We did this the day after the Getty Center and liked it much more.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Fascinating - so much to take in - and beautiful!", "Spent a few hours here, could have spent the whole day. Take the time to join in the guided tours and see the video; it all enhances the experience!"], ["Reviewed April 11, 2017", 5.0, "Well worth a visit", "Wow what a treasure trove! It was a pity that the upper floor was closed on the day of our visit. We could have spent longer there but were on a tight schedule. Would love to return."], ["Reviewed April 11, 2017", 5.0, "Stunning", "Loved everything about this museum. Truthfully the grounds alone are worth the trip to Malibu. The parking is $10.00 per car, but admission is free. Parking is easy, you may want to call in advance or online to see if reservations are necessary, but we drove up on a weekday and it was no problem. Once out of the car, you immediately begin the experience. The outdoor vistas are incredible. The interior of the museum and the exterior of the museum flow so effortlessly in and out that it doesn't even occur to you that one moment you are looking at incredible antiquities and the next moment you are staring at a stunning mosaic fountain or a beautiful herb garden. Truly magnificent, I would highly recommend this venue for every age group. Lots of walking required, but wheel chair accessible as well. Very modern. Don't miss the Venus prayer statue or the incredible herb garden. You can also enjoy a bite to eat there if the weather is nice.\nShow less"], ["Reviewed April 11, 2017", 5.0, "An absolute gem of an experience!", "We love the Getty, and live close enough to go there often! Parking is the only slow down, as you need a reservation. Most days it's easy to get an online reservation that very day... excepting holidays. We love the permanent exhibits of ancient Greek and Roman art, but as good as the art is the museum. It's a replica of an ancient Roman Villa buried in the ash in Herculaneum after an eruption of Mt. Vesuvius. Perfect!\nShow less"], ["Reviewed April 10, 2017", 5.0, "Exceptional", "Beautiful & Amazing. The art and architecture are beyond the imagination. The gardens are a site to behold."], ["Reviewed April 10, 2017", 5.0, "Love this place", "Great collection of Greek and Roman artifacts in an absolutely beautiful location. The grounds are spectacular."], ["Reviewed April 9, 2017", 5.0, "Go to the Getty", "Currently under renovation but if your in LA I still strongly encourage you to go the Getty. It's just beautiful and it transports you to a different world. Be sure to get the free iPod tour. Museum is free too but parking is $15 per car. Go to the Getty!\nShow less"], ["Reviewed April 8, 2017", 4.0, "An impressive ancient art collection in spectacular settings", "My kids learned about the Greek and Roman empires in school this year and therefore impressive collection at the villa had much more meaning than a usual museum visit. The location and grounds are very pretty and the parking structure is a convenient feature. The 2nd floor was closed for renovation but the ground level is composed of several rooms with dozens of amazingly preserved art from 100–500 BC. The exhibits are not extensive but this is perfect for teens because the museum wasn't overwhelming. There's a hall dedicated for some nice hands-on activities like drawing on pottery replicas, dressing up in Hellenistic consumes and posing for the camera behind a screen projection, rub-on textures and other crayons fun. The complex includes a nice cafe and a gift store. It was grand catching some afternoon sun rays in the outdoor terrace.\nShow less"], ["Reviewed April 5, 2017", 4.0, "Beautiful views despite construction going on", "I have been to the Getty Center many times but I had never visited the Getty Villa. The Villa is significantly smaller than the center, however it has some spectacular views.\n\nI was a bit disappointed that when I was there, the giant reflecting pool in the main garden was empty. Also, we were told that they are doing some construction on the second floor of the museum in an effort to rearrange the way the artifacts are grouped (something about chronological vs. thematic).\n\nCurrently I would say you only need about 1.5 hours to walk through the gardens and see the exhibits that are not under construction. There are several gardens, some very beautiful fountains and wonderful views of the ocean. Still worth the trip.\nShow less"], ["Reviewed April 4, 2017", 5.0, "Don't miss this.", "The location is superb with a wonderful view of the Malibu hills and the Pacific Ocean. The ambience of the villa itself and the artworks can have one oohing and aching for hours. This is such a wonderful place."], ["Reviewed April 4, 2017", 4.0, "Nice visit, highly recommended if you're in the area", "Came here on sunday early afternoon, not to busy, nice and quiet environment and pretty interesting. Nice collections to look at, we did the special perfume making event, and it was quite interesting, if you're in this area, definitely check it out!\nFree entry, just pay for parking\nShow less"], ["Reviewed April 3, 2017", 5.0, "Eye Opening", "If you love art and history, you will love the Getty Villa. The Getty Villa was owned by oil tycoon John Paul Getty and when he died he left his lavish home, together with the Getty Centre as a museum to the public. It's situated on top of the cliffs at the eastern end of Malibu where the views are striking. It's just beautiful walking around the villa and it's surrounding gardens viewing all the art work and sculptures. We spent about 2 hours roaming around before we went to the Getty Centre. We booked our free tickets on-line before we left Australia (you can't visit without pre-booked tickets). The parking costs $15, and if you head over to the Getty Centre on the same day you can use the same parking ticket for free. (you just need to get it validated in the foyer of the Getty Centre). A full and interesting day out.\nShow less"], ["Reviewed April 3, 2017", 4.0, "Beautiful Walk Through a Roman Villa!", "It's a gorgeous setting to stroll through and view Greek & Roman sculpture. Stepping back in time, you can imagine what it was to be a wealthy family in Pompeii. The sculptures, marble, mosaics and art are simply beautiful."], ["Reviewed April 2, 2017", 5.0, "goregous", "This is such a good place to see. It is far enough from all the noise and crowds in LA so you can relax while look at the exhibits they have. There are also gardens where you can sit and unwind. On a sunny day it is an amazing spot to visit\nShow less"], ["Reviewed April 2, 2017", 4.0, "Beautiful grounds", "We went to the Getty Villa in March, so the gardens were not full and lush yet, but still beautiful. It was fun to walk around and view the sculptures and indoor exhibits. There is a special area for young children where they can draw, which is a nice touch. The upstairs was closed and it seems that we were there on field trip day, so it was a little crowded.\nShow less"], ["Reviewed April 1, 2017", 5.0, "Great", "Really enjoyed visiting today in the morning with live actors and jugglers...parking is only $ 15 cash or credit cards...a great 1/2 visit...free online tickets...great cafe and gardens to walk through"], ["Reviewed March 31, 2017", 5.0, "Fantastic Recreation", "Imagine walking the path of ancient times in a recreation of a first century Roman country house. I imagined Pompeii before the volcanic eruption. Beautiful grounds, intriguing interior rooms and sculptures. Wonderful!"], ["Reviewed March 31, 2017", 5.0, "Unbelievably beautiful!", "Amazing what you can do with money and a vision! Uncompromising realization of a dream that was only completed after Paul Getty died, spectacular ocean and canyon setting, a life acquiring Greek, Roman and Etruscan treasures, designing and building a replica villa overwhelmed at Herculaneum by Vesuvius, attention to all the minute details, having that dream impeccably administered and operated 50 years later makes for a unique place on earth!\nShow less"], ["Reviewed March 30, 2017", 5.0, "What a gem!", "Went here for a tour with my daughter who recently moved to LA. We were so amazed. What a beautiful facility. The tour was wonderful. We sat on the patio after and had a glass of wine and appetizer while the sun set....we will definitely be back\nShow less"], ["Reviewed March 29, 2017", 5.0, "Pleasantly surprised!", "Recommended by friends otherwise wouldn't have gone. Beautiful, fascinating building with so much to see. The gardens are beautiful too. All free, just pay to park"]]}}