{"The Getty Center": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Getty Center", "url": "/Attraction_Review-g32655-d147966-Reviews-The_Getty_Center-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/2c/47/a1/nice-architecture.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "12153"}, "address": {"@type": "PostalAddress", "streetAddress": "1200 Getty Center Dr", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90049-1657", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Must see for Architecture and Art enthusiasts", "Great overall experience at the Getty Center - beautiful grounds, stunning buildings, wide variety of art provided a full day of enjoyment"], ["Reviewed yesterday", 5.0, "Do not miss", "While I did not love the architecture, the exhibits and gardens are tremendous. And, on a clear day the views are sweeping.\nSaturday morning at 10 (opening), perfect time to arrive. Heating up but not overrun.\nPlan to spend at least 1/2 day, especially during good weather. Bring a blanket and relax on the grass with a book and/or go to one of the restaurants.\nGreat place for kids.\n\nNB waiting for the tram inna giant line is silly. WALK up the hill.\nShow less"], ["Reviewed yesterday", 4.0, "Stunning views of LA", "Gorgeous setting and impressive displays. The garden walk in January was still great even without too many flowing plants to see. The docent was very knowledgeable of the architecture and gardens. Get here early as parking can fill up quickly."], ["Reviewed 2 days ago", 5.0, "Wonderful museum", "This is an amazing museum. It sits atop a hill that makes the views of Los Angeles breathtaking. It is FREE...yes, no fee for admission. The art was beautiful and the sculpture garden was great. The grounds and flowers were amazing. Well worth the visit."], ["Reviewed 2 days ago", 5.0, "Great collections", "We couldn’t believe what we found on this mountain. There were lots of free informational tours to choose from. We enjoyed one on the architecture and building of the center. Although it was too early in the year to see most of the gardens in bloom there was a lovely cactus garden on one roof. There was a lot of different exhibits in each building and the views of LA were unbelievable. Make sure you have a full day if you want to see it all. And you do want to see it all.\nShow less"], ["Reviewed 2 days ago", 5.0, "A must when in LA", "This place is amazing! The views are incredible along with the art, whenever my friends visit LA I always say this is one of the spots we need to stop by. StarTrack was filmed here in the garden. They have a Vincent van Gogh painting which is nice to see in person. Not as good of MOMA in NYC but still on point. It's free to go visit other then parking $15. 100000% worth it the visit!\nShow less"], ["Reviewed 2 days ago", 5.0, "Love this place.", "We have been to the Getty center numerous times, and it is always a joy to visit. The garden seems to be the favorite part of our visit every time."], ["Reviewed 3 days ago", 5.0, "Sinply Fantastic", "This must be Gehry's best building. Sound is impeccable. Design is exquisite. Garden on rear side a jewel. We simply had fun....at the symphony no less."], ["Reviewed 3 days ago", 5.0, "Beautiful collection set in a spectacular building", "Extensive and varied collection of European art including many of the masters. The collection is housed in a series of architecturally significant buildings and surrounded by beautiful gardens. It's located on the top of hill with spectacular views of L.A."], ["Reviewed 4 days ago", 5.0, "Wow", "This museum is absolutely stunning. We went to see the art but were blown away with the setting and architecture of the buildings and views! We visited on a cold day but the gardens and outside areas are definitely as beautiful as the art itself.\nThere is NO FEE to enter this amazing site and is definitely worth the time. You will have an amazing day.\nThere food and wine for purchase so plan on spending a few hours - it’s so worth it!\nShow less"], ["Reviewed 4 days ago", 5.0, "Fantastic day out.", "We had to visit over the weekend and joined a long queue to get into the car park. We feared the worst. However, once parked it wasn't very long before we were at the Center, the organisation is fantastic with getting people onto the small train to the top of the hill. There is so much space here that even though there are a lot of people, it doesn't really seem that there are a lot of people. The exhibits are well organised into their specific genres so it you have a particular interest you can go straight there, we particularly liked the French impressionists. There is also a nice little cafe that sells decent, reasonably priced food. Overall, a great day out.\nShow less"], ["Reviewed 4 days ago", 5.0, "Amazing place", "What an experience!\nGreat views, wonderful gardens, amazing architecture and unbelievable art collections. This was well organised and just a very enjoyable day out. There is a $15 parking fee but no other charges. Cafe food was a little expensive but that can be forgiven as you don't have to pay for entrance.\nShow less"], ["Reviewed 5 days ago", 5.0, "The Getty", "The Getty was a very good day trip. Parking is $15 and $10 if you go after 3pm. Don’t take the tram up , walk instead you will appreciate the views. There is so much to see... oh and the art and their history are totally amazing. It is a beautiful museum. There is a restaurant, several gift shops and the employees are really nice.\nShow less"], ["Reviewed 5 days ago", 5.0, "Must visit in Los Angeles", "If I have to make a list of must visit places for LA, the Getty would rank the same as Disney and Universal. And it's free! (not for parking but it's only $15).\n\nWhen you are done, on a nice day (i.e. almost every day in LA), take a drive from Sunset to Santa Monica. You won't be disappointed.\nShow less"], ["Reviewed 5 days ago", 4.0, "Where the setting betters the collection", "This indeed is one of the best settings in the world for an art museum. It is also extremely well organized and of ease to visit. Since arrival to their parking at the base of the hill it is the only place where spending money is required. The tram to the top is free and so is the absence of entrance free included the self controlled audio material. The grounds are extremely well designed and the views outstanding. On the other hand ,the masters collection is limited. In some cases much of the touted names consist of only one piece. The visit , like all good museums can be exhausting so we did not have time to explore their very good manuscripts collection. Part of the issue visiting the Getty is the guided tours. The well meaning guides are too loud contributing to the noise level. They have not learned to use modern technology that we see in many places in Europe where the whispers of the guides are transmitted directedly into the audio system of the participants. The undisciplined school children roaming are no help .\nFood is not easy, or cheap, to get access to. The karts outside are limited to low variety fast food, but the restaurant has a good reputation that we did not have time for.\nOverall it is well worth to fight the LA traffic to get there, and take relief in the thought that the worse is over when you leave toward the Ventura Freeway\nShow less"], ["Reviewed 5 days ago", 5.0, "Great Museum and Great Tours on offer", "Definitely worth the visit and if you get a chance take a few of the tours. The architecture tour was particularly good and the guide was very knowledgeable and engaging. Couldn't believe they had three Caravaggio's on loan from Rome!!!"], ["Reviewed 6 days ago", 5.0, "Masterpiece!!", "What can I say about the Getty? Words escape me. You just have to go and see it. Plan for half day. Take a book. Have lunch there. Have enough time for the art but more time for the place, the feeling, and the experience. It is a one of a kind! The most beautiful place in LA by far. A place for the whole family. For everyone and anyone!\nShow less"], ["Reviewed 6 days ago", 5.0, "Buildings & Grounds are Marvelous", "We visited the Getty Center on Friday, 22 Sept. 2017. Parking is $15 in the underground garage. One takes an elevator up to the ground level then an automated tram to the museum. I wish the orientation movie would have done a better job of explaining the vision/goals of the museum. Many galleries are sparsely filled and we walked through them relatively quickly. We enjoyed the amazing Mayan Gold special exhibit. The cafeteria dinning room was beautiful and the large platters of food were very good. We arrived at the parking garage at 10 am, saw 90% of the galleries, had lunch and departed at 1:45 pm. Four and a half hours would do it.\nDid this review earn a “helpful” vote?\nShow less"], ["Reviewed 6 days ago", 3.0, "A spectacular setting housing a relatively small collection.", "The architecture and the setting on top of the hill were breathtaking. The art collection was not large or particularly unique. There were some nice pieces from a wide variety of artists. I guess I had hoped that more money could have been spent on the collection and less on the buildings.\nShow less"], ["Reviewed 1 week ago", 5.0, "Curiosity", "If you love arts this place is a place for you. I don’t really appreciate arts before but when we visited Getty Center I would have to probably change my mind. A fine place of fine arts."], ["Reviewed 1 week ago", 5.0, "Wonderful place", "It was one of my favorite places in Los Angeles. The view is simply amazing and it is so relaxing to spend your time in that gardens! I was very surprised to learn that it is free to visit such a beautiful place. I didn't know about this place before I arrived in LA, it wasn't on my \"schedule\", but my friend insisted to visit it, and I'm so happy that she did. We didn't have very much time to visit all the areas of the center, but that is a good reason to go back as soon as possible. :)\nShow less"], ["Reviewed 1 week ago", 5.0, "What a great place", "Second time there; a masterpiece with lots of masterpieces inside, and out. Fun for art/architecture lovers. Enjoy"], ["Reviewed 1 week ago", 5.0, "A GLORIOUS sunshine filled day at the Getty!", "We visited the Getty Museum on an early Friday morning. Parking was easy. We took the tram to the top of the hill. The view of the city was remarkable. There was plenty of space to wander with benches along the way to review and reflect. The exhibitions were varied and impressive. I hope we can visit again.\nShow less"], ["Reviewed 1 week ago", 5.0, "If you are in LA, go here. Period.", "This is a FREE MUSEUM. You pay for parking, but you can take an uber or bus here as well. Based on the architecture only, it is my favorite museum in the world. Based on the art collection alone, this is my favorite museum in the world. Seeing a trend? And then there are 360 degree views of Los Angeles, a monorail ride to the top of the mountain, and amazing fountains and gardens. I have lost myself in these buildings for whole days many times. The exhibits here are world class, and the private collection is the most amazing ever assembled.\n\nThere are a few spots for food while you are up here. The restaurant is a bit pricey, the cafeteria is what you would expect from a cafeteria with reasonable prices and a great variety of food, and there is also a food cart in the middle section of the outer part of the museum that also has coffee, beer and wine.\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth a visit by all", "Very impressive collection of art and antiques. Better than any public display or museum I have ever seen.\n\nEven those not into art can get something out of it. Some will think 2 hrs is enough, others would need a couple of days. (Children will probably get bored, but there is the outside gardens they might like).\n\nFree entry but we did have to pay a little for parking, and the food and drink was very expensive. The car park was very full and the tram was broken when I was there so it was a 10min walk up hill if you didn't want to wait for the shuttle bus (usually a tram).\n\nA must visit for everyone. Wear good shoes and byo food and drink.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very Easy to visit", "Is a great surprise is very easy to visit and cheaper with great view to the city and Ocean. For sue I will back again."], ["Reviewed 1 week ago", 5.0, "Beautiful in every way - a must visit!!!", "One of the highlights of my family's trip to Los Angeles! What an incredible place - and so awesome that it is free!!\n\nLoved our group tour - so many of the world's best and most recognizable artists' pieces are in this special place.\n\nIf you have time, would highly recommend getting a bite to eat at one of the restaurants on the premises - the view of Los Angeles is just as magnificent as the works of art inside!\nShow less"], ["Reviewed 1 week ago", 4.0, "Artsy", "The Getty Center is beautiful, I noticed a lot dates and not many families. The landscaping is stunning and the art is hip."], ["Reviewed 1 week ago", 4.0, "Great garden, good museum", "Most of the time I spent in the Getty was in the lawns, gardens, and balconies of the museum, which were, in my opinion, the best part. There was lots of space to lay down, have great views of LA, and to have an all around relaxing day. The few hours I spent in the museum were not nearly as fulfilling, with some of the sections I went to being mildly interesting at best. I do recommend a trip to the Getty, as Long as you are in LA for multiple days.\nShow less"], ["Reviewed 1 week ago", 5.0, "The Most amazing Art Gallery I have ever seen", "I've been to museums and art galleries in NYC, various cities throughout Canada, Berlin and Munich in Germany, London, Paris, various cities in Italy, and my hometown of Buffalo, NY. This is by far the most impressive collection of art and history that I've ever seen. You must go here. It's wonderful! The Getty Center consists of 5 galleries in one complex so plan for an entire day. As an added benefit the cost is FREE. You will love it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome visit", "We just spent a fantastic day at the Getty Center. The art was amazing. It was so awesome to see in person one of the prints we have at home Irises. Just stunning to see this in person. We had lunch at the restaurant and it was some of the best food I’ve had in California. I can’t wait for out next visit.\nShow less"], ["Reviewed 1 week ago", 5.0, "Easy Sunday Visit", "I am amazed of the artwork and sculptures! Make sure to wear comfortable shoes. There are many exhibits and places to sit and admire the art. Teenagers were not as amazed! They offer options for small children."], ["Reviewed 1 week ago", 5.0, "A Must Visit when in LA", "Do yourself a favor if you're visiting LA and have half a day to spend here. The place is beautiful. It's a trek to get to but so worth it. The design of the place is inspiring. Whatever event they hold it's always interesting. Great for kids and people of all ages. There could be a lot of walking but in LA the weather is always great.\nShow less"], ["Reviewed 1 week ago", 3.0, "For a selected audience !", "Go here if you love art, paintings, history. Nice view of the city. Garden is nice. Definitely not number 1 attraction in LA. Number 1 attraction should be the Griffith Observatory."], ["Reviewed 1 week ago", 5.0, "A don't miss for art lovers!", "I'm an art lover who is primarily interested in pre-20th century European art, so that was the part of the this large complex that I spent my limited time (3 hours) perusing. The collection was WAY above my expectations. Fabulous art works, beautifully restored, including the bonus of a temporary exhibit of THREE Caravaggio masterpieces! You usually have to go to Rome to see any of these. There are Rembrandts, marvelous Zuburans, and wonderful 17th century still lifes. The grounds are beautiful, even in February. Admission is free, but parking is $10. A fun tram ride up the mountain from the parking area to the museum is included. Just go!\nShow less"], ["Reviewed 1 week ago", 2.0, "No available parking Sat afternoon", "- Arrived on a Sat afternoon at 4pm. - Parking is full with no alternative options. - Asked to return in 2 hours, but as we had an evening flight to catch, left instead. - Disappointed."], ["Reviewed 1 week ago", 3.0, "Yawn!", "First of all, I'm not an art person, but can appreciate good art. The Getty has rooms barley filled with art, just a few items per room. 1000 yr old rugs and china just not my thing, although it may be appreciated by some. I guess it was worth seeing once.. This is definitely NOT a place for young children. All in all, it was boring. The Peterson Car museum was very interesting if in LA.\nShow less"], ["Reviewed 1 week ago", 5.0, "A must Museum Visit", "This was one of our museum visits while staying in Hollywood. It's a must for your museum outing. Interesting exhibits and very comfortable for seeing the exhibits."], ["Reviewed 2 weeks ago", 5.0, "Impressive collection and art display", "Absolutely stunning well curated and designed facilities that caters to families, school children and people of all ages.\nThe train ride and free admission are nice. There is lots of fee based parkade parking available. Plan on spending a day to enjoy the collections, videos, restaurants and beautiful grounds. There are lots of helpful guides available to make the experience enjoyable. A definite must see for any art enthusiast!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "First time", "This “is” the place to visit. The museum and the artwork Are some of the best I have ever seen, what makes it special is the architecture of the buildings that house them and the amazing views which surrounds the museum.\nWhat surprised me were the outside spaces and gardens a real treat.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nothing less than Fantastic!", "My wife and I arrived at the Center at about 3:30 on Valentines Day, 2/14, and parked in their garage. We took the free Tram up to the Center. The views were very nice. At the center we decided to use their free electronic tour Gide audio/video mini tablet system and left a piece of ID as Security.\n\nThe facility is really amazing, fantastic art from world renowned artists, awesome views, and very affable Museum attendants. Parking was only $10 since we arrived 3:00 otherwise $15.\n\nAbsolutely Fantastic! A must do!\n\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nice View", "The Getty provides the perfect place to view the entire Los Angeles. Also, its great art pieces relax your thoughts and mind simultaneously. Great!"], ["Reviewed 2 weeks ago", 5.0, "Gorgeously Different From The Getty Villa on PCH", "Wow. This place is a paradise! Lush manicured lawns. Tranquil and well construed landscaping. Delightful exhibits. Elevated levels of land. Views of an open sky. Restaurant/Cafe option(s). The place is lovely.\n\nThere is ample parking and for those who are unaware, parking is free for Chase Bank Private Clients. Also, the aerial tram ride from parking to facility is calm and smooth.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fabulous!", "We arrived a half hour before opening time on a Sunday morning and got right on the tram up to the museum. A coffee/snack bar was open before the museum, so we enjoyed a cup of coffee and the views while waiting.\n\nWe really loved learning about the structures on the architectural tour which takes about 45 minutes. Next we joined the highlights tour of the museum which was so informative. The gardens are beautiful even in winter.\n\nI would love to go back for a visit in the summer!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Day at the Getty Center", "An amazing museum with a beautiful series of interconnected buildings and gardens, and a world class private art collection. This was built after the earlier museum, now known as the Getty Villa, became unable to hold the growing collection. The Villa is also worth a trip, to see a museum in the form of a grand ancient Roman estate.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Even if you don't like fine art it's worth a visit.", "The Getty is another must do whenever we are in the area, usually about once a year. Admission is free and all you have to do is pay for parking.\n\nThey have many galleries to visit and what I appreciate is they are well designed and you rarely succumb to what we term \"Museum Fatigue\" like at some museums and galleries where you are presented with endless rows and rooms of things to see with no break. At The Getty there's always a way to pop outside and get some fresh air and relax.\n\nThere's something here to see for just about everyone but even just going up to walk around and look at the amazing architecture and views is more than worth your time and they have a really nice cafeteria with a varied menu.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Getty museum", "It was nice. Great views, art and all things that I saw there were awesome! Bus # 234 goes there. I really enjoy this visit!"], ["Reviewed 2 weeks ago", 5.0, "Well worth the trip", "Fabulous visit for our family of four. Beautiful....Restaurant on-site was wonderful. Very pricey, but excellent food and wine."], ["Reviewed 2 weeks ago", 5.0, "Like visiting a world class European museum in your Los Angeles back yard", "World class European art: paintings / furniture and accessories / some sculpture / wonderful unique architecture / did I mention FREE! / late hours on Saturdays. Multiple food options. A must visit if you spend much time in SoCal."], ["Reviewed 2 weeks ago", 5.0, "Truly World Class!", "Everything about the Getty Centre is exceptional!\n\nThe setting is spectacular, overlooking the City to the South and the Pacific to the West from a prominent bluff.\n\nThe architecture is amazing, modern and soaring, but fitting into it's environment perfectly. This is enhanced by the beautiful gardens throughout.\n\nWe only had a day there and feel that it will take many more visits to fully appreciate the Center. Perhaps most surprisingly, is that with the exception of parking, which is $15 per day, and food and drink, its free! Guided tours and audio tour equipment is all complementary.\n\nI found the collection to be relatively small. As a \"non-arts buff\" I found the collection to be broad, rather than deep. For example, the Impressionist gallery contains about twenty-four pieces. Having said that, the collection appears to be well considered and curated. The pieces, especially the many sculptures, are beautifully displayed and integrated into the buildings and gardens.\n\nWe ate in the cafeteria, where there was an excellent selection of great food at very reasonable prices.\n\nOverall, an outstanding attraction that is worth many visits.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent.", "Admission is free, but parking is a tad expensive at $15. The tram takes you up to the museum. The cafe is well worth a visit after hours of strolling. The musuem also offers an excellent view of Downtown LA. The staff are friendly and helpful and the art collection is great. Such a great place to be!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great experience", "Nice place to spend the day. Parking is a bit hard to figure out how to get in and out. The exhibits are well done but a bit hard to figure out what is where. The garden area is a delightful surprise"], ["Reviewed 2 weeks ago", 5.0, "Incredible", "A highlight of my trip. I wish I had given myself more time here!! Excellent visitor experience with iphone audio guides, and very friendly and knowledgable tour guides. I took the Collection Highlights tour, and the Architectural tour. What a rich cultural experience, I highly recommend and consider this a must-do.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow! This is now my top must-see attraction in Los Angeles!", "The views are incredible, the art is spectacular and the grounds are amazing. If you have a few hours, this is definitely a must do activity while in Southern California. We went on a very clear day with little smog and no clouds. We could see from the ocean to downtown LA and beyond. Even the 5-minute tram ride up to the campus offered amazing views! I was disappointed that many of the staff (mostly outdoor) were not very friendly and gave curt 1 word answers.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Good art collection, Great environment", "This is a special museum and one that we visit often. In addition to their art collection, they have great exhibits of furniture and illuminations. We are photo collectors, so we visit for their changing exhibits. Entrance free, parking $15, but you can park cheaper away and take a shuttle. Go here!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful building, lovely art and fun tram", "Great art, beautiful building, lovely outdoor space, and affordable cafeteria food. They have wonderful summer concerts that are not to be missed. Their photographic exhibitions are one of the highlights for me when visiting."], ["Reviewed 2 weeks ago", 5.0, "Serene feeling at the Getty Center", "My friend and I both commented while walking around the Getty Center gives us such a serene feeling. We are blessed with our beautiful SoCal weather of blue skies, slight breeze and gorgeous view to the ocean. The variety of art work should please everyone.\nAlso, the Getty Restaurant is a must! Be prepared to enjoy a lovely glass (or bottle) of wine, a starter, entree AND dessert with coffee. Your palate will thank you for the array of flavors!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Outstanding exhibitions", "The Getty Center is an impressive place to visit and a real gem for every traveler to Los Angeles. Do not miss the opportunity to see a large variety of different styles, collections and exhibitions on show. It is an impressive place to visit and from the start it feels like a true journey when the tram takes you to the center. The gardens are magnificent and enjoyable with a large variety of trees, shrubs, plants, grasses etc. The coffee shop is a nice place to sit down after a busy day of watching all the displays.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Outstanding!", "It is truly a work of art in its own right, and the views are spectacular. The buildings are beautifully interlaced, a tram takes you from the parking lot up to the Getty, and the ambiance is breathtaking. There is a cafe area on a wide open patio, and inside there is a cafe as well as a restaurant. The traveling exhibition on the economic crisis in Argentina in photos was particularly outstanding. You need to plan a day to do it all. We didn’t have enough time for all the exhibits. A real treasure!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "What a place, Rome and Greece in california", "To enter the center you will have to register and print your pass from the Web. It is free, but don´t forget to do this, you won´t be allowed to enter if you don´t have a printed ticket.\nThe place is just fantastic with a beautifull view of the Pacific. Plan a full day and bring your lunch with you. The villa is just great, it´s like being in greece.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Impressive as always", "We always visit The Getty Center when we visit LA. Their exhibition & permanent collections are consistently impressive and interesting. Everything is organized from the time the car is parked, transport to the Center by tram & the scheduled guided tours that run regularly. Best to visit on a week day but expect school children as it is a popular educational spot. No admission fee but there is a $15 parking charge.\nRecommend viewing the introduction video for first time visitors & join the guided tours. The volunteer guides are knowledgeable & engaging.\nIf one enjoys their visit here, this can also extends to The Getty Villa.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Free, free, free.", "Wow. This place is huge. There is a train that takes you from the car park to the entrance at the top. There are security guards that check your bags before allowing you to enter the premises. There is everything from paintings, sculptures, antiquities and gardens. Tables and chairs to sit and take a break or have a snack in the courtyard.\nI visited on the back of a 13 hour flight and very little sleep and I would have enjoyed this so much more if I wasn’t sleep deprived.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Won't Disappoint - So much to love", "Thoroughly enjoyed visiting for the first time. Gorgeous grounds that are family-friendly and perfect for lounging in the sun. Incredible city views and of course stellar art collection. Multiple dining areas; we chose the more casual which offered a ton of delicious options, to say the least. Definitely allow a half day for a visit if possible! Kids will enjoy the short tram ride. P.S. If I'm remembering correctly wi-fi was spotty, just FYI.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best Museum I Have Ever Visited", "From the tram ride to the entrance, to the superb architecture of the center and its garden, to the food in the museum Cafe, the Getty Center was one of the best museums I have ever visited.\n\nThe art is displayed in incredibly beautiful galleries with impressive views of LA and the many museum shops and temporary exhibits are very well designed.\n\nWe enjoyed your three hour visit and hope to return again!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Loved the gardens", "It's free to get in but you have to pay for parking - $15. What's incredible is that the car park has so many floors; it was tremendously busy, seemed to be full on each level and we just kept going down and down! Once you've parked up, you walk towards the Getty Centre's very own monorail. The queue for this is a little insane – think Disneyland – I'd say it was about a 40-minute wait. Also, there is partial shade, so if like me you are fair of skin – make sure you're wearing a hat and also sunblock. I'd also say, just bring water with you everywhere when traveling in LA – you don't want to be caught out. The Getty itself is huge so when you're actually walking around, it doesn't seem that busy at all. Architecturally, this building is very beautiful with its mixture of straight and curved lines, poised up high with fabulous views of the city. I loved the grounds water feature through the paths of the Central Garden, the flowering maze and particularly the cactus garden. When inside I enjoyed weaving my way through the various collections and you can see works such as Van Gogh, Irises. Like everywhere in LA, the building had fantastic air condition, but what was also fabulous was the huge, triple glazed (at least) doors that not only maintain the coolness but keep the art protected.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beautiful time spent at the Beautiful Getty Center", "We enjoyed our time at the Getty Center. Easy parking and tram ride close by the parking structure. I advise going on a sunny day. There is a lot of walking outside and would not be easy to walk to various buildings if it was rainy or windy.\nTheir is no admission fee, but parking is $15.00. If you arrive at 3PM it is only $10.00.\n\nThe individuals working their are knowledgeable and very polite. They have many wonderful artist and collections to view and easy access to them all.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "There is a reason it is number 1, Free (except parking) and amazing art", "I suggest you go on the free tour with the art guide. You can learn a lot about art that you would not regularly understand. The garden is amazing year round and the view is spectacular especially on a clear day. The only draw back is parking cost, but get a car full of people and enjoy.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice Family Outing", "A great time and place to see fabulous art and do so in a family friendly location with a very peaceful location in the hills above LA!"], ["Reviewed 3 weeks ago", 4.0, "Beautiful grounds surrounding a small but very nice museum", "Even the outside walls are of interest - you can find fossils in the tiles. On a clear day, the view is spectacular. On busy days, the tram leading up to the museum can be a bit overcrowded. Was bummed to notice they're charging $15 for parking now. Nice half-day event for adults and older children.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "The LA/LA exhibit was great.", "This place was amazing, while we were there they had a special display of Latin American (Inca/Mayan) treasures. The artifacts date back several hundred years, in fact, older than I would have thought.\n\nIn addition to the special exhibit there are sections of the museum that house painted artwork, carvings, historical furniture, think Louis V, French, sculpture and more.\n\nWhile we were not there at the right time of the year to view the gardens at their best I imagine they would be beautiful. We also saw how close the fires got to the museum, it was across the street/highway on the 405. You could see the charred hills and the Getty center with all of its greenery near and around, would have been a disaster if it has crossed the street.\n\nThe museum is free, the parking is about $20 but you can get a lot of folks into a car or better yet UBER there and then you won't have to worry about the parking. They have a train shuttle that takes you up to the center.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Interesting and inspired!", "Was not sure what to expect but the art collections, the views, the history was simply spectacular. Worth the visit!"], ["Reviewed 3 weeks ago", 5.0, "Open your mind...open your eyes!", "Recharge your mind and soul...for free...less than 30 minutes from LAX!\nThere are at least ten pieces of art that individually make the Getty rival the more notable museums of the world. Having visited most...The Getty did not disappoint. The Van Gogh alone made this worth the trip....the view and awesome fresh food cafe only enhanced the visit. Sunset was amazing! Open to 9:30pm ..just jump in that next ride share and go!\nA visit will remind you that our civilization is soooo much better than what is in the news!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must see for every art lover", "With hall after hall of top-notch art collections and fabulous views of Los Angeles the Getty is an attraction every local and visitor should check out. Make sure to allow at least 3 hours to fully take in the place."], ["Reviewed 3 weeks ago", 5.0, "amazing artwork and beautiful views.", "not only does the Getty have some amazing artwork but it also has an incredible garden with amazing views."], ["Reviewed 3 weeks ago", 5.0, "Don't miss Getty Museum when you are in LA", "The Getty Center is always my first choice of recommendation when I have friends visiting from out of state. I always enjoy taking my friends there. It's a place for everyone, not only art lovers. In addition to amazing art collections, the Center offers breathtaking views from downtown LA to the Ocean, beautiful gardens, and plenty of seating areas to relax. It is definitely a must see, and you can never be tired of visiting again and again.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great art and amazing views", "The Getty Center is one of those little gems in the city where you can go and relax, enjoy the views, look at great art, and just take it all in. On clear days the view of LA are spectacular but i got a bit of haze\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Crown Jewel of Los Angeles", "Plan to be here all day and wear your walking shoes. The gardens and architecture are an art piece unto themselves. If you love ancient paintings this is the place."], ["Reviewed 3 weeks ago", 5.0, "Beautiful Place", "If you like art in a wonderful setting...then this is the place to go. I enjoyed just being there and there is art in the buildings as well. Definitely worth a visit when you are in LA."], ["Reviewed 3 weeks ago", 5.0, "Amazing place to visit", "We both loved the Getty Centre, both for its Architecture and its Art. We had limited time so concentrated on the visiting exhibition of Central American gold - wonderful. We then looked at specific galleries - there is plenty to see. There was a small David Hockney exhibition on when we were there.\nThe building is full of light and space and a great place to stroll around. The views are spectacular and there are plenty of seating areas etc. No admission fees but you pay for parking - the ticket is valid for The Getty Villa if used on the same day, which was what we did.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Beaufitul", "This is such a great museum. I went to all the exhibitions and this is definitely worth the trip. So many scultptures, paintings, and information ! The entire place is a beautiful, and peacful ambiance. Friendly staff and cafe shop in the outdoor area. Restrooms are easy to find too.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Must See", "Wow....can't imaging coming to LA without a visit. It was a wonderful place to spend several hours. A gem."], ["Reviewed 3 weeks ago", 5.0, "Wow! Love the Getty", "We could’ve spent two days there. Beautiful space with outstanding views. We took teenagers and they loved it too. Make sure to get reservation ahead of time. The outdoor spaces were especially unique."], ["Reviewed 3 weeks ago", 5.0, "Great experience and museum", "Spent an afternoon with my family at the Getty Center, saw the Golden Kingdoms exhibition which was fantastic. The kids enjoyed the hand-decorated masks and playing in the tube sculpture. Great place for a family with young kids (age 6)."], ["Reviewed 4 weeks ago", 4.0, "Worth a visit", "I spent a afternoon in the Getty. The collection is nice though not as rich as what you will find in Europe. The garden and the architecture is spectacular! The view of the city and Beverly hills( I reckon?) is amazing. Recommend."], ["Reviewed 4 weeks ago", 4.0, "Nice Buildings & Grounds", "Mostly old paintings.. Saw a Painting by Vincent Van Gogh.\n\nIf you’re into old religious paintings this is for you.\n\nPersonally I found the architecture and grounds more interesting than the art.\n\nIf you’re visiting on the weekend, Expect it to take a long time to park & the line for the tram to take forever. If you’re impatient like me probably better to just walk up the hill...\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Getty is still Number 1!", "If you are in LA don’t miss the Getty!\nCosts nothing to enter other than your parking fee if you come by car.\nSets a standard that most fail to meet. Good food as well a a fabulous environment on top of the exhibitions mean I’ll always come back when I’m in LA.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Wow!", "Soooo agree with many of the reviews that this MUST be on your bucket list. We got there at 9:30, parked immediately and went right in. The tram’s a great way to get up the hill and deliver you right at the entrance. We walked through the beautiful gardens until the museum opened at 10:00. Then toured each of the floors on our own. The buildings are architecturally wonderful and the artwork breathtaking. The views of the city from each of the outdoor patios is spectacular. Just go. You won’t be sorry! By the time we left at 1:00, it was packed. Not so getting there right as it opens.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Incredible", "The Getty Center is one of LA's best attractions. When you arrive at the Getty, you are greeted by smiling staff members. The staff really go out of their way to be helpful. They're warm, they're friendly and they're always on hand to answer your questions. The Getty architecture is as stunning as the art. It is entirely made of marble and sits at the top of the hill that divides the city, and it houses some of the most extraordinary pre 20th century European art in existence. From Van Gogh and Monet , to ancient Roman artifacts and tapestries and everything in between. There are also traveling exhibits that feature more modern work. The art is divided into 4 buildings that can be visited in the order of your preference. There are special family rooms as well as activities for kids to stay entertained and learn about art. The buildings are well-designed, with lots of natural light and high ceilings. The grounds include a labyrinth of gardens and manicured lawns that is a tranquil place to sit and read, write in a journal, let the kids blow off some steam or simply meditate and relax. There are fountains and flowers; babbling brooks and tall cactus plants.\n\nAnother amazing feature of the Getty is the Garden. The beautiful labyrinth-like garden features flowing water and changes with the seasons. If you get hungry you should go to the cafe to sample the amazing daily menu. If you are looking for an exceptional dining experience try the restaurant, since it gets full you are better off making a reservation in advance. If you need want a special treat stop by the first floor of the research library and look at the available literature. On a side note, I was very impressed with the children's gift shop. Instead of the usual array of toys and silly souveniers, the Getty shop is heavy on art supplies, pencils, crayons, clay...all the tools a young artist would need to create his or her own art. Try to be at the Getty Center first thing in the morning – easy to park, no crowds. What can I say except – if you are in LA and love museums you must go. My only regret was we didn't have more time, there is so much to see at this incredible museum.\n\n\n\n\nShow less"], ["Reviewed 4 weeks ago", 5.0, "not what i expected", "location- 4/5 it was tricky going there, you really have to check online to where you should park\ncontent- 6/5 i was completely amazed since it was not i expected it to be. there are so much to see and are very entertaining and the admission is free!!! though parking is quite expensive but still it is worth it.\nstaff- 4/5 they are very attentive.\nrestaurant- 4/5 a bit pricey maybe to compensate since there is no entrance fee\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Breathtaking Trip", "My Son took us over to Getty for a day trip. This place was incredible! I highly recommend going & spending the day there! The grounds are beatiful & you can eat outside over looking LA. Great experience for family and kids. 👍🏼👍🏼☺"], ["Reviewed 4 weeks ago", 5.0, "A must see attraction in LA.", "This museum is worth seeing for its (a) collection; (b) architecture and (c) location! Even if the the first two disappoint you (they won't), the views of LA are stunning, particularly if you are fortunate to arrive on a clear day.\n\nA convenient and cheap way to get to the Getty Centre is to take e the public bus, which stops just outside.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "a day at the getty", "The Getty is a great museum....whatever you like. Art, decorative arts, garden. etc. I really enjoyed both the architectural tour and the garden tour. They both pointed out the incredible amount of planning and factoids that you wouild never know without the explanation"], ["Reviewed 4 weeks ago", 5.0, "Beautiful museum!", "Great architecture, beautiful works of art (Van Gogh!) and a perfect spot for sunset. The line for the tram was long (40 minutes wait), so I walked up the hill (about 15 minutes, quite okay, so spare your time and just walk)."], ["Reviewed 4 weeks ago", 4.0, "Excellent French & European furniture", "What a gem and collection of French and European Furniture. Truly he had an exquisite eye for fine furniture. Highly recommend seeing these pieces alone. The art is wonderful too. The museum is filled with a lot of Dutch and Flemish art because of the restrictions on years for what the museum can present and acquire. Some of the artists are notable and sought after. Definitely worth comparing the collections from around the USA to the Getty.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must see", "This is a great place for any art lovers, families, and couples. The gardens outside offer a lovely escape from city life and a wonderful place to picnic and soak up some sun."], ["Reviewed 4 weeks ago", 4.0, "Wonderful outdoor gardens", "The garden reminded me a bit of the gardens in the Palace of Versailles, except in smaller scale and grandeur. Nonetheless a great garden, and the Photography in Argentina exhibition was very interesting.\n\nA must-go at least once but not sure I would return (not a big arts appreciator).\n\nThe entrance is free with free audio tours, and first hour of parking is also free, although I doubt you would stay for less than an hour to make it. The hour after that is USD 15.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Outstanding", "Visited this museum in June of 2014 and loved it! I could visit this place everyday if I was local. The exhibits, gardens, and art are so beautiful and inspiring. Was pleasantly surprised to be able to experience the James Ensor Exhibit while there. A must when visiting LA!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Lovely spot that inspires appreciation for philanthropy", "We can see why the Getty is related #1 of places to see in LA. We went on a weekday, and even then it was busy. The tram deposits you at the steps of the Center, and even with a map it is not possible to visit all of the Center. There are beautiful spots to linger, and the collection of artifacts and artwork is amazing. The Getty is also student-friendly, with a number of local grade and junior high classes sprinkled all around. It's a place you need to return to frequently to get the full sense of beauty. More power to the Getty family for sharing this treasure.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A favorite place to revisit on clear, warm LA days...", "My family, church friends and I come here on perfect LA days to enjoy the sun, warmth, the beautiful gardens and views, and of course, the fascinating curated exhibits. Always something to see and enjoy, especially with family and friends."], ["Reviewed 4 weeks ago", 5.0, "Amazing Place Totally Worth the Visit", "The Getty is extraordinary. The art, the architecture, the setting and above all the views are all amazing. The Getty is truly a celebration of beauty on many levels. The best part of all -- admission is free. Parking is $12 however, but too many museums $25 admission fees plus $12-$20 for parking. If you don't like art, go for the sweeping views which, on a day like today included as far east as the Santa Monica mountains and as far west as all of Catalina Island and even San Nicholas beyond. The art collection is massive and beautifully displayed. Even in winter the gardens were fascinating and the building is top design. You can't help but respect The Getty.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must see!", "Stunning location! Worth visiting just for the views, but also wonderful art, including decorative arts. Something for almost everybody. At busy times, allow extra time to get in. We were there on the Saturday afternoon of a long weekend and had to wait just to get into the driveway to where we could be dropped off, then waited in line for the security check, then for the train to go up the hill. But worth it.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Beautiful !", "Amazing collection of art - well presented - park then take the Tram up to the Center - several buildings - parking is $15.00 then museum is free. You can spend the whole day there - rotating feature exhibits going on ! Well worth the trip !\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Excellent Museum", "Meaningful art museum in a beautiful building and location, well organized and only thing to pay is parking"], ["Reviewed 5 weeks ago", 5.0, "THIS IS PARADISE", "This is the best place for architecture, museum exhibition, art, garden outdoor exploration.\n\nThe museum has multiple locations and floors with different artist exhibitions.\n\nThe garden is gorgeous. You will find all sorts of plans there. In the center there is a waterfall. Fresh air, best view of the city!\n\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Like no other", "I'm so lucky that this beautify museum is only 30 min from my house. The complex it's self is a marvel of architecture. One of the best views of the City from Downtown to the Pacific. I agree with another reviewer that this has to be on the list of world's great museums.\nShow less"], ["Reviewed January 24, 2018", 5.0, "No. 1", "In terms of location, architecture, and exhibits, this is one of the world's great museums. The view of LA is spectacular, and like being in a helicopter. The layout and displays are perfect, and lunch is very upscale. Definitely a must do."], ["Reviewed January 24, 2018", 5.0, "A masterpiece!", "Everything about the Getty Center is amazing! The complex itself is a masterpiece, up the hill with a wonderful panoramic view of Los Angeles! The many different exhibitions and masterpieces begs to come more than one time, free entry with an ridiculous low charge for parking make the Getty a must see in Los Angeles.\nShow less"], ["Reviewed January 24, 2018", 5.0, "A Modern Masterpiece", "A true LA treasure, like the Guggenheim in Venice. Go for the artwork, stay for the atmosphere. It's amazing! Gardens, phenomenal exhibits, a stunning view, and a wonderful way to soak up culture in a seriously cool environment. Worth the effort to park and get there - go and be inspired.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Getty Center", "Getty Center is a fabulous place. It's own collections are wonderful, and the visiting collections are frosting on the cake. Not only is it a wonderful museum, but it is also a beautiful place. The architecture is amazing, and it enhances the great views around it.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Return visit", "Always try to get to the Getty when in LA Amazing art and interested exhibits. Already looking forward to the next trip."], ["Reviewed January 23, 2018", 5.0, "Great place to visit", "We had concert tickets for an international concert - the concert hall is intimate and beautifully done The Gettty center is a great place to visit in the evening -- beautifully landscaped and the view of the city is awesome"], ["Reviewed January 23, 2018", 4.0, "The center's architecture and setting is at least as interesting as the exhibits", "Our journey to the Getty Center was complicated by the common GPS issue - evidenced by the various signs in residential streets directing drivers back towards the 405 junction, which wasted 20+ minutes in our case due to queuing traffic.\nHaving managed to switch lanes on N Sepulveda Blvd just in time to turn left back under the 405 we were finally at the large parking structure. Signage to the Center may be flakey but the onsite parking and transit up to the Center were very well organised. We had a quick lunch in the cafe, a walk around the outside of the Center buildings then time for one permanent exhibit and one temporary exhibit - more time than the 2 hours we had allowed would have been useful as were rather rushed and missed out on the guided tour of the site.\nGood points:\n+ Lots to see in the various pavilions and surrounding grounds\n+ Plenty of onsite parking\n+ Several options for drinks and lunches\n+ Architecturally interesting\nNot so good points:\n- Check the destination address is correct as misguided GPS regularly takes drivers into the residential neighbourhood of Westgate Heights\n- The site is on several levels so there are lots of steps, both outside and inside the buildings\n- For me there were no truly outstanding or must see exhibits\nShow less"], ["Reviewed January 22, 2018", 5.0, "Awesome Place", "Tight on funds.\nJust for the price of parking everyone in your car gets in.\nReally nice things to see and explore.\nGreat views on a clear day.\nDo the tour of the grounds. Explains a lot of why this location and how it was built.\nYou can easily spend a full day here.\nOf course it's less crowded on the weekdays.\nWe always go early to avoid some of the crowds.\nBring a picnic lunch to enjoy on the grounds.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Kingdoms of Gold", "The exhibition of Kingdoms of Gold, it is very complete and relevant, love it.,the ecenery very beautiful ."], ["Reviewed January 22, 2018", 4.0, "Great sightings", "The whole area is free. You should come early to avoid long lines on the train. You should know what to visit as the the area is huge."], ["Reviewed January 22, 2018", 5.0, "Getty Inspired", "I’m a designer, participating on runway show. Metropolitan Fashion Week. I have to design some pieces inspire me from the art ."], ["Reviewed January 22, 2018", 3.0, "O good option", "If you have plenty of time go for it. Getty Museum is a touristic place and any day day you go you will find a lot of people from all over the world. The place is huge, the gardens pleasant and time to time they change the exhibitions, so pay attention if is the kind of time you want to dedicate because sometimes you go there and can bump into something you maybe find boring or not attractive. Go with some food in your backpack because food there is expensive and scarce. If you'd prefer eat before going so you have plenty o time to burn calories visiting the buildings and gardens.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Love this place", "Great views of the city, the ocean, a beautiful garden, and so much art to peruse and get cultured! Their rotating exhibits are always enjoyable.. Parking & food are costly, but it's worth it since the experience is free. Wear comfy shoes - you'll be walking a lot.\nShow less"], ["Reviewed January 22, 2018", 5.0, "The Getty Museum", "Superb setting atop a promontory with 360 degree vistas from the Pacific to the inland basin. A memorable visit for Art lovers with continuous exhibitions as well as an impressive permanent collection! A must see for people of all ages and creeds!"], ["Reviewed January 22, 2018", 5.0, "Don’t Miss the Getty", "The Getty is a one of a kind museum in a unique location at the top of the Santa Monica Mtns. There are always world class exhibits, right now the PST exhibit of pre Columbian Gold works is amazing! Hungry? The great outdoor cafe and high end restaurant provide good choices for a meal or just a snack. Be sure to walk down to the garden, it is a design marvel and with views that overlook the city it’s not to be missed!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Must do when in LA!", "Amazing museum and architecture Great exhibit halls and the artwork is breathtaking Love the tram ride up and seeing all of LA views Great Restaurant on top for lunch stop suggested Wear cimfottable shoes This place is huge"], ["Reviewed January 22, 2018", 5.0, "Beautiful gem in Los Angeles", "My daughter introduced us to the Getty and we thoroughly enjoyed this amazing place. The grounds are spectacular, beautiful art and architecture. Take your time - you can easily spend several hours in this lovely place."], ["Reviewed January 22, 2018", 4.0, "Put this Museum on your list!", "Hit the \"Highlight one hour Tour\" - docent was knowledgeable. Appreciated going in-depth on several pieces within the Getty. It's so large - you could easily spend several days to see all the sections. We had lunch there in the formal cafe. Beautiful views and wonderful service. Food was good -\nShow less"], ["Reviewed January 21, 2018", 5.0, "Beautiful place", "Beautiful place to visit. Free but you pay for parking. Make sure you inquire about the Villa close by to include in your visit. Get tickets for Villa visit at the Getty and you can include for the same day visit or another day. Beautiful masterpieces to see.\nShow less"], ["Reviewed January 21, 2018", 5.0, "One of the best new museums in the country & admission is free", "Beautiful inside and out. Gorgeous views of the city. wonderful grounds including interactive gardens and Streams/fountains. The cafe food is excellent. The exhibits are wonderful. To best enjoy it, take a free tour They have themed self tours as well if you have limited time. The parking is free down the hill; if you park at the museum, it has a fee. Then you take the monorail up to the museum. If you go on a rainy day they will lend you umbrellas. Its perfectly awesome.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Happy travelers", "Visited this place several times, entrance to the place is easily missed. The place is very lovely the view itself is breathtaking. The gardens are lovely and well maintained. The arts it contained are mesmerizing. I would recommend this place to everyone and will visit again soon.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Treasures of the Getty Center", "I was fortunate to attend a 2-day symposium at the Getty Center Dec 8-9, 2017, about indigenous knowledge and the making of colonial Latin America. I also saw the Golden Kingdoms exhibit that included many works discussed during the symposium.\nThe BEST two days I have spent in a very long time. The Getty Center collection and temporary exhibits are priceless! The architecture and gardens are beautiful. It is a wonderful place to spend the day. Many people bring their laptops and write at a patio table, in the garden, in the cafeteria. The parking is $15 for the day, but it is reachable by the bus line that runs up Sepulveda. And if it is a clear day, you can see Catalina! A day at the Getty is a day very well spent.\nShow less"], ["Reviewed January 21, 2018", 5.0, "The Getty Center", "I would highly recommend a visit to the Getty Center. It’s a wonderful outing. I especially enjoy the gardens. Be sure to get advance tickets and see what special exhibits are showing."], ["Reviewed January 21, 2018", 5.0, "Magnificent place, one of the best contemporary museum.", "The whole package is outstanding. I've never been in such beautifully placed museum. Maybe in some European castles... Yes, it is not in some historical place, but views on the LA from the top of the hill are awesome.\nYou need a full day, at last, to see collections, walking at full speed :) Collections are great! The way they exposed is also great. There are no paintings crowded on walls. Air everywhere, light everywhere.\nShow less"], ["Reviewed January 21, 2018", 5.0, "An absolute must", "If you travel to Los Angeles you need to include this wonderful museum in your itinerary. Not only that it houses an exquisite art collection, one of the best in the country but it's location is stunning. You can easily spend 4-5 hours in this venue admiring the architecture and the amazing landscaping as well as its exhibitions both permanent and temporary. There are good dining options for various budgets and if you manage to catch the sunset you are in for an wonderful treat. I recommend planning to spend an entire afternoon there.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great place to spend afternoon", "Went with out of town friends. Spend whole afternoon and they loved it. You can spend whole day here. I would suggest to pack some sandwiches and take water with you. Parking is easy and tram ride is very cool."], ["Reviewed January 21, 2018", 5.0, "Getty museum", "Great museum to enjoy with the whole family. Every single member of the family had a wonderful time. A must see for any tourist in LA. Where you can enjoy the best art and at the same time have a picnic in a beautiful garden with the best view. It doesn’t get any better than that.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Wonderful place to an afternoon or the whole day.", "Enjoy world class art work, spectacular views and fine dining all in one visit. You can check their calendar for musical events and you can see why the Getty Center should on any LA must see list. While you’re at it the Getty Villa on PCH in Malibu is also highly recommended, Reservations are needed and although admission is FREE there is a parking charge\nShow less"], ["Reviewed January 21, 2018", 5.0, "Getty Center Los Angeles", "Amazing buildings, tremendous facility, astonishing art and wonderfully manacured gardens. And then the view over Los Angeles and out towards the Pacific Ocean. Wow, visit and get a tour ::))"], ["Reviewed January 21, 2018", 5.0, "Mother’s Day at The Getty", "They were featuring two very impressive exhibitions: “Eyewitness Views: Making History in 18th Century Europe” and “The Lure of Italy: Artists’ Views”. Both were excellent! My children and I always have lots of fun when we visit The Getty Center, and we always leave with more knowledge and feel more cultured\nShow less"], ["Reviewed January 21, 2018", 5.0, "A jewel of Los Angeles art and architecture", "The Getty Center, perched above West Los Angeles is a must destination for locals visitors to Los Angeles. The view from the gardens and terraces is second to none in Los Angeles. The collection is wide ranging with many notable pieces. This is not the Met in NY, but a world class museum.\nShow less"], ["Reviewed January 21, 2018", 5.0, "The Great Getty", "Very good selection of art from all over the world ...free admission nominal parking rate very nice elegant structure ... beautiful gardens ... Enjoy"], ["Reviewed January 21, 2018", 5.0, "Family", "Good education for art and sculpture art. Beautiful grounds.The garden is unbelievable. Great views of Los Angeles. Children can run and play. Great day trip for locals or if your from out of town."], ["Reviewed January 21, 2018", 5.0, "A Must-see when you are in Los Angeles!", "The Getty Center is not only for architecture-and art-enthusiasts a place to go. The view is spectacular, the gardens lovely to hang out after strolling through the different pavilions and outstanding exhibitions."], ["Reviewed January 21, 2018", 5.0, "The Getty Center -- a particularly rich experience for viewing art in the hills above Los Angeles.", "The Getty Center is a very special Los Angeles experience of great art in a campus like arrangement of buildings in an exceptional setting. Other cities have Museums in \"downtown \" locations that are very urban but the Getty is situated in the beautiful heights between the San Fernando Valley and the LA Basin. Initially people feared that the need to park and then take a train would discourage people from visiting the Getty but instead the journey and the splendid views became part of the attraction. The collection has some real strengths in Renaissance and Baroque painting as well as a notable collection of master drawings and a particularly fine collection of furniture. There are often very interesting traveling exhibitions on view. I've never visited where I didn't have the opportunity to both visit an old favorite and also see something new. So go for the view! --in all senses of the word.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Gorgeous Views", "Went after Christmas but car line to get in was horrendous. Just don't go around Christmas/New Year's but otherwise it's good. Think they should implement a better parking system (buy tickets) so that the traffic can be managed better."], ["Reviewed January 21, 2018", 5.0, "Fabulous Place!", "How can one say enough? Beautiful, educational, interesting, well laid out, great staff, amazing collections, amazing architecture. LOVED IT!"], ["Reviewed January 20, 2018", 5.0, "Incredible collection and Spectacular grounds and views", "I have been here twice, and would go again. This is a great place to take pictures. The collection is interesting and expansive. It is a delightful way to spend time while in LA!"], ["Reviewed January 20, 2018", 5.0, "Lovely place.", "The wife and I loved this. We spent all afternoon there and we could have spent the whole day! Really worth the time. A little challenging to get to without a car however, but doable."], ["Reviewed January 18, 2018", 5.0, "Outstanding Experience!!", "So much to see and do, but plenty of beautiful space to just go for a picnic. This is a world-class museum, in an increasable setting with outstanding views. It will be a must-visit stop on all of my future visits to the LA area."], ["Reviewed January 18, 2018", 5.0, "AMAZING, Gorgeous, FREE!!!", "This place is a National Treasure. The Campus is a beautiful work of art on its own, and then you get to see priceless works of art inside. The restaurants re outstanding with incredible views to the ocean on one side and the city on the other. The staff is thoughtful and very well educated. The art is breathtaking. The Central Gardens are not to be missed. The admission will always be free and parking is cheap. A MUST SEE oasis above it all in Los Angeles.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Best way to spend your free time in LA", "There's always something to see and observe. We love it here. The building, the art, the grounds are incredible. Study the design of everything including how the tiles outside align themselves with the lines of the buildings. The art is always incredible. LOVE LOVE LOVE this place.\nShow less"], ["Reviewed January 17, 2018", 5.0, "No regrets", "This was our first day out in LA & what a day. Really if take your time look at the wonderful gardens, admire all of the art and sculptures exhibitions and enjoy lunch in the wonderful Getty restaurant it will take all day. First you park (15 $ per day) & then get a small train up to the Getty centre. In December around 5 PM we were admiring the sunset. & the glorious views across LA: And entry is free. Unbelievable.\nShow less"], ["Reviewed January 17, 2018", 5.0, "A Must Do while in LA", "The Getty Center blew our minds! Gorgeous architecture on beautiful hilltop location. There are so many exhibits that we weren’t able to see everything. The ancient Mexican artifacts, sculptures of various mediums, and cultures were breathtaking. The staff is knowledgeable and helpful. We were fortunate enough to view a jaw dropping sunset to conclude our visit.\nShow less"], ["Reviewed January 16, 2018", 5.0, "NA to LA", "One of the best museum I have been to! The quality of the exhibits to the ease of getting around and the spotless conditions made this a great take... did I mention admission is free... I don’t know how they do it! Make sure you do the Gardens!\nShow less"], ["Reviewed January 16, 2018", 4.0, "Beautiful grounds with great views", "Worthwhile visit to see the buildings, gardens and the great views. Permanent collection is skewed to older European works but the temporary exhibits were very good. Good food at the outdoor cafe.Go early to avoid lines getting into the parking lot and dont be afraid to walk if the lines arelong for the tram.\nShow less"], ["Reviewed January 16, 2018", 5.0, "A must-visit place when in LA... plus it's for free!", "The Getty Center didn't disappoint. I am not a fan of museums and exhibits but I enjoyed this place a lot!\nGreat architecture and design and art collections. Lots of scenic places within the property. Take advantage of the free guided tour to discover the place and the art pieces.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Fabulous art and architecture.", "Great setting for world class art and free to enter. Impressionist art was worth the trip along with the buildings and views."], ["Reviewed January 14, 2018", 5.0, "Amazing Architecture, Gardens, & Art!!", "There are few places in that you can access in the international art world for free, that allow you to see aspects of paintings, sculpture, architecture, and gardens. This may be the one and only if it’s kind.\n\nA couple of things to know - parking is charged, number of people visiting the Center is limited by parking. If you do not get there early, you may not find parking, hence be unable to get access to the Center. If parking is full in the morning, they will ask you to come back around 1:00 for openings in afternoon parking, important to get there around 12:45. This is great as it limits the amount of people to a manageable number, allowing you to move through the exhibits without being rushed or in contact with other people. The tours - self guided and exhibit guided are both excellent and recommended.\n\nAn amazing way to spend an day.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Not-to-be-missed destination", "The Getty Center is worth investing a day of a visit to LA - while you can enjoy the architecture and artscaped gardens in less time, once you get all the way to the Getty you can spend hours and hours immersing in the collection. Entry is free but parking is $15. If the adjacent parking is full, look for overflow parking across Sepulveda Boulevard at a temple parking lot - if you see a sign for parking there, turn in immediately instead of turning into the Getty and having to turn around, unless, of course, you just want to drop off your passengers. Don't bother waiting for the tram up the hill - while the sidewalk is a bit steep it is well shaded and not a bad walk. The vistas of Bel Air are delightful from the approach. Once at the Getty, get your bearings with the orientation video and get a map of the complex. Different schools of art are housed in different pavilions. There are several cafes throughout the grounds - my favorite is the Garden Terrace but there are also indoor options. There are special curated or traveling exhibitions as well as a comprehensive permanent collection. There is a free audio tour that features highlights of the collection. The Italian travertine on buildings and courtyards is softened by water features and plants. The gift shop has a good selection of art books but not so many affordable souvenirs except for children. Don't miss the cactus garden at the South Promontory with a fabulous view of downtown LA. If you want to immerse in the history of art, the Getty is one of the best places to do so.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Unbelievable museum!", "Great works of art, all kinds, painting sculpture, stained glass, furniture, etc. Beautiful buildings, fountains and gardens. No entry fee, just for parking, and that is only $5!"], ["Reviewed January 12, 2018", 5.0, "Really worth a big detour", "Staying overnight by the airport and decided to finally go to the Getty. A $20 Uber to get there, but a $50 taxi back. Uber was quoting $75 but it was 5.00 on a Friday and the roads were jammed.\n\nThe Latin American gold exhibition was the feature and it was very well done. Having visited the Gold Museum in Bogotá only a month or so before we were impressed by the attractive and informative way it had been structured. The Colombians could learn.\n\nTerrific paintings, sculptures etc., but it was the setting that makes it unique. Very attractive building with great views, even with the smog of LA which was pretty bad for January.\n\nWith the special exhibitions I think it could be worth going 2 or 3 Times a year if an LA resident.\n\nEntrance was free. No idea how they do that. Must be the rich Foundation. We should have made a bigger effort to visit years ago.\nShow less"], ["Reviewed January 12, 2018", 5.0, "A Day at The Getty is a Must-Do", "We spontaneously chose to visit The Getty Museum before driving back home to San Diego. Wow. Beautiful complex, free admission, a multitude of exhibitions throughout the buildings besides permanent collections. We used the audio tour to learn about the Golden Kingdom and the museum highlights. So much to see. Beautiful views of the city. You must come!\nShow less"], ["Reviewed January 12, 2018", 5.0, "Best Museum in LA", "This place is one of the best museums in LA. If you like arts and histories, you'll be happy to be here for hours and hours. It's better to visit this place around 10am or probably earlier since it will get crowded and long line entering parking garage. Parking fee is $15 ($10 after 3pm) but no cover to enter the museum. You need to ride a tram from parking garage to the main area (you can walk if you like) and don't forget to ask for a map at information booth inside museum entrance hall. So many interesting things in this place from paintings, sculptures and breathtaking views from outside the building. Bring powerbank or extra charger cos you will take so many pictures. Trust me it's worth it to come here :)\nShow less"], ["Reviewed January 11, 2018", 4.0, "Excellent Art", "If you are looking for a place to see exhibits of Art - then this is place to go! So much so little time!"], ["Reviewed January 10, 2018", 5.0, "World Class", "This is possible the best overall museum experience in the world. When you compare the quality of the architectural use of space, paintings, sculptures, and ceramics collections it’s impressive. Toss in the gardens and views makes this a world class experience over the top."], ["Reviewed January 10, 2018", 3.0, "A personal disappointment", "I had heard so much about the place and love modern art and architecture. This place, however, felt totally overdimensioned. I admit the entrance is free and therefore there should be nothing to complain about. It is just I expected a more inspired approach from such a renown architect like Richard Meier. Also, the exhibitions were of moderate interest to me since they do not offer real highlights. My favourite part were the impressionist paintings and the pre-columbian objects.\nShow less"], ["Reviewed January 10, 2018", 5.0, "This is a must see for art lovers!", "The collection of art at the Getty rivals the museums in some large cities. The architecture is amazing and the gardens are beautiful. There is no cost to visiting the Getty except for a fee for parking. What a great entertainment deal!"], ["Reviewed January 10, 2018", 5.0, "Visit to the Getty Center", "We live in the San Fernando Valley, not far from the Getty Center but it is a place to return to periodically especially to take out of town visitors. There is great art work there, but if nothing more than to visit the grounds, it is well worth it. Especially on a clear day, the views are spectacular. It is a great destination to just walk around for a couple of hours. Bring your camera.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Amazing Experience", "This is a remarkable place that is a must see if you are in the area. Plan for 5 hours and do as many tours as you can. The tour guides are very knowledgeable and a delight to listen to."], ["Reviewed January 9, 2018", 5.0, "Fabulous LA Museum", "This was my second visit to this Museum with a view of the La hills and valley. You go for the world class exhibits but you leave remembering the beautiful views in every direction. Plan to spend between 2-4 hours.\n\nThe only cost is parking is $15 at the base of the mountain then your journey begins by taking the tram up the hill. Amazing views begin your day. Free maps are available so you won get lost. Be sure to visit the beautiful gardens which were an art project itself. You can get eat lunch or just grab a snack at the museum. Go early because there's always a line to park. Enjoy!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Indeed the Best Museum in Los Angeles", "I did not have very high expectation for the Getty Center. I imagined that it is just \"another art museum with mediocre collections established by some wealthy family.\" However, their collection is generally extensive. The more impressive is the settings of the center itself.\n\nThere are several buildings on top of the hill, with great view of Los Angeles (and its congested freeways). There are also several simple but informative temporary exhibitions going on at the time of my visit. The garden and the outdoor artworks are also lovely.\n\nThe best thing is that all these are free, including the audio guide and the mini-train ride from the parking lot.\n\nIf you do not have your own transportation, it is a little tricky to get to Getty Center. The easiest way is taking Metro Expo Line to Sepulveda station and change to Bus 734/234. However, I do see many people order Uber to/from the Center.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Architecture or art ?", "I revisited The Getty Center and I encounter the same desilusion as per my last visit. This extraordinary museum is exceeding as an architecture and is lacking in art. The permanent exhibition are poor and the temporary one are unattractive. Although is permanently crowded the curators are probably in a continuous holliday or simply they do not have the means or the will to enrich this wonderful museum with matching art. Check beforehand what's on display or purely go to admire the construction and spend time in the gardens.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Simply Amazing", "How can one describe how amazing this place is. The architecture, the gardens, the location, the special exhibitions and importantly the collection. I was mesmerized the moment I walked in the first wing. A room of Rembrandt's - wow. Personally I prefer the Cezanne beside van Gogh's Irises which was good considering crowds. The grounds are fabulous and the cafe is the best I have come across for a museum.\nShow less"], ["Reviewed January 8, 2018", 5.0, "My favorite thing in LA", "This was by far the coolest museum that I’ve ever been in and the view from anywhere outside the museum was amazing spend the whole day pack a lunch take the whole family it’s awesome depending on the day parking can be a bear but it’s well worth it sunset up here was amazing\nShow less"], ["Reviewed January 8, 2018", 5.0, "The Getty Center", "Spectacular complex, gardens, art and architecture. Highly recommend as a day trip. The garden features with sculptor and water are outstanding. Special exhibits outside of the collection are also very"], ["Reviewed January 8, 2018", 5.0, "A must visit", "A vast area on a hill overlooking 405 and Beverly Hills. A parking deck gives access to a tram that takes you to the top. We always underestimate the time required to benefit from such a visit. Well organized and maintained site, you can enjoy the museum, the villa, the gardens, cafe and the views. If you are an art - architecture lover plan to spend most of the day there. A 2 hour visit would not do it. I plan to go back again.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Best art collection", "This is our second visit to the Getty Center. The first time we arrived too late. There was not enough time for us to see the art other than the building. This time, we arrived on a Saturday and the Getty Center closes late on Saturdays. Still, we could barely finish seeing the paintings.\n\nWe were amazed by the huge collection of paintings. They are all excellent masterpieces from famous painters. They were so beautiful that we found it hard to leave the exhibition rooms. In addition to paintings there are also exhibitions of other arts such as photography, but we did not have time to see them all. Next time when we visit LA again I am sure I will visit the Getty Center.\nShow less"], ["Reviewed January 7, 2018", 5.0, "Must See When in LA", "Can not believe this museum is free. Paintings by Van Gogh, Renoir, Monet, Cezanne. Many buildings and beautiful landscaping. Sweeping views from several vantage points of Century City and neighboring areas. After a chaotic and crazy day at the Rose Bowl Parade and Football Game, this museum was the calm serenity we needed to enjoy the beautiful sunny CA weather. Parking is at the bottom of the hill and you ride a tram up. Fyi... the Uber/Lyft pickup is in a specific area when you are leaving. Security can direct you to the correct location. This museum has several dining options is enormous and takes several hours to see everything. Enjoy!!\nShow less"], ["Reviewed January 6, 2018", 5.0, "Outstanding", "This is an impressive, and beautiful museum. I was surprised at the amount of famous paintings here. The Kingdoms of Gold exhibit was fascinating and impressive. It is a clean, and beautifully set place, with white buildings and fountains on a hillside, surrounded by gardens."], ["Reviewed January 6, 2018", 5.0, "Go for the architecture and views Alone", "The art was fine, it the setting wow the gardens the sculpture the architecture itself. Real treat this is a must. If you are basically In shape skip the line for the tram. The walk up is fun invigorating and takes maybe 15 minutes"], ["Reviewed January 5, 2018", 5.0, "Amazing!", "My family and I went here to see not only the art but the overall architecture, it was brilliant! This place and the view will knock you off your feet its so amazing! And it’s totally free (we did have to pay for parking but if I remember correctly it was $15 usd) Overall I would highly recommend it to anyone who loves beautiful art, stunning views, architectural wonders, and unique furniture styles!\nShow less"], ["Reviewed January 5, 2018", 4.0, "so much to see, so little time and energy", "Visited during a very busy Christmas visit with family. Lots to see inside and the views are beautiful outside."], ["Reviewed January 5, 2018", 5.0, "WHAT A VIEW! What a place!!!!!!!!!!!!", "I remember when the Getty first opened. It was stark, trees were small, I was very underwhelmed. I can honestly say, I took some friends here recently and was really happily surprised at how the \"Place Has Grown Into The Vision\". It was a clear day and you could see forever. The trees and the gardens were wonderful, even in winter. I spent most of my time outside, enjoying nature on a glorious day. I will for sure be going back to savor the interior and exhibits as well. SO beautiful!\nShow less"], ["Reviewed January 5, 2018", 4.0, "Free Admission 15 to Park", "What a stunning museum complex. Lovely outdoor area and world class art. The most famous Irises by Monet does not disappoint. While we were there an exhibit of Golden Kingdom was showing (also free) an incredible collection of Inca and Mayan gold artifacts. there are spectacular views from the second story walkways.\nShow less"], ["Reviewed January 5, 2018", 5.0, "The Getty Center was amazing", "\"Wow\" is all that I can say. What an amazing place -- the facility, the view and the collection. We loved it. We spent 7 hours there and didn't even see everything. Thank you J. Paul Getty."], ["Reviewed January 5, 2018", 5.0, "Exciting Visit", "The Getty Museum has lots to offer anyone interested in exploring culture and the past. I especially enjoyed the outside landscape. The cafeteria is also very good with many options for picky eaters. Excellent value for a long day of exploration"], ["Reviewed January 4, 2018", 5.0, "plenty of vip malls to visit there", "everyweekend we go to getty for the malls, it is a great shopping center full of places to have lunch or dinner while doing shopping"], ["Reviewed January 4, 2018", 5.0, "Loved it!", "Been to loads of musuems all over the world but there is something special about the Ghetty - we did a couple of tours with volunteers who were passionate and knowledgable but what I think sets this place apart is that it is so relaxed."], ["Reviewed January 4, 2018", 4.0, "Cafeteria but good food!", "Usually I don’t expect much except bulk when you go to a “cafeteria”. At the Getty Center, the selection of food was great, the layout of the serving area was well thought out AND the food was good!\n\nThere are four different food lines representing four different food styles. Plus you can go to an already prepared sandwich area and grab and go.\n\nGood job, Getty food management!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Wow", "What a fantastic place. Had an awesome day at the Getty. Caught a Lyft from Downtown LA there and back, glad I did as parking was at a premium. Lunch at the cafe was pretty good vale as well.\n\nIf you are visiting LA it is a must see.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Getty Museum", "Wonderful place of art for all ages and groups of young to old.\nHaving place like this in Los Angeles\nis priceless.\nFelt like l was in Europe and enjoying art gallery, but way larger\nAnd greather than l have experienced.\nNot as large as LOURVE.\nI will visit again and again:)\nShow less"], ["Reviewed January 3, 2018", 5.0, "Beautiful inside and outside", "Spent four hours and could have spent another four hours taking it all in. The gardens are beautiful. Just wish there had been benches along the path so I could sit down and enjoy it more. The artwork is varied and I will have to go back to see what I missed this time. There is no entrance fee for the museum, but they do charge for parking.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Nice place to Visit!", "Its a nice place to visit during your stay in LA. Place is beautiful with interesting arts to see. Price is acessible, worth the time!"], ["Reviewed January 3, 2018", 5.0, "THE PLACE TO GO IN LA!!!!", "Lovely architecture wonderful collection and superb view of LA. The garden is amazing as well. We were there before heading home through LAX and very much regret only spending a day there. Even if you don't want to do anything, it is still the place to go to get away the hassle bustle of LA. There is something for everyone. We will be in LA again and I will schedule at least 2 days another visit.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Lots to Offer!!!", "Amazing sweeping views of the city and a fun little tram ride starts it all off as you climb up to the architecturally stunning estate. The museum has primarily European classical artworks but they also have quite a few spin offs notably the Japanese art exhibit as well as changing contemporary exhibits. Docents lead wonderful informative tours and are excited to share their knowledge and open to discussing ideas. Cafe is state of the art (no pun intended) with lots of options and offerings while the restaurant, while a bit pricey offers an elegant atmosphere and beautiful views. I recommending planning 4+ hours for this museum as there is lots to see! Outdoor gardens are great for walking through, meditating and taking in the sweeping views of Los Angeles - some of the best views of the city from coast to downtown buildings!\nShow less"], ["Reviewed January 3, 2018", 5.0, "Getty is great for a day!", "Huge amazing complex. Priceless art sculpture furnishings! Incredible gardens beautiful views. Well worth five hours. Restaurants are great also"], ["Reviewed January 3, 2018", 5.0, "Magic on the Hilltop", "Wow! The views from the Getty Center are fantastic and that is before you go into any of the exhibits. One parks at the bottom of the hill in the Center's parking structure and upon exiting pays either $10 (3 hours or less) or $15. That is the only cost to you as all the exhibits are free. You can walk, take the tram or a bus to the top, your choice. Plan on spending about three hours viewing before you go into \"museum overload,\" as you have just scratched the surface at least another visit is warranted to lightly cover more of the exhibits. We were impressed with the way the displays were set in rooms that appeared to be taken right from castles and chateaus really bringing the exhibits to life. There is something here for everyone regardless of age. We will return when back in the area.\nShow less"], ["Reviewed January 2, 2018", 5.0, "One of my favorite museums", "Beautiful, modern set up. Very open and specious. My dad and I used to come here about once a month just to hangout and people watch. The art is pretty unique here I would highly recommend a visit. The views around the building are also a plus!\nShow less"], ["Reviewed January 2, 2018", 1.0, "Wish I could review the center but I spent 45 minutes in the parking garage to be told there was no available parking", "Arrived at the Getty Center at 11;45 am on Tuesday, January 2, 2018. Parking attendant directed us into the parking garage. After we drove down to level P7 and found no available spots, we were again directed by parking attendant to follow the white car in front of us up a hill. We never found the hill because as we exited the garage we were directed by another attendant to turn right. This took us away from the Getty Center! We turned around and were directed by police back into the Center. After arriving at another parking attendant, we were informed that the lot was full and to come back in 1 hour. This already took up 1 hour of our time! I found it hard to believe that the parking attendant directed about 30 cars too many into the parking garage and that there was no communication between them. What a waste of time. Would love to visit the Center in the future but will be some time before I forget the poor treatment we and many others received.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Gorgeous gallery and outdoor spaces", "What a view. What a collection of beautiful, fascinating and fun art. I took a bus to get there and it was well worth the effort and getting lost a couple of times. Stunning."], ["Reviewed January 2, 2018", 5.0, "Just Go- Even if you don't like museums, you will love this place", "The location, the architecture, the art-Oh My.\nThis place has it all.\nThe views are spectacular and the artwork is amazing. The trip is so worth it.\nDefinitely worth the Uber ride.\nWe arrived fairly late in the afternoon and only had 1-2 hours to spend. I would suggest more time to see everything.\nShow less"], ["Reviewed January 2, 2018", 5.0, "World class", "If you love art or architecture, do not miss the Getty Center when visiting LA. Fairly crowded, but worth it. It takes a while to park and either hike the hill or take the tram, so expect to stay a while. The museum cafe is excellent and roomy, but LA pricey for a cafeteria. The art is amazing and from many historical periods and cultures - it's like a mini-met.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Amazing", "This is a place where you breath culture.The biuldings are amazing , the view , and there is also the collection of arts.Its a must see in LA.There is only one low point , the cafeteria has no Expresso coffee......"], ["Reviewed January 1, 2018", 5.0, "Don’t miss it", "Don’t miss this treasure BUT plan on spending a leisurely day there. There is just a ton to see and the outdoor gardens are a half of a day alone. There are wonderful restaurants that look out over the valley ."]]}}