{"The Broad": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Broad", "url": "/Attraction_Review-g32655-d8645857-Reviews-The_Broad-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/19/8d/c0/the-broad.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1061"}, "address": {"@type": "PostalAddress", "streetAddress": "221 S Grand Ave Downtown Los Angeles", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90012-3020", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 4.0, "Shield and great circulation systems.", "The architecture of this museum is most interesting borrowing the shields that began in San Francisco and continued in Marseilles. The building automatically creates a fanciful architectural promenade that helps visitors discover the collection."], ["Reviewed 3 days ago", 4.0, "The Broad Boasts Contemporary Art Worth Seeing", "We had a wonderful afternoon at The Broad. I had been eagerly anticipating visiting this popular museum for quite a while. We were so happy to see the contemporary artwork (think Keith Haring and Jeff Koons) and The Broad currently boasts the Jasper Johns exhibit.\nUpon arrival, I didn't like having to wait outside for our appointment time to get into the Jasper Johns exhibit and then the rest of the museum. I'm glad we arrived just on time and not before as we had planned as it was a chilly day in LA. Odd, but true.\n\nI would recommend The Broad. It's easy (once you are inside) and manageable in a couple of hours. A pleasant addition to our town.\nShow less"], ["Reviewed 3 days ago", 3.0, "Great building; disappointing collection", "The building is worth seeing and some of the art is good. But, the collection, as a whole, was very disappointing. I would recommend going to the museum if you can get your tickets in advance and want to see a spectacular building. But, don't expect to be wowed by the collection.\n\nAlso, FYI, the museum does not have a cafeteria or a cafe.\nShow less"], ["Reviewed 3 days ago", 5.0, "Jasper Johns show", "First time at this museum. Very cool space and pretty good parking close by. Very friendly people working there and well worth the visit. Their permanet is great mix of contemporary artist mainly from the pop era..."], ["Reviewed 3 days ago", 5.0, "Modernist focus, great acquistions", "Cheese grater design remarkably functional inside. Remember that you need reservations to enter. Big exhibitions have additional cost but include admission to the regular museum."], ["Reviewed 4 days ago", 4.0, "Try to get reservations ahead", "After waiting an hour and a half on a weekday, I was allowed in. The exhibit was small, but excellent."], ["Reviewed 4 days ago", 5.0, "Amazing!!", "This is probably one of the nicest art galleries I've ever been to. It was amazing! We loved the contemporary art that filled the third floor. I would recommend booking a FREE ticket in advance. I hear the standby lines can get quite long. We attended at night, and it was fantastic. A must see when you're in the city!\nShow less"], ["Reviewed 5 days ago", 4.0, "Modern Museum", "The Broad is a fabulous modern building located in downtown Los Angeles. It houses the art collection of Eli Broad and the collection is generally modern in nature."], ["Reviewed 5 days ago", 5.0, "A must see and FREE! Don’t miss.", "Wish I would have made a reservation but we lucked out and only had a short wait. The Broads have an amazing art collection. Everything from the hidden message, political statements, and just simple fun. Totally worth the trip. And you can get a picture of the Walt Disney concert hall right next door.\nShow less"], ["Reviewed 1 week ago", 4.0, "AN ISLAND OF CULTURE IN DOWNTOWN LOS ANGELES.", "From the outside architecture to the beautiful interiors and excellent art on display, this is a destination for those that appreciate art (or not). It is amazing the collection that the Broad's have amassed and have put on display for all to enjoy. Get timed reservations online in advance to avoid long waits in line. This is definitely worth your time to plan a visit. If you found the review helpful, please tap the Thumbs Up tab below.\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth the trek Downtown", "Everything about this Gallery is worth visiting. The architecture is amazing, the internal layout is interesting, and the works are very impressive. We also visited the Jasper Johns exhibition which is also worth pre-booking tickets for as it is very extensive."], ["Reviewed 1 week ago", 4.0, "Worrh the Visit, but not the best of the museums", "We enjoyed our visit here, but compared to other museums in the area wasn't totally wowed by this one. The architecture was wonderful."], ["Reviewed 2 weeks ago", 4.0, "Worth the wait in line", "We hadn’t really planned on visiting inside. The building looked so attractive in pictures we had to get close by. We knew that if we would have the time this would be the one museum we would visit.\nWhen we got there and loved the outside we just stood in line that took more than 50 minutes! You have to book tickets in advance in order to get into the special exhibition.\nThe regular exhibition was wonderful. We had lots of fun exploring it!\nIt just turned out to be a tour shorter than the waiting time but we felt it was worth it.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A quite extraordinary selection", "We had never heard of this place until we found ourselves walking past it and were enchanted by the architecture. Not only is the building very striking, but its influence extends for some way outside the walls ... the sidewalk is lined with weird grassy humps protruding through the concrete, and the pedestrian crossings at the nearby intersection are multi-coloured pieces of art in their own right.\n\nAccess to the main display area on the second level is by escalator up what appears very strongly to be a stylised birth canal. No, really. Waiting at the top is one of Jeff Koons' Inflatables series, in this case a truly enormous set of stainless steel tulips.\n\nThe range of art on display is as wide as it is bizarre. There truly is something for everybody here, including those who would normally dismiss all Modern Art.\n\nThe quirkiness of the place is pervasive. For example, the staircases leading back down to street level pause on landings with picture windows which overlook the museum's main storage areas, giving glimpses of the thousands of pieces of artwork not currently on display.\n\nThere is a queue for free access and our Los Angeleno friends tell us that it is frequently very long and slow-moving. On the day we strolled past we got lucky ... we only waited about 10 minutes.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So worth the trip", "Beautiful museum with a plethora of eclectic art. Warhol, Lichtensteinn, Koons etc are all represented in this gorgeous museum. What took my experience to the next level was speaking to one of the staff on site regarding the Mark Tansey room. Aaliyah was well-educated on the art and artist and was so friendly. I truly enjoyed her interpretation and explanation of the pieces. Unfortunately I did not get to see the Infinity Room. The wait was 218 minutes. I signed up and we went for drinks at Otium. While we were there, I received a text saying we were able to go into the room (only about an hour after I signed up) so we missed it. Hopefully next time. I will be sure to stick around knowing the estimated wait time might not be totally accurate.\n\nOverall, this is a lovely experience and I would highly recommend it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A wonderful free museum", "Located next to Disney Concert Hall in downtown Los Angeles, the Broad host the art collection of Eli Broad. The building is modern. The art collection is astonishing with masterpieces of contemporary artists. Think Warhol, Koons, Murakami. And do not miss going inside the Mirror Room. There is usually a line to get in it. For 45 seconds you will be lost in a world reflecting lights in mirrors. It’s akin to floating in the sky. Absolutely wonderful. The good news is that this museum is free.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful (and always free!)", "Incredible space and collections. We arrived without reservations (Wednesday) and only waited about 15 minutes for entry. Unfortunately the Jasper Johns show was not opened yet but still a fascinating and varied collection of art and sculpture. Don't miss the Walt Disney Music center across the street.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Go even if you don't like modern art", "A fun museum. I'm not really into contemporary art I suppose, but this museum is so worth it. Such an eclectic and enjoyable collection and I hope to return. Be sure to stop on the one staircase to look through the \"behind the scenes\" window into their storage area - you can see part of the collection hanging in storage which is really neat.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Staggering", "In terms of contemporary art and architecture, this museum pushes well past conventional collections I have seen at other major museums. The architecture - which is occasionally flawed - is ambitious and boundary pushing. The art simply captures the almost the very best in so many contemporary areas, from Koons to Keifer to earlier standard bears such as Sam Francis. For Millennials and others, it is a selfie and Instagram paradise. Visitor fashion is also much on display. I spent time with only 3/4 of the offerings and it was pretty astounding. I'd like to be more critical and not be in such awe, but I am humbled by what has been accomplished here.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice museum for kids, teenagers and adults.", "This is a great museum for kids. You won't have to worry about the kids being noisy. Them touching things, or them getting board. The teenagers will enjoy it because, they can take lots of selfies and explore. Adults will enjoy it because there is so much content that only an adult would see. There is no cost for the museum you can order free tickets or stand it line and wait to get in.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Quintessential and famous modern art", "If you love modern art, pop surrealism, minimalism you should not miss the Broad. This is the most comprehensive collection under one roof."], ["Reviewed 3 weeks ago", 5.0, "Amazing", "My first experience to a museum in LA. Absolutely loved this experience and all of the artwork. We got put on the wait list for the Infinity Mirror Room, worth the 2.5 hour wait. One of my favorite memories from my first visit to downtown LA.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A visit to Broad Museum", "Wonderful museum in down town LA. Went to see Infinity Mirror show by Yayoi Kusama. That was great show> Get your tickets before hand. There are always big lines."], ["Reviewed 4 weeks ago", 4.0, "DTLA Gem", "The Broad is nestled between the Walt Disney Concert Hall and the Museum of Contemporary Art. Both and The Broad and the Concert Hall offer great exterior photo opportunities and the area is close to dining and Grand Central Market.\n\nThe museum is beautifully curated in a modern and clean space. You can start at the top and work your way down through galleries. There are recognizable pieces from pop artists scattered throughout. I would recommend booking your FREE tickets online and visiting during a weekday afternoon if possible, to avoid larger crowds.\n\nThe infinity mirror exhibit has been mostly removed, with a one room still available to experience. There is an option to sign up in advance for a spot in line. Again, if you go in the afternoon or near closing on a weekday, you may be able to nab a short wait time. You are given about 30 seconds in the room once you get through the queue.\n\nThe Broad is a perfect place to visit while you explore DTLA. There is so much to see in the area.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must do for art buffs", "The Broad is simply stunning. It looks amazing from the outside and inside it's filled with a diverse collection of thought provoking and iconic works. The store has some very unique gift ideas too."], ["Reviewed 4 weeks ago", 3.0, "Great attraction for a day date!", "My girlfriends and I attended the Broad while in LA for the day. This place would be a great \"day date\" location since the museum is free (however parking on weekends is not). If you could book entrance online prior to your trip I would recommend it so you do not have to wait in line; otherwise if you don't have pre-booked tickets you would have to wait in line to get in.\n\nWe attempted to go into the infinity room, however the wait was 5 hours long; which we anticipated based on the day we went.. I would recommend attending on a weekday to attempt shorter wait time. All the art pieces are amazing and the range in variety definitely is a plus for all those who are not too interested in art or get bored easily.\n\nThe only thing that was burdensome was the fact that there were staff members literally at every corner or at each art piece. Nothing against the museum or the staff; I completely understand why it is necessary to have workers at every corner to ensure no damages to the art pieces; however it was extremely awkward at times viewing some pieces with a staff member staring at you the whole time. Other than that, the museum itself is definitely worth checking out!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Loved this museum!", "We went about 2:00 in the afternoon with no advance tickets and walked right in. No waiting line. One great feature from the museum - you can go to their website and find a link for regular/hourly updates on how long you have to wait in line to get in as a standby. It worked great. Loved the architecture and found an interesting array of contemporary artists. I highly recommend a visit to this beautifully curated museum.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Awesome place but not worth standing in line for hours.", "The infinity room was great wished I could've stayed longer in it (Only get 45 seconds). Huge gallery of art some stuff is a little weird and some stuff really interesting. Would recommend but isn't a must see."], ["Reviewed 4 weeks ago", 5.0, "unsual art pieces", "Parking\nThere is parking lot and u can validate the ticket with the museum for up to 3hrs. But u still hv to pay after u validate, but less $. I was there about 2hrs, after validation, I paid $12.\n\nWhen u head out from parking lot, make sure to pay first (there is pay machine next to elevator). Insert the white ticket that says \"the broad\", then the yellow ticket that u validated, and pay. If you dun insert white ticket first, and insert yellow ticket, it will say invalidate ticket.\n\nEntrance / Visit\n\nIf u are facing the main entrance of the museum, the left line is for ppl who has ticket, who booked a month ahead, and the right line is for ppl that dun hv ticket. ( the wait can be up to 2 hrs )\n\nI recommend getting the ticket first online. It's FREE and less wait time. If u book 11:30am, be there early coz they will allow all the ppl that book at 11:30am to go in at the same time. Then once u go in, go to the left, and sign up for the infinity room. There is a iPad for registration and there should be a staff to help out if u hv questions. Leave ur name and phone number and they will text u the wait time. Mine was 95 min. 10min b4 your visit to the room, they will text u again so u can head down to level 1. The room is located pretty close to the gift shop. It's tiny and there is water inside for reflection. Make sure u stand as instructed and enjoy the moment. It's rilli AWSOMEEEEEE! Time flies when u r inside so make sure to think about ur pose ahead !\n\nOverall, I luv the experience there. Staff r nice and they try their best to let you enjoy the moment while protecting the projects.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Don't miss it!", "I'm not the biggest fan of contemporary art, but I really enjoyed my visit to the Broad. Be sure to see the Kusama room. (Sign up for it as soon as you go into the museum.) There was no special exhibition she we were there, but there is lots to see in the permanent collection and the architecture is something to see in itself. A variety of artists & styles. We spent about an hour and a half there. You'd need more time if there was an exhibition. The standby line is often long, so book your (free) tickets online in advance and you won't have to wait.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Must see the infinity mirror room", "An amazing collection of contemporary art that is free to visit! Reserve your spot to go in the infinity mirror room as soon as you get there. Even though they said the wait was 3 hours when I claimed my spot, it really was only about 1.5 Download the app to get more info about the art, artists, and building.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "AMAZING EXHIBITIONS", "A lot of modern contemporary art pieces are collected there. It changes throughout the years so always something new to see.\n\nSaw the infinity room there and was just in awe of how much fun that was. Was in standby line and waited 2 hours.\n\nThe inside is very spacious well lit and very modern. Highly recommend visiting.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great small museum in DTLA. Worth checking out.", "Get your ticket online, it's free. It also can save you an hour or two! Great artsy stuff, there's also a small theater upstairs where they screen a short film. It has the balloon dog, the metal tulips, the giant dining room table, the infinity room (might be seasonal) it's quick to see. Not the biggest museum but definitely worth checking out. Parking wise, if you stayed less than an hour, do not put the validation in. It will go from $10 to $15. There are neighboring museums so check those out as well.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great Visit", "Parking is easy under The Broad. It is so well planned when entering, that it is painless. Everyone is nice and knowledgeable inside. It has a wonderful collection and it was easy to see everything. Worth the visit."], ["Reviewed January 21, 2018", 5.0, "Kusama - the Infinity Room", "The Broad is a small, relatively new museum in downtown Los Angeles. The recent Kusama Infinity Room exhibit was a fun outing. Fascinating artist, mirrored rooms and soft sculpture art. The third floor housed Haring, Koons, Basquiat and Lichtenstein among others. Try the rotating sushi bar at Kura for a fun lunch.\nShow less"], ["Reviewed January 18, 2018", 5.0, "A work of art", "I loved my visit to the Broad. It is an architectural gem in Downtown LA that should be seen if you only visit one museum during your visit. It’s compact in scale and free to enter (but book your space in advance online). The modern architecture is an experience in itself but the museum also contains an amazing collection of mid century to contemplate art.\nShow less"], ["Reviewed January 16, 2018", 5.0, "IMPRESSIVE!!!", "I'm not the biggest contemporary art fan. Sometimes I think my 8yr old nephew can do a better job compared to some pieces of \"art\" I've seen, but the Broad is quite impressive! I understand the draw with a long line to enter. Luckily we got advanced tickets to enter during a specified time slot which I highly recommend doing. We parked in their garage and had our ticket validated prior to leaving. The exhibits are on the top floor with quite a large number of rooms. The venue had such amazing pieces of art and I thoroughly enjoyed all of it! This is definitely a MUST SEE & I HIGHLY recommend going!\nShow less"], ["Reviewed January 16, 2018", 5.0, "Awesome space, greatest hits collection.....", "Cool building with a greatest hits collection of contemporary artist, Basquiat, Koons. Nice flow to the galleries, I especially liked rooms where you could see multiple works of Ruscha and Kelly."], ["Reviewed January 16, 2018", 5.0, "Reserve in advance", "If you want to go make sure you have reserved in advance otherwise you will have to wait for two or three hours at least and there is the change that you don't get a ticket."], ["Reviewed January 15, 2018", 5.0, "Fantastic museum for modern art", "Incredible collection which was created by one individuals collection, which makes it even more impressive"], ["Reviewed January 15, 2018", 5.0, "Small but well-appointed modern &contemporary art museum; reservations a must!", "This art museum is well-worth a visit, showing mostly contemporary American artists. Having read a lot about the artists that were there, it was quite exciting to see their works \"in person\" for the first time.\nThe museum is free but the reservation process is exacting: Reservations are accepted beginning on the first of the month of the month before the month you plan to go. As I was only to be in LA for a few days at the end of December, I was on my computer at exactly 11:00 am PST (9 hours difference from home) on Nov 1st, which allowed me to choose my date and time. On the other hand, it was impossible to get a reservation for the temporary exhibit, even following the even stricter, more complicated process to the letter. Check the site on how to get reservations and make sure you are on your computer when reservations open for your hoped-for visit.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Excellent collection, free entrance reserving through the site", "We had some luck with the free tickets on short term availability. Possible due to bad weather the day before but i believe they run out pretty quick.\n\nStanding in line we were informed about the collection and some house rules.\nStaff was very friendly.\nBagdrop right at the entrance.\nShop sells earphones for audiotour.\nCollection was good and modern. We loved the infinity room and the Koons works.\nGood museum for about 2 hours.\n\nWould come here again.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Free activity...Free!", "This is a free admission however be prepared to stand in line. The museum is laid out in a modern fashion and it’s a great place to bring the entire family. It’s fun for all and the modern art expands the mind’s horizons. Parking garage close by and lots of great eating all around.\nEnjoy one of the only free events is this part of town.\nShow less"], ["Reviewed January 11, 2018", 1.0, "Free entrance creates long queue nightmare", "We made a last minute decision to visit LA in December and really wanted to go to The Broad. The museum releases the tickets on the first day of the month for the following month on their website, and the next available date is in Jan 2018. Which means we have to go to the museum itself to queue for their daily limited free tickets.\nNow, all we wanted was to go to the Broad Museum's permanent collection, but because Kusama's Infinity Room was drawing to a close, there was a frenzy crowd trying to score The Broad's tickets to get in to buy tickets for Infinity Room. Museum staff said the queue for the free entrance tickets was already bad but it was a double whammy now, as everyone wants to go into Kusama's Infinity Room.\nWe queued for 3.5 hours to get into the museum on the 3rd floor. It is a nightmare and a waste of time. We wished we left, but because we drove an hour into LA, and parking fee cost USD15, we stayed and continued queueing.\nIs the permanent collection on the 3rd floor worth the queue? No. No. No. The queue and the crowd soured our experience. Plus, there are a lot of people interested in taking selfies of themselves only.\nShow less"], ["Reviewed January 11, 2018", 3.0, "See and compare it to others", "A monument to a wealthy mans ego. Not the Getty or a Guggenhiem. Still an architectural must see. Modern art, not classics. Grand Boulevard is coming to life with this addition next to the Disney. Best of all, its \"free\"."], ["Reviewed January 10, 2018", 4.0, "Funky meets fine art in LA", "A rainy day in LA sent us indoors - “ it never rains in California “? (NOT)\nThe Broad was on our list of must sees and it did not disappoint. An excellent collection of contemporary artists displayed in a clear open high ceiling environment in a building that is itself “fine art” .\n\nReserve ahead for the special exhibits but do not avoid this museum if they are booked - worth a few hours of your day while in LA\nShow less"], ["Reviewed January 6, 2018", 5.0, "Excellent Contemporary art!", "It's unbelievable that the admission is free for such a wonderful collection of contemporary art! However, there is a fee to see the special exhibitions cost. I went on a Sunday morning and the place was packed. It's a gem of a museum. LA doesn't disappoint with their museums. The lines were long - I waited at least 2 hours to get in but it was totally worth it. Work by well known contemporary artists such as Warhol and Jean-Michel Basquiat as well as artists not well known in both 2D and 3D art. The staff were great on answering questions and monitoring the long lines. If you love contemporary art, you will NOT be disappointed even with the long wait to get in.\nShow less"], ["Reviewed January 3, 2018", 5.0, "visited the fabulous Yayoi Kusama exhibit", "beautifully curated exhibit inn a fabulous space. Also visited the permanent collections. lovely gallery and worth a re-visit."], ["Reviewed January 3, 2018", 5.0, "Excellent!", "IF you are willing to stand in line, timed entry is FREE! The exhibits are awesome!! My wife took a picture of me standing next to ten foot table and chairs!"], ["Reviewed January 3, 2018", 4.0, "Contemporary Art", "The museum is of medium size. Easy to navigate as the special exhibit is on the first floor and the \"art\" is on the 3rd floor. Can easily take in this museum in a few hours or less. I mainly went to see the Infinity mirror exhibit, which was stellar. The rest of the art was just ok to me, but I am not much of a Contemporary art fan. I think it is worth seeing and walking around, especially as you can make an afternoon of it by going to The Broad and then to the Grand Central Market to eat.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Tremendous Art Museum for Kids and Adults Downtown LA", "The Broad experience begins from the outside, with a perfect building right next door to the amazing Disney Hall downtown. The oculus breaks what could be a monotonous outside. Get your free tickets online in advance so you do not need to wait in line. No special exhibits when we were there so it was just the third floor permanent exhibits.. Once up the escalator you enter the well lit, cavernous third floor, broken into rooms but all walls do not reach the ceiling so the pattern of natural light is magnificent. Modern/contemporary art is not really my thing, but this is a good representative collection well displayed. Great place to take kids for an introduction to art. Great online free app with lots of information. It is not an all day project, as you can see it in under an hour and appreciate it in under two.\nShow less"], ["Reviewed January 2, 2018", 5.0, "We love this place", "We went to The Broad to see the Yayoi Kusama exhibit. It was awesome. They had a permanent infinity room by Kusama that is amazing. I never tire seeing it. As always the staff is engaging and seem to really enjoy their jobs. It is a beautiful building. It is a great way to spend an afternoon.\nShow less"], ["Reviewed January 2, 2018", 4.0, "Interesting pieces", "Nice museum- not my favorite art pieces. Some of it was a bit too off the wall for my taste. Liked the LACMA better."], ["Reviewed December 29, 2017", 3.0, "Modern art", "Some of the art is better than the other. At least they didn’t have human excrement as part of the exhibit, as we have seen at some other modern art exhibits. Only a golden urinal. There are some works by Andy Warhol. The best part is the building itself. Interesting design, and the lighting makes it even more so in the evening.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Amazing Contemporary Art Collection!", "Love the building, love how you enter, love the galleries and most of all love the art collection. They have an amazing collection of contemporary art beautifully displayed"], ["Reviewed December 27, 2017", 5.0, "The Broad - That’s all you need to say", "We drove to LA for the day to visit the Broad Museum. Unfortunately we did not have tickets for the special exhibit of Yayoi Kusama: infinity mirrors.\nThe lobby was full of an art piece, love transformed into dots m, which were large pink polka dotted balls. It was a fun start to the day.\nWhile the museum has three levels, only level 3 is the actual galleries which have rotating works of art. The first thing that hits your eye is the Jeff Koons tulips, large colored mirrored works which are fun to stand in front of and see your reflection. I have always been a fan of Jeff Koons.\nRight behind the tulips is Takashi Murakam painting, in the land of the dead, stepping on the tale of a rainbow. This amazing work is the longest artwork in the collection, measuring 82 feet long.\nThe exhibit was full of modern art from all over the world. It is designed in such a way that there are 21 small galleries and it is easy to make your way from one to the other without missing any.\nThe first level has the special exhibits, and the gift shop, which is small but full of fun stuff.\nWhile most people take the escalator up from the 1st to 3rd levels, if you’re able to, walk down the stairs in the middle of the museum as they will take you past the storage area and you get to see other paintings hanging waiting for their turn to be shown.\nYou can download the mobile app and audio tour, but you better have headphones to hear it. Otherwise you can buy some in the gift shop, to add to your collection of headphones.\nAll in all a fun day.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Not what I expected...very awesome", "Located near the center of the city, had seen photos of the building and heard how hard it was to get into. We did not book, and arrived around midday (end November - off peak). Spent about half an hour in a queue looking to get in. When we finally made it, very impressive. Modern art, but impressive modern art with collections from around the grove. Took about an hour to go through. Great for teenagers, particularly if they study art. Free to get in - thanks LA!\nShow less"], ["Reviewed December 23, 2017", 5.0, "Amazing contemporary collection", "Breathtaking collection in an outstanding location. This is the one place to go if only one museum could be visited. It takes a while to get in, for free. Check and book advance tickets on line to avoid the queue."], ["Reviewed December 22, 2017", 5.0, "a lot of non-gray", "What is marvelous about the Broad is that most of the visitors are not gray-hairs (like my wife and me). I would say that the average visitor is in their mid-thirties. We took our grandsons there earlier this year. They are 6 and 8. They loved it (we of course kept them away from that one room). The art is what you might call accessible modern. The Broad is absolutely the best thing is downtown LA. It's hard to get a ticket.\nShow less"], ["Reviewed December 21, 2017", 5.0, "The rare vanity museum that is a must-visit", "Eli and Edythe Broad have long been patrons of the arts and other causes in Los Angeles, and the relatively new Broad (rhymes with \"Road\") Museum houses their amazing collection of current art. They are clearly patrons of the highest caliber and collectors of impeccable taste. From Warhol to Basquiat to Koons to unknown and remarkable artists, it presents the Broads' amazing collection in a purpose-built structure that is a work of art itself. Admission is free, but you must book, and those can be hard to obtain. It's worth the effort, though.\nShow less"], ["Reviewed December 21, 2017", 5.0, "The Broad Museum", "This is an absolute no-brainer. Every visitor to LA should visit the Broad if they can. I was last there 12-20-17 for a special exhibition (Yayoi Kasuma - very special show, moving on to Toronto and Cleveland in 2018), but happily visited the excellent regular collection while there. So many iconic modern works. Come. You won't be disappointed. (Schedule tickets in advance if you can, though, otherwise you may need to wait to get in, even on a weekday.)\nShow less"], ["Reviewed December 21, 2017", 4.0, "Free general admission", "My sister and I had to wait in line for one and half hours! It was cold. I understand it is free but we could see the helping people were careless. When we got finally in we were so exhausted that could not pay attention to the details. I gave 4 just simply for the building, architecture and art. The one star less for being 1 1/2 hours in the line. They could manage better.\nShow less"], ["Reviewed December 17, 2017", 3.0, "Cool building, exhibits not for me", "The building itself is very cool. The art exhibits are not what I enjoy. I went once, and that was enough. No need to go back."], ["Reviewed December 15, 2017", 3.0, "Permanent collection is really just art by the acreage.", "The lineup for the Kusama temporary exhibit was just too long, but I did get a chance to spend a couple of hours touring the permanent collection.\n\nI really couldn't fathom why Eli Broad would collect pieces of art that were all so gargantuan. It really seemed to me IMHO that he was buying art by the acreage to wow and impress rather than acquiring more important and reasonably sized pieces.\n\nBased on the buzz of the Kusama exhibit, I would definitely suggest a visit as it is one of only four venues in N. America to have the privilege of displaying it. However I would not encourage folks to go out of their way to see the permanent collection, especially since the Getty, MOCA, and LACMA are all nearby.\nShow less"], ["Reviewed December 14, 2017", 5.0, "Loved movie night", "Enjoyed the off beat movies the night we attended. Viewing the Narsisister shorts was quite an experience. The mirror room was also worth a visit."], ["Reviewed December 10, 2017", 5.0, "Great Culture in LA", "A day of culture for the family. Child 1 is an art student at uni so knew some of the artists which was great to see. Fantastic exhibition. Something for everyone"], ["Reviewed December 9, 2017", 5.0, "Great Collection as well as Kusama", "I’ve visited the Broad twice and both times was able to see the Kusama infinity mirrors. The permanent collection is amazing if you like contemporary art and the building is fantastic. The Kusama show was not as extensive as in Tokyo’s National Gallery this past spring, but the infinity mirrors were amazing. The only complaint is the short amount of time you are allocated to see them but is certainly understandable.\nShow less"], ["Reviewed December 9, 2017", 2.0, "Takeover from Instagram", "While art should be accessible to the masses, it also should be respected. Unfortunately, with free admission, the masses pour in not to enjoy the work, rather to model for instagram. The noise echoes off the concrete floors and the amateur models stand in front of sculptures as an accent to their physique.\n\nIf you want to enjoy art, walk to the other side of the street to the MOCA.\nShow less"], ["Reviewed December 6, 2017", 5.0, "The Broad - Yayoi Kusama: Infinity Mirrors", "This review is about The Broad, in specific to the Infinity Mirrors exhibit by Yayoi Kusama. It was AMAZING! We went on opening day (there was a huge line, only downside if I had to pick one was waiting for each exhibit)\n\nOverall it was a great experience for my girlfriend and I. The exhibits ranged from Infinity exhibits & installations to paintings and photo. Each Infinity exhibit is timed for fairness and to prevent groups from setting up photoshoots. Other exhibits are not timed and you're allowed to take photos and what not.\n\nWould definitely recommend! Not just the exhibit but The Broad in specific!\nShow less"], ["Reviewed December 6, 2017", 1.0, "Nothing to feel here, better pick something else", "I came here hoping to experience something. Feel something. The land of Hollywood, Disneyland, etc.. I was expecting something goofy, uplifting, interesting... I was expecting to be moved in some way.\nThe 'art' here is very fixed, boring, non-interesting, soul-less, heart-less, I didn't feel absolutely anything. The more I walked around hoping that this is all some misunderstanding - why would anyone want to show off this? I do sound like a snob, but the thing is I don't even go to museums often. And sometime I don't like them, but at least I feel the artist wanted to express something. In this case, consider it as a perfect, magazine you bought in the store... Nothing personal, everything 'perfect', nothing moving, nothing coming from the heart. I felt desperate to feel something, so I was left with only my desperation. Alright, getting too poetic now, that's it!\nTry Getty museum instead - even if you don't like any of the shows (there's many) you will love the scenery and the view! It's also free.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Yayoi Kusama Exhibit was great, but so was the permanent collection", "We stood in line for hours for the special Kusama exhibit. It was worth the wait, but for those who don't like waiting, the permanent collection is really great, and admission is free. The building is an architectural gem."], ["Reviewed December 2, 2017", 5.0, "Enjoyable Afternoon in a Modern Art Wonderland", "A friend and I visited The Broad, and it was a great experience. We went in the early afternoon, so we had to wait in line for about an hour to get in. The time passed quickly, but if you don't get there when it opens, or at an off-time, bring a book, or better yet, a friend with whom you'd like to talk. It was a sunny day, but we were mostly in shade when we stood in line, but there were some volunteers handing out loaner umbrellas to those people in line who were in the sun.\n\nI really enjoy looking at art, but often don't like museums. I can be overwhelmed by a museum like NYC's Metropolitan Museum of Art, for example, because it's so large and has such a diverse collection. Plus, some museums can be stuffy (I'm talking air quality, not attitude) and uncomfortable. The Broad seemed to be just the right size for me (not too much, not too little) and felt fresh (again, air quality and light), so I didn't feel like I was boxed in for most of a day. I also particularly enjoyed the windows in the main stairwell that allowed you to see the infrastructure/storage \"innards\" of the museum.\n\nThere were many works from modern art's most well-known artists: Warhol, Rauschenberg, Lichtenstein, Kruger (Barbara Kruger can not be celebrated enough for my taste!), Koons, etc., but I very much enjoyed seeing works from Malcolm Morley, Mark Tansey, Kara Walker, Mike Kelley, and especially Tauba Auerbach. I had unknowingly wandered into an exhibition of Auerbach's work in NYC a while ago, and fell hard for her lyrically mathematical style, so I was particularly delighted to see something of hers at The Broad.\n\nThe Broad is free to all, but I did spend a lot in the gift shop. Be prepared to be inspired to spend!\nShow less"], ["Reviewed December 2, 2017", 4.0, "Nice Art work", "This museum is pretty trendy and offers nice art work. I was a little bummed that we weren't able to see the lights exhibit as you have to reserve those tickets in advance (which I knew). I thought that maybe we could get lucky and get in the day of but they were sold out for the entire exhibit. You can see this entire museum in under an hour as it's not very large.\nShow less"], ["Reviewed December 2, 2017", 3.0, "Reserve a month ahead for your visit, online. Don't get caught in the crazy lines!", "This museum is all about the online reservations. Had I planned way ahead, I would’ve reserved tickets to the museum (if not the exhibit) in October. But I didn’t, and clearly, that didn’t stop me. I was determined to see the exhibit and museum. A tall order, I now know that.\n\nSo, we went and stood in the stand-by line like the rest of the impromptu folks – also known as the last-minute, spontaneous, hopeful, museum visitors-turned-wait-experts.\n\nI did plenty of research online before going, but it was difficult to determine what the lines would be like. Previous museum goers warned that lines would most likely be longer over the holidays and weekends, but I wished and hoped and prayed most people would be Black Friday shopping. (Damn you, Amazon. No one in L.A. was Black Friday shopping because they were all in line for The Broad.)\n\nMy mom and I showed up at 8:45am. We were able to easily park in the lot in the building – most of the parking is tandem so you’ll have to leave your keys with the parking attendant if you’re blocking someone.\n\nParking is $22 but you get $10 off if you get your ticket validated. I paid the full $22 because my validation ticket didn’t work.\n\nPaying the full $22 was the grand finale to a very full day in line, after waiting for almost four hours. That’s right! One, two, three, four… I’m still in line.\n\nWe went because we wanted to see Yoyoi Kusama’s Infinity Mirrored Room, which looked beautiful and worthy of a selfie while in the exhibit, but definitely not worth waiting in line for four hours. Periodically, a Broad staffer would come out, and do a count of the stand-by line. They’d come out in pairs, and this would cause people to straighten up and pay attention, as if somehow their mere presence would magically move the line faster.\n\nThe line was going around the block, and I’m guessing there were probably 350 people ahead of us. When we were finally almost at the front, one of the museum staff members came out to let us know they had run out of tickets for the exhibit. The woman behind me went ballistic, asking why they waited so long to give the final count and there better be a freaking manager she could speak with. I should also mention that it was around 1pm by this time, and for the lucky last people who managed to get tickets were asked to come back for their “appointment” to see the exhibit at 6pm. A whole five hours later! But people didn’t even blink. They just eagerly nodded and handed over a credit card to pay the $30 entrance fee for the exhibit, which is going away after Jan. 1, 2018.\n\nWe got tickets and then… we were directed to stand in another line so that we could enter the building. Only in L.A., people!\n\nNow that my expectations were tainted with the 240 minutes I had spent in line, my judgement of the artwork was extra critical. I won’t lie, I was still excited to go inside. It was mostly modern art, and there were a few cool things, like the giant table and chairs, and a huge mural created by Japanese artist Takashi Murakami.\n\nThe museum is really small. You could quickly go through it in about 20 minutes. I think we purposely stayed an extra half hour just shuffling around to somehow justify all that time we spent in line.\n\nAlso, the line was shaded because it was nestled between the side of the museum and the Walt Disney Concert Hall across the street. Only the front of the line was sunny, but they provided umbrellas for (Asian) patrons to avoid the harsh L.A. sunshine. So, it wasn’t like we were sweating in line for four hours. Had that been the case, this would’ve been a very different story.\n\nPS - Even if you reserve tickets online, you still have to wait in a separate line to get in. It's faster than the stand by line though.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Great Museum", "The Broad is a grand new museum. They have a great permanent collection and they bring in excellent large scale single artist exhibits.\n\nThe exterior architecture is nice but the interior design is awesome. Go up to the top floor and study the lighting and how it enters the structure. You will be amazed.\n\nAt least now, in these early days, the lines are long. This, even if you have reservations. And, by the way, you MUST pre-buy your tickets and have reservations or you may wait in line a very long time.\n\nDo you want to know a secret? If you have a reservation you will still have to stand in line. Get there ten or fifteen minutes after your reservation and you can walk right in.\n\nOverall great place to see great art! Recommended.\nShow less"], ["Reviewed December 1, 2017", 5.0, "Stunning Building. Amazing Art Work!", "The Broad is so experiential and contemporary! Set next door to the iconic Walt Disney Concert Hall, the Broad is one of the most beautiful buildings ever. Their stunning art collection with Jeff Koons, Takashi Murakami, Andy Warhol and other amazing artists is just amazing."], ["Reviewed November 28, 2017", 5.0, "Outstanding temporary exhibit", "The Infinity Exhibit is supposedly a harder ticket to get than tickets to Hamilton --- it is quite unusual (unique really) but not something one needs to \"kill\" to see. That is, it is a powerful experience but if you miss it you won't be \"bereft.\"\n\nThe museum itself is housed in a gorgeous building and if modern art is your cup of tea, please go! The parking lot is well staffed (as is the museum itself) but the self-pay machine is totally confusing if you have obtained a validation while visiting the museum -- drove me crazy until a staff member came by to help.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Fun and Free!", "The art starts outside with the humorous and inspired grass nodes pushing up through cement envelopes. Love this free treasure trove of contemporary art so generously shared with us all by the Broads!"], ["Reviewed November 26, 2017", 5.0, "Amazing", "Not akways a fan of contemporary art but wwe can't wait to visit again. Thebuilding is gorgeous. The exhibition spaces are a perfect setting fpor the stunnign works. Excellent curation as well."], ["Reviewed November 22, 2017", 5.0, "Fabulous surprise", "I have been to many world class museums . This is an extraordinary world class collection of works . Reminded me of Bliboa, Dia Beacon, Whitney Downtown NY, and the Moma . I loved it . One of the highlights of my trip ."], ["Reviewed November 20, 2017", 5.0, "Incredible Contemporary Art collection!", "The Broad has amazing contemporary art housed in an amazing contemporary, purpose-built building. I loved it even though I am not normally a fan of contemporary art. Admission is free but you must book tickets well in advance. Across the street from the Museum of Contemporary Art. Make a day of it an visit both. You won't be sorry.\nShow less"], ["Reviewed November 15, 2017", 4.0, "If u love art u will love this place", "I went with my husband he wanted to go so badly admission is FREE & parking is. $8 if u get it validated by the museum on your way out. We parked behind/under the museum.\nHe loved it I didn’t really like it I thought it was boring but that is because I don’t really like art. The one cool thing I saw was the life size dining table pretty cool!\n\n\nI’d recommend if you love art or want to spend a very cheap day out in LA. Don’t forget to book your tickets ahead of time they get full fast.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Breathtaking", "Great exhibits. Free. Worth the visit if you’re true lover of art. Located downtown across from The Colburn School. Remember to get a parking validation for the garage parking discount."], ["Reviewed November 10, 2017", 5.0, "So many classics I never expected to see in person!", "An amazing collection to see in person if you enjoy modern art. On display at the moment are famous works by Jeff Koons, Andy Warhol, Keith Haring, Basquiat, Cy Twombly and many others. Many you'll immediately recognize and accept as art, and a few may have you scratching your head, but it's intellectually enjoyable to be confronted with the question: What's art?\n\nAdvance bookings are highly recommended, and in fact 100% neccessary to see the special exhibition on the first floor and get more or less instant access to the free collection on the 3rd floor. I speak from experience: I was one of the dolts who didn't book in advance and stood in line outside for over an hour to get one of those free admissions.\n\nLines form early so if you avoid my advice, plan accordingly.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Enjoyed This Museum!", "The third floor of this museum is \"free\" but you must book tickets in advance. The pieces are arranged nicely and spread out so you can enjoy each room but do not feel overwhelmed with \"art\" everywhere. Plus the exhibit cards are well written and the staff is very knowledgeable if you have a question, which is unusual in museums!\n\nThe Mirror exhibit is amazing. In the morning we noticed the line was extremely long but when we walked by in the late afternoon no line at all and we were able to get tickets for a time slot an hour later.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Surprise around every corner", "A beautiful building filled with surprises. My favorite place to see contemporary art. Go early to avid the crowds and book so you can skip the line."], ["Reviewed November 9, 2017", 2.0, "Hugely Disappointed", "We went here purely for the infinity mirror which I thought was very cool, we got free tickets in advance, got there in time and straight in the queue and ended up going to see the mirror room after about 20 minutes which i was fine with as I understand everyone wants to see it. It's a shame you cant spend longer in there but it makes it fair for everyone.\nOther than that I thought the museum was very poor, I understand different people have different views on art, but there was a brush painted gold that i could do in my back yard. There was other random objects that were just very poor. One or two cool things like the balloon sculptures but not a lot that did it for me.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Cool place and it's practically free.....", "Small museum but cool exhibits. And it's free. Be sure to reserve your free tickets in advance so you don't have to stand in line and your entry is guaranteed"], ["Reviewed November 7, 2017", 5.0, "I love the arquitecture of the building", "Great location you feel LA deep modernity, in downtown exhibition is good! Permanent or new expos super worth it! If you book in advance online easy acces! Parking in California center with validation is the best! You have market close Japan and China town near!!! Don't miss it is part of LA BEAUTY!\nShow less"], ["Reviewed November 6, 2017", 5.0, "Absolutely Stunning Structure", "In the heart of downtown Los Angeles close to the Disney Music Center and close to other downtown attractions- Interesting exhibuts but reservations required."], ["Reviewed October 31, 2017", 3.0, "Small, overhyped, not Art", "I decided to check out this museum based on all the hype and marketing. Well, having seen the best museums in the world, I was far from impressed by this one. While the building is very interesting from the outside, inside it's very small, sparsely displaying \"art\" pieces that are super modern and can be hardly described as \"art\" (junk stitched together, magazine clippings glued together, neon sign etc).\nAdditionally, you have to get free tickets months in advance, stand in line among a bunch of teenagers, and once inside try not to lose your patience among the same hordes of teenagers taking selfies.\nThe special exhibit may be worth a visit, however on the day it showed 7+ hrs waiting time. Are you kidding me? They make you log on an ipad as soon as you get in, and it will tell you how long of a wait there is for the special exhibit. Everyone must have decided to skip it and go home, because those 7+ hrs turned into 2 hrs, so I decided to go back and have a look at the \"Infinity Mirrors\". You have to stand in line again, until you enter this room (one person at a time), and you can be inside for a maximum of x seconds, until the museum attendant opens the door again telling you to come out. Now, nice mirrors and unique concept for sure (better than the junk stitched together), but had I waited 7+ hrs just to be in a room for x seconds, I would have been pretty upset.\nAll in all, a pretty disappointing experience.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Interesting building and interesting artwork", "The Broad as a contemporary art museum, the building is just as interesting as their art collections. I feel the structure is the collection of eyes together to see through art and the world. I recommend to join some guided tours when visiting the museum. You will learn the life of those artists and understand more their artwork.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Totally worth planning ahead to reserve a free ticket", "Yes, the ticket even for the general admission ( let's not even talk about the tickets for special exhibit)is hard to score. The reward is you get to view some delightful modern art in a well design , interesting space. Small enough that you can walk around without walking the marathon distance.\n\nYou just need to reserve online the second the advanced tickets become available ( see website for current policy). You can try same day standby. The lines are long.\n\nShow less"], ["Reviewed October 23, 2017", 5.0, "New, fun and fabulous!", "The Broad is a do not miss. Wonderful vibe, wonderful art. And it's free! Just go online and get your tickets ahead of time."], ["Reviewed October 18, 2017", 2.0, "It would have been nice but..", "The problem with this museum is that is so famous and good that all the people from all over the world want to go there.\n\nThe ticket is free and this is a nice thing but bring a lot of people also that are not interested to go there just because is free.\n\nThey have few spot for people that want reserve in advance the entrance and a long queue for first come first served (line time 3 h when I was there).\n\nThere is not a way to pay to get there without queuing! I wanted to pay so badly to avoid 3 h of the line under the hot sun.\n\nBut the Museum was nice at the end.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Worth a visit even if you do not go in........", "The building is beautiful and whimsical from the outside. Walk around it.\n\nOn the plaza to the south of the museum are fifteen 100 year old Barouni olive trees that were transplanted from northern California. If you ask the guards they will lie and tell you they were transplanted from Italy. Walk through the grove and sit down for a spell and ponder the accomplishment of what they did here. It is perfect.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Wonderful Visit", "Great place to spend a few hours. Interesting collection and space. Needed more time so will be back."], ["Reviewed October 11, 2017", 5.0, "Broad is good", "The Broad is not a big museum. But it has every kinds of art inside. Breathless and enjoy to see each masterpiece. Worth to wait outside if you don't have reservation."], ["Reviewed October 9, 2017", 5.0, "Short and sweet", "This museum is on the smaller side, sure - you can wrap it up in about 2 hours (and stay a bit if you want to see the traveling exhibit). With that being said, the collection of modern art is really inspiring. Had a wonderful time, so glad I made reservations ahead of time.\nShow less"], ["Reviewed October 6, 2017", 4.0, "wonderful art collection", "because it's free you have to go online to get tickets. there is a standby line. i was lucky enough to et a ticket last minute right when it opened. sadly, the special exhibit was closed and we could only look around the 2nd floor."], ["Reviewed October 2, 2017", 3.0, "Cool art museum with some interesting pieces but limited display", "Went here with the family to see a special exhibit and went through the whole museum. We went specifically to see Yayoi\nKusama Infinity Mirrors. To see this you need to get a separate ticket with a time on it and then come back at that time to line up to see this. It worked well and since my wife is good at managing this sort of thing we had it all arranged. As soon as possible I took off with the kids to explore the museum. I enjoy seeing things like this with the kids as they have a very fresh approach. The museum is cool and the pieces on display are interesting but to be honest we were done in about an hour and then after our 1 minute in the special exhibit our total visit was not very long. I am assuming that they have a limited display area and a lot more works on storage but I felt a bit let down by the limited amount of art on display. I was also a bit let down by the trendiness of the art. I know that the collection is what it is but felt that people were there to see a couple works by some famous modern artists and take selfies with them and that was the depth of the experience. I did appreciate some of the docents in the rooms who took a moment to talk with us as provide a small insight. My kids while not big museum fans do get art and do talk about it so they could have benefited from more curation. Funnily, they didn't get some of the more famous works and enjoyed some of the more obscure ones a bit more. Worth going to but don't expect more than a couple hours here.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Visit to the Broad", "We visited and with free reservations walked right in past the \"non planners\" waiting and wasting time in line. Museum is spacious and has mostly modern style painting and sculptor. If you want to see the Masters, this is not the place. Interesting."], ["Reviewed September 30, 2017", 5.0, "Spectacular", "The Broad is put simply just an amazing cultural experience. It contain an amazing collection of modern art, drawn from the private collection of the Broad family. Only opened about two years ago in a spectacular building it's also free. The art is just superb with amazing work by Warhol, Twombley, Koons, Kelly, etc. A must if you love modern art.\nShow less"], ["Reviewed September 29, 2017", 5.0, "Great museum", "As we could not get on line tickets for this attraction we had to queue for couple of hours to get in. However, it was a worth while. The gallery is small but engaging with very nice selection of modern art. The infinite mirror is the highlight of the place.\nPlan yor visit as other interesting places ie Walt Disney Concert Hall, historical architectural buildings, central market are nearby.\n\nHighly recommended for art lovers.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Wonderful building, great modern art collection.", "Through timed ticketing The Broad controls the number of people in the galleries. This makes for an enjoyable art experience. Sign up for their app to hear curated descriptions. Small but fine store. Infinity mirrors is a MUST."], ["Reviewed September 25, 2017", 5.0, "Book in advance (free), talk to the docents, and make a Grand Ave tour", "Remember to book in advance for a free timed entry ticket. Can't get them at venue except in standby line in the morning.\n\nVisited with 15 and 11 year olds who usually don't like art galleries. The Broad was different enough, small enough and engaging enough to really interest them.\n\nTalk to the docents. They are very approachable and knowledgeable.\n\nYou will only need an hour but do some research and you easily have a \"Grand\" day around the Broad with other nearby attractions - Disney hall, architecture, markets etc...\nShow less"], ["Reviewed September 22, 2017", 5.0, "Great pieces to explore", "I really enjoyed The Broad. Plan in advance to get the free tickets makes it so much easier. I wouldn't have wanted to wait in the stand by line. Some great pieces and more than just paintings. I would go back."], ["Reviewed September 16, 2017", 5.0, "An Art for your senses.", "A modern state of the art museum which one must find time to visit when in L A. But remember to book your visit in advance ! Queues are long and admission on arrival not certain. They were kind enough to accommodate us on a two day notice ! And what a treasure of contemporary art was there to behold ! The ongoing exhibition of Infinity itself , was worth the visit. Do go there !\nShow less"], ["Reviewed September 15, 2017", 3.0, "Mixed bag of contemporary art", "Collection that shows the personal choices of a Los Angeles couple - often consists of the must-haves of what was hot in New York from the 60s on. The result is a mixed bag. The building is new and entry free, although often with a long line.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Awesome location and great special events", "The Broad is a wonderful new museum. Better to get the special tickets when shows are there or - if you are a non-local you might not get in. The owner has a fab collection which you get to see a part of. And the location is really fun.\nShow less"], ["Reviewed September 13, 2017", 5.0, "To Infinity and Beyond", "The Broad is a small museum, but what it lacks in size, it makes up for in beauty, architecture, and a long wait to get in!\n\nI jest a little, but be prepared for a long line if you're waiting standby. There are tickets, but you must reserve in advance. We waited about 45 mins in standby with a toddler in a stroller. I would bring a bottle of water if you have to wait. The museum took us about an hour to view. By the time we viewed the museum, our tickets for the infinity room were up and we very much enjoyed that experience. You're only allowed about 45 seconds in the room, but it was quite a finale for the day!\n\nIt's is free to get in to the museum, but the downstairs parking garage is $4 per 15 minutes unless you get validated at The Broad- $12 for 3 hours, quite a difference between potentially $48 for 3 hours. Note that every 15 minutes after 3 hours is taken at the $4 rate.\n\nHave fun, enjoy The Broad, see the Disney Concert Hall next door, take a few selfies!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Modern Contemporary Magic", "Since it's opening in September 2015, I have been back several times. Tickets are free on their website, unless it is for a special exhibition & then charges may apply. I enjoy how the collection rotates so each visit there are new discoveries. The Infinity Mirror room is great and perhaps my most favorite installation has been Ragnar Kjartansson's The Visitors. This museum is an LA gem with a location close to Grand Cedntral Market so it makes for a fun staycation day!\nShow less"], ["Reviewed September 12, 2017", 5.0, "my fav museum in LA", "if you like contemporary art this is the place to go. Kusama exhibition was breathtaking. the building itself is also a piece of art. highly recommend this place. even more than LACMA or MOMA"], ["Reviewed September 11, 2017", 5.0, "Inspiring, beautiful and treasure to enjoy!", "We did not have tickets but got in with a 10 min wait on a Friday afternoon. This museum is amazing. The collection is so thoughtful, the lighting is amazing. The museum is not huge so you get to enjoy everything in 1-2 hours. Make reservations if possible. This is a museum not to miss!\nShow less"], ["Reviewed September 10, 2017", 5.0, "Kept my 14 year old engaged", "I took my anime obsessed 14 year old daughter to The Broad. She was completely engaged. She kept posting pictures to all her followers but she seemed to really understand intuitivly the intention of the artists. When she didn't she would ask a VSA. They are amazing. They're enthusiastic and knowledgeable. My only issue with The Broad is the printed text describing the intention of the artist. It seems written for a PhD in philosophy. It would be more helpful if the copy were more accessible. It would be better to let some of the young VSA's take a crack at writing the label copy.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Free DTLA Contemporary Art Museum ... so worth it!", "Our party of four booked our reservations in advance on August 1st at noon to visit The Broad Museum on 9/9/17.\n\nWe parked in the structure on 2nd & Broadway which is attached to the museum for $12 all day parking (since it is a weekend, otherwise we would need validation). We took the elevator up and got in the reservation line, not the loooong standby line.\n\nWe stood in line at 12pm to wait to get in at 12:30pm. Our objective was to get in asap. Immediately after entering the museum we turned left and walked about 30 feet towards the gift shop to find the famous Infinity Mirror Exhibit kiosk. This isn't really a kiosk, it's an iPad on a stick. Anywho, there was no line to sign up and we got our queue to line up for the room in 523 minutes. We projected that we would enter the room by 5:50pm. Since the museum closes at 8pm on Saturday, we were excited that we guaranteed our spot into the highly anticipated mirror room.\n\nNow for the art. Everything here is art. The building itself is art. The hallway leading to the 2nd floor and down to 1st floor are art. Some call it an instagram playground but if you take the time to observe and read the details for the photos and art works you'll really appreciate the depth going into each piece. You easily spend 45 mins to 2 hours there. There's quite a lot of work to see. I have to admit I had a fan girl moment when I saw some of Andy Warhol's works. The art rotates as you'll notice there is a huge storage in be basement of more artwork that isn't being displayed.\n\nNow clearly, my friends and I were not going to wait until 5:50pm for the Infinity Room so we walked about less than 10 minutes to Grand Central Station for lunch. Before we knew it, we got a text that we were going to be next for the Infinity Room which is 2 hrs earlier than expected. Note that a lot of people cancel. Unfortunately, the link they texted messaged us to check on the queue wasn't working. The museum was very accommodating when we texted our reply that we would be 5 minutes late as we had to rush back to the Broad.\n\nInfinity Mirror Room. You can go solo or win another person. But you don't get to clump your 45 seconds together if there's 2 people. It was pretty and everything I imagined. I had my phone ready before I went in and took quite a few photos. I even had 15 seconds left over. It goes by quick but it's plenty of time.\n\nWas this adventure worth it? Absolutely. I appreciate the arts and the fact that this free to the public is amazing. If you have the time to book in advance it'll make all the difference.\n\nAlso compliments to the staff and how well organized the layout of the museum is handled both inside and out. Everyone I spoke to was very friendly, approachable and willing to answer any questions.\n\nMust see when in LA!\nShow less"], ["Reviewed September 9, 2017", 1.0, "Confusing!", "This place maybe free, but it's still not worth your time! It is not well organized and definitely BORING!"], ["Reviewed September 7, 2017", 5.0, "Get Free Tickets in Advance", "This is a relatively new (2 years or so) museum that houses an amazing collection of contemporary art. The building itself is a piece of art work itself. Order free tickets on line and show up on time. Parking is not free but it balances out the free admission. The gift shop is great too. Very attentive and helpful staff. Do not miss the Broad. Downtown LA.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Free Modern Art Museum", "The Broad is a free museum located in downtown Los Angeles close to the Disney Music Hall, the Superior Court, the Opera and the Music Center (all easy walking distance). You need reservations, often months in advance. The Infinity Room is a must-see - you get 45 seconds in a mirrored room that has hanging lights and is a blast. Reservations are separate for that exhibit, and cannot be made in advance but must be made at the museum when you arrive. We were able to slide in at closing time, because otherwise we would not have gotten into that exhibit.\n\nThe museum has a lot of modern art that used to be at the Los Angeles County Museum of Art, including Warhol's Elvis, Lichtenstein's \"I'm Sorry\" and others, and a decent number of Koons sculptures. You don;t need more than 1-2 hours.\n\nParking is $12.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Best Collections", "One of the best museums i've ever been. My visits to this place are always smooth and yes i've been here more than once since i always company my friends from other country to come here. I always plan a head by downloading their app and keep checking the ticket availability before going to sleep, after waking up and any other 1 minute time you can spend to check the tickets LOL. Well it's better to do that rather than waiting in a line outside for hours. To be able to get inside The Infinity Room for free before October, you definitely need to book tickets as early as possible before noon, it's already fully booked for September but sometimes some people release their admission tickets cos they're not able to go so keep checking. The store on ground level has many unique items including items from Andy Warhol. All the collections are very nice...that's the reason why i love visiting this place. It's worth all the efforts.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Good date location", "I went here and enjoyed all the contemporary and modern art that was displayed. it was very easy to reserve the free tickets that they offer online. the only downside is how complicated it is to reserve a viewing of the infinity room."], ["Reviewed September 4, 2017", 5.0, "Outstanding attraction", "Plenty of positives for this Museum -- wonderful art, helpful interpretive information, pleasant environment. It's crowded so you definitely want to book the free tickets in advance of your visit and try to get in at an early time if possible. We got in at the 10:30 admission group and immediately signed up for the Infinity exhibit (it turned out to be a 2 and 1/2 hour wait but the texting and auto queue information let's you tour the museum while your queue spot is protected. The bathroom on the first floor is quite small, larger ones are on the second floor.\nShow less"], ["Reviewed September 4, 2017", 5.0, "A Very Cool Museum and Free Too", "Tickets are free but you need to reserve them in advance and get an allocated entry time.\n\nThe museum is not very large and the collection is eclectic but provocative and fun at the same time. Took us about 60-90 mins to see everything. Only thing we could not see is the infinity room, you have to queue for that separately.\n\nEnjoyed our visit and appreciate Eli Broad's gift to LA.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Fantastic and an Eclectic Collection of Art", "You can book tickets ahead and avoid waiting in the line\nFYI, the ticket to the museum doesn't include entry into the infinity mirror exhibit.\nFor that, your best bet is to reserve first slot when you book advance tickets and then get there early and reserve your name for the infinity mirror exhibit\nShow less"], ["Reviewed August 30, 2017", 5.0, "Loved the Fun Exhibits", "My daughter got us timed tickets to be admitted. We enjoyed seeing the fun exhibits such as the giant chair and tables, the blue dog, the crazy paintings and displays. We also signed up to get into the Infinity Room. You get in line and sign up on an iPad. We were told the wait would be 600 minutes! Yikes, but the guy working there said it's usually half that time and they send a text to let you know it's almost your time. We left The Broad after seeing the exhibits and went back to our hotel. We did get a text and were able to quickly take an Uber back and were allowed right in front of the line because we had the text on our phone! The line was not long, maybe 10 minutes. Everyone is allowed to go in by themselves or with someone else for 45 seconds. A girl stands by the door to the room and times it exactly. While everyone else was in the room, the 45 seconds seemed long, but when it's your turn, believe me, it goes really quickly! Yes, everyone we saw came out and immediately looked at their phone to see if they got a good picture. I mean, really, enjoy the moment! ha ha. I, of course, took a photo, but within the first few seconds so I could truly look around in awe when in the exhibit. Don't be married to your phone and miss the actual moment! It is amazing to stand there in the room alone and just look around in wonder. I would definitely return to The Broad for future exhibits or just to spend more time seeing everything I missed the first time.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Should not miss if in Los Angeles", "One of the world's best and biggest contemporary museums in the world. They have a rotating collection. The place isn't huge but the artworks are incredibly awesome. If you don't have a ticket, just come very early and fall in line to enter. Something worth doing while in Los Angeles.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Fabulous small gallery", "Eli Broad has amassed an amazing collection of contemporary art and housed it in a spectacular building -- a quick visit but well worth it except for the Mirror Room which had a four hour wait to visit it -- needless to say, we didn't hang around!\nShow less"], ["Reviewed August 29, 2017", 5.0, "Great collection that is always changing.", "Book your tickets well in advance - they're free and for a specific time - as opposed to lining up and waiting hours to 'walk in'. As well, the longer you wait to visit during the day, the longer your time will be to see the special exhibits.\nShow less"], ["Reviewed August 29, 2017", 5.0, "One of the best free museums I've ever been to!", "One of the best LA attractions and close to so many other great places. Be sure and walk around the Disney Theater and go inside if you can, even just too see the lobby if you can't get inside hall."], ["Reviewed August 28, 2017", 5.0, "Book it online FIRST!", "We have planned a relaxing last day in Los Angeles. Took our breakfast and drove to the car park nearby. Saw the long stand-by queue at the entrance... So, we went to take pics of the Disney Hall first. once we got back, the queue was still very long, so we queue up at the end. it was 3pm. and we became the 2nd last of the line while they stop people from queuing! very good and patient security guard who can gently refuses people from queuing. Not an easy job for him. It is free entrance, but they have audience quota for the whole museum. So, don't expect that you can go in as you like. you have to wait till your turn! Better to book your entrance tickets online in advanced. No kidding. Otherwise, you will have to queue for more than an hour to be in! But the ART inside worth the wait!!!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Wonderful Museum", "One of the most beautiful museums I've visited in my life. The collection is stunning, so many of my favorite artists under the same roof. The exhibition is extremely well organized, with great space between each piece so you can appreciate every single work of art without people getting crowded. Love it!\nShow less"], ["Reviewed August 28, 2017", 4.0, "More than just impressive,its masterful!!", "Probably L.A's second most popular museum,next to the Getty center.One of many free museums to visit here.Worth a visit,make sure you get your reservation online before planing a trip here.The art,the scupltures.the atmosphere,everything about this free museum,makes it a must do,when you are in town in L.A.Dont go before visiting this impressive museum.A tip,Take many pictures but don't get too close to the art and sculptures.Securiry walks all over the place,making sure no one touches anything.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Great museum", "Small, but neat museum with one-of-a-kind pieces. Really have to book a time slot in advance as it can get really crowded."], ["Reviewed August 27, 2017", 3.0, "Long lines, book in advance, worth a visit if in the area or a fan of Warhol and Lichtenstein...", "One of L.A.'s newer modern art museums - on Grand Avenue - across the street from the Disney Performance Center. Worth a visit if you're a modern art or architecture fan, or in the downtown Los Angeles area. Book several months in advance - otherwise - will need to line up - up to 1 1/2-2 hours (in our case) - in the scorching heat - but they provided umbrellas. Good collection of Roy Lichtenstein and Andy Warhol pieces. The building itself was quite remarkable - so, great place to take photos. Visit the Disney Performance Center or LA MOCA (Museum of Contemporary Art) - literally across the street - but all on Grand Avenue. Take a drink, snacks and something to do - if you haven't booked in advance.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Excellent", "Founded with the Broad's family collection of contemporary art, this museum is NOT to be missed. The top (third) floor highlights (and rotates) some of the family's personal art collection. Other spaces contain visiting and temporary exhibits by others. What is nice about The Broad is that it is NOT overwhelming. It is \"open\" and spacious, and comfortable so you can \"take it all in\" without getting tired. It's also in a great downtown LA location, near many other noteworthy attractions.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Nice museum", "It's free to visit the museum just need to make online reservation. Just the building itself is worth the visit. Nice collection of contemporary art pieces. Too bad the mirrored room is full. They should make it available for booking online as well. The museum shop is amazing with lots of unique and limited edition items.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Impressive!", "The art work that is displayed within the building is just awesome. Visit this place if you a chance. You can easily spend 3 hours and not get bored of the art work that is displayed. The building from outside is very stylish. Parking is available across the street for about $9. Plenty of staff inside to answer any questions about the art work on display.Strongly recommend.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Great place that's free!", "I've been meaning to go to the Broad, contemporary art museum for some time now: I finally found the time recently. Its located on Bunker Hill in DTLA, and admission is free. You solely have to reserve a time slot in advance (usually takes up to one month in advance). BTW, make sure you validate your parking bc it will cost you $12 for 3 hours, vs $22 vs no validation.\n\nAlthough the Broad is fairly small, it has some unique items like the Tulips, Dog and Huge Table. However, the piece I liked the most was Takashi Murakami's, In the Land of the Dead, Stepping on the Tail of a Rainbow. It was such an eyegrabbing work of art.\n\nIts nice rich peeps like the Broads are philanthropic bc they create cool places like the Broad for everyday folk like you and me to enjoy. Another big plus is the staff is super nice and helpful. If you are in DTLA, do take time to visit this unique place. It only takes a couple of hours tops to enjoy.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Worth the Wait", "the building itself is a work of art. Exhibits rotate so its a good idea to visit on a routine basis. Something that may be on display one month may not be there another. The highlights and the most popular items are usually on display.\n\nGreat time. It was a nice surprise.\nShow less"], ["Reviewed August 20, 2017", 5.0, "AWESOME", "Loved this place! Tickets I have heard are difficult to get but I got there early and lined up and did not have a problem getting in. I went when the infinity room was there, sooo cool! Strongly suggest this place."], ["Reviewed August 18, 2017", 4.0, "Beautiful Broad!", "As you can expect by the name of this museum, the Broad, I love the huge size of the art works displayed in the museum--modern, grand and bright!!! I took a group of 5 senior ladies there. Everyone was impressed. I plan to take my grandsons there in the near future. Combining your downtown Los Angeles trip with the Broad will be a great day adventure!\nShow less"], ["Reviewed August 17, 2017", 5.0, "My Favorite Museum", "The Broad has become my favorite museum in LA. The exterior of the building is a piece of art. It's located in dtla which has so much to see as well. The Broad is a must visit."], ["Reviewed August 17, 2017", 5.0, "New Downtown", "Special renaissance of Downtown L.A. Contemporary Art and very fashion multi-styles building. Get in for admiring what's inside this jewel. Lucky you if u will find the right show just in time."], ["Reviewed August 17, 2017", 5.0, "Great.", "I really enjoyed my visit to the Broad. I found the collection to be varied and thought provoking. I enjoyed the timed entry, I found it easier than waiting in a ridiculously long line. It also allowed me to view the art without fighting a massive crowd.\nParking and entry were easy. Most of the staff were kind and helpful. As a solo lady traveler, I felt safe in the neighborhood and museum/parking structure.\n\nI only had two issues with which I was not pleased.\n1. Infinity Room. You have to sign up for a time slot, but I was told the list had filled at 11 am that day. My museum ticket was for 3 pm, so I had no chance of getting in. It would seem to make more sense to have a certain number of spots per timed entry time, rather than per day. That way, it's on me if I don't sign up in time, rather than being unlucky and not getting a morning slot.\n2. The woman at the front with the clipboard told me I didn't need a parking validation. I did. I had to pay $22 for an hour visit (instead of $12) because I didn't have a validation. You owe me ten bucks, clipboard lady. I take venmo.\n\nOverall, I would go again.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Fantasitc Visit", "A challenge to get tix, but go if you are able. An amazing structure with incredible modern art. All well curated, with an audio guide to help explain significance.\nNot to be missed if you have any interest at all in Art,,,,,, and to see a great collection.\nShow less"], ["Reviewed August 15, 2017", 3.0, "Interesting architecture but not worth the wait", "Long lines - need to get ticket in advance. However, they let the standbys in before the next time slot, which makes it harder to get in the electronic queue to see Kusama's over-hyped Infinity Mirrors. Took 3+ hours to see that despite having tickets for 10:30 (opens at 10), partly because they let in the standbys before us. It's just not worth the wait - very limited architecture and the Emperor has no clothes! Fortunately, the nearby Disney -LA Phil Music Hall is open with a free audio tour so if you really need to wait to see the 1 minute viewing of Infinity Mirror room, there is something constructive to do\nShow less"], ["Reviewed August 15, 2017", 5.0, "One of my favorite Museums!", "I went to the museum alone while exploring LA. I had heard of the museum month before my trip and I'm glad I did. Entry into the museum is free however if you want to avoid standing in an obnoxiously long line you should book your ticket a month in advance when they are available on the Broad's website. Their was a special exhibit by Yayoi Kusama that I wanted to see so when I got to the museum I first checked in for the exhibit and explore the museum as I waited for a text message that it was my turn to see the special exhibit (about a 1hr 30min wait). Overall, it was a beautiful experience The Broad has a lot unique pieces and their staffers are very knowledgeable about the work which is nice. The is also a cute gift shop with awesome souvenirs.\nShow less"], ["Reviewed August 15, 2017", 5.0, "Absolutely loved it", "This place is great. Beautiful, varied collection, not too busy, easy to get to and free! I would recommend booking in advance, I was early for my time slot and the standby queue was already around the block. If you want to see the Yanoi Kusama Infinity Room then I recommend booking the first time slot of the day, you are more likely to get in and then can wander around the rest of the museum.\nShow less"], ["Reviewed August 9, 2017", 5.0, "THE place to see contemporary art", "Plan ahead and get a free reservation for admission. Show up at your appointed time, and be whisked to a playground for art lovers. Ask the guards about the art--some double as docents! Many icons of the last 30 years are here, though I would have liked to have seen a David Hockney. But I quibble. A wonderful collection.\nShow less"], ["Reviewed August 9, 2017", 5.0, "A burst of colors", "I finally made it to The Broad & I'm so glad I did! I was on the email notification list for some time. The tickets \"sell out\" quick! I reserved our Aug 6th trip in July 1st. Yep, over one month in advance.\n\nThe building itself is worth the visit. It's open, airy, bright, minimal and perfectly suited to showcase the art.\n\nI was happy to see some art that I hadn't seen before by artist who I am familiar with.\n\nYou'll only pay for parking but you can also take the Amtrak or public transit. It's very easy to spend some time here without leaving feeling overwhelmed by too much info.\n\nShow less"], ["Reviewed August 7, 2017", 5.0, "An extraordinary museum!", "We were very impressed with the Broad. We visited with our entire family ranging in ages from teens to seniors. The size and quality of the artwork is very special. Make sure to take a guided tour. Our guide was great and knowledgeable and put a different perspective on the pieces. Try to get tickets ahead of time so you can not wait in the long line and enjoy more of the experience of the museum. You can order tickets on line.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Wonderful Museum", "We had to wait in the standby line as you needed to book a time months in advance. The wait was just over 1 hour, we got there at 10am. Museum opens at 11. The feature exhibit is worth the wait. The 3rd floor has many interesting pieces of art. I definitely recommend visiting this museum\nShow less"], ["Reviewed August 5, 2017", 4.0, "Impressive new museum for LA", "▪️Location: Easy access in Downtown LA.\n▪️Parking: In same building as The Broad. Underground structure accessed from 2nd Street. Remember to validate at The Broad for reduced pricing.\n▪️Collection: Paintings and sculptures, mainly by well known 20th century artists.\n▪️Other: Impressive Infinity Mirrored Room which requires a separate ticket.\n▪️Staffing: Friendly staff who pop in with observations and then allow visitors to proceed at their own pace.\n▪️Highlights for us: Jasper Johns, Warhol, Ruscha, Lietchenstein.\n▪️Cost: Free. You pay for parking which in our case was $12.\n▪️Recommend? Yes\nShow less"], ["Reviewed August 1, 2017", 5.0, "Loved this visit", "I wasn't able to get advance tickets as recommended, but the wait at 2pm on Tuesday was less than 30 minutes (the Twitter feed reported 45 minutes wait) Excellent space and interesting collection. One hour is enough time to see the two floors, and not at all crowded inside. Worthwhile visit, disappointed to find that MOCA, right across the street was closed on Tuesdays. But the Central Market is nearby. Highlight for me was Cy Twombly room. Free admission.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Don't miss this!", "This is a relatively new art gallery and was not listed in my travel guide. It is free and very popular. Unfortunately it has 90 minute queues in the sun most of the time. It is not easy to get an advanced ticket but try to do so. Even waiting in the queue - in my opinion - it is the best modern art gallery in LA. The design inside and out is interesting and the exhibits very well curated. At the present time there is a Yayoi Kusama mirror room (requiring yet another queue & wait) you are only allowed 45 seconds but it is brilliant! There is no restaurant in here and it really can be done thoroughly in a couple of hours but there is a big outdoor eating area close by and the Walt Disney concert hall next door to make a totally first class day out in LA.\nShow less"], ["Reviewed July 25, 2017", 5.0, "You can do it in 68 minutes", "Shhhhhh! No one wants to admit this. We are supposed to think we have to spend hours rambling the galleries, minutes reflecting on the power of each piece, you know...\n\nBut the truth is you should see this beautiful edifice, inside and out, no matter what, and since it is free, you can justify zipping through and know you'll be able to return! Giant table and chairs, gorgeous Pollocks, crazy African-American-inspired silhouettes... and your mind is shaken up a bit and you feel the joy of human creativity for a bit and revel in the wonder of being able to think for a bit...\n\nThank you to the Broad family for sharing your collection with us. I appreciate it more than I know how to express.\nShow less"], ["Reviewed July 22, 2017", 5.0, "An ode to Broad's ego but a great museum nonetheless", "Visited on a Friday night (my favorite) and the museum wasn't really crowded. We love coming here on Friday night's as we can then walk down to the Central Market fo rdinner later and the museum seems less crowded. The art itself is fantastic and well presented. I just wish it could have been done in conjunction with the LA county Museum to broaden it's appeal. A small thing I guess. Well worth a visit.\nShow less"], ["Reviewed July 21, 2017", 5.0, "LA visit Day 1", "A trip to LA with my college bound daughter was on the agenda. She loves art and this is what she wanted to do for gradation just the two of us, no pesky brothers to ruin the experience so we headed to The Broad.\n\nWe did not have advance tickets which would have been better but you have to get them a month in advance. Since this was a last minute trip we arrived an hour early as reviews suggested. We were still about 10 back in line. It was hot and in full sun so take sunscreen, water, and have patience as it is worth it. About 15 before opening, staff appeared with umbrellas for shade and that was great. The staff was able to answer questions.\n\nWhen we finally entered behind all the ticket holders, we signed up for the infinity mirror exhibit. They took our reservation and phone number so they could text us when it was our turn. We had an 83 minute wait but was able to tour the museum until our time. Make sure you sign up for this immediately when you enter as later in the day you will not get a reservation.\n\nI love the wide variety of art with numerous mediums. The building itself is a work of art. The elevator is even worth the ride. I wish we had signed up for a tour as many times the story behind it is more interesting than the piece itself.\n\nThe museum is free but parking was $30 just two blocks away across from the MOCA museum. We had a great lunch at a nice cafe. There were lots of food trucks and typical sandwich shops in the area.\n\nThe Broad is right across the street from the Philharmonic hall and they allow free self guided tours that start no later than 2pm but we didn't have time. Lots to do in this one area. If we had advance tickets, we could have toured the concert hall, then The Broad, then MOCA all for the same $30 parking just don't go on a Wednesday as MOCA is closed.\n\nHighly recommend this museum, three to four hours was plenty for us.\nShow less"], ["Reviewed July 19, 2017", 5.0, "A must visit!", "I absolutely love this museum! I've been inside multiple times and each time I visit I still get excited! Great art collection, you have to see it for yourself. Just a tip, try to book your ticket online before you go so you can skip the long line.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Modern art, instagram friendly!", "Really unique and modern art you won't find anywhere else. Exhibits are very instagram friendly so you'll be taking nonstop pictures! Enjoy"], ["Reviewed July 19, 2017", 5.0, "Great Modern Art Treat", "I love this space- the architecture sets off the huge modern art collection of the Broads! Every level has a fun discovery! Changing feature exhibits added to standing collection will keep me coming back! Great for out of town tourists- if you decide to go to this part of DTLA you can visit the MomA across the street, the Geffen Museum is nearby in little Tokyo, look at the Disney Hall- all in one stop! We broke for lunch at Grand Central Market and continued our fun exploration! We are local, but put on our tourist hats for the day and had a blast!\nShow less"], ["Reviewed July 18, 2017", 5.0, "Architecture and Modern - both great", "The layout is visually exciting. After entering a beautiful archtectural gem, one takes a stunning esalator into the interior and masterful modern art. Staff folks are incredibly helpful and readily anwser questions and not intrusive. You need to make the free reservations ahead because the no reservations line is quite long\nShow less"], ["Reviewed July 17, 2017", 5.0, "An amazing experience", "The broad is just an amazing place to visit if you're in the area. The building alone is stunning, let alone the incredible art on the inside. I recommend booking a free ticket in advance, as the 'free' no ticket line gets extremely long and doesn't guarantee entry!\nShow less"], ["Reviewed July 16, 2017", 4.0, "Get Tickets in advance! Interesting exhibits, interesting architecture", "We spent 1/2 a day at The Broad during a weekend in LA, and it was really neat!\n\nAs a museum, there's a lot of interesting modern art - all presented well, and with good descriptions on the pieces and backstory.\n\nHighly recommend getting tickets in advance. We reserved tickets online (free) a few months in advance, and were glad we did - by 10:30am there was a \"standby\" line down the block to get in, but we just walked to our timed ticket line about 10 minutes before the time we signed up for - no real line, no fuss.\n\nArchitecturally, the Broad is interesting because it's a building with a shell around it. Inside, it is very organic in appearance. As with any art museum it's a lot of walking, reading, and contemplating.\n\nWell worth a 1/2 day visit.\nShow less"], ["Reviewed July 14, 2017", 4.0, "Unusual structure", "The Broad is located in Los Angeles Downtown near the Omni hotel. It is an unusual structure look like a bird's nest."], ["Reviewed July 11, 2017", 5.0, "Awesome place to check out", "You must plan in advance. Tickets are free and made available on the first of the month. It's not huge but has many amazing pieces and some cool exhibits. Some of the exhibits you need to get a ticket for when you get there. So it's one of those \"go early\" if you want one. We went at 2pm and could not get one. They go pretty fast. The view of the storage room is pretty cool. You can see how they store the art before putting into an exhibition. Parking around there is about $20. Take public transport if you can.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Something NEW in LA!", "There was so much buzz about this new museum I had to see it as soon as it was open, and I did. Simply dazzling. This is a persona, broad ranging collection, from the Eli Broad family. It rotates and they bring in other artists for special exhibits. AND it is free BUT you need to make a reservation to avoid the long wait ling especially if you want to buy a ticket to a special exhibit. Whatever you do, it is worth the effort.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Interesting Exterior", "Very interesting exterior, but all tickets were booked so we did not have the opportunity to see the interior or exhibitions inside. If you hope to visit the museum, plan way ahead of time and book tickets early, like as soon as they are available for reservations.\nRight nest to the Disney Concert Hall so you can see two architectural sites without too much walking.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Reserve tickets ahead of time & enjoy!", "Reserved tickets online when they got available. By 10 a.m., there were 200+ people waiting for a day ticket outside in a hot sun! Check out the museum's web site for advanced reservation ticket info. Great museum with nice selections, we had a great time. Staff were helpful and easy parking at the museum, $12 all day Sunday.\nShow less"], ["Reviewed July 9, 2017", 4.0, "Must-See Art!", "The Broad has a great selection of art, definitely worth the visit! I scheduled my visit ahead of time (which you can do on their website), which allows you free entrance at a specific date/time. This means you avoid waiting in line (which is the option if you didn't book ahead of time). Can get crowded, but that is expected in my opinion.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Deserves All the Hype", "I now live in DTLA, but I went to the Broad within its first month of opening when I was still a West-sider. It's a phenomenal space with eye-popping art that appeals to art history buffs and laymen alike. Tickets are free, but you have to reserve well in advance online, perhaps a month or so before you want to go. One of the most remarkable things about the Broad is that all of the security guards are also trained to speak about the art and really know some interesting facts.\nShow less"], ["Reviewed July 5, 2017", 5.0, "AMAZING contemporary art museum.", "Really amazing contemporary art museum open in downtown LA. Best part: it's free to go! Make sure you check the closing time though, you want to give yourself enough time to see everything. Also, MOCA is right across the street."], ["Reviewed July 4, 2017", 4.0, "They definitely possess some jewels of contemporary arts", "The wait for infinite mirrors room is enormously long, if you don't book it well in advance on line. Consider some couple of hours here in this museum."], ["Reviewed July 2, 2017", 4.0, "Fun and free!", "We did not reserve tickets ahead of time and arrived aprox 15 after the museum opened. We were told we would probably wait between 90-100 mins before we could get in, but it ended up being only 60 mins. The museum was very nice and not crowded very crowded. Backpacks must be worn on your front or side, not your back, but they do allow you to check your backpack.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Amazing contemporary collection", "If you enjoy contemporary art, this is the perfect museum for you. Warhol, Sherman, Twombly, Basquiat, just to name a few. The layout is very walkable and friendly for visiting, The museum shop was so-so. Usually I can find a few things I have to have in a museum gift shop, but this one was rather boring. Mostly books, which I can buy cheaper online. But aside from the gift shop, everything else was amazing, even the escalator ride up to the second floor.\nShow less"], ["Reviewed June 28, 2017", 3.0, "It Was Free", "I only really paid The Broad a visit as it was free and was kinda hoping I'd have some sort of epiphany when it comes to modern art but, alas, nothing! Seeing a chess board with 9x9 squares instead of 8x8 did nothing for me and getting scolded by an attendant for standing too close was a bit much.\nA lot of people will love the exhibits, it's just not for me.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Free and fun!", "The Broad has an excellent collection of contemporary (from 1950-present) paintings. You must reserve your tickets in advance for a specific time."], ["Reviewed June 26, 2017", 4.0, "Checked out a new museum", "We had a party of 8, including 3 adults and 5 teens. Entry is free, but since we didn't have a reservation we paid the additional fee to see the Cindy Sherman exhibit, so to we only had to wait around 20 minutes to get in. We haven't been able to see the Infinity Room yet, but hope to this year. The reservations can only be made once you enter the Broad, and are first come, first serve. Lovely art. Two stories. We walked to (iconic) Grand Central Market for lunch.\nShow less"], ["Reviewed June 26, 2017", 3.0, "Average at best", "The building has some cool architectural features and the gift shop is interesting but the exhibits were mediocre at best. To be honest, I am not a huge modern art fan so perhaps didn't appreciate it as much as some others would have."], ["Reviewed June 25, 2017", 5.0, "Brand new modern art museum", "Dizzying! Wonderful layout. First class art. Well-known artists as well as younger ones I did not know of yet. Several videos were running in the special exhibit \"Oracle.\" A must see museum. Free admission, but reservations required and the availability is limited. A four-week wait is likely.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Great collection, highly recommended", "Located downtown LA, you can get there easily by metro/subway, approximately 15 min walk from Little Tokyo arts district. Admission is free, but you shoul book it 2-3 weeks in advance to secure your spot. If you don't there's still a chance you'll get in. Every day a standby lineup forms up in front if the building, and depending on the capacity (if some of the pre-registered visitors don't show up) they let you in. Waiting times vary, it was about 15min for me, but I know for a fact that it could be way longer. Check out there twitter feed fir info on waitinh time, they post it daily. Also, their website mentions it in more detail, worth going through that befire planning your visit.\nShow less"], ["Reviewed June 22, 2017", 5.0, "Beautiful museum focused on modern art. Get your tickets in advance!", "Nice way to spend a couple hours in downtown LA. Definitely get your tickets in advance. Our tickets had a set admission time and we walked past a long line of people hoping to get in."], ["Reviewed June 21, 2017", 4.0, "Be early!", "My advice is if it's summer, be early, be very early! We waited in the blistering sun for nearly two hours (1.50) to get in, there are staff handing out umbrellas but somehow they kept missing us even after repeatedly asking for one. Going inside was a relief but by then we were actually exhausted, and could not even get into the infinity room or book it for a later date. It certainly is worth a visit but not the wait, so plan well, sorry.\nShow less"], ["Reviewed June 21, 2017", 3.0, "Very interesting", "Went to visit the Broad with a group of teen girls and friends very interesting art. Lots of things to see. Some of the stuff was kinda odd but I'm not an art critic. Many different prospectives of how people view art. It's good to experience different forms of art. Had a nice time.\nShow less"], ["Reviewed June 21, 2017", 5.0, "So cool!", "We made reservations to go to the Broad while visiting Los Angeles. You need to make reservations ahead of time. So we booked our tickets May 1st for June. The tickets are free but if you don't reserve you have to stand in a very long line. The building is amazing. They have two different floors of galleries. There was pieces of art by Keith Haring, Andy Warhol among others. There was even a giant dining room table that you can stand under. We had a great time. My family of teenagers really enjoyed themselves.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Amazing collection but book ahead; fantastic staff", "Bizarre ticketing system. Either stand in a very long line or book ahead. I booked for June on May 1 the first day that the free tickets are available for the following month. Fantastic collection of modern and contemporary art. A good size; large enough but not intimidatingly so. Each of the galleries has mostly just one or two artists so is really great to be able to see several works by the same artist together. Minimal informaton on the walls. But I discovered that the staff while also doing guard duty are all artist types and really well trained and eager to engage. I had many interesting discussions with the staff and I went up to several and asked them to explain a piece and they did so uniformly in an intelligent and interesting way. I ended up spending three hours in the museum. Note that there is no cafe inside.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Amazing!", "My friends and I went here primarily for the infinity room. The Broad opens at 11am and it has 2 different floors of art. I would highly recommend signing up for the inifinity room as soon as you get in the Broad because it gets filled up fast and they only take a limited number of people. My friends and I waited for 3h before it was our turn. We spent time by visiting the other 2 floors and going for Beantage. The inifinty room was definitely phenomenal, however, you only get 45s/person in there so make sure you take full advantage of it by being mentally and physically ready\nShow less"], ["Reviewed June 17, 2017", 5.0, "Great modern museum", "Enjoyed this museum. We reserved tickets (free) in advance. It's a very cool museum and a good size. Cool to be able to see into the room where they store the art."], ["Reviewed June 16, 2017", 5.0, "Best museum ever", "Probably my favourite permanent collection of modern art in the world. The selection of XX century art is just exquisite, every single room blows your mind. The building itself is a true gem. Tickets are free and the wait wasn’t that long, less than 30 minutes.\nShow less"], ["Reviewed June 16, 2017", 5.0, "A little gem in the heart of Downtown LA.", "This contemporary art museum is very interesting. It's also small enuf to manage your viewing with friendly staff visible and available in every room. A beautiful building of unusual design and there is the really intriguing Infinity Mirrored Room to queue for. Take the time to wait for an opportunity to get in...it's worth it. The museum is wonderful for young and old. It has clean restrooms and convenient drinking water fountains. Ubering is easy. The local buses also run close by. Entry is free.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Pick your favorite", "I loved this museum. You can see the best art in the world- for free! Staff was also very friendly and I loved the gift shop."], ["Reviewed June 14, 2017", 5.0, "Love a good free art gallery!", "Love the broad. Always a wait if you don't get tickets in advance but I don't mind as it's never painfully long & it's free! If there's an individual entry exhibit then i'd recommend signing up for that on your way in before you see the rest of the gallery so you don't have to wait too long.\nShow less"], ["Reviewed June 14, 2017", 5.0, "An excellent museum that impresses on all counts - but get your tickets early!", "Booked weekend evening tickets weeks in advance - but it was well worth the effort. The museum is beautiful, the collection a joy to go through with helpful explanatory information in most cases to help visitors better understand the works on display. Must go in LA!\nShow less"], ["Reviewed June 13, 2017", 5.0, "Book ahead to avoid waiting", "The Broad is free and you can queue on the day but booking ahead means you avoid the lines. There are some great example of modern art to enjoy. The gallery isn't huge so a couple of hours is probably enough."], ["Reviewed June 12, 2017", 5.0, "GREAT MUSEUM", "First tip is to book tickets online, it's free so you could plan in advance and pick a date. An e-ticket will be sent to you and entrance is super easy. The museum is beautiful, lots of natural light and contemporary art. Great for the younger crowd. It's constantly packed but worth the visit. I suggest spending about 3-4 hours here. A must go when in LA !\nShow less"], ["Reviewed June 11, 2017", 5.0, "Contemporary Delight", "We booked tickets on the 1st of May for a June 4th visit since we were not able to get tickets on short notice on our previous 2 visits to LA. I truly enjoyed the curation, I read about 20% of the blurbs accompanying various works of art and usually felt enriched by the art history and social commentary provided (e.g. Andreas Gursky's photos). I appreciated the diversity of artists represented in the Broad collection, in particular noting that female artists seemed better represented in this museum.\n\nAnd I want to commend the staff, I had interactions with at least a half dozen and found them consistently top notch. Bravo to The Broad!\nShow less"], ["Reviewed June 11, 2017", 5.0, "The lines are long but worth the wait", "We were to late to book on-line ... it has to be done a month in advance. But we had heard the lines weren't too bad, so we got there about 11 am on a Sunday and were inside before noon. Well-organized line management. The space itself is spectacular and we found the Oracle display selections captivating, although unsettling and basically angst-producing. But those are the times we live in. The permanent collection selections on the 3rd floor were the best of contemporary art and were a joy to wander through. Great addition to the LA art scene.\nShow less"], ["Reviewed June 11, 2017", 5.0, "reach early....need to stand in queue to get in. Or book ahead online.", "best of all its free....but limited entry so either book tickets online or reach by 10am as the museum opens at 11am.\nI had breakfast at this wonderful place called Bottega Louie and then strolled over to the museum. Wish I had walked briskly instead, but it did not matter much.... got in after about an hour.....can spend the time chatting with the people around.\nMuseum was really lovely....catch the talks by the staff...they bring the exhibit alive and are very interactive. Were done by lunch....and there was a mexican fruit cart outside selling refreshing cut fruits with a special spicy sour sauce and salt.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Definately worth a visit - but book ahead to save time!!", "Spectacular building from the outside and even more interesting from inside! Be sure to book your tickets (free) ahead of time to avoid the long lines for standby tickets. Apparently late Thursday and Friday are best if you don't have a pre-booked ticket. Interesting collection, loads of helpful staff to answer questions, fascinating glimpse into their storage area on the second level via a stairway...well worth a visit if you are in town!\nShow less"], ["Reviewed June 8, 2017", 4.0, "Crazy long line!", "It was worth my hour wait since the tickets were free, but I don't think I would do it if the temp was over 90 degrees. I enjoyed the big airy space, and the exhibits were well laid out. Only took and hour to see everything though.\nShow less"]]}}