{"The Gondola at Heavenly": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Gondola at Heavenly", "url": "/Attraction_Review-g1798615-d283397-Reviews-The_Gondola_at_Heavenly-South_Lake_Tahoe_Lake_Tahoe_California_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d2/35/2b/photo5jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1957"}, "address": {"@type": "PostalAddress", "streetAddress": "4080 Lake Tahoe Blvd.", "addressLocality": "South Lake Tahoe", "addressRegion": "Lake Tahoe (California)", "postalCode": "96150-6907", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Heavenly view", "The gondola to the top is a really scenic trip. Get off at the first stop and observe the many majestic views of the mountains and lake. Lake Tahoe is a sight to be seen, but you can't really see it from the very top of the gondola ride. There is a little gift shop there with relatively good prices. At the very top you can see some of the runs of Heavenly and enjoy the Tammarak lodge. The price is kinda high for food and drinks at this lodge, but much what you would expect at a ski resort. The Gondola is free with the usual lift ticket on skiing and $48 without the ticket. Seniors and kids have cheaper prices and you might find special pricing at some places. We already had lift tickets and were given comp tickets for a couple of riders. Wish it were a little cheaper!!\nShow less"], ["Reviewed 6 days ago", 5.0, "Wonderful Views", "I wish there was a cheaper option to ride the gondola when not planning to ski. Perhaps during restricted time?We have had guests with us who do not ski and $30 bucks to ride up and down one time is ridiculous. For skiers the gondola moves fast and is a dream way to access all that Heavenly has to offer\nShow less"], ["Reviewed 1 week ago", 4.0, "Expensive but a worthwhile view", "Whilst it is an expensive prospect there is nothing like the view you can get from the mid way stop. I would not suggest using the food court at the top"], ["Reviewed 1 week ago", 1.0, "Ruined my holiday", "I cannot believe the price I was changed for lift passes. I was in tears and wanted to come home. I am now making sure everyone knows just how much I paid, thank you so much for making my trip such a disaster. My 14 year old daughter will never forget seeing her Mum cry!\nShow less"], ["Reviewed 1 week ago", 1.0, "Expensive/Inconvenient/Unpredictable", "The Heavenly Gondola is outrageously priced!\nThe Heavenly Gondola is inconvenient - no parking nearby, info staff not helpful and lines are too long.\nThe Heavenly Gondola is unpredictable - never know if it will be running or not due to maintenance or wind/weather holds.\nThe views are fabulous but the windows are scratched and not clean so photos are not an option.\nI would never suggest this as an activity in Tahoe - if you want a good view - hike in the VanSickle Park - great views, cheaper and less stress!\nShow less"], ["Reviewed 1 week ago", 4.0, "Must do!", "There's a long wait during touristy times but staff are friendly and helpful. The ride takes you to the observation deck where you have great views of the lake with informational plaques. You hop back on from there to go to the snow activity area for skiing, snowboarding, tubing, ropes course, and more, where the vibe is fun with live DJ music.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great Tahoe activity... but overpriced", "At the peak of the season it will cost you (adult) $64 just to ride the gondola. While I think the ride is amazing and a Tahoe must-do, I'm giving it four stars because of the price-to-value ratio. The views of Lake Tahoe are unmatched and the ride up and down are both fun, but it's hard to give this attractions five stars because of the steep price (pun intended).\n\nI recommend arriving early (we arrived at 8:00 am) for easy parking (use the lot behind the grocery store - $20 for the whole day) and getting your tickets ASAP. The resort gets crazy crowded around 11am and when we were leaving at 12:00 pm, the line was outrageous!\nShow less"], ["Reviewed 1 week ago", 5.0, "Skiing at Heavenly", "We got our ski lift passes through Epic on line and decided to use the gondola as our access to the slopes. Beautiful breath taking views of Lake Tahoe and surrounding countryside. It’s enclosed and keeps the wind and weather off."], ["Reviewed 2 weeks ago", 5.0, "Great team", "I’ve skied for 30 years & a variety of places, Heavenly’s gondola is most efficient. A team of four rotate getting skis & forming a group for each enclosed car. Moves fast & easy!"], ["Reviewed 2 weeks ago", 4.0, "Beautiful view of the lake", "We were there during summer. It was a bit pricey to go up the gondola, but it did provide an excellent view of the Lake, so it was worth it."], ["Reviewed 2 weeks ago", 5.0, "Views are breathtaking", "Season pass holder, take gondola up to the mountain to snowboard. This is a very peaceful perch of my snowboarding experience as I get 25 minutes of Amazing views and good conversation with my friends and family that I am snowboarding with."], ["Reviewed 3 weeks ago", 5.0, "Heavenly Gondola", "The view was so worth the price. Be sure and get off at the 1st stop for the most amazing views. We paid $58 per adult, but would do it again."], ["Reviewed 3 weeks ago", 5.0, "Expensive but Fun", "Basically, this is the way to get to the Heavenly Ski Resort on top of the mountain and like everything else at Heavenly, it's super expensive. Kind of like a theme park. But once the sticker shock subsides, you can enjoy the incredible view of the lake and far off mountains. A bit of a zoo in the morning as everyone scrambles to buy tickets. There is a dedicated window for gondola tickets that doesn't include lift tickets - this line moves very fast. This is what we did the first day, since we were only interested in tubing once we got to the top (tubing is not included with a lift ticket - it is its own thing - a lot of fun, btw!). This can be a little confusing. Anyhow, the gondola is quite a feat in engineering and the highlight of our trip.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Expensive but worth it if you love views!", "Riding the gondola to the top of the mountain was really fun. The views are stunning! You get off part way up and can walk around an observation deck."], ["Reviewed 3 weeks ago", 5.0, "Beautiful", "It’s the most beautiful view of Lake Tahoe. Very worth! On the top there is a bar/restaurant. I didn’t eat there so I can’t help with that!"], ["Reviewed 4 weeks ago", 5.0, "The Gondola at Heavenly", "The Gondola was a little pricey, but well worth it for the view of Lake Tahoe. There are 2 stops that you can get off at before you head back down. The first stop is a must for picture takers. There is a small gift shop at the first stop and bathrooms. There are 2 places also you can get drinks at during the summer. Both places were closed while we were there. We took lots of pics and then got back on the Gondola and road to the top. We stood and watched the skiers and snow boarders. There is a restaurant/bar that has a happy hour and music. We did not walk over to it because it looked like it was all ice getting to it and we were both in tennis shoes. You would probably need a walking stick or spikey shoes that would help you walk over. On the way down to the base, there is no stopping at the overlook to take pictures again, so make sure and do it on your way to the top. There is a parking garage but I am not sure the cost on it. Across the street from the Gondola area there is a shopping area that has a Wyland Gallery in it. There are signs everywhere not to park in that lot or you could be towed. At the back of that parking lot there is a marked off area you can park for $20 for the day. The casino's are within walking distance of the Gondola area.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great Sightseeing", "Heavenly Gondola was expensive I will agree with that and it was a short little ride but the views of Lake Tahoe are exquisite!"], ["Reviewed 4 weeks ago", 2.0, "January ski trip", "The Gondola itself was nice but for skiers the location was horrible. The Gondola drop off for skiers starts with a bunch of steps to get down to the snow and then it’s a hike to get to the first series of ski lifts. Not sure why they placed the Gondola so far away from the lifts and they could have had the stop a little earlier so that it was level with the area by the lifts and lodge. Plus, having to hike up those stairs after a long day of skiing isn’t fun. First ski Gondola I have been to where the location was so poorly located.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great views", "We love to ski Heavenly and one of our favorite parts is the ride up the gondola. It takes about 15 minutes and offers the most panaoramic views of the lake you will ever see. I appreciate the fact that there are ski and snowboard storage bins attached to the outside of the gondola cars, which keep bulky, awkward equipment out of the way so you can focus on unobstructed views. The gondola attendants are super friendly and load your skis for you.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Amazing views!", "While the price of the gondola ticket may seem crazy expensive for a 15 - 20 minute ride up the mountain and another 15 - 20 minute back down, it is totally worth it. They max out each Gondola to 8 people at the most and it is so beautiful to see the scenery around town. We took beautiful family pictures in the gondola itself as well as at the Observation Platform halfway up. Seriously, do NOT miss this stop on the way up. You will not stop here on the way down. They have picnic tables set up here so you can have a quick snack while you take it all in. They also have free standing binoculars available for use around the deck. It's a smooth ride and enjoyed by all in my family.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Breathtaking views", "It's a pricey ride but probably worth it. The views of the mountains and the Lake are amazing. Snow, blue sky, green pines. Wow. We had a beer and rode all the way up to the top on the second lift. Very nice."], ["Reviewed January 22, 2018", 5.0, "Convenient", "Located conveniently next to hotels however if you are just visiting there is no parking. Used to be able to park at local hotels but they have cracked down on it. Lines get long for lift tickets so make sure you come early or buy prior to getting there! Views are gorgeous from this resort! Skiing is awesome, lots of runs, more flat areas than I like and mountain is definitely more for skiiers but overall I love heavenly!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Quick", "We got there for 9am waited for 5 mins and were straight on. Staff are really nice and put our skis on the rack for us . Quick ride up with amazing views !"], ["Reviewed January 22, 2018", 3.0, "Very picturesque but inconvenience for skiing", "The gondola itself as a tourist attraction is very beautiful. The views of the lake and mountains are spectacular. This is not the purpose my family and I were using the gondola for however. As the main transportation up the mountain for skiiers from heavenly village, I found that the exit point at the top of gondola was an inconvenience for skiiers and boarders due to the stairs you must climb down as well as the fact you must either walk or skate to the tamarack lift (a fair distance) OR skate even further on a flat to access the Californian lifts.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Scenic views", "As family visiting heavenly on a skiing trip, utilising the gondola was our quickest and easiest way to access the slopes, we were not prepared for the magnificent views it provided over the Lake Tahoe area, showing the lake and surrounding mountain ranges. It also provides easy access for foot travellers and a viewing platform half way up for those who want take in the spectacular view in the open air. The only issue I found as a skier was the stairs that had to be negotiated at the top and the fact that you had to travel uphill to access the ski lifts.\nShow less"], ["Reviewed January 20, 2018", 3.0, "Bad design for skiers at the top...", "Our accommodation was right beside the Gondola so this became our morning ride to Ski Heavenly. Strange how for a ski lift though that the Gondola lands you smack bang in the middle of beginner/tourist walker land, and even stranger that you have to either skate uphill to the Tamarack lift or another uphill skate across to the California trail....If the Gondola went 20 or 30 metres further all of this would be alleviated and hence so would the congestion at the base of the stairs. Also the many stairs and ski boots simply don't mix at the end of a very long day on the slopes. I witnessed many slips and falls over the 8 days. I believe the non skier trade must have influenced this weird engineering decision? The Gondola ride itself though is something to experience as the views over the lake are breathtaking indeed as is the gradient to get to the top.\nShow less"], ["Reviewed January 17, 2018", 1.0, "Over priced and no information absolute rip off", "What a let down, we paid a little over $500 for 2 days use of the Gondola and this was not to ski or board this was purely just use of the Gondola. what they don't tell you is if you buy your tickets daily after 1pm they are half price we felt ripped off after we found this information out,,,, the windows on all the carriages are damaged and scratched which means no good photographs as you go up, staff a rude and arrogant, typical of a monopoly mountain ski area, they will sell you tickets to an attraction at the top of the mountain even if that attraction is closed. and then make excuses, day 2 we went up to use the tubing for my daughter and they where closed, the response we got got verbatim\" We are a Ski and Board Resort, Other Activities are a Bonus\"\nNever Again.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Sightseeing", "Sold out on Sunday but luckily we were leaving Monday. So got a chance to ride the gondola up just for sightseeing. Friendly staff and great ride up!"], ["Reviewed January 14, 2018", 4.0, "Great Views", "We visited Lake Tahoe over the Christmas period. There had been fresh snow a couple of days before we arrived, but there was plenty at the top of the mountain. We missed out on our first day getting to the top, as they only sell so many sightseeing tickets per day, so if it is a busy time I suggest you get there early on the day you wish to travel on the Gondola to secure your tickets as the lines can be quite long. Once you have your ticket you can ride at anytime during that day. The views are amazing. You can stop on the way up to take photos of the lake from the observation deck. You can only do this on the way up. If you are in the area even if you are not skiing it is worth the trip to the top.\nShow less"], ["Reviewed January 12, 2018", 5.0, "amazing ride and view", "amazing ride up the mountain. went from 50 and sunny at the base to a blizzard on top. one world to another fairly quickly"], ["Reviewed January 11, 2018", 4.0, "Don't Miss Out, even if you don't Ski!", "We decided to take a ride on the Gondola after we were done skiing for the day. We are so glad we did! We took the Gondola to the Observation Deck. When we got out we were so impressed with the view of Lake Tahoe from there!\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great Experience", "We went to Tahoe during a time of not too much snow so the gondola was a pricey but worth it experience for us. We got to see snow up close in the mountains. I don't ski but still had fun traveling, seeing snow, and eating at the restaurant they had for happy hour and the nachos.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Best ski trip, so good we named our son after this place", "Heavenly Ski Resort is a touch of paradise in Lake Tahoe. Huge terrain, quality snow, friendly and very helpful staff, and a massive layout. Good for intermediate to experienced skiers with long runs and quick chairs. The Gondola to the top is a worthy experience. So good that our sons middle name is Tahoe and our daughters middle name is Snow. Could easily move here!\nShow less"], ["Reviewed January 8, 2018", 5.0, "Awesome views and efficient", "Great views of the lake. Efficient to get to the ski slopes. Warm and comfortable. Operators are friendly and good. Service runs as much as the slopes are available for skiing. Good gondola to take."], ["Reviewed January 8, 2018", 4.0, "a beautiful ride", "Not much snow at the Lake, but quite a bit at the top. I didn't mind paying the $55 round trip to the top, but the $6 for a bottle of Pepsi at the observation deck is a bit much... Beautiful view, but the windows all being scratched up was a disappointment\nShow less"], ["Reviewed January 7, 2018", 3.0, "Sit facing the Lake", "A great great view. If you are only looking for views, get out at observation deck on the way ‘up’ (it does not stop at observation deck on way ‘down’). If you are a skier/boarder who is not a beginner, this is a slow way to get to the best terrain, drive to Stagecoach or Calif Base Lodge instead\nShow less"], ["Reviewed January 7, 2018", 4.0, "Best way to ski heavenly", "Great way to get to the snow the fastest when you can get curb drop off. Not worth parking as the plaza charges for parking. This is a shame especially when they charge $150 for the lift tickets."], ["Reviewed January 6, 2018", 4.0, "Beautiful but super expensive", "Awesome view of the Lake Tahoe.\nNice ride and great opportunity for taking great shots on the observation deck. It's optional and I strongly recommend it. On upper, last station there are nice areas but not as beautiful as the view of the lake from the deck. There is a restaurant on the top and the tubing for kids during the winter.\nThe only bad thing is the price for the ride for people who not even use the ski trails.\nFor me and my teenager son I had to pay $109 !!!\nIt's robbery..... :(\nShow less"], ["Reviewed January 6, 2018", 3.0, "Pricey for one trip", "The view is great, but if you are not sking , not much to do at the top. This is a pricey trip to go once. If you plan to ski it's good. The view is beautiful and you do not have to wait long."], ["Reviewed January 6, 2018", 5.0, "Pricey but only way to get the view!", "Not sure of any other way to get to the top of the mountain. We don't ski but wanted to see the snow and view. Staff was great. Long lines but then it was New Years and expected. Be sure you stop at the observation deck before going on to the top. It doesn't stop on the way down. Very very pricey but we expected this beforehand. It's a ski resort, in CA, of course it is going to cost a lot. But since this was a one-time trip, we thought it was worth it. Spectacular view I'm not sure you could get anywhere else.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Great ride", "The Gondola has very helpful staff, you can load the skies on the outside. The only bad thing is that the glass on the cars are scratched."], ["Reviewed January 5, 2018", 5.0, "Must do!", "The gondola ride (views) was breathtaking and I highly recommend. There was snow for the little ones to play in, even though the temps were in the 50s down in the village. We had a great time."], ["Reviewed January 5, 2018", 5.0, "“The mountains are calling”", "Go enjoy yourself out on the mountain, drink a nice IPA. The atmosphere of Heavenly Village is quaint. Enjoy the wonderful view & staff."], ["Reviewed January 5, 2018", 2.0, "Expensive!", "Was skiing with family. Non skiers wanted to join us on the mountain for lunch & for kids to go tubing. Return trip is $50 for adult, $35 four kids. Just silly money & simply not worth it."], ["Reviewed January 4, 2018", 5.0, "Spectacular", "I can appreciate that if money is tight that this is expensive, but as a tourist I felt it was well worth the price. I don't see what all the fuss about price is from other reviewers unless they are on a truly tight budget. The gondola was well maintained and the staff was attentive-what you want when you are going up the side of a mountain, correct? I was actually a bit nervous on our ascent, but was comforted as everything looked top notch in terms of maintenance of the gondolas and all of the mechanics. The views were excellent.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Good choice", "Although it is expensive, $64 for one trip, it was worth it for the views. Accompanied grown children who were on gondola as part of lift ticket to go skiing, I was not skiing. It stops at observation deck, halfway up, beautiful views of lake and surrounding mountains, it was extraordinarily windy the day I visited, but was great vantage point. Then climbed back on went to top of mountain, you can go to lodge, etc. Nice thing is going back down at non peak time you can get your own gondola and thus wonderful photos.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Loved our trip up and down", "Was told the day we got there that if we wanted a pass up and do the tubbing we had to get to the office right when they open because they have been selling out early , so I got up the next morning at 7 ate breakfast walked over there from my hotel and was there at 0800 to make sure I can get three tickets up we had our own Gondola which was nice so we could take picture , nice sights of all of Lake Tahoe .\nShow less"], ["Reviewed January 3, 2018", 5.0, "Ski", "Nice place to ski and snowboarding. They have private classes also. There’s restaurant and clean bathroom."], ["Reviewed January 3, 2018", 4.0, "Expensive if you're not skiing", "20 minute ride in each direction to get to the ski mountain. Stop at observation deck, about mid-way for excellent picture taking location. Not much to do at the top other than eat (also expense) and look around"], ["Reviewed January 3, 2018", 5.0, "Well managed, awesome views", "A bit expensive, but worth going at least once. Nice views from the observation deck mid way. Gondola ride is comfortable and many activities to do at the top. A nice way to spend the day in fresh and healthy manner."], ["Reviewed January 2, 2018", 2.0, "Wanted to go, but not at these prices", "We didn’t ski because there was so little snow, but we wanted to go up for the view and lunch. I have been up the mountain before, and the views are phenomenal from the top, but there is no way in the world i am going to pay 64 dollars a person for the sightseeing gondola. That is 256 dollars for a family of four. That is highway robbery! Sorry!!!\nShow less"], ["Reviewed December 31, 2017", 4.0, "Simple, easy and brilliant views", "Took the gondola up with another family with small kids. Short queue for tickets. Good that kids under 5 are free. Then went round to board and we got our own gondola. Stopped at viewing point for quick walk around and then headed up to the top to find snow! Well run, clean and simple.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Expensive but worth it", "The views are gorgeous, the staff was helpful and friendly, everything ran very smoothly. The lines can be insane with all the skiers. Marriott Concierge helped us get tickets without the line and for the next day. Tubing tickets only sell a set amount for the day. The price of admission is worth the experience, especially if you don’t live near or often visit ski resorts.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Absolutely Heavenly!", "We are not skiers, however, we highly recommend a ride on the Heavenly Gondola. Take a camera—the first stop is a huge sight seeing deck. The view of Lake Tahoe is breathtaking—we’ve been there winter and summer. Always spectacular!"], ["Reviewed December 28, 2017", 5.0, "Nice ride to Heavenly", "The gondola was a great trip up to Heavenly. Great views at the first stop and a nice ride over to the ski resort. A little pricey, but the trip and views are worth it."], ["Reviewed December 27, 2017", 4.0, "Nice views but expensive", "This is a comfortable way to get to the top from Heavenly Village. But it’s not cheap - $64 for adult and $35 for kids (below 12) during peak period. That covers only one trip up and down.\n\nJourney itself is quite smooth with gorgeous views up the mountain and down over the lake. There is a stop for the observation deck about 3/4 of the way up - you have to get off on the journey up if you want to stop there.\n\nThe entire journey to the top is about 20 minutes. Most traffic at the top during winter season is of skiers/ snowboarders so keep that in mind. There are some trails to walk around but lots of foot traffic during the holidays.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Always fun", "Many improvements this year on the gondola trip. More activities added to the mountain. Much more for kids, only one worker was a stick in the mud. Everyone else was friendly & nice! Still snow so winter activities were available. Definitely a must see every time we visit.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Christmas in Lake Tahoe", "This is the most convenient ski lift we have been on - a little expensive but they have got the market"], ["Reviewed December 26, 2017", 1.0, "Thoughts of an International Traveler", "First and last trip to Heavenly Gondola! The biggest mistake I've made is that I didn't read the RECENT reviews before coming here.\n\nFirst of all, even if you reserved your ticket online, which was about $129, you still had to wait 2 hours to retrieve it and finally get on the gondola. The lines were insanely long and unorganized. It didn't help that the ushers were giving wrong information as to where to line up.\n\nSecond, although I liked the view at the observation deck, the experience went downhill from there. As we got on the skiing side of the mountain, we asked employees of the resort for help, and they were incredibly rude and mean. I fell my first near a slope and this Heavenly employee (operated the lift) told me it was my fault for falling and continued to berate me as I got hit by another skier (and apologized to him). I'm sorry I'm not experienced since this was my first time skiing. Heck, this is the first place I came to see snow. It didn't stop there as several employees were horribly degrading us, as we asked for simple stuff. I remember asking one employee (helping out at the tubing area) if he could take a picture of my family and he yelled and rudely told us off that he was working and he didn't have time to deal with guests.\n\nSeriously, it's like the employees of this resorts hate international guests. It's like they're nice to locals and regulars in one moment, and then when it's people like us, who are new and curious to the place, they shun us and over exaggerate our faults.\n\nThe locals and other guests were so kind to help us (like preventing us from getting lost and simply lending a hand), but the employees are just so discouraging. Don't get me wrong, there are a FEW employees who are kind (these are the instructors), but the employees who are doing minimal work (like standing around the lift, activity places, entrance) are one of the worst customer service I've ever received.\n\nFinally, that experience wasn't worth the price! Everything was expensive. Expect to spend about $500 for 2 people in 1 day. I would've been fine with spending that amount, but most of the employees are ridiciously the worst people.\n\nIf you're a visitor from another place/ country, don't come here. You'll be treated as an outsider, taken advantage, and discouraged from even trying to ski/snowboard again\nShow less"], ["Reviewed December 24, 2017", 3.0, "Gondola too expensive.", "For 1 trip to the top no skiing. $55 is outrageous. Its a nice photo opportunity. Is it worth the line up and crowds????"], ["Reviewed December 23, 2017", 2.0, "Go to Squaw Valley and ride the tram instead", "Though the scenery is okay the price is a rip off. You can ride the Squaw Valley Tram and Funitel all day for the same price that Heavenly charges and there is much more to see."], ["Reviewed December 22, 2017", 1.0, "Grancy", "If they had decent prices for family it would be outstanding. I feel for poor people that can not afford this experience.\nPlus the parking situation is ridiculous. Parking near the gondola is non existent. Lake Tahie turning into a rich mans town. So sad and disappointing.\nShow less"], ["Reviewed December 22, 2017", 3.0, "Great Views but Very Overpriced!", "$55 per person for a ride to the top of the mountain and then gouging prices once you get there - not sure I would do it again... We thought it would be fun to get lunch at the top, but the cafeteria style burger platter was $26 -- that's just throwing good money after bad! The cost of the ride up should be deducted from what you spend at the top (similar to how skiing is handled) so as long as you spend $55 or more, your ride up is free!!!\n\nBe sure to get off at the halfway point for some very good views/photos if you do decide to spend the money! ALSO - buy your souvenirs at the halfway stop because they don't have any at the top (at least not in the primary lodge.)\nShow less"], ["Reviewed December 22, 2017", 4.0, "Check the weather beforehand", "Visit this venue on the 19th Dec 2017, $56 per person if you only want for sightseeing which will carry you to the top. There are 2 stops, 1 for sightseeing/viewing purposes, and the second one for skiing and of course for a bit of photos as well.\n\nThe wind was chilling around 10am, and when we stopped at the 1st stop, it was very windy and quite difficult to take photos. We have to shelter a while at the gift shop. When we continue to the second stop, the clerk do not allow us to alight cause they said they discontinuing the service to the bad weather, so we were sent back down immediately, although it really took us a while to realize that on the opposing gondola there were lots of people coming up. When we were down, we asked and the clerk said that the service has been resumed, to our disappointment. Anyway this is why you should check the weather report first.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Ride up the mountain", "Amazing views! Me and my boyfriend went this past weekend. It was quick, no line. Was able to take amazing pictures. We went to ski lodge at the top and enjoyed a beer before riding back down."], ["Reviewed December 15, 2017", 4.0, "Enjoy the snow and have fun!!", "Fresh mountain air and fabulous snow views. They also provide skiing classes here, and they do have easy and slow ride to the higher area."], ["Reviewed December 12, 2017", 3.0, "Pretty views but costly", "We are not skiers but wanted to see up the mountain. As we stay at the Timber Lodge, the Gondola was right outside the entrance. You do get great views and the ride takes about 20 minutes each way. There is a massive observation deck before you get to the top that you can get off at and look around. Beware though the observation deck is only accessible on the way up. You can get back on and continue to the lodge, walk around and return when you are ready.\n\nMy only complaint was the cost. For adults it is $55 each during winter and $20 for kids over 4. Clearly, the gondola is more for skiers and I'm sure built into the lift passes but for sightseers, that's pretty steep. I would say worth the onetime expenditure.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Great views", "I only did this for the view which was breathtaking. The price was really steep, but I don't ski so I wasn't really getting my money's worth anyway. I would go early, the lines can sometimes be long"], ["Reviewed November 23, 2017", 4.0, "Short wait, easy slow ride to ski area", "We rode the Gondola at Heavenly on 11/20 and 11/21 in order to get to the ski resort (both the California and Nevada sides were closed still).\n\nThe ride itself was easy (no lines), smooth, and all the operators were nice/friendly. The only downsides were the somewhat long ride and the fees to park in the parking garage. We parked in the parking garage the 1st day and ended up paying around $21. The second day, we found a free lot that was walking distance away instead.\nShow less"], ["Reviewed October 21, 2017", 1.0, "CLOSED", "I was so very disappointed. The Gondola was closed! I checked several sites, Trip Advisor as one of them, and every single place told me it was opened today until 4:30. You can imagine how disappointed we were. We even drove 2 hours just to come ride. It does look fun, just wish the information provided was accurate.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Highly recommended", "What an amazing experience. Fabulous views. Fresh mountain air. So pleased we decided to visit the top of the mountain, saw little chipmunks and felt really healthy with the fabulous air."], ["Reviewed October 15, 2017", 2.0, "Not Very Heavenly", "Our first time ever to South Lake Tahoe. The town was full of people. But the gondola was closed for maintenance. This was a Saturday so it isn't like they schedule their work during the week. This was middle of October so beware if you come this time of year.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Amazing views!", "This is expensive but worth it if you're not someone that can hike up a mountain. The views are amazing."], ["Reviewed October 10, 2017", 5.0, "Great views of Lake Tahoe", "We stay at Tahoe seasons resort at the base of heavenly so this is a great opportunity to take a ride up the mountain and see all the great views of Lake Tahoe and downtown area you can see for miles in all directions. Whether it’s winter our summer reviews are outstanding all the time .\nShow less"], ["Reviewed October 4, 2017", 1.0, "CLOSED", "Planned to ride the gondola one afternoon during our vacation. Got to the ticket office to find a sign that said CLOSED. If you are planning a trip in the near future, please be aware it is closed for maintenance until November. Very disappointed!"], ["Reviewed September 25, 2017", 5.0, "Heavenly Gondola", "We'll worth the cost. The view is fantastic. Definitely get off the 1st stop and do the walkway to see Lake Tahoe. The lodge at the end has the best Bloody Mary but is pricey at over $17."], ["Reviewed September 25, 2017", 5.0, "Must do", "The ride what can I say of the views enclosed cabs made it much nicer to take pictures. People working the lift where very nice helpful ."], ["Reviewed September 25, 2017", 4.0, "Great views but disappointed that everything was closed", "The views were fantastic as everyone else notes. We were disappointed that everything at the top was closed due to recent snow including the hiking trails. Our fault for not checking the board near the ticket counter in advance."], ["Reviewed September 24, 2017", 5.0, "Breathtaking ride up the mountain", "Visited Lake Tahoe for a wedding. We decided to take a Gondola ride up the mountain. It was cold but the views were breathtaking. Take a camera and dress for the occasion. We stopped at the top to take in a college football game, drink a beer and enjoy the scenery. It did not disappoint.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Morning sightseeing", "My honey and I decided to take it to the top of the mountain. Cold morning for sure... remember to take your gloves and scarf as well as your camera. Breathtaking views. A cup of hot chocolate is just what we needed to get warm. Love the stops and trails along with way. Wrapped up out trip at the lodge watching college football, enjoying a glass of beer and some good chill!\nShow less"], ["Reviewed September 21, 2017", 4.0, "Going to the top", "Expensive but worthwhile ride to the top of the ski hill. Over 9,000 feet with a panoramic view of Lake Tahoe and the town below."], ["Reviewed September 19, 2017", 5.0, "Amazing!", "The viewing stand at the top of the gondola offers the best view of Lake Tahoe to be found. You can see all the different shades of blue, the sail boats and the surrounding Sierras. Breath taking. The lodge at the top is nice and a meal credit is offered with the ride. Great value.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Fun time", "My wife and i were referred to this activity by the front desk woman at Postmarc hotel where we stayed while in Tahoe. It was a very smooth calm fun ride up the mountain with amazing views, especially at the top of the mountain. Great time, would recommend it to anyone visiting Tahoe.\nShow less"], ["Reviewed September 18, 2017", 2.0, "Be Sure to Check Seasonal Hours", "We were really excited to take the gondola for a view of Lake Tahoe. I'd called ahead to see how long the gondola ride takes which the woman estimated to take about 25 minutes all together. Problem was, that when we got there everything was closed even though the website said that it opened at 9am. It turns out their seasonal and weekend/weekday hours are not well advertised. They aren't running the gondola Monday-Thursday currently (September). I highly advise that you call ahead and ask their current hours since I had to call twice to figure this out. There is a large sign board right outside Heavenly that shows what's open/closed and hours of operation but that's only convenient if you're there on the premises. I'm sure the views are great, just sorry we missed out on them due to the hours of operation mix up.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Shortened Trip", "Nice view. Expensive but unique. We had planned for half a day with adventure pacs for the youngsters, but my wife had a nasty fall while walking that required first aid and a trip to the Quick Care facility in Stateline. Nick and his crew of medical staff on the mountain were great. Really took charge and dealt with the situation. We also got full refunds for all our tickets--including the gondola ride--so it turned out to be \"not expensive\" after all. So, all in all, it was, good and not-so-good. Once my wife got checked out OK at the facility in Stateline we called it a day. I felt bad for the grandkids who missed out on the zip lines, etc., but at least we got great view of Lake Tahoe from the top of the mountain.\n\nShow less"], ["Reviewed September 17, 2017", 5.0, "Spectacular", "Bit pricey at 45 dollars each and then if you want to take part in any of the activities at the top you need to pay for them but the views are absolutely stunning and would not have missed it for the world."], ["Reviewed September 16, 2017", 5.0, "Great trip, great service", "The gondola ride up the mountain was fabulous. The trip was made even more enjoyable by the friendly and helpful staff who seemed to go out of their way to make the mountain experience something special."], ["Reviewed September 12, 2017", 5.0, "Breathtaking!", "This place is a MUST visit when you're going to South Lake California! One of the most breathtaking view I've seen in my entire life.\n\nTIP:\nIf you're going to visit during summer, make sure to bring your cap and jacket or scarf, because it's still chilly.\nShow less"], ["Reviewed September 12, 2017", 3.0, "Summer: must stop for the view", "Compared to the Rockies or the Alps, the gondola takes you to a rather ugly mountain bowl where there are quite a lot of activities. It might look better with snow but we will not be rushing back.\nThat said, the view of the lake from the viewing platform at the first stop going up is magnificent. It almost got a fourth star. Make sure you see it going up as the gondola does not stop on the way down.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Gondola ar Heavenky Valley", "Do you want the best veiw of Lake Tahoe? Take the gondola ride up to 8200 feet and see the Lake in all its glory. Don't forget your camera....but if you do there are photographers there who will take your picture for a fee. You will be on the top of the world!\nShow less"], ["Reviewed September 10, 2017", 5.0, "What a view!", "This is an easy way to see the top of Heavenly and it's heavenly views! The staff is very friendly and the trip is worth the price. I just wish they allowed mountain bikes!"], ["Reviewed September 9, 2017", 5.0, "Awesome views", "Altho there were severe weather advisories, the skies were sunny and clear yesterday and we decided to take our chances. A beautiful day. We highly recommend the added ski lift chair ride at the top. Getting off at the first is a definite YES as you can't do on the way down. We enjoyed the beauty and finished well before the temps took a dive and a hail storm moved in. Put it on your TO DO List.\nShow less"], ["Reviewed September 7, 2017", 4.0, "A must do when in south lake tahoe", "15 mins ride can get you up to the observation deck. The view there is a must see when you visit south lake tahoe."], ["Reviewed September 6, 2017", 5.0, "Surprised", "Not only was I surprised with Lake Tahoe, the town, food and the gondola ride to observe views of the mountains, but I was surprised by my honey who proposed to me on Heavenly Mountain lots to do for adult and kids. Within walking distance from nearby hotels..\nShow less"], ["Reviewed September 4, 2017", 4.0, "Beautiful scenery", "For being a Sunday on Labor Day weekend I thought there would be a long line to buy tickets and jump on the gondola but to my surprise we only took maybe 15 min to do both. It was pricey but worth to see Lake Tahoe up on the mountain and see just how big the lake is. There is a bunch of activities to do up on the mountain like zip lining hiking and rope obstacle courses even for the little ones. It's probably a 20 min ride to get to the top. You also need to get off at the halfway point at the observatory deck to take some amazing pictures. Everything on top of the mountain is very expensive so take your own water.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great ride -- superb views", "The five minute ride to the top is smooth and the views from the top are spectacular. Because the tram can hold fifty people, try to get a spot where you can see."], ["Reviewed September 3, 2017", 5.0, "So glad we did this", "The gondola is expensive; there's no denying that. But we have no regrets about spending the money. What a view! It was truly a vantage point like no other. Staff, particularly on the observation platform, were very friendly, and everything was very clean. Great experience."], ["Reviewed September 2, 2017", 5.0, "Expensive but worth it", "A fabulous day out on the gondola with spectacular views of Tahoe and a wide range of activities for all ages . Not to be missed"], ["Reviewed August 31, 2017", 5.0, "Beautiful sights", "Great ride up in the gondola and chair lift, then hike to the top of the mountain. Clean, well-marked, moderately difficult trail at the end, very fun. Fabulous view."], ["Reviewed August 30, 2017", 5.0, "neat view", "Well worth the money. Great vistas at the first stop. Lots of activities at the top. Drinks were a bit high."], ["Reviewed August 30, 2017", 1.0, "Trapped!", "At roughly $100 for two adults to go up in a gondola to take in the sights, you expect things to run like clockwork. This didn't. Everything was fine going up--stopped at the observation deck for photos and to look around, and proceeded up to the top where the view is less, but there are other activities. OK so far. On the way down, the gondola stopped abruptly, and remained stopped for about 15 minutes. Probably wouldn't have been a problem, but it was 4pm, about 85 degrees outside, and not a cloud in the sky, so no shade. With only tiny holes to allow air in, it became very hot in the gondola almost immediately. (An elderly person with breathing problems, an expectant mother, or parents with fidgety kids would have been in big trouble!) Upon reaching the bottom, the staff was dismissive--it was a \"bad sensor\" that caused the stoppage. They gave us a token refund, but only because we pushed for it. If you ride this, beware!\nShow less"], ["Reviewed August 30, 2017", 4.0, "Views are worth the cost", "Beautiful vistas with great photo opportunities. Most of the employees are friendly and helpful. The altitude made me a little unsteady and an employee walked over to check if I was OK. WOW!"], ["Reviewed August 29, 2017", 4.0, "Adventure Awaits!", "This really does give you a view of Lake Tahoe like no other. You ride way up to an observation platform first with amazing views and photo opportunities. Then you continue up in the gondola to the top. There is a further option to go even farther up in a chair lift once you get off the gondola. We didn't do that part, but instead spent our time hiking around. There are also numerous activities you can pay extra for, such as zip lines, tube rides, rope courses and a rock wall. There really is a lot you can do up there. The downside is that this is all very expensive. Just going up in the gondola for a family of four will set you back over $150. This does not include all the extra stuff you might want to do once up there. Food was another kind of ridiculous expense. At the top, a bottle of water costs $5.50. Really? However, the views are stunning and being up at the top of the mountain is a great experience.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Gondola provided great views and nice hikes", "A bit pricey but we had a great day. To see Lake Tahoe, you stop at the observatory level. We learned a lot about the lake from a guide posted there, then continued up. We took the chair to the top; it's free but you need to sign a waiver at the bottom and get a hand-stamp. It was a nice hike to the top from there with spectacular views. Then we hiked down to the gondola; a nice varied trail, more interesting than just walking down an out-of-season ski trail. We got to the ski lodge just in time to get lunch; they were starting to close down the cafeteria around 2:50pm. There were lots of activities for families with children that looked like fun -- ropes courses, zip lines, and the like -- and they were not busy. They didn't appeal to us (two older people and two young adults) so we were grateful we didn't buy the more expensive tickets that included activities when we purchased the gondola tickets. Then we returned to the bottom by gondola. There were no lines or crowds when we went - a Saturday in late August. Very worthwhile in spite of the price.\nShow less"], ["Reviewed August 28, 2017", 5.0, "beautiful summer ride to base village", "we are not skiers so we enjoyed the scenery in august..took the chairlift to the top of the ski runs and hike a little from there..many photo ops"], ["Reviewed August 28, 2017", 4.0, "Expensive but still worth it with unique view of lake tahoe", "What can I say, was little sad paying $48 per head. But totally forgot once we boarded the Gandola. It gave a very different view of Lake Tahoe. It got two stops where you can spend as much as you like, be aware of the timings though. The first stop is just for the views , got a little cafeteria and restrooms. Second stop is full of activities. For every ride/ activity up there , you need to pay.\nWeather - it was little unpredictable I would say- it was chilly at the first stop and too hot at the second stop( at least that's how it was for us)\nMake sure you keep water with you, especially when u are riding down , especially when it is sunny. It got suffocating inside. There is ventilation but it got very hot.\nView of the lake - it was awesome but I felt it might be beautiful during spring cause the water color is more blue then. When we went, it did not show the Tahoe Blue color. You can easily spend from two hours to whole day here depending on your energy , interests and budget.\nThe first 3 pics here are at the second stop.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Nice views of the lake", "The ride was worth it for the lake views from the midpoint stop. Make sure you get off at the first stop going up because on the way down you cannot get off to enjoy the spectacular views of the lake. The activities at the top were fun for my kids. Nice place to spend 3-5 hours.\nShow less"], ["Reviewed August 24, 2017", 2.0, "Ropes trainer very rude! Slapped my daughters hand!", "To my 13 y/o daughter while training before going on the ropes. He actually slapped her hand away twice! Once while she was trying to help her little sister learn and then again when she was done and was taking her helmet off in the area to get the gear off. My girls said he was very rude to all the kids before them as well. Maybe someone else should be doing the training that can handle dealing with kids. I don't appreciate my daughters hand being slapped! Not happy!\nShow less"], ["Reviewed August 24, 2017", 4.0, "Beautiful Sightseeing!", "Yes, it is expensive BUT so worth it! The views are spectacular! Lots to do for a price. We were bummed that the coaster wasn't working but they had so much snow, they didn't have time to do the maintenance. The food at the top is very expensive.\nShow less"], ["Reviewed August 24, 2017", 3.0, "Nice", "Beautiful ride to the top, and nice walking area. Lots of add on attractions once you are at the top. Restaurant was underwhelming more cafeteria style as opposed to fine dining. A little expensive but worth it."], ["Reviewed August 24, 2017", 5.0, "Great tourist attraction", "I highly recommend the gondola trip up Heavenly mountain. Take your time at the observation deck. The views of the lake and mountains are stunning. We also took the ski lift further up the mountain. Well worth the time and money."], ["Reviewed August 23, 2017", 4.0, "Great views, great ride", "Really nice ride up the mountain with plenty of six seat gondola cars. Stop on the way up at the observation deck for the best views of the lake and surrounding area. It does not stop there on the way down. At the top there is a great adventure park to enjoy and dining. I gave it four instead of a five only becuase it seemed expensive in my opinion.\nShow less"], ["Reviewed August 22, 2017", 5.0, "breathtaking", "Amazing scenery going up, at the top, and on the way down. Lots of things for adults and children to do at the top, including zip lines, ropes courses, tubing, hiking trails. etc. Only drawback was a closure due to bad weather."], ["Reviewed August 22, 2017", 5.0, "Fun trip up the mountain", "We took the gondola up to Heavenly Village. It is a fun trip up in the summer and you can see the lake and surrounding area."], ["Reviewed August 21, 2017", 5.0, "Went in the summer", "I do not care what the other reviews say. if you want an amazing view, it is worth the money. We do not have kids, I do not know if it is kid fun. But we really enjoyed it. Brethtaking view. Would do it again if we went back. The lift ride up was steep. And the gondola stops sometimes. DONT PANIC, it starts up again.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Awesome", "We loved the ride and the views. If you like hiking, rock climbing and zip lining you will love it even more. It takes about 25 minutes up if you don't get out on the terrace to savour the views. I highly recommend that you do as these are the best views you can get on the ride.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Mountain top wedding", "We went to a beautiful wedding on top of Heavenly Mountain. The gondola ride up from the base was very scenic, the view of Lake Tahoe was gorgeous and the staff very friendly and helpful."], ["Reviewed August 19, 2017", 2.0, "Great view BUT!", "$49 per person to ride a gondola???? Really!? It was beautiful, but we felt the pricing was insane! I really felt like it was ridiculous."], ["Reviewed August 18, 2017", 5.0, "Best view of the area", "Just perfect for seeing the sights. You get to go up to levels in the condos, and go to the top of Taramac on a 6 seater chair lift, which you either ride down or hike down."], ["Reviewed August 17, 2017", 5.0, "It's an Epic Deal!", "If your are Epic Pass season's pass holders, you ride for free!! It's a beautiful ride in the summer. Get off at the middle point and walk around the observation deck. Here are some of the most beautiful views of the lake. Get back on and ride to the top. Then ride up the Tamarack Lift to reach the highest point. You can hike up even further or just go to the Carson City Lookout for great vistas. There is zip lining up there as well. We hike down the trail back to the Tamarack Lodge, it's a nice moderate hike down. Be sure to check times for last gondola down!! Glad I had my pass it really was fun and no extra charge with pass.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Worth it for sure!!!", "Amazing views, fun activities for all. Great setting. Staff were all so great :) Good for all ages and safety is certainly kept in mind :)"], ["Reviewed August 16, 2017", 5.0, "Great Ropes Course and zip line tours", "We did the Silver Rush Zip line tour and the mountain pass which included the three ropes courses and gondola ride. The mountain, lodges and amenities were spotless. The three ropes courses were great. The hours were somewhat limited and some of the courses were closed which required to go up on the next day at no extra charge but a little bit of an inconvenience. The people who sell these passes at the bottom of the mountain are not pushy but provide tons of information. There are different levels of passes that increase in activity and price and we never felt pressured to purchase the ultimate pass. However, the highlight was the zip line tour. We have done zip lines but we never did a tour like this. We went from tree to tree across 5 zip lines that went from long and fast to longer and faster over the course of 3 hours. It was a real adrenaline rush. What made the zip line tour great were the guides. We had Dylan and Chandler. They were unbelievably great, informative and very safety conscious while at the same time providing a lot of fun for my wife, my two boys (16 & 15) and me. They clearly explained the operation, provided us insight into some of the wildlife and trees and instructed us on the safe use of the zip line. They never seemed that they were going through the ropes and clearly seemed to enjoy their job. Because of the fact that some of the ropes courses were closed I would have given it a rating of 4, however Chandler and Dylan were so good I gave it an overall five rating.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Seemed Pricey but worth it!!!", "My wife and I spent ~3 hours by the time we rode the gondola, the chair lift at the top and took some short hikes. You could easily spend more time if you did the zip lines and such that are available."], ["Reviewed August 16, 2017", 5.0, "Must See", "The gondola is a must! Once you reach the top, you can take a free chair lift ride even higher that goes up without stopping and comes back to the gondola stop.\nIt was stunning to walk around the observation area...snow capped mountains, the lake and clouds.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Nice ride with great view of the Lake", "A bit pricey, but this is something you don't do every day. Gondola ride is nice and you can hop off to first stop, observation deck with beautiful view of the Lake and enjoy beauty of the mix of green and blue colors. Next stop is full of activities for kids and some for adults. We went on short 1000ft zip line and that was fun. You can hop on chair lift ( free with paid gondola ticket) and go even higher to the top. Nice place!\nShow less"], ["Reviewed August 15, 2017", 5.0, "Amazing views", "From a picturesque view of downtown Heavenly to seeing far and wide from the top, this is an awesome day out. If you want to do activities though, be sure to wear closed toe shoes! A couple from our group were unlucky to find that out when we arrived\nShow less"], ["Reviewed August 15, 2017", 5.0, "The views from the top are awesome!", "you have got to try the ride up to the top...the ride and the views you enjoy while riding are definitely worth the price of admission!! it's a must try while in the area!"], ["Reviewed August 14, 2017", 5.0, "Fantastic", "Besides being scared of heights, this is worth every dollar.\nYou stop about half way up at a viewing platform. The views are breath taking, really amazing. Hop back on the gondola and head to the top!\nReally good trip up, maybe go when it is cooler, like in the morning as the gondolas will be very hot.\nFantastic, really worth it.\nShow less"], ["Reviewed August 14, 2017", 5.0, "What a view!", "This is a MUST if in the Tahoe/Heavenly area. Amazing ride, views, and experience at the top! We booked it just for the sights, but when we got to the top and discovered all the options (zipline, chair lift, marked hiking trails, tubing, and more), we were that much more thrilled that we booked it. You can make a full day of fun here!\nShow less"], ["Reviewed August 14, 2017", 5.0, "What a view!", "We took the gondola ride and it's well worth the money. The first stop is a view point. Beautiful views, tables to eat at and a coffee shop to grab a cup coffee and a snack. The second stop up top has lots of neat things for the kids and kids at heart to do. We didn't realize all the activities they had up at the top. Pack a lunch and enjoy the day!\nShow less"], ["Reviewed August 14, 2017", 5.0, "An absolute must in Tahoe", "The Gondola at Heavenly was the best thing that we experienced on our trip to South Lake Tahoe. It's not cheap but is well worth the cost. We rode the gondola up and there are quite a few other things to do as well when you get up the mountain. My children loved taking the ski lifts to the top of the mountain and others in our group loved the zipline. The view is amazing, I would definitely go again the next time in the area.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Beautiful views", "Took the gondola to the top for a destination wedding, went up in daylight came down after dark ...stunning views on both rides especially the lights around the lake after dark."], ["Reviewed August 13, 2017", 4.0, "Nice summer excursion", "It was interesting to go up in the gondola in the summer versus the crowded conditions during ski season. surprised at all the activity up on the mountain. Everything is very pricey, but great views of the lake."], ["Reviewed August 12, 2017", 5.0, "Must See and Must Do in Tahoe", "In the center of Heavenly Village this is the main attraction. Beautiful design and view as you ascend to the top of the mountain. Breath taking view"], ["Reviewed August 11, 2017", 5.0, "Reunion", "So I do not like heights AT ALL! But we stayed at the Timber Lodge Marriott so our group wanted to this. I'm so glad that we did. It was fun and very safe! We went to the very top and walked back down to the gondola. This is definitely a family activity.\nShow less"], ["Reviewed August 11, 2017", 3.0, "Prices are obscene", "$96 for two to ride the gondola to the top. Views are amazing. Gondola was dirty, hot and stuffy. Bring your own refreshments. 16 oz soda, 16 oz water and small bag of Doritos was $17. That's no typo...seventeen dollars and some change."], ["Reviewed August 11, 2017", 4.0, "Great View", "We enjoyed our ride up Heavenly even though the gondola was too warm with little air circulating. The stop midway up was nice with views of the lake and surrounding area. There was also restrooms at this stop. After arriving at the lodge sea, we took the ski lift (included in the gondola price) up the rest of the way to the top of Heavenly. The lodge had a restaurant and restrooms. There were several activities for purchase including zip lining. We just weren't that adventuresome!\nShow less"], ["Reviewed August 10, 2017", 5.0, "Vacation", "Excellent views and lots to do once on top. Staff was great and weather was wonderful. Definitely recommend!"], ["Reviewed August 10, 2017", 5.0, "More than you can imagine", "This gondola serves heavenly valley ski mountain. In the summer the mountain evolves into a massive village of activities.there are so many fun stations here for mostly younger set but I enjoyed the tube ride with my grandson. Plan on a full day up there in the clouds.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Great Views", "Well worth the money if you want a complete view of Lake Tahoe. Just make sure to spend all the time you want at the observation deck since you cannot stop there on the way back down"], ["Reviewed August 9, 2017", 5.0, "Great views at the first stop", "Beautiful view of the lake at the first stop. Second stop now has a cafe and zip lines. Prices for food and drinks are very expensive so try to eat before going up. My son did the longest zip line and had a blast. If you haven't rode this gondola than it's definitely worth it.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great views!", "We were staying in Heavenly Valley and decided to take the gondola ride. Be aware that this attraction is very dependent upon the weather.\nWe went on an afternoon and were told that bad weather was coming in and we should wait until the next day unless we wanted to do a quick round-trip ride. We opted to wait until the next day.\nWe went early and took the gondola up the mountain. We're both a little height-sensitive, but the enclosed gondola car was pretty comfortable and felt secure. You need to get off at the first stop so you can take pictures of the lake. The second stop has an adventure park for the kids with a ropes course, tube slide, and zip line. There is an additional charge and waiver that need to be signed but the kids in this area were having a blast. We filled out the extra waiver and got a hand stamp that allowed us to ride an additional chair lift up the next mountain. There were several walking trails. We weren't up for the hikes, but many others were enjoying the trails.\nThere were no lines getting on and off the gondola or chair lift. It was very easy to do, a fun ride, and beautiful views in both directions. It was worth the trip and we would totally recommend it to friends and family.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Really, do this at least once!", "In the summer this is a beautiful activity. The views are amazing as you rise higher and higher over the lake. Be sure to stop midway and take some photos at the platform before continuing on to the top. Up there you'll find activities for the whole family including zip line rides, snack bars, and hiking.\nShow less"], ["Reviewed August 8, 2017", 2.0, "Zipline not all that", "This review is for the Blue Streak zipline. Don't waste your money or time. I've been wanting to check out the epic adventures they have during summer at the top of heavenly for a year now so last week we decided to try it out.\n\nI booked our adventure the day before reserving our 11:30 spot. We showed up an hour early like we were instructed. We waited in the gondola line and then were told we had to check in in the heavenly store. Would have been nice if that was clearly stated during the booking process or maybe a large sign at the gondola to let people know.\n\nWe waited in another line to check in to sign the waivers. From there we waited in yet another line at the cashier in the store to get our wrist bands and pay. (Too many moving parts of you ask me).\n\nPrice: $69/person + gondola tickets - thankfully we had free gondola passes so we did not have to pay for those tickets.\n\nWe were told we had to hurry since the gondola ride up takes a while then you hop onto a chairlift at the top. Yet we had a reserved time slot...\n\nWe rode the gondola up to the 2nd/last stop. Hopped off and hopped onto the chairlift to the zipline platform.\n\nThe blue streak zipline is a single line that's 3,300ft long. It has a beautiful view of the lake as a back drop. However, the chairlift ride up the the zipline platform runs parallel with the zipline soooo you get the view up and back down.\n\nThe zipline itself is awkward. You are harnessed like normal ziplining except you sit in a chair apparatus. You do get to go 2 at a time so my husband and I rode next to each other.\n\nI love ziplining but can honestly say this wasn't worth the money. I'd rather spend the money and do the zipline courses they have.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Experience of a Lifetime", "Though it is expensive it is worth taking the Gondola up to the top of Heavenly and experience the birds eye view of the lake and town. The mid station allows you to get out and take pictures and learn about different destinations in the area based off of plaques showing you the direction of the sites. You can also ride the lift (Tamarack) at the top and get up even higher. Also, there is a large lodge available with snacks, food, and drinks if you would like to make a day of it. It takes approximately 10-12 minutes to ride up and 20 plus minutes round trip if you do not get off.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Heavenly view!!!!!", "Visited this place during Summer and took the Gondola. Plan half a day for this activity as the Gondola ride has two observation deck and lot of summer activities such as zip-lining, tree obstacle courses, water parks etc. Also the view of Lake Tahoe from observation deck is amazing and breathtaking.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Closed due to weather!", "Hi! I really shouldn't even be reviewing this because the gondola ride was closed due to severe weather when I tried to visit yesterday (Aug 6). So I can't opine on the (surely awesome) view from the top. But I can tell you that it was $49/adult. And looked fun. Will try again on a less severe weather day (ps-it was sunny at the gondola base, but it torrentially rained 10 mins later).\nShow less"], ["Reviewed August 6, 2017", 4.0, "So much fun at the top of the mountain", "Went up and did the adventure pass. Tubing was a blast and I did the ropes course and ziplining. Food is super expensive at the top. I think the adventure pass it worth price, but check the weather before you go. the mountain closes often in the summer for lightning.\nShow less"], ["Reviewed August 3, 2017", 5.0, "The hype is true", "The tour books and friends said the Gondola ride gives you a great view of Lake Tahoe and they are certainly right. Worth the price to ride to the top."], ["Reviewed August 3, 2017", 5.0, "Great view", "We rode up the gondola and got off at the observation deck and enjoyed the incredible view of the lake and the mountains, we then rode to top which has multiple activities which you have to pay for and it's not cheep, there is a zip line and climbing walls, the food at lodge is expensive but the kids had a great time.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Great Views of the Lake - Friendly Staff", "Took the gond0la ride yesterday. The positives are the ride is smooth and efficient. You have an ability to stop on the way up at an observation post for a nice view of the Lake and the area. The staff is plentiful (except when purchasing tickets), helpful, and courteous. The slightly downside, once you get to the top, be sure to have your game plan in place. Took one of the hiking trails, while they are relatively well marked, we chose our trail based on the \"$100 view\", it was hard to tell when we achieved that view. Nothing was marked along the trail indicating we arrived at our destination. If you don't have kids with purchased activities, or a desire to zipline, there isn't that much else to do - and it's not an inexpensive journey. All in all, a nice way to spend a morning, just know what your game plan is.\nShow less"], ["Reviewed August 2, 2017", 4.0, "You should take the Gondola at least once.", "The view is beautiful, and you can ski multiple runs or walk several short trails during the winter from the top. There is a very nice observation deck where you can view Lake Tahoe from way up high. The only problem with this ride, is the cost. We stopped taking our family up 4 years ago because of the cost.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Great ride and view, a bit pricey", "We came to Stateline in July and the gondola ride up the side of the mountain was a nice break from the heat. We were in shorts and T-shirts and the weather at the top of the mountain was just perfect for us.\n\nThe ride is about 10 minutes and comes in two segments. The first part brings you up to the top of the mountain (elv. 9,150') where there is a nice walkway with spectacular views. When we went, there were a lot of people, but not overly crowded. Without coupons, tickets are about $48 per adult, slightly less for teens and seniors.\n\nThe second segment brings you to an area with lots of activities (ziplining, ropes course, climbing wall, etc). Each activity is an additional cost and tickets can be pre-purchased near the gondola station at the bottom of the mountain. I believe they can be purchased at the top as well.\n\nThere is also a large cafeteria for dining. I would highly suggest bringing your own food however unless your name is Bill Gates. For example, 4 chicken strips, fries and a soft drink will set you back about $24.\n\nOverall, we found the gondola ride a nice experience. There is plenty to do at the top and the views are great! We just stuck to the ride, because everything was a bit expensive for our tastes.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Great views", "Quite pricey $48 each but great views from the half way section of the gondola and lots to do at the top. Looks very good for families with kids as lots of activities to do at the top! Visited summer season."], ["Reviewed August 1, 2017", 4.0, "Cool Experience. Hot Gondolas.", "Really cool experience. Only issue is that the gondolas were hot and not well ventilated. Otherwise a very nice experience."], ["Reviewed July 31, 2017", 4.0, "Very enjoyable!", "The ride up, although stuffy inside the gondola, was picturesque! Friendly staff, quick lines if any, and equipment in good condition (scratched plastic windows of course) made for an enjoyable way to spend just under a hundred bucks..."], ["Reviewed July 31, 2017", 5.0, "Concert stay", "Attention to detail at this inn was amazing! Will definitely go back.\nThank you so much for taking care of us during our short stay...wish we could have experienced your hospitality for a longer stay.\nWe will highly recommend to anyone who inquires about our trip!\nShow less"], ["Reviewed July 30, 2017", 5.0, "Worth the price", "Fabulous views of the Lake\nHave your cameras ready!\nThe ride up was a little warm with no breeze in the gondola. Sadly windows are sealed closed because some fool in the past threw out a lit cigarette and started a FIRE on the mountain.\nFun activities at the top for all ages.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Best view of the entire lake!", "We heard this was the number one rated attraction at lake Tahoe and agree. The ride is fun and the view is spectacular! You hop on right in town off off the main street, and there is a parking garage next door. The garage has no attendant, you enter your phone number on a screen when entering, and pay at a first floor kiosk when picking up your car, by entering your phone number again and paying with your credit card.\n\nThe ride is fun, the gondolas seat four and there are plenty of them, we had rides all to ourselves. When you get near the top you get off at a huge observation deck with a snack shop and gift shop. The views are amazing and we saw a golden eagle, as confirmed by two staff members who are there every day. We could even video chat with my sister in England and show her the lake!!\n\nNext stop is down to a valley with a huge activity center, dining lodge and chair lifts to go even higher up. They have zip lines, climbing areas, and hiking trails. You can hang out for hours, we ate and rode a lift before heading back down on the gondola. We spent several hours here and it was totally worth it!!\nShow less"], ["Reviewed July 26, 2017", 4.0, "Heavenly views", "Literally Heavenly views to be had while riding this. Only reason for not being 5 star is the price- definitely a pricey experience and no little extras with it. I have done this in the past, July 2011 and August 2013, and previously a lunch voucher came with it. So the value is not as great as it once was.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Gondola", "Beautiful scenery and friendly staff! Well worth the time and money! The top of the mountain is a bit chilly, even in the summer months."], ["Reviewed July 25, 2017", 5.0, "Ziplines and ropes course were a big hit", "TripAdvisor really needs to open a new entry for summer activities at Heavenly. Summer options are SO different than winter.\n\nWe did the Blue Streak Zipline (the longest one at 3300 feet) and everyone loved it. We had 3 grown ups who were a bit squeamish to try it, but found it was awesome, and two 12-year olds who loved it but felt like it could have gone even faster. (I think because they were lighter, they may have gone slower than the grownups, who thought it was plenty fast). They tell you it can get up to 50 miles per hour at the highest speed, you slow down significantly below that before coming in to \"land\". You sit in a seat, which makes it feel less frightening than some ziplines. It's a long ride (for a zipline) with lovely views. Really recommend it.\n\nThe kids and some of the adults also did the \"middle\" of three ropes courses. It was was really fun for all, although the adult most afraid of heights was definitely put off by some of the crossing options. It's nice that there are multiple ways to get though the course and you can try different routes. There are three ropes course options -- one for very small kids, a mid-range one that's great for tweens and more conservative adults, and the largest one targeted at adventurous adults.\n\nIt's a little complicated to figure out the ticketing structure for the summer activities. There is no \"one ticket for all activities\" pass. The two longest ziplines must be purchases separately, a set of activities including the ropes courses and a tubing run come as part of a package, and there are two options for a 5 or 7 zipline \"canopy tour\" that is totally separate. I think they could simplify the ticketing a bit. But we got there at 11am and happily stayed till the activities closed at 4pm. Could easily have arrived earlier and spent the entire day there. Fantastic for our 12 year olds and adults. The younger kids options looked like they would be equally as fun.\n\nOne note -- I found the \"dry land\" tubing a little uncomfortable. You basically are tubing on some kind of astroturf. You go remarkably fast, and the sides of the tubing run feel low. I kept thinking I was going to slide over the edge and scrape myself up. I did not...nor did I see anyone else slide out of the track, so it's likely just my fear. But it felt dicey to me. Looked much less dicey for kids (they weigh less and didn't seem to slide up as high on the sides).\n\nI was definitely a little apprehensive about the long zipline, but I loved it. Give it a try even if you're a little nervous!\nShow less"], ["Reviewed July 23, 2017", 5.0, "Fabulous experience!", "I was a bit surprised and daunted by the price as we were a party of ten but I would recommend this trip, not only for the views, which are magnificent, but also for he beauty all around including snow in July. We couldn't get on a zip line too windy and also costs extra but we took the ski lift up to the top which was incredible and free.. There are activities for the kids which also cost extra. But for a once in a lifetime it's worth it.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Worth the visit", "A bit pricy, but good activities for the family (additional charge for some activities). Get package orientation before buying tickets."], ["Reviewed July 22, 2017", 4.0, "Great views of Lake Tahoe", "Taking the gondola up the mountain is a great way to see Lake Tahoe and the basin below. The overlook is fantastic and coffee is available. Ride further up to see the cafeteria,restaurant (full bar) and summer/winter activities."], ["Reviewed July 21, 2017", 1.0, "Expensive let down", "We had great hopes going up to the activities via the gondola..... It was very expensive for the gondola trip - $176 for the 4 of us..! Once up there we felt we need to at least try something, we went for the 4 line zip wire (another $160!!!) this was cheaper then the other zip wire at $69 each...!\n\nIt was ok but certainly not worth the money...we decided to call it (a very expensive) day and head back down.\nShow less"], ["Reviewed July 20, 2017", 5.0, "A beautiful view of Lake Tahoe", "We rode the gondola after lunch on a weekday afternoon. A beautiful view of the lake from the middle observation stop. The top had a lot of activities that would appeal to families, but we paused just long enough to look around. Well worth the time and money.\nShow less"], ["Reviewed July 19, 2017", 1.0, "Epic Disappointment", "I was looking forward to this adventure and was very disappointed. The cost was high at $86 per person for the all inclusive (except zip lines) option. The biggest disappointment was the coaster being closed. There was nothing stated anywhere down below about this ride being down for the season. I didnt realize I needed to ask if rides that were advertised were actually operating.\n\nFor the multiple rope line activities, the wait was very long. This was on a Wednesday and not highly crowded. There was a 30 minute wait just to get to the line to get safety harness and helmet equipment. It was very slow and disorganized.\n\nWhen doing the tube slide, there were breakdowns which closed lanes to 1, creating a long line to ride.\n\nOverall, I will be thinking twice if I ever do this again. If you are going to do this, Ask what rides are down for the day!\nShow less"], ["Reviewed July 19, 2017", 4.0, "Amazing views", "Expensive but gorgeous experience. Would be nice if there was a discount for 4+ people. Kind of hot and steamy inside gondola but tolerable."], ["Reviewed July 19, 2017", 5.0, "WHAT A VIEW", "The group of employees that run the gondola and the zip line, tubing and rope climbing are the best. I have never come across a more professional group of young (18-25+?) people that are the nicest and accommodating. If the rest of the young people across the USA were of this caliber, maybe we DO have a chance.\nAnyway off my soap box.....this is a wonderful ride up the mountain that stops half way up for pictures then a quick hop back on up to the lodge. You don't have to get off, but if you want pictures from this area, you need to get off. The downhill ride doesn't stop. My only complaint is that it is very HOT inside. No air at all.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Fun!", "Pricey but worth the visit. Lots of activities to do with the family. Good is highly overpriced though."], ["Reviewed July 17, 2017", 4.0, "Beautiful aspect of Lake Tahoe", "This is well worth doing if you are staying in Lake Tahoe or nearby.\n\nThe views are spectacular and unrivalled in the whole area in my opinion.\n\nOne gripe is the cost. $120 for two adults and a child, no activities.\n\nThat really is turning the screw.......how do families on median income afford that outing?\n\nShame as I would have given it 5 stars if t wasn't for that.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Breath taking views!", "Inexpensive way to see the whole lake! Amazing views even on a not so clear day. Lots of activities at the top as well."], ["Reviewed July 16, 2017", 5.0, "Great views", "Not for those who are afraid of heights. The views of the lake were spectacular from the observation deck! Somewhat pricey, and the windows of the gondolas are all scratched up."], ["Reviewed July 16, 2017", 5.0, "Great Experience", "The Gondola ride is very beautiful with views of the lake that you can't see anywhere else. We have taken this ride multiple times over the years and never miss taking guests up the mountain."], ["Reviewed July 15, 2017", 4.0, "A must do", "You go not only for the view but for the activity. First stop is the observation deck. Gorgeous view all the way around. Knowledgeable guide who is willing to answer questions.\nYou get back on to go further up the mountain. This area is full of activities. Individual coaster track, roped obstacle course, longgggg zip lines as well as a kid size zip line.\nIt cost $78 for just the sightseeing without the activity. I thought a little pricy but sure enjoyed the view.\nPicture is from poster at the airport but depicts the ride!!!\nShow less"], ["Reviewed July 13, 2017", 1.0, "Seemed like it would have been fun... for about 1/4 the price", "I read some great reviews about the gondola ride, but when we heard the price was $48 per person, with no discount for children, we decided our $250 could be better spent elsewhere,"], ["Reviewed July 13, 2017", 5.0, "Tahoe at its best", "A nice smooth ride to the top of heavenly. Magnificent view of Tahoe & it's surrounding mountains. Once at the top , more photos food & drinks. Relax and take in the view. Doesn't get much better than this 😎"], ["Reviewed July 12, 2017", 4.0, "What a view!", "We went in early July. It wasn't too busy, the weather is great, and the views from the gondola are incredible. If you just want to ride the gondola to the top its about $50 per person and worth every penny. Be sure to get off at the observation deck about half way up before going all the way to the top. There was still snow but most of it had melted off. Go early in the day. It gets warm in the afternoon (especially in the enclosed gondola) and the best view is west so if you go late afternoon you are looking into the sun. Once at the top there is one more (ski lift) ride you can take for free, and both adult and kids zip lines that are fun but not free and can have a long wait. Reservations for the zip lines are strongly suggested. There is also a typical ski resort restaurant at the top (burgers and drinks) which is ok but not great. The altitude bothers some people.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Gondola", "Wen you want to see all of snow from the lake Tahoe and all around of the lake this is the best view . . ..... ...."], ["Reviewed July 10, 2017", 4.0, "Fun day on the mountain!", "Rode the gondola up the mountain around 1:00 pm and stayed until 5:00. (They are only open from 9-5) There is a stop before you get to the top with an observation deck where you can take pictures. Views are amazing! (When we got there a wedding party was leaving. They had space for corporate events, weddings, etc.) At the top, there are sport activities such as zip lining, ropes courses and rock climbing. The lodge is open for small treats/food with steep prices. The hotshot zip line was disappointing since we've been on several zip lines. A lot of money for a quick drop. My husband and teenaged son enjoyed the rock climbing and the forest ropes course. The ropes course took close to an hour - it totally depends on who is in front of you and how long they take (unless you're the one taking a long time ...) We were told that there's another longer zip line, however, it was sold out for the day.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Amazing views and a nice, scenic ride", "We went during summer and got to experience a very clear and warm day. Our kids (2 and 3) were too young to take part in any of the activities at the top of the mountain but they enjoyed playing in the summer snow and having a walk around. Once at the top of the gondola you get to also go on a chair lift ride (without getting off). I would research parking for this as we were not aware of what options there were and could only park at the shopping centre parking garage downstairs. It was not overly expensive but I believe there may be cheaper options.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Family holidays", "Loved it!! Beautiful place to visit. Loads of activities for both adults and children. Great facilities and very friendly and helpful staff. However if at all possible try and bring pwn gear as far as possible- very expensive to hire"], ["Reviewed July 9, 2017", 5.0, "Those views though", "Best views on the mountain. Definitely get off at the midpoint station on your way up the mountain for fresh air and pictures of an unparalled view."], ["Reviewed July 8, 2017", 5.0, "Best view of Lake Tahoe", "This is the best view of Lake Tahoe you can get from a height at any time of the year. Mostly this will open by May long weekend every year after they close for winter. This place close at 4pm, so try to be early."], ["Reviewed July 8, 2017", 5.0, "Simply amazing", "Took a ride on this gondola. I don't do well with heights at all. My hands were super sweaty but oh man it was worth it. Absolutely amazing views - so beautiful and so much fun. Wish I could go on it over and over. Well maybe not over and over but glad I did it.\nShow less"], ["Reviewed July 7, 2017", 5.0, "GREAT view of a beautiful area!", "We had a fantastic ride on the gondola, and then on up to the peak on the chair lift. It was so gorgeous; well worth the time and dollars. The halfway landing gave us all a series of views with informational plaques on the deck.\nWe were able to do a couple of the activities - tubing, children's zipline and low ropes course - before eating a costly lunch. Then lightening was located too close to the resort and we stayed in the lodge for 2 hours before being evacuated down the gondola. The resort did a great job of keeping us all safe. We would've liked to be kept more informed during those 2 hours in the lodge, but the staff seemed to handle the situation efficiently otherwise. Then the resort compensated us for our disappointing afternoon when it closed the gondola ride. We wish we could've had time to return another day, but or schedule didn't allow it.\nWe'd recommend this resort to anyone with children 5+ yrs old who like controlled, safe adventure.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Vacation 2017", "The Gondola at Heavenly is a great ride. However, the food and drink prices are extremely expensive. I would definately eat before going up."], ["Reviewed July 6, 2017", 5.0, "great boarding", "I lived in south lake for many yrs. while they have hiked their prices in the recent past, heavenly is still a world class ski resort"], ["Reviewed July 5, 2017", 5.0, "Must visit", "This is the heart of lake Tahoe visit. Without this you can't complete your lake Tahoe visit. A must visit for everyone"], ["Reviewed July 5, 2017", 5.0, "Amazing Views", "Great views. So worth the price. The forst stop is the observation deck. Stunning views of the lake and surrounding mountains. There is a service area where you can get a cocktail and soft drinks. There are benches to sit out to enjoy the views. At the next stop is the lodge with food and more drinks. There is a rock climbing wall, ropes course and some awesome zip,lines, in addition to other cool outdoor activities. This is worth the price.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Good views in summer, must be spectacular in the snow", "The advantage of visiting just before the season starts is there are minimal queues (lines to usa folks) but then the attractions at the very top are not yet operational. So we were able to wander un-jostled round the first level observation level, which affords views in all directions with helpful notes every now and then. After taking the second ride to the top, preparations were under way but mostly having maintenance and final sprucing. Plenty of chairs for sitting and watching the energetic when things are open, or in our case just enjoying the sun and distant vistas.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Worth the price!", "Went with the whole family. My 1 year old as well as my 65 yo inlaws all enjoyed the view, the walk, and the ride. Pricey, but Highly recommend!"], ["Reviewed July 3, 2017", 5.0, "Pricey-but Fun!", "We did just the gondola ride--not the other activities. It was breezier than we thought on the overlook. 75 degrees below and 7-8 degrees colder and windy there. Would like to have had a light jacket. We went up to the village and had fun walking on a bit of snow before taking the chairlift to the top. We wore our hiking shoes as it is very uneven terrain at the village, but sneakers would have been fine. Definitely bring the camera-great photo opp!\nShow less"], ["Reviewed July 2, 2017", 5.0, "Glad we did it", "The price was a bit of a deterrent but once at the top we were very glad we rode the gondola. The views from the observation deck were amazing. The activities at the top were better than we expected and we wish we had more time to do zip lines. Our 3 and 5yr olds really enjoyed the kids zip line. Tubing was closed when we were there but that looked awesome too. A great cafeteria style restaurant and bar at the top too.\nShow less"], ["Reviewed June 30, 2017", 5.0, "LAKE TAHOE, YOSEMITE, SEQUOIA TRIP", "Rode Gondola starting about 10:00 AM. Waiting time for tickets was no more than 3 minutes, then straight onto the Gondola. Views from observation deck, of Lake Tahoe and surrounding areas was outstanding. When we arrived at top there was lots of snow on ground on ground, up tp 10 feet in places. When we went 06-16-17, weather was mild and wind was calm. Also great views on way back down.\nShow less"], ["Reviewed June 29, 2017", 5.0, "A great view with a high price", "We were lucky as they just opened up the day before (June 16). It’s not cheap as it cost us over $100 for two adults and one child but the views are worth it. The three of us went up in one gondola without a wait, and it looks like it can fix up to six. On the way up you can stop at an observation deck and its well done with many great spots to take pictures and to just sit and soak it in. There are information stations as well. There is a small coffee shop as well, but we skipped it as just basic coffee was $5 and that was the cheapest option I saw. They also do the take your picture and try and sell it to you later for another high price routine as well.\n\nOnce you get to the top, there are various activities to do if you choose, such as doing a small zip line for kids. The thing I remember the most is that they have a café and I was shocked when I saw the prices. For example, for only $27 (plus tax) you can get an Italian beef sandwich, fries, and unlimited refills of soda! I know they got you up there, but that is an absolute joke (and I’ve been to many sporting events and concerts so I know about high prices). Oh well, we passed on the food as that wasn’t the point of going up there anyway.\n\nOverall, it was a great experience and is a must do while in South Lake Tahoe.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Amazing Views", "Get a different perspective of Lake Tahoe with a fun ride up to the mountain. You will have an overlook of the lake and the surrounding mountains, plus a chance to enjoy the cool temps, even on a hot, summer day. Worth the price."], ["Reviewed June 29, 2017", 4.0, "Great views of Tahoe!", "The Heavenly Gondola ride was a great way to get fabulous views of the lake and surrounding area. We stopped at the Observation Deck, where we found a very engaging staff person to answer some questions we had about Tahoe. Once up at the ski area, we found the staff there to be very friendly and interested in us and what we wanted to do. Unfortunately, the snow still covered hiking trails, so our activities were very limited to cornhole and walking around the lodge area.\nShow less"], ["Reviewed June 28, 2017", 5.0, "Lake Tahoe", "Loved the gondola ride, the view at the observation stop was fabulous! We did not partake but there were lots of adventure activities. Zip lines, snow tubing etc. plenty for all ages."]]}}