{"The Grove": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "The Grove", "url": "/Attraction_Review-g32655-d547175-Reviews-The_Grove-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/2f/da/41/the-grove-2.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2025"}, "address": {"@type": "PostalAddress", "streetAddress": "189 The Grove Drive", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90036-6222", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "Great Mall!", "Plenty of high end shops, eating places and things to see. Has UGGS and Tiffanys, Cheesecake Factory and Wood Ranch, even Sprinkles cupcakes. Great place to spend the day. Has huge parking garage connected."], ["Reviewed 4 days ago", 4.0, "Humongous outdoor mall", "Huge outdoor mall with all the usual stores and then some . Almost feels like you are at Disneyworld when there . We went mostly for the food ( they have a great section devoted to food courts that put out some good chow at cheap prices ) .\nShow less"], ["Reviewed 1 week ago", 4.0, "Afternoon stroll", "It's a pretty outdoor mall. Even though we didn't buy anything except for the tasty pretzels, enjoyed the scenery & enjoyed walking around the farmers market."], ["Reviewed 1 week ago", 4.0, "Very nice shopping area", "Great pedestrian friendly shopping area. Lots of high end shops and just a 2 minute walk to the Farmers Market."], ["Reviewed 2 weeks ago", 5.0, "Fantastic place to shop and eat", "Lovely place to shop and eat and spend time wondering. Definitely worth a visit if you are in the area!"], ["Reviewed 2 weeks ago", 5.0, "Wonderful atmosphere", "Beautiful outside mall! Although we didn’t really find something to shop for we loved strolling around the village like “streets”. We found the farmers market very interesting. You should stop by will in the area."], ["Reviewed 2 weeks ago", 5.0, "The grove", "I always enjoy a visit in the Grove when I go to LA .this is one of the places you can walk around and people watch . have some nice food and there is usually a few nice shops there , I love Nordstrom and also there is a new yoga shop is open which has some really cool yoga clothes and also u can do classes there too .\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Advertised as dog-friendly, but totally not.", "I have been to the Grove several times since I live in LA. It's a very manicured outdoor mall- that's basically the extent of it. The farmer's market is nice, and the shopping is fine. However, they claim to be dog-friendly, except they have a horrific policy against pit bulls of any kind. I have seen people asked to leave with perfectly well-behaved pit bulls. Meanwhile, people with tiny, yappy dogs are allowed to ignore all dog etiquette and let their dogs roam far away on extendable leashes, run up to unsuspecting people, and bark their heads off. Last time I was at the Grove, a woman has her dog/rodent in Banana Republic. She was letting it roam on its leash and IT BIT ME! Pit bulls (which are usually extremely loyal and gentle) are not allowed but these tiny terrors are?? Rethink your policies, Grove. It's the dog owners who are problematic, not the breed. You should be asking people like that woman to leave (By the way, the Banana Republic staff saw this dog bark at me and bite my foot and said nothing to the woman).\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun!", "It's relaxing and fun to walk around and shop. I was in the wonderful Barnes and Noble for over an hour!"], ["Reviewed 3 weeks ago", 5.0, "Good shopping and food destination", "Located next to the farmers market which is also a worthwhile visit. We went at Christmas time so as you can see from the photos there is a big emphasis on the Christmas theming which they have done really well.\n\nIt’s essentially an outside mall with a variety of higher end shops, restaurants, coffee shops etc but very high end. There is a trolley cart available that runs the length of the place but it’s very easy to walk around.\n\nThere is also a movie theatre complex and ample paid parking spaces available including valet parking. The guest services is very high quality. Worth a visit if you include the farmers market and a restaurant meal to round it out, you would then easily take a good few hours or more.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great Shopping, Beautiful Scenery", "Stopped by here en route up to Studio City. Nice food stalls and farmer's market on one end and then a lot of nice stores and good restaurants dotted along. The grounds are gorgeous and apparently it's the #1 thing to do in LA for visitors. Good shopping, eating and nice views to walk through\nShow less"], ["Reviewed January 23, 2018", 5.0, "great shopping...great strolling...", "A busy place for visiting...shopping..strolling...eating...fun!! Usually very busy... BE CAREFUL...in the Grove there are hawkers for free parking if you sign up...However, you must park in the proper lot!! Different parking lots...be careful. High end shops...good food...lots of people watching...Great afternoon!!"], ["Reviewed January 21, 2018", 5.0, "A lovely way to spend an afternoon or evening.", "The Grove is adjacent to the original Farmers Market, the street has beautiful shops, great restaurants and a trolley that goes from one end of the grove to the market. You can hear music softly playing and the water fountain sways to it’s sounds. My favorite time to go there is at night, when the street is lit up and beautifully decorated.\nDuring the Christmas Season, the street is magnificently decorated, with snow showers every half hour.\nA perfect place to enjoy over and over again.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Strolling around", "Excellent place if you are in the mood to stroll around with a latte or do some shopping. Farmers Marked next door"], ["Reviewed January 19, 2018", 5.0, "Lovely at Christmas!", "Went here twice on our week trip to LA and it is a beautiful place to shop and dine! The Christmas lights were fantastic! Easy access from the parking garage made it a very comfortable place to be. Very crowded but clean and safe."], ["Reviewed January 14, 2018", 4.0, "Comfortable shopping mall", "A good and compact Shopping mall. Nordstrom as major anchor store, Cinemas, Gap, Nike, Barnes and Noble, Michael Kors, Coach + many more. They have a good train which goes around and a thrill for children and adults.\nThe cafe at Nordstrom is very good. The design of the mall is interesting and one can pass time easily.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Great place to shop and dine", "We had a great time shopping and browsing the Fresh Market. We stopped at a couple places for drinks and lunch. Was very nice to people watch and enjoy a nice afternoon."], ["Reviewed January 9, 2018", 5.0, "Loved it!", "We were not interested in the stores or shopping. The food area (market) was awesome! Cool spot with lots of different food options. The food we had was amazing! Also a great spot for celebrity sightings."], ["Reviewed January 4, 2018", 4.0, "Good Shopping District!", "Lots of big brands. Farmer's Market nearby. Plenty of parking at a reasonable rate. The trolly ride was fun for the family - it's free and brief."], ["Reviewed December 31, 2017", 2.0, "Generic, Crowded Mall with Chain Stores", "Awful. Crowded. Stale. Chain stores. Farmers market next store is overrated. Not really a farmer’s market. Food stalls with prepared, mostly unhealthy food."], ["Reviewed December 26, 2017", 4.0, "A cozy place to shop, eat and chat...", "One big park with stores, resto & cafe in Christmas season, really shouldn't miss it while visiting Los Angeles ! Have lunch at Bar Verde Nordstrom, afternoon snacks at Blue Ribbon Sushi Bar & Grill and dinner at La Piazza Italian Restaurant. Bar Verde & Blue Ribbon are ok but not La Piazza....unfriendly waiter who serves us ruin the evening.\nShow less"], ["Reviewed December 25, 2017", 4.0, "An Attraction With Something to Please Everyone", "And even fake snow at Xmas!! A concentration of stores, restaurants, bars and a cinema. Always bustling with mostly tourists, but worth a visit, and possibly not as crowded if you go not around th holidays.\n\nThere’s a farmers market with less expensive food and a variety of offerings.\n\nDefinitely a place to bring the kids for a trolley ride and at night a water show in the small lake. The Fountain Bar is great for couples, but expect to wait.\n\nMy choices for type of visit did not include family with grown children which was the case. I also took my small chihuahua on this trip and she thoroughly enjoyed herself. LA is a dog lover’s city.\n\nVisit the website for events and if you park in the covered parking, go to the roof, there are elevators to the floor below, and see a fantastic view of LA. Enjoy.\nShow less"], ["Reviewed December 21, 2017", 3.0, "A bit too precious, but still an entertaining place to shop", "The Grove was one of the first destination malls in Los Angeles, a faux town square that invites Angelenos to get out of their cars and stroll among (mostly pricey) shops and restaurants. It has synchronized fountains and an excellent movie theater. The piped in music can be annoying, but overall, a fun place to shop and people-watch\nShow less"], ["Reviewed December 17, 2017", 3.0, "Interesting outdoor concept.", "The malls is centered around a walking street approach which gives it a hometown feeling. It offers anything from the farmer market to the usual mid range shops. We tried the brazilian food at the outdoor market, where you weight your plate, the lamb turned out to be very salty while the chicken bacon wrapped was dry. In late november we could enjoy the season s decorations and activities. At the central place they were taping a tv show limiting the access. Most boutiques stores can be found at other shopping malls.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Magical during the holidays.", "The most beautiful mall I’ve ever been to. Luckily for me, I visited The Grove with the holidays in full swing. The outdoor mall got transformed into a magical winter wonderland. In my opinion it’s best to go there after sunset when everything is lit up. It adds to the atmosphere in my opinion. Of course shopping there is a treat in itself with high end stores like MK, Coach, and Nordstrom stationed there to just names few. They also have a trolley there that’s fun to ride as well. If you visited LA, you definitely would want to add The Grove to your schedule.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Great farmers markets", "One of my favorite places in LA. The shopping area is cool but a must is the farmers market. There are several restaurants with amazing food (my favorite is the Brazilian barbecue). I love the atmosphere. I always stop by there after shopping."], ["Reviewed December 10, 2017", 4.0, "Great place", "Stopped in to check out this really fantastic place. Plenty of parking. Max 24.00 a day. So much to see. Largest Barnes and noble I have ever been in. (Three stories tall). Super large farmers market with a very impressive selection of food. Both take home and ready to eat now. We had the empanadas from nonnas and the borekas from Moises. They were fantastic.\nShow less"], ["Reviewed December 7, 2017", 5.0, "A must see!", "Visiting LA? Please do go to the Grove! Amazing shopping and also a fun place to be with children. No worries about parking there is a lot of space even if you have to get to the farmers market/ whole foods or Kmart there is space. At the Grove you will be entertaint from the moment you walked down the street.\nShow less"], ["Reviewed December 6, 2017", 5.0, "The complete package", "I haven’t been excited about a mall in a while. This mall has everything from fine shopping to a variety of dining choices including the super interesting Farmer’s Market with all types of cuisines and price points."], ["Reviewed December 6, 2017", 5.0, "Christmas at The Grove", "Snow, flying Santa, reindeer high up above and water fountains that dance? All this and more every Christmas season at LA's Grove. Despite the long lines (you used to be able to make reservations) for Santa's house, it truly is a festive time of year where it's easy to forget you're in the desert. Part mall, part farmer's market, part luxury place to people watch and be seen. Bottom line: it's a fun and festive way to spend the days and or evenings between Thanksgiving and Christmas.\nShow less"], ["Reviewed December 6, 2017", 3.0, "It's a MALL! What else do you want to know?", "Bright and shiny stores. Spotless perfect streets. Stores on every side with sticker prices that make you wish you'd stayed home and shopped online at Amazon. Pretentious, overdressed people wandering about and filling their shopping bags with instant bling. And a parking structure that looks like it might have been designed by Temple Grandin - for cattle encountering terrifying chutes for the first time. My advice would simply be to say at home -- were it NOT for the fact the whole place was right next door to the Farmers' Market, which is a delight to wander. The Farmers' Market saves The Grove experience. Remember this.\nShow less"], ["Reviewed December 3, 2017", 1.0, "Over rated", "Over priced, not enough options of food, popcorn machine is on and loud while were watching the movie, sound system not loud enough, drinks arent cold and no option of having ice, being forced to pay for food even if we dont want it, no toilets, worst experience in my life, never again.\nShow less"], ["Reviewed December 2, 2017", 5.0, "I adore this shopping place especially right after Thanksgiving. Charming decorations!!", "Such a fun place to shop. Trolley's, restaurants, shops, farmers market at the end. Book stores, etc. Just a fun place to people watch and shop with lots of places and benches to stop if you get tired or just take the trolley from one end to the other. One of my most favorite places in LA, not for the shopping but for the energy.\nIt is so well decorated for Christmas with a sleigh and reindeers wired up in the sky. A huge gingerbread shop and a life-size stuffed snowman and gingerbread man in suits to have your picture taken with. Such fun!! Lots of places to eat in restaurants or take out place down in the Farmers Market\nShow less"], ["Reviewed December 2, 2017", 5.0, "Great, experiential, open air hybrid mall experience w/ shopping, food, people", "Went to experience The Grove with family on a Saturday afternoon; quite an adventure. Stunning array of stores upscale to moderate scale, farmer's market, large number of restaurants and eateries, fun people watching and trolley car to ride. Wonderful place to spend an afternoon with family whether eating, shopping or just people watching. Recommend highly for a place to go for a whole family event.\nShow less"], ["Reviewed November 30, 2017", 4.0, "A bit of a tourist trap, but some decent restaurants, great people watching, and a great movie theater.", "If the weather is nice, this is one of the best places to people watch in LA. Clean, great Christmas decorations, and the trolley goes occasionally. Lots of people walking their dogs, and many small kids near the fountain here.\n\nNice outdoor seating in some restaurants. Skip the chain restaurants, you can go to the Cheesecake Factory almost anywhere.\n\nVery nice movie theater, but not cheap at all.\n\nI wish they had a few more benches to sit at, though. The Farmers market is nearby, with some other great restaurants.\nShow less"], ["Reviewed November 26, 2017", 4.0, "Hollywood Mall", "The Grove is a trendy shopping, dining and entertainment precinct in West Hollywood where you can spot the rich and famous. It’s also close to a few other places of note, CBS Studios and the Writers Guild of America which I walked past. I spent the better part of my last day in LA at The Grove looking around including at the adjacent Farmers Markets. Key shops in the Grove worth checking out include Barnes & Noble (with regular celebrity book signings), Gap, Banana Republic, Cheesecake Factory & the Pacific Theatres (14 screen cinema). It’s a pleasant mall with a nice fountain and street entertainment from time to time as well as a free tram between the Grove & the Farmers Market (don’t bother, the two are right next to each other!) I ate at Cheesecake Factory & Cafe Marmalade and would recommend both. Worth checking out whilst in LA. I’m not sure how it compares with the other major mall nearby, the Beverly Center, but both seem equally famous.\nShow less"], ["Reviewed November 25, 2017", 3.0, "Christmas time is beautiful", "This area is very crowded and loud but the decorations are beautiful. Dining is pricy but appears to have great options for a variety of customers. The shopping is pricy too. I guess this is a nice place to visit and slowly walk around and enjoy without spending too much... unless you want to. :)\nShow less"], ["Reviewed November 18, 2017", 4.0, "Lovely upscale mall near Farmers Market", "The Grove is an upmarket mall with well known stores such as Nordstrom and Michael Kors, and more.\n\nThe Grove has many restaurants like Maggiano's Little Italy and The Cheesecake Factory. There is also a 14-screen movie theater.\n\nNext door is the excellent Farmers Market with a lovely food court with many great food options. There is a free tram between The Grove and The Farmers Market.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Best Xmas decorations", "Yes it’s a shopping centre. But by making use of the outdoor nature of the centre they have put on a really superb display for the holidays. It wouldn’t matter what religion you are come and enjoy. Recommended"], ["Reviewed November 13, 2017", 4.0, "Unique experience in the heart of LA", "This outdoor mall is a truly unique destination in the heart of west Hollywood. Parking is usually abundant except when there is a special event or its a holiday in which case watch out. Looking for a parking space becomes a dog-eat-dog undertaking. What makes the Grove so special I think is the unique approach to the layout. It’s like a small open air neighborhood almost with a movie backlot feel. It’s feels small and cozy and it’s just very pretty to look at. The only caveat (downside) of this mall is that it’s targeting an upscale clientele. Unless you are well heeled financially, this is a sighseeing destination only. You will run into a lot of tourists here.The other reason this is a great destination is that the Farmer’s market is right next door. That alone is worth the visit. If you’re in the area then this is a must see.\nShow less"], ["Reviewed November 13, 2017", 4.0, "Cool Place. Parking Sucks.", "First off, the Grove is awesome. What is a shame is that the urban design is sub-par since it is always such a pain to find a parking space and get out of there once you are trying to leave.\n\nBeing a architecture grad, I get it that the land is expensive and there are skyline height limits in place, but I truly believe this place could have been even more successful if the parking was handled in a different manner. The majority of people I talk to who are from the city or visiting typically complain about this fact when the Grove is brought up.\n\nTraveler Tip: I'd Uber/Lyft if possible to avoid having to find parking OR simply just be patient and not let it affect your overall experience.\n\nOverall: I think there are other places in LA to go depending on what you are looking for. If shopping, head to a mall (there will be a lot more stores to choose from). If restaurants, there are plenty all over LA that have their own parking lots.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 10, 2017", 5.0, "Great location and shops", "The farmers market cafes and food vendors is the best part. lots to see and take in at this location!"], ["Reviewed November 9, 2017", 4.0, "Pleasantly surprised", "An outdoor mall located in the heart of LA, there is a solid selection of newer stores together with a farmers market.\n\nThey have a large parkade right beside it that is right beside it.\n\nA tram runs up and down the Main Street, everything is nicely decorated, with a pond and fountain in the middle\n\nA good selection of restaurants, stores, farmers market and a massive theatre.\nThe farmers market has a mix of retail, food booths, baked goods, meats, whatever you want and you can each order and then sit at tables in the area.\nShow less"], ["Reviewed November 8, 2017", 5.0, "The Grove Farmers Market", "Great markets. Great place to meet up with friends. Great place to kill a couple of hours. There's plenty to see, eat and buy here at Grove Markets, and the Grove itself comes alive at night. Loved the pond with the fountain in the middle of the plaza and the little tram is really special, particularly for the younger ones.\nPrices can vary from cheap to expensive depending on what you are looking at and the same item may vary in price from store to store or stall to stall, so as always, do you homework if you are going there to purchase a particular item.\nThere are restrooms on site, cafes, a couple of more upmarket restaurants and of course, many street stalls offering a wide array of menus and wares, so no one could possibly come out of there feeling hungry.\nA fairly large carpark is opposite The Grove,servicing the shops on that side but you'll probably get a park in there. Otherwise catch an uber, bus or taxi. They'll all know how to get there!\nWe visited the Grove just for a look around and stayed there for dinner. I thoroughly enjoyed the experience and loved the atmosphere of the place.\nMy only disappointment is that we probably wont get time to go back again before we leave.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Shopping and Dinning", "A good family friendly place to go. A pedestrian only street with shops, restaurants and a cinema theatre. There is also a tram that you can get that goes up and down the street. Overall it was enjoyable however if your time is limited then you can definitely skip this.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Fantastic Discovery on our tour of LA", "On a tour of LA we had lunch at the grove. It's one of these places that just stands out. Busy, popular with great shopping, restaurants and facilities. It's a little Gem. I'd not heard much about The Grove before my visit to LA- but I am so glad our tour included it. There are plenty of shops and places to eat that you can easily spend half a day here.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Great stop at The Grove and the LA Farmer's Market", "Our Segway tour guide suggested a visit to this place after our tour and we were very happy we chose to follow his suggestion. The Grove is a very nice shopping/dining/attraction area and is situated near the LA farmers market. The LA farmers market is a fascinating conglomeration of food booths, retail product stalls, produce, meats, bakery goods.....really just about any type of food that you can imagine. What is nice about it is that you can find a variety of choices to suit all tastes and then sit at tables nearby, each with your different food choices. It is a casual, lively environment and much of the food is reasonably priced as opposed to going to a sit down restaurant. This is a good place to visit for people of all ages.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Good place for all family", "It's special place for family, a lot of shops, restaurants, cinema, nice place for sightseeing,take photos, ride a tram, and special market/farmer market with varieties of cuisine.just relaxing and enjoy your time there."], ["Reviewed October 29, 2017", 4.0, "Great Shopping", "Located right next to the LA Farmer's Market. One street with high end stores and restaurants. They have a trolley car that goes from one end to the other."], ["Reviewed October 25, 2017", 5.0, "5 Stars", "The Grove is just amazing. It is absolutely stunning especially at night. I would highly recommend that everyone visits."], ["Reviewed October 23, 2017", 5.0, "Beautiful shopping center", "Outdoor shopping with major brand names and restaurants. Nice fountain area. Movie theater with amazing entrance. Very upbeat and fun to walk around. Next to Farmers Market which should not be missed!"], ["Reviewed October 23, 2017", 4.0, "Great shopping experience", "We went to The Grove based on other reviews and weren’t disappointed. This is a glamourous area for shopping with a great selection of shops for every type of thing you’d need. There is a cinema there as well plus the food market on hand for a quick snack. The fountain in the middle is lovely and it is a great way to while away the afternoon.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Good shopping experience and place for lunch.", "This outdoor shopping mall with a market has a variety of shops, from larger chain department stores to unique boutique shops. There are a few options for eating or having a drink after eating, and although The Grove was busy we had no trouble finding a table and being served quickly. A well maintained area and easy to navigate around.\nShow less"], ["Reviewed October 22, 2017", 4.0, "Beautiful Location", "The grove was beautiful - a gorgeous outdoor mall with a nice water fountain and grassy area. There are a few food carts outside, some restaurants and of course shops. Most of the shops are more high end, not necessarily designer but Sephora, Fresh, Barneys etc...\nAll in all a great little mall\nShow less"], ["Reviewed October 20, 2017", 3.0, "Nice for an afternoon visit", "One of the first things we did in L.A was go to the Grove. It was a nice little complex with some okay shopping. The real experince are the food stalls and souvenir shops througj a little walkway. We had dinner there and the kids loved it.\nShow less"], ["Reviewed October 18, 2017", 5.0, "Love it here", "Love the Grove LA! Great place to shop, relax, take photos with family & friends.\nPerfect place for travellers' enjoyment & leisure! Cool water feature - Easy place to walk around. I've heard very good things about he Farmers' Market here - Would love to return & enjoy another wine at the La Piazza :)\nShow less"], ["Reviewed October 18, 2017", 5.0, "Check Out the Farmers Market", "This is a nice outside mall, for lack of better description. They have a number of known brand and higher end shops to pick from as well as a movie theater and some restaurants. I have been here a number of times, and honestly the reason is for their farmers market on the far end from the parking garage. There are so many unique places and smells going on in this place, it always makes it worth it to stop by any time I am in L.A. to try something different. The one thing you need to keep in mind is, many of the shops are CASH ONLY, so plan accordingly.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Always a pleasant location to shop, or just to stroll through", "Since my sister and I were meeting at The Grove shopping center to have lunch at The Cheesecake Factory, it was convenient to stroll through the center and window shop."], ["Reviewed October 16, 2017", 5.0, "Loved The Grove so much we visited twice in one week!", "My wife and two young kids visited The Grove as part of our week-long spring break vacation in the LA area. It was a real highlight. We enjoyed lunch on two different days. So many great options to choose from. We liked the shopping and also picked up fresh produce for our week. Just a very fun place to visit and walk around.\nShow less"], ["Reviewed October 14, 2017", 4.0, "The Accidental Mall", "Literally walked into this mall area while on a tour. I was headed towards the Farmer's Market, somehow missed the clocktower clearly stating \"Farmer's Market\" and ended up at The Grove. They had an amazing selection of a stores and looks like a nice mix of fun, food, and shopping in the same location.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Touristy, tasty, trendy.", "The Grove is for sure a tourist attraption, for sure. Not in a negative sense, mind you. Families with children hang out to look, eat, and enjoy typical American popularism. Fansy department stores and food fansies line along paths of this outdoorsy mall. Prices aren’t hot, but varietal displays of carbotonics and deepfries sure turn heads of hungry hippos.\nSummary: The Grove is very L.A.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Great area", "This area has so many different things going on with bands playing & the workers give you blankets to sit on & watch them while sitting in the grass area or you can get a table plus the trolly they have is free & a nice thing to do. We walked around & shopped in almost every store & saw a couple famous people as well. If youre in the area try visiting the Farmers Market though. I have to go back with more friends to enjoy this even more\nShow less"], ["Reviewed October 13, 2017", 4.0, "Beautiful, higher end shopping.", "It's definitely an upscale mall and of course a little pricey, but a really nice place to walk around and visit. Right next to it is the farmers market and that's where I would go to get my meal, variety is great. But the mall itself has many different shops to pursue in. It is a little small as malls go but very nicely laid out and manicured.\nShow less"], ["Reviewed October 13, 2017", 1.0, "Really Disappointing", "Bene here a few times before but this time found it soulless and a waste of time - half the shops they say are there are not there any more. Spent an hour there, but could have spent 10 minutes - really not worth visiting."], ["Reviewed October 10, 2017", 5.0, "Disney-like outdoor mall", "The Grove has this really clean magical atmosphere to it. The layout is really pretty and there is always music playing and balloons being handed out."], ["Reviewed October 9, 2017", 5.0, "Great place to hang out", "We went to the Grove and it was great. So fun to walk around. Felt like i was in the \"Disneyland of Malls\". Even have a movie theater there. Many places to eat. Stores were very high end, but fun to walk through. Would definitely go back.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Awesome location", "The grove is an amazing gem in the hustle and bustle of Los Angeles . It offers shopping, food, entertainment, souvenirs, local groceries from near by farms... just rows and rows of food under one huge roof... Perfect place to spend a glorious day!"], ["Reviewed September 25, 2017", 4.0, "A good half day stop", "Pretty place for shopping. Celebs have been spotted here but unfortunately we didn't see any. Not enough of our types of shops to spend a day wandering but I guess it depends on your taste. Certainly a pleasant area, laid back and not too busy. The farmers market at the end had some scrumptious looking food and was also interesting to look around. Both the grove and farmers market smaller than I imagined but nice to visit all the same\nShow less"], ["Reviewed September 24, 2017", 4.0, "Nice Shopping Spot", "Its a nice shopping centre with a fun courtyard and ambience. The nice thing is it's right beside the Farmers Market so you can see both at one time. Worth the visit."], ["Reviewed September 24, 2017", 5.0, "Great Shopping and Dining !", "Excellent location as it is very near to the Farmers Market. There is a good choice of shops and a couple of restaurants including The Cheesecake Factory. We have been to The Grove quite a few times because it feels safe and there seems to be a good general atmosphere there.\nShow less"], ["Reviewed September 22, 2017", 4.0, "A fun shopping must visit", "The place a combination of food and mid to high range shopping outlets. Plenty of attractions for the kids and eateries to keep you full."], ["Reviewed September 20, 2017", 5.0, "Grove", "We went to the Grove because we were attending The Price is Right. We parked at the Grove parking structure so that is how we were able to visit. It is very nice outside mall and framers market. It's a beautiful atmosphere and scenery. It also has a movie theater and trolley ride.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Love it", "I love this place go in the evening some lovely restaurants and the atmosphere is very cosmopolitan beautiful gardens and waterfall feature in the middle and a tram that takes you up and down and to the side you have the farmers market and a market that sells Asian handicrafts and eating places loads of shops to browse round I've been in the day but evening is a lot better this is a must\nShow less"], ["Reviewed September 18, 2017", 5.0, "Beautiful place to visit", "Plenty of shops, beautiful scenery and a nice day out for family, friends, couples or people on their own. I would go back there again"], ["Reviewed September 17, 2017", 5.0, "Such A Pretty Shopping Area", "Our family visited here in July and agreed we had never had such a pleasant shopping experience before. The lay out with the landscape is very pretty, there are tons of great stores, and yummy dining option. It was a great way for us to spend our day. The only negative thing was looking for parking in the garage, but that is expected at all malls.\nShow less"], ["Reviewed September 15, 2017", 4.0, "Lovely way to spend an afternoon.....", "We had intended to go to The Grove, but were delighted that it was next to Farmers Market! Lovely upscale place, where you has a mini tram to give you a bit of a ride ...lovely shops, and a movie theater."], ["Reviewed September 12, 2017", 5.0, "A happy place", "Very nice place to visit, full of shopping, restaurants n ice cream shops...full of vibes You can lay down there n chill, go for shopping n chill It's like a different area in the middle of z city"], ["Reviewed September 10, 2017", 5.0, "Beautiful Shopping Center", "My son and I had a wonderful time visiting The Grove, it was beautifully laid out and excellent stores at all price points. Having access to the Farmers Market was an added bonus. There are various food options throughout the facility and sweet treats strategically placed. We had lunch and a great afternoon of shopping. This is a family friendly location.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Almost too much to see and do!", "Loved this little surprise upon exiting the LA Farmer's Market. I was not aware of it and didn't expect it but loved every bit of it!! From higher end shopping to bargain hunts, it was all there and got some unique things from my trip!"], ["Reviewed September 5, 2017", 4.0, "Pleasant shopping area adjacent to Farmers Market", "Airy shopping parade with many big names. However, it overall seemed quite bland and similar to a Disney set. However, it was a very pleasant setting and a good variety of shops so a pleasant place to spend an hour or so. Good for a mooch around if you've gone to visit the market but wouldn't travel for that alone.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Nice shopping center", "We basically stumbled across this outdoor mall because we went to the farmers market.It is quite small, so not too many shops, but it is cute and picturesque. We also enjoyed the little ride with the San Francisco like Cable Car."], ["Reviewed September 4, 2017", 4.0, "Many lunch options", "Primarily went here for lunch options but there is also plenty of retail as well...a lot of options for lunch and the atmosphere was great...we settled on a baguette from the French style restaurant ...very nice"], ["Reviewed September 4, 2017", 5.0, "Great place and FUN shopping, great outdoor experience", "I often come to The Grove when I think of relaxing time, comfortable outdoor shopping, and hang out with friends! Parking here is convenient as it's just right up in the heart of them all. A great outdoor for every level no matter who you are and everyone is friendly here. Time flies when you are having a great time. This place is one not to be missed!\nShow less"], ["Reviewed September 4, 2017", 4.0, "Upmarket outdoor shopping mall", "The Grove is an upmarket shopping mall with some large shops and a great farmers market. Barnes & Noble, Crate & Barrel and other big stores are present along with. Taschen books outlet. The farmers market has plenty of excellent food options and there's an Umami burger too.\nShow less"], ["Reviewed September 4, 2017", 4.0, "Shopping", "Nice outdoor shopping mall. Cute little area for dining. Parking in one of the lots is free for the first hour and a half if you get validation from one of the stores. Otherwise, self parking in the other lot is free for the first hour then $4 for 1 1/2 and it goes up from there. I highly recommend a visit if in LA.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great Mall. Try the Theater or Specialty Restaurants.", "Great outdoor mall that has many enticing options. The movie theaters now have a bar, so you can have an alcoholic drink with your popcorn and movie. The Cheesecake Factory offers a nice balcony, but it's always busy, so expect to wait. The Farmer's Market has something for everyone -- including snacks to buy and take into the movie theater, where they are lax about allowing outside food items inside.\nShow less"], ["Reviewed September 1, 2017", 4.0, "THE FARMERS MARKET and the various shopping is really nice", "Great food at the Farmers Market and along the walking street of the GROVE. Nice shopping and good fascilities for a nice shopping experince. Also has a nice Mall at the Grove. ROSS, CVS and other shopping fascilities all within walking distance from The Grove"], ["Reviewed September 1, 2017", 5.0, "Very Nice Mall", "What I love about the mall is that is outdoors. You can find many brands like topshop, zara, UGG, MAC, etc. and many good places to eat, including LADUREE!"], ["Reviewed August 29, 2017", 4.0, "Nice outdoor shopping", "We really enjoyed the Grove. We took an Uber there from Hollywood blvd which cost around 7 bucks each way.\n\nIt has a small but quality selection of shops and restaurants. It's really pretty when it's dark and they put the lights on. They also have a cute trolley which you can ride from one end to another.\n\nWould recommend for an evening.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Good for eating and shopping", "You'll find a cinema, Barnes&Noble, Nike, etc. Lots of good food. It's not too crowded, and you could stop off at the holocaust museum right nearby after."], ["Reviewed August 28, 2017", 5.0, "So Awesome especially when decorated for Christmas!", "Be sure to stop here even just to take a quick walk around it really is a beautiful outdoor mall. I'm not one that really enjoys shopping either but I always take a quick stroll through when I'm in the LA area. I always park here when visiting CBS studios anyways so I usually stop by the mall after my visit there.\n\nThere is a train that takes you from one end to another that the kids absolutely love. Its also amazing to visit around Christmas time when its all decorated with the awesome lights and the fountains are colored as well.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Great way to spend some time", "The grove offers numerous stores and restaurants. Nice atmosphere and great shopping from name brand stores to off the beaten track farmer market with fresh food and rows and rows of booths from jewelry, clothing and all crafts. Colourful market and very friendly people. Would have loved the chance to ride the rail car (was not operating when their) Beautiful water fountain and friendly environment. A must see when in LA. Ate dinner at the Wood Ranch. Best steak ever and the service was awesome. Could eat there every night. Friendly staff and service. Food was amazing and the atmosphere was lovely\nShow less"], ["Reviewed August 28, 2017", 4.0, "L.A.Groove, At the groove!!", "When I got here,It was nice to see the atmosphere people had.Lots of shops.restaurants,stores to see.As I walk the area,one thing I was looking forward was to hop on the freeTrolley ride.I couldn't see it or hear it's bells.As we where exploring the area,we found it.Unfortunately it was inside the shop garage.It wasn't working that day,don't know why,maybe next time.But I managed to take some fotos of it.Other than that,everything else was owesome.Worth visiting if u plan to visit L.A area,hope the trolley is working that day!!\nShow less"], ["Reviewed August 27, 2017", 5.0, "Fantastic place", "Grove not just shopping mall Grove is a full day place all brands, resturant Different atmosphere Just enjoy Every time I am in L.A must go to Grove"], ["Reviewed August 27, 2017", 4.0, "Beautiful mall", "Great outdoor mall with vibrant art installations and even water features! Free wifi from shops was a bonus too. Must go to the Original Farmers Market next door while you're in the area."], ["Reviewed August 25, 2017", 5.0, "Must see when in L.A.", "I've been to L.A. twice and have visited The Grove twice. This is a place I would go to all the time if I lived in Los Angeles. Lots to choose from for shopping and eating."], ["Reviewed August 24, 2017", 5.0, "Beautiful!", "We recommend visiting The Grove even if it's to browse the shops - you'll find so much here it's just lovely. We found ourselves relaxing by the musical fountain at one point - definitely recommend!"], ["Reviewed August 24, 2017", 5.0, "Nice mall", "It was a nice mall, ice cream float was delicious and their cones are pretty big! They also have a trolley ride and they say that some of the Hollywood stars come here to shop!"], ["Reviewed August 21, 2017", 4.0, "Very nice!", "Other than the parking zoo, the mall is great! Originally came to visit LA for a brunch and show at the magic Castle. After the show we were driving around and stumbled upon the place.\n\nGreat ambience, packed with people, a world of choices for whatever style of food you're in the mood for and every store to satisfy your shopping desires! I particularly liked the many restaurants and bars with outdoor seating. The farmers market adjacent to the grove is also fantastic!\nShow less"], ["Reviewed August 21, 2017", 4.0, "Lovely area for shopping - vibrant place to eat.", "The Grove area is an outdoor mall with high end shops and a quaint free tram that you can ride from one end to the other. Its a really great atmosphere with bars and restaurants offering outdoor seating and family friendly too.\n\nFurther down the main street is The Farmer's Market offering a wide range of world foods, allowing a family to all choose their own meals and then come together in the shared seating areas. Everything from Gumbo to Pizza, Cookies to Empanadas. Prices varied but seemed reasonable.\nShow less"], ["Reviewed August 20, 2017", 4.0, "More than a Mall", "If you're going to visit a shopping mall with nationally known brands (middle-high end retailers) then this is the place to go. Most mall experiences can give anyone a headache, how nice to have an outdoor pedestrian mall like this with fountains, benches, and music.\n\nIt's a kitschy environment with the mix of architectural styles, but the people watching is A plus & it backs right onto the Farmers Market.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Great Mall", "Beautiful outdoor mall with great shopping. Great trolley ride, good food choices and ample parking."], ["Reviewed August 14, 2017", 5.0, "Great area", "I think going to the Grove is a must. Cool shops and restaurants and the farmer's market with tons of artisans and food vendors. Very clean, nice people and parking on site."], ["Reviewed August 13, 2017", 5.0, "Great outdoor Mall", "A plethora of stores and attractions to keep you busy all day. Excellent food choices to make sure you last all day. Whether shopping, eating or just want to hangout. This is the place to go to."], ["Reviewed August 12, 2017", 5.0, "I loved it", "From the important things you must go in LA !! And for me you must see it at morning and night it's like a different place And you've see farmers market it's also nice and clean place 👏🏻"], ["Reviewed August 12, 2017", 4.0, "Decent shops - Smaller than exprcted", "This is a beautiful outdoor Mall in LA. We were however surprised how small the area is and with the majority of shops being relatively high end there isn't the best range for family shopping. We had been told that this is the best place for celebrity spotting but unfortunately no luck! It's a nice place to go for an hour or two but if your schedule is jam packed it wouldn't hurt to leave this out.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Outdoor Mall", "The Grove is located in what I call the La Brea area in Los Angeles.\n\nStroll through the Grove for an outdoor mall experience and possible star sighting. Parking at the Grove is plentiful and easily accessible. The Grove has all the standard national 'mall' stores and eating places. I recommend walking around the Grove, but eating uniques eats at the farmers market.\n\nThe Original Farmers Market is located right next to the Grove and is worth a visit. I recommend walking up and down all the aisles before making your food decisions. There is a lot to choose from. We had delicious dinner food from:\nNonna's Empanadas- delicious empanadas, all different flavor and filling combos.\nThe Gumbo Pot- true New Orleans cooking. We had the Rice and Beans and the Jambalaya. Both delicious.\nI recommend walking around this gem and checking out all the different food places and quirky stores. We absolutely loved our two choices and would eat at either place again.\n\nThe Grove is always a pleasant experience on a nice day. It is all outdoors so plan accordingly.\nShow less"], ["Reviewed August 11, 2017", 4.0, "Location: CENTRAL! Really cool outdoor galleria/shopping mall.", "Located very central. It's a really nice shopping mall/galleria with a vide variety of stores, movie theatre etc."], ["Reviewed August 10, 2017", 5.0, "Beautiful", "Beautiful area in Los Angeles with a great farmers market and fabulous stores in the heart of the city."], ["Reviewed August 10, 2017", 4.0, "Colourful, lifts your spirits", "If you are feeling down and want to be in the midst of people, watch people shop, and take a stroll this is a good choice. You could do some window shopping, quite a few high end stores around and there's always some decent eateries where you can catch a quick bite.\nShow less"], ["Reviewed August 9, 2017", 5.0, "A must see", "This shopping place is a must see if you are in LA and it is highly recommended if you are near LA. Open to air place, delicious variety of food and great time to spend"], ["Reviewed August 9, 2017", 4.0, "Great place to visit at night", "Yes this is a shopping mall and the shops are your standard shopping mall major retailers however this is a nice place to visit at night just to take in the lights and experience the crowds of people if nothing else. It is attached to LA's farmers market with its unique small restaurants and shops. Check that out if you are there around a meal time or just for a snack. There should be something for everyone.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Don't get it", "I saw all the reviews and expected to spend hours here with dozens of shops. Most were stores like the Gap that can be found anywhere. We ended spending our time at the Farmers Market which was a far less vanilla experience."], ["Reviewed August 6, 2017", 5.0, "A Cultural Experience", "The Grove takes \"Shopping\" to a new level. It's a \"Destination,\" not just a quick trip to the Mall with a mission to Buy something. Even people who dislike shopping relax, take in the open air, & find things they like ~ such as the fountains, pond, people watching, restaurants, food kiosks, ice cream & other treats.\n\nThe Trolley brought a Jazz Band to the Stage, great entertainment.\n\nThe grassy Parklike area with complimentary blankets & sometimes music is the icing on the cake.\n\nThe Farmers Market was a highlight.\n\nI think the main thing that makes The Grove stand out is that it's also a Cultural experience.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Holiday Spirit!!", "Visited with family to do some last minute holiday shopping and dinner before flight out to celebrate Christmas in the Midwest and found the decorations beautiful. Great way to get you in the holiday spirit! Many shops and restaurants to,sample plus the holiday mart a hidden gem Can't wait to go back next for the 2017 holidays. The only challenge is the parking!!! Garage fills up fast\nShow less"], ["Reviewed August 5, 2017", 4.0, "Stores in a nice area", "It is a nice area with lots of different stores, restaurants and cinemas. It is an open shopping mall."], ["Reviewed August 5, 2017", 5.0, "Great little place, definitely worth a visit!", "On first glance the Grove seems to be nothing but a few shops but don't be put off as it's a great little place to eat, have a drink, shop at the Farmer's Market, chill out on the lawn to watch a band and so on. It also has a massive Barnes & Noble if books are your thing. For kids (and big kids) the little tram is really cute too, as are the dancing fountains. Getting there can be a bind if you hit the wrong time of day but it's defo worth trying to see it if you can. It's easy for Ubers as there's a \"concierge\" section right at the front for drop offs and collects. We went three times whilst in LA and would thoroughly recommend it.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Farmers Market is highlight", "For the most part the Grove is fake street, complete with trolley car, nicely done with the standard and more affordable shopping mall stores, including a large Barnes and Noble. It is refreshing change from a real LA street and therefore quite popular and relaxing. The diamond in the crown is the original Farmers market which has numerous food and market stalls, small shops and a few bars.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Fun Shopping and Dining Next to Farmer's Market", "Outstanding shopping and dining area next to The Farmer's Market and near CBS Television City. Offers both large department stores and specialty retailers. Fun place to see for a few hours."], ["Reviewed July 30, 2017", 4.0, "The hangout", "I go there all the time, great place to just get together with friends. They have a lot of mini restaurants and stores to go window shopping. They have a two floor Apple Store and three floor Nike store, my favorites. If you go, you should get ice cream, they sell really good ice cream at The Grove.\nShow less"], ["Reviewed July 29, 2017", 4.0, "American Girl!", "We visited The Grove because we knew the American Girl store was there, and my daughter is really into American Girl. However, what we discovered was, this place is a haven for those looking to shop on an upscale level.\n\nWhile we didn't break the bank checking into the big budget stores, we thoroughly enjoyed walking around and browsing a bit. On a casual day, one could easily kill a couple of hours.\n\nParking is a bit pricey, and there weren't many places to grab a bite within the walking area, but you could certainly grab a treat from the Starbucks--located within the towering Barnes and Noble.\n\nShow less"], ["Reviewed July 26, 2017", 5.0, "Great little shopping Mall", "Had some lovely shops, pop up boutiques and best of all Cheese Cake Factory for lunch! Not sure Fisherman's Wharf was our cup of tea but worth a quick look! Tram is cute......"], ["Reviewed July 26, 2017", 5.0, "Really Fancy Concierge Section!", "I was shocked when I saw the breath mints and mouth wash in the bathroom. Everything is really presented beautifully and the people behind the reception are really helpful!"], ["Reviewed July 26, 2017", 5.0, "Very nice shopping area", "This is a very nice shopping area. A mall, built like a small town centre, with town square, live music and a cable car. You'll find both shops and restaurants here. Worth a visit."], ["Reviewed July 24, 2017", 5.0, "Great lunch", "Great place too go for lunch. We had two sandwich combos with salad. The sandwiches had chicken. The salads were delicious. Total costs $20 plus tax n tip. Nice atmosphere n staff."], ["Reviewed July 22, 2017", 5.0, "Perfect spot for everyone!", "We visited on a Saturday afternoon as visitors from out of town. What a great find!! Such a cute atmosphere with a great mix of stores both upscale and more reasonable. Lots of great restaurants with a variety of dishes for everyone's tastes. We shopped and ate and ended the day eating ice cream on the grass (sitting on a complimentary blanket) listening to a jazz band! How awesome is that?\nShow less"], ["Reviewed July 22, 2017", 5.0, "Grownup Playground", ".This is a great place to go to with the family. It has a theme park feeling because the avenues are decorated for (seasonal) holidays. Lots to see and do. Great shopping, great restaurants. Very nice light/fountain display. Fealt at home."], ["Reviewed July 19, 2017", 5.0, "Nice place for me", "For me I like this kind of places where you can walk and see the shops around, but my daughters they just buy some and they want to go, maybe it was little bit hot at that day, the place is very nice you don't have to go there for shopping, you can go there for walking or for movie theater we didn't watch movie because of my young daughter age, but we set in small garden there for a while then we went. Nice place in general\nShow less"], ["Reviewed July 19, 2017", 5.0, "Great Shopping and People Watching", "Beautiful shopping area. Tons of great shops and brands represented. Perfect place to take a walk, sip a coffee, and do some people watching."], ["Reviewed July 19, 2017", 4.0, "Fun shopping -- and parking tip", "Nice variety of stores in a pretty setting. My teen loved the Snapchat Spectacle pop up kiosk. We learned you can try these sunglasses for free by visiting the Concierge desk and leaving your license and a credit card imprint. Nice way to try them out. We also loved visiting Sprinkles cupcakes before going back to the parking garage.\n\nBetter bargain parking at the Farmers Market area (instead of Grove garage) and making a small purchase to get it validated. Disappointed paying $7 to park in Grove lot.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Great shopping with a great atmosphere", "I loved this shopping area! It was very clean and safe. It has a great atmosphere and beautiful landscape! The Farmers Market is literally tied into The Grove! Lots of great shops and restaurants options all in one spot! I would definitely recommend coming by to shop and enjoy the beautiful setting!\nShow less"], ["Reviewed July 16, 2017", 5.0, "People watching!", "Caught a flick on a very hot afternoon combined with a bit of gift shopping. Top shelf shopping & people watching."], ["Reviewed July 15, 2017", 4.0, "Fancy shopping", "Its a beatiful place! Its open until 22, so you can go after your dinner in the farmers market. Its no the best place to buy, too expensive"], ["Reviewed July 15, 2017", 4.0, "Beautiful", "Really nice open air mall, carries most brands but if you are interested in H&M or Forever 21, you won't find them there."], ["Reviewed July 14, 2017", 4.0, "Nice mall", "It's a mall. A nice mall with high end shops. Nice are to walk around and also sit and people watch. Lots of great restaurants . Personally preferred the farmers market but the grove was fun also."], ["Reviewed July 12, 2017", 5.0, "Great place to shop", "This is such a cute shopping street! its almost like Disneyland's Main street! the whole street is beautifully designed and lined with some of the best shops and restaurants you can find. we went here on a whim from the hop on hop of bus, and we are so glad we did. it was one of our LA highlights, being next door to the farmers market and one stop before pinks hotdogs it really is a must do on your trip\nShow less"], ["Reviewed July 11, 2017", 4.0, "Nice Open Air Shopping Centre", "The best thing about it is that it is free! It is a nice outdoor shopping centre which offers a great variety of known brands such as Nike, Topshop, Anthropologie or Nordstroms. It also has a movie theatre. The highlight is the farmers market which even though is pricey is pretty good. Nice place to spend 1 or 2 hours at.\nShow less"], ["Reviewed July 11, 2017", 5.0, "GRRRROVE! A MUST in LA", "My favorite place for people watching, shopping and pure fun for all ages. Besides, being a beautiful outdoor park/mall with amazing stores and boutiques, I love that there still is a real live book store, which is an oasis to sit indoor or out and watch the beautiful people of which Los Angeles is famous for. The fountains are smashing and the parking superfluous. The sun always shines at the Grove and so will you!\nShow less"], ["Reviewed July 9, 2017", 5.0, "The Grove is Great!", "Loved this place, had so many amazing shops and markets to look at! Eating was great, so much to choose from!! Loved the water fountain and pond in the middle of the place, was so nice to sit and take in the sun and passers by.\nEven spotted a celeb who was happy to take a photo with me! (Lipp from Shameless).\nWould def go back here again, great shopping, food and all in all a nice walk around.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Great place to people watch", "Went with the teens on a Saturday night. Beautiful outdoor facility with stores and restaurants and a fountain and a movie theater. Great place to come and people watch. If we weren't with teens we would have probably skipped it, but had a nice time."], ["Reviewed July 8, 2017", 5.0, "I like it!", "Nice, clean, interesting place, where you can walk, watch dancing fountains, shop and just have fun!"], ["Reviewed July 6, 2017", 5.0, "Shopping in open air", "We enjoyed the shopping as a family with good variety of brands. I liked most American girl, coach and Nike."], ["Reviewed July 5, 2017", 5.0, "Good Shopping with a lot of sales but GREAT place for nosh!", "If you crave a variety of eats, then run to The Grove for food! There are so many options, that you will be coming back for more! Be sure to try the Beef Jerky, The coffee shoppe that offers coffee cups that are dipped in chocolate... eat and explore until your heart desires!\nShow less"], ["Reviewed July 4, 2017", 4.0, "Lots of things to see", "This was a cool spot to see. Lots of retail stores. We just walked around and browsed. Some cool architecture. The Nike store was massive. Also an American Girl Doll store there. The kids loved those two stores. Tons of restaurants to choose from for food. Parking was reasonable as well.\nShow less"], ["Reviewed June 30, 2017", 4.0, "A variety of upscale shops", "I visited the The Grove, while my daughter attended a function at USC good shopping I got some pink uggs for $60.00. It is right across the street from Ross and Whole foods."], ["Reviewed June 25, 2017", 4.0, "Lovely Little Shopping Area", "Nice clean outdoor shopping mall with all the usual stores plus a few cafe/restaurants and a cinema. One evening we visited they were showing the movie Legally Blonde for free in a small grassy area in the mall whilst on another evening they had a jazz type band playing in the same area.\nA Lovely way to spend a couple of hours, even if you aren't shopping.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Visited twice and was packed both times - nice walk of stores", "Anyone who says the mall is dead hasn't been to the Grove. It was packed with people both times we visited. Nice variety of stores and restaurants (restaurants were all busy). If you want to enjoy some time whether you want to shop or not, go to the Grove.\nShow less"], ["Reviewed June 23, 2017", 4.0, "Good shopping", "It's not a huge mall but it certainely have a nice charm and atmosphere. You will find enough to be content."], ["Reviewed June 22, 2017", 5.0, "Nice place to hang", "We had a few hours to kill before the baseball game. Was happy to have this spot with shops, restaurants and other fun things to kill time. Lots of places to choose from."], ["Reviewed June 21, 2017", 3.0, "Mixed", "The farmers market is real good, but the stores themselves are the same things you find everywhere else."], ["Reviewed June 19, 2017", 1.0, "Live music meant it was a nightmare for children staying. Beware", "We booked three rooms at the Grove Arms several weeks before our visit. At no time did the landlady tell us that a live rock band was booked for that evening - immediately below the bedrooms. We were promised the music would be finished by 11pm but it was still going strong at midnight and four visits downstairs to complain were needed. Accommodation is basic and, at £205 for the four of us for a night, felt like very bad value and a very poor experience.\nShow less"], ["Reviewed June 13, 2017", 5.0, "Loved it!", "The Grove is what I pictured all of Hollywood looked like: bright, clean, polished, friendly... obviously after spending time around LA I realized that it wasn't exactly true. The Grove, though, IS all of those things! It was a really relaxing place to spend an afternoon shopping and eating. If you have the time, it's worth checking out.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Great food places", "Loved the buzz of this place - lots of interesting food stalls - we had a great lunch. Liked the history of this place too. Easy parking. Good stop between Hollywood hills and Rodeo Drive area. Don't be put off by the big new mall this place which is next door has more character and originality - a real gem.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Food for EVERY taste and more!", "I learned about this place from a Los Angeles tour guide. The Grove is like the fanciest Farmer's Market you have ever experienced!!! If you can't find something delicious to eat here you need to learn how to cook. My favorite was a kiosk (restaurant stand) almost directly in the center of the many isles of food kiosks. It served (Washington state shipped) fried oysters that were off the hook literally and figuratively!!! I am a fried oysters fanatic and have ordered them at 40 plus restaurants but these fried oysters had me in culinary heaven!!! Besides this kiosk there are many others serving food from almost every culture. But if you want to stick with American fare there were a couple of kiosks serving grilled or baked chicken which my teenage son loved. There was also a fudge place that had rocky road fudge with lots of marshmellows inside which I couldn't pass up.There are lots of outdoor tables here some in the shade and some in the sun. There are also some cool souvenir stores here and a sticker store with every sticker imaginable. I will be returning to CA this summer and I will probably want to eat at The Grove everyday!\nShow less"], ["Reviewed June 7, 2017", 5.0, "Awesome mall", "As far as attractions and shopping venues go, this one is a treasure, providing the weather is good - its predominately an outdoor venue - in LA, so it's usually always good! Outdoor, great selection of shops, entertainment and eateries leading into a very pleasant day without the usual feeling of being hemmed into a windowless indoor world. Plus it has a farmers market just near by, supermarkets and large chain variety stores a stones throw away. It's all good in the hood: five big stars with one caveat...good weather!\nShow less"], ["Reviewed June 6, 2017", 3.0, "It was okay.", "If you're staying around here then it would be good to visit. If you have a spare afternoon you can get some dinner at the Farmer's Market which is perhaps more affordable than the other eateries. I found many things overpriced here (the market itself - fruits, vegetables were seriously overpriced... you might want to pop along to Trader Joe's across the Car Park but even then the produce is still pricey). I also found the people to be quite shallow, perhaps more than anywhere else in L.A. The shopping is quite meh. I wasn't impressed at all. It's not a 'landmark to visit' just somewhere to go if you have a few spare hours and want to eat somewhere new. It's also a lot smaller than you might think. The only good thing about this place is the Barnes and Noble or whatever it's called and the cheap-ish food at the Farmer's Market.\nShow less"], ["Reviewed June 5, 2017", 3.0, "If you don't have much time in LA don't visit here", "We decided to get dropped here and really the only highlight was the American girl shop, don't get me wrong the place is beautiful with lots of shopping. But we should of spent our time doing something else instead of going to the shopping complexes. We didn't stay long. It's nice to see but if your only in LA for a short time utilise your time elsewhere.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Amazing Place!", "Must visit when you are in LA. Attached to the Farmers market, perfect for a whole day outing. The grove has a good collection of shopping , food and fun. There is also a small area where they give out free blankets to use/ lie on the grass. The fountains are fun to watch. Great place to be on a nice summer afternoon.\nShow less"], ["Reviewed June 4, 2017", 4.0, "Nice Outdoor Shopping Mall", "Nice outdoor shopping mall with fountains and semi-fancy restaurants. There is a movie theater, Anthropologie, Barnes and Noble, Nike, and other stores. The Farmer's Market is adjacent to the Grove. I actually like the Farmer's Market more than the Grove because the Farmer's Market offers lots of interesting food selections and has a much less fancier atmosphere. Overall a good experience, but be sure to get your parking validated.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Must see!", "I loved the atmosphere in this place, people are relaxed coming to have fun, couples, families, shoppers, a great mix in a small area makes positive vibes reign! Would come as often as possible if I lived in LA!"], ["Reviewed June 3, 2017", 4.0, "Need more than 1 day to see it all", "The Grove is located right next to the Farmers Market. It was not too far from our tour of Hollywood. There are many shops and restaurants plus a theater at The Grove and it's a great place for people watching. The entire area has been redone and there is a Whole Foods Market across from The Grove. While walking through the Farmers Market, an ice cream cone sounded good. The place we tried makes their own and it was delicious!\nShow less"], ["Reviewed May 31, 2017", 4.0, "Would be a better place to visit if you're not on a budget", "This is a neat place and beautifully kept. There is a lawn on which some people just lay or congregate, it's dog friendly, and there's plenty to do! Only, most of those things to do, like shop or eat, cost more money than you may want to spend.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Extremely Nice Attraction!!!", "This is an upscale outdoor mall with a lot of activity! Great place to shop and people watch. It's sort of connected to a farmer's market that we thought was really cool. Actually, I should do a separate review on the market alone. It was full if so much culture. We saw everything from alligator bites to organic juices/smoothies to French inspired cuisine to the selling of fresh uncooked meat. It was an amazing outdoor shopping/dining experience! Being an Atlanta native, we have nothing compared to this...the closest description that we have to this place and it still would be a poor comparison is...a much bettter Atlantic Station with Phipps Mall stores and add Dekalb Farmers market, Krog Street Market, and Ponce City Market all together in one place.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Beautiful place", "The Grove is really beautiful. You can shop and walk, it's just really nice. I love the American Girl Place for my daughter and the trolley is really fun."], ["Reviewed May 27, 2017", 4.0, "Nice shopping and relaxation", "A nice place for shopping which has many speciality shops. It has cinema theater. Coffee and Ice cream shops are around. You can buy souvenirs and gifts. The Farmers Market is just next to you where you can eat and relax. Car parkings are available. You have to visit this place when visiting Los Angels.\nShow less"], ["Reviewed May 27, 2017", 5.0, "\" LOVELY \"", "I like the atmosphere there. There are many kinds of restaurants all day long. Prices in the shops is not expensive so you can make a good shopping there and enjoy that lovely place. Like it so much and l am sure I will visit it next time in L.A.\nShow less"], ["Reviewed May 26, 2017", 4.0, "Weekday stroll", "As visitors from the philippines we were brought to this place cause of the traffic and people were converging for what seems to be protest march around hollywood blvd. The place have nice shops with theatre and nice restaurants. Add to this is what they told us as the original spot - Farmer's market. If you're in the mood for food trip then it's the place to be. Brazilian bbq, corned beef steak, mongolian, etc etc. The place is a meeting of the old and common people's place and the modern and sophisticated ones. I love the place.\nShow less"], ["Reviewed May 23, 2017", 4.0, "Nice place to walk, eat and people watching", "It's a closed street with stores, restaurants, pretty fountain and a farmers market also very nice to eat Mexican food (and more affordable).\nIf you go there, try get earlier than 11am because it is easier to park (there are paid parking floors). I love to go to Ladureè(French brand since 1845) sit on the outside tables and spend some time watching people moving back and forth. The macaroons are simply gorgeous! You really should try this experience in your life !!\nShow less"], ["Reviewed May 21, 2017", 5.0, "Nice place", "The food looks and tastes good, breakfast dishes all day long. Price is not expensive and the place is nice."], ["Reviewed May 21, 2017", 5.0, "Nice time!", "Had a great time at The Grove. I visited twice during my vacation. I ate at the market; so much to choose from! Great shops and convenient parking. Definitely a \"must-do\"when you're in LA."], ["Reviewed May 21, 2017", 4.0, "Really nice shops and market", "Visited The Grove the other day and was a nice option for an early evening shop and dinner at the market. Amazing and luxurious little shopping mall. Beautiful landscaping and lovely shops. Went to the market there too which had lots of nice food options and a couple of bars. I had a couple of beers at the bar right in the centre of the market and watched the NBA playoff game while my wife did some more shopping. 10 or 12 different beers on offer at that bar. Beer tastings paddle on offer there too. So something there for men who aren't really a fan of shopping. My wife really enjoyed shopping in the beautiful shops too. Overall worth a visit to Grove and glad we went. Only about $10 uber ride from Hollywood Blvd.\nShow less"], ["Reviewed May 20, 2017", 3.0, "It's your average Mall!", "It's just your average outdoor mall with your average chain stores. I'm from Florida and there are dozens just like this one. I did like the dancing fountains and the feature of the towels you could borrow to lay on the grassy area. I found the Farmer's Market next door a lot more interesting. So I would walk to the Market and browse through the stalls for some more interesting food and finds.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Outdoor shopping area and farmers market", "The Grove was fantastic! A beautiful outside shopping center that includes many eateries and shops. There is even a trolley that you can hop on to take rides around the grove.\n\nIt is a nice way to spend an afternoon in LA. Shopping, eating, people watching, photo taking.\n\nThe only downside is the parking garage. It is like a maze driving through there. Seems even a little dangerous with all of the twists and turns. But on a positive note, the valet parking area is amazing! It has the feel of a 4 star hotel lobby!\nShow less"], ["Reviewed May 17, 2017", 4.0, "You have to check this out!", "I went to the farmers market and had some spare time and just stumbled upon this. Shopping, movie theater, fountain, music. Such a fun area! Reminded me of NY! Don't miss it!"], ["Reviewed May 17, 2017", 5.0, "Cool!", "A very cool shopping centre. You forget where you are when shopping here. It makes you want to stay and spend spend spend."], ["Reviewed May 17, 2017", 5.0, "Don't miss that!", "The most beautiful place in LA! Looks like a an old little town. You can just go around and enjoy the atmosphire, get something to drink, or just get inside stores there! I was there at 5pm untill 7-8 pm. Sunset is a perfect time, and also it safe there at night!\nDON'T MISS!\nShow less"], ["Reviewed May 13, 2017", 5.0, "Terrific mall experience combined with Farmers Market next door", "The unexpected delight of the The Grove and the Original Farmers' Market. Didn't picture the Grove as this at all. Thought it was a run of the mill shopping centre. Were really only going to the Market for lunch coming back from Rodeo Dr. But Wow - loved the atmosphere, the outdoor nature, the tram car, the entertainment, the architecture. The Farmers Market was another great smorgasbord of food delights - even better than the Grand Central Market in Downtown.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Great place to stroll around", "Lovely pedestrian street, awash with shops and restaurants. It is a great spot to spend a few hours. Adjacent is the farmers' market, perfect to shop for food, trinkets and have a bite at one of the very many food stalls. Enjoy."], ["Reviewed May 13, 2017", 4.0, "Nice place to go for shopping for her not for him", "It is a nice place to go for a walk and spending some time. It is a commercial centre but in plein air. Many shops are proposed but mainly for her while I was looking for shirts and things west coast for him, non existent there.\nShow less"], ["Reviewed May 12, 2017", 5.0, "great place to hang out, eat, shop, cinema", "this is one of the best places to hang out in LA, it has lots of places to eat drink, shop ad go to the cinema. its a little pricey but the farmers market attached to it is a little more reasonable. the farmers market has lots of little food stalls to eat in a comunial area and the food there is amazing. the New Orleans food place is particularly brilliant. you cold spend a whole day at the grove just hanging out looking in shops ect. if you have the cash of course. some nice mid ranged price jewelry places here too. also good for celeb spotting\nShow less"], ["Reviewed May 9, 2017", 4.0, "Great place to have fun", "this outdoor mall excellent concept good design free double decker trolley and travel with in the open market brand name stores restaurants friendly entertaining place"], ["Reviewed May 9, 2017", 3.0, "Nice little shopping area", "This was a nice shopping area but if you only have a couple of days in LA, skip this attraction. It's just like any other outdoor shopping area. It's nice! But only stop if you have some time to kill while visiting."], ["Reviewed May 8, 2017", 4.0, "Shopping", "Local LA shopping center . Many of the same stores as at a mall . Restaurants and coffee . On site parking available .\nWe had fun but there weren't really any unique stores. There is a really cool farmers market attached . Check that out !\nShow less"], ["Reviewed May 6, 2017", 5.0, "Great deal to start with LACMA, then walk to Farmers market and close with The Grove", "A charming and Outdoor Mall located just beside the Farmer´s Market and 15 minutes walking from LACMA & Petersen Automotive Museum. If you are around LA during Christmas, you can not miss it."], ["Reviewed May 2, 2017", 5.0, "A fun place to visit all around1", "I know they film various celebrity shows from this location in the heart of LA. So I took the family last Saturday. What a very cool place! Parking is free with validation and they validate for free inside Nordstroms but I'm sure you can find something to buy.\n\nI'm a meat eating gun carrying member of society but I tried Vegan Ice Cream and it really was pretty good.\n\nYou can sit in the park area and the mall provides fresh clean blankets to sit upon and people watch or enjoy snacks and libations.\n\nPlenty to eat here. If you want to forgo the lines in the main area, hit the Nordstrom's eBar... It's like Star Bucks but tucked in a corner... busy but not as crowded as the rest of the place and they have good drinks there.\n\nBarnes and Noble is pretty amazing as it is 3 stories and they have celebrities in there almost everyday signing their books.\n\nThey also have a free double-decker trolley that travels the length of this outdoor mall.\n\nOverall it is a great place to go and just be or shop. I really enjoyed people watching with my daughter. This place is the epitome of LA Fashion and you will see it all there.\nShow less"], ["Reviewed May 2, 2017", 5.0, "Great timekiller", "Even if you're not trying to shop at any of the stores they have, The Grove is still an amazing place to visit if for no other reason than to experience a well designed shopping center. It's seriously gorgeous. Coming from the east coast/midwest, we have nothing like it there. The landscaping is amazing, you feel like you're in a movie. The shops have something for everyone, from super high upscale brands, to Topshop/Zara, to The Container Store. The area is easy to walk. Even the parking garage entrance is designed like a hotel desk; in fact, I thought it *was* a hotel at first. I even saw a celebrity while I was here. The Grove is a great spot to visit when you come to LA, I recommend it even for non-shoppers. Just come, get an iced tea or something, and sit on a bench for a while. You won't regret it. Parking prices aren't outrageous either.\nShow less"], ["Reviewed May 1, 2017", 3.0, "I Hate Going to The Grove! But There's Lots of Good Stuff There.", "It's so busy, the traffic, parking, restaurants, always so crowded. I try to go as little as possible, but it is a cool mall. I like the Farmer's Market there, lots of stores, but nothing really you can't find at other malls. I just hate the crowds, I'd rather go eat at Canter's Deli down the street and shop somewhere else if possible.\nShow less"], ["Reviewed April 26, 2017", 5.0, "Lovely place", "Went here while at lunch at the farmers market on a tour. This beautiful space is where you would hang out for lunch with a friend. Beautiful grounds with lawn, pond, flowers, trees, paved roading, that is quiet and intimate. It was hard to believe we were in the bustling county of Los Angeles. The Nike store was something else- 3 floors of space with areas set up for trialling the merchandise.\nShow less"], ["Reviewed April 24, 2017", 5.0, "Beautiful Shopping Center!", "Very trendy place, they always have some exhibit in the center of the place and great music near the fountain.\nThe stores are a bit pricey but the place is really nice and you can have a lot of fun strolling down and looking at things. They also have great places to eat!\nShow less"], ["Reviewed April 24, 2017", 5.0, "Beautiful Shopping Experience", "This outdoor mall is like visiting a magnificent park. Lots of beautiful flowers and plants and lovely water features make this a fun day of shopping or just enjoying the outdoors. There is also a Farmer's Market which has interesting options for lunch or a snack. If you enjoy shopping this mall is not to be missed.\nShow less"], ["Reviewed April 22, 2017", 4.0, "An eclectic retail and cafe/restaurant precinct", "Easy to get to, park and spend some time from breakfast to dinner with retail therapy in between. A Rueben and Cherry cola, Umami Burgers and the Cheescake Factory will add a few kilo's."], ["Reviewed April 20, 2017", 4.0, "Whimsical and Fun Shopping Experience", "This is a trendy and upbeat newer outdoor mall in L.A. It's crowded but it's a fun place for people watching, shopping, and dining. It has unique ambiance with an old small town style architecture reminiscent of Disneyland Main Street . Come earlier for a good parking spot. There are many restaurant choices and it's a perfect place to visit on a sunny warm Spring day in Southern California. Highly recommended and we will come back.\nShow less"], ["Reviewed April 19, 2017", 4.0, "Spring Bresk", "Fun Trip , visited the Grove in the morning after breakfast at DuPars Visited The Grove at night, fun"], ["Reviewed April 18, 2017", 5.0, "Favorite place to be", "Absolutely loved everything about The Grove!!!! For starters had a convenient parking garage. Loved all of the stores, loved people watching, loved the ambiance of the landscaping; it was beautiful."], ["Reviewed April 17, 2017", 5.0, "Where to watch dogs in prams being paraded", "What a lovely indoor/outdoor shopping centre with a cute team you can hop on to go from entrance to opposite end. Nice little walk to farmers market where we got a bite to eat."], ["Reviewed April 15, 2017", 3.0, "What's the hype about?", "A lot of people rave about this location, but I don't get it. Some fast food outlets with tourist kitch at the entrance, and then some over-priced upscale stores as you travel further on down the mall. There are lots of better things to do in L.A.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Coolest mall ever", "Loved the grove, a different take on a shopping mall, a hybrid between an outdoor strip mall and a park. They even have a trolley that you can ride around. Nice to go window shopping and people watching. The bathroom was clean, nice and fancy. Love that they have molton brown hand wash and hand lotion!\nShow less"], ["Reviewed April 13, 2017", 1.0, "Crazy parking, overpriced restaurants, tourist trap", "Where do I begin. Took 5 minutes just to get in because pedestrians were streaming across the crosswalk non stop. No Grove staff in sight to direct traffic. The parking structure is like Mr. Toad's Wild ride. One way traps, crazy merging, almost had two accidents. If you get in the exit lane by mistake you are forced to exit, no \"return\" lane. Parking payment is fully automated. Was charged $10 instead of the validated $3.50 rate but no person to argue with. Then the restaurant. $24 for a small plate of pasta and $13 for a cocktail was representative of most of them. Much better places in LA for shopping and dining. Avoid this overpriced, rip off, tourist trap.\nShow less"], ["Reviewed April 10, 2017", 4.0, "Lovely Shopping Spot - Relaxing Vibe", "Enjoyed this open-air shopping area. Lots of the usual chain-type stores with two major dept stores (Nordstrom and another one I forget). Huge American Girl doll store there too. Nice movie theater. A few restaurants. Adjacent to the Farmer's Market food area, which I enjoyed more.\nShow less"], ["Reviewed April 10, 2017", 5.0, "What a perfect place for lunch", "We went as a family and had a blast! There was something for everyone!! Great options and everything was delicious. We had Mexican food, which was perfect. Could eat here every day."]]}}