{"Third Street Promenade": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Third Street Promenade", "url": "/Attraction_Review-g33052-d103427-Reviews-Third_Street_Promenade-Santa_Monica_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/50/80/f9/third-street-promenade.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5310"}, "address": {"@type": "PostalAddress", "streetAddress": "Third Street between Wilshire Boulevard and Broadway", "addressLocality": "Santa Monica", "addressRegion": "California", "postalCode": "90401", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Great place to people watch and eat different foods", "If your in the Santa Monica area, the Third Street Promenade is a fun place to go. It's just two blocks for the Santa Monica beach and the Santa Monica Pier. Lots of fun things to see on the Pier along with restaurants to eat. I prefer the Promenade as there are interesting stores and many different places to eat. Parking is easy and you can enjoy the entire day there.\nShow less"], ["Reviewed 4 days ago", 3.0, "Great people watching", "When you tire of walking the beach the promenade offers a very interesting alternative. Lots of retail space of all kinds in an interesting assortment of architectural styles. Much of it is reminiscent of the glory days of cinema. And as is always true in Santa Monica, the people watching is excellent. Promenade is closed to vehicular traffic so it makes for a very interesting place to get some exercise.\nShow less"], ["Reviewed 5 days ago", 5.0, "Cute shopping area", "Great outdoor shopping area with many good restaurants to enjoy! Shopping ranged from very high end stores to affordable places like Old Navy so something for everyone! Great area to spend an afternoon!"], ["Reviewed 6 days ago", 5.0, "Shopping for the holidays", "You will find lots of stores and restaurants here. The Promenade spans over close to 3 blocks. It had art installations by Dabs Myla all up and down the shopping center streets."], ["Reviewed 1 week ago", 5.0, "Highlight of my visit", "I've spent a few days in the south California area. By far Santa Monica and San Diego have been the places I have been. As for this promenade it was a lovely walk and we enjoyed window shopping around all the shops."], ["Reviewed 1 week ago", 5.0, "Pure enjoyment!", "Great selection of stores, clean and well kept promenade with a lovely variety of restaurants and coffee shops. Felt safe and comfortable in this area, would definitely visit again!"], ["Reviewed 1 week ago", 4.0, "Lots of stores and random entertainment", "Wether you are looking for a Tesla car or a tshirt from old navy, this area has a bit of everything."], ["Reviewed 1 week ago", 4.0, "I Wish it Went On and On", "I never miss going shopping when in Santa Monica on the Third Street Promenade. There’s always some interesting stores, good food and it’s even a good place to see a movie. I always get to the end and wish it continued for a few more blocks, but it’s a relatively small community and they do a great job of keeping it up.\nShow less"], ["Reviewed 1 week ago", 4.0, "Great place for a light lunch", "Well situated at 1401 3rd street Promenade, this self service Asian restaurant is also know as Bibibop ans has a great selection of tasty food"], ["Reviewed 2 weeks ago", 5.0, "Nice place to have a wande", "We spent a few hours here in the afternoon. A lot of nice shops to look around and some street entertainment and some restaurants."], ["Reviewed 2 weeks ago", 5.0, "Excellent and clean", "This is a good shopping area, very clean and with a mix of well known stores. There are cinemas dotted amongst the shops. Some dinosaurs with water fountains make a lovely feature of the shopping area. A pleasant place to be."], ["Reviewed 2 weeks ago", 5.0, "Lots of shops", "This is a must see too if you’re in the Santa Monica area. Every type of shopping you could want from high end to everyday. Lots of food and restaurant choices."], ["Reviewed 2 weeks ago", 5.0, "Very cosy shopping", "Judt lovely stroll in the sun. Nice decor. Clean. No stress or crowd. No traffic. Just enjoyable...."], ["Reviewed 3 weeks ago", 5.0, "Great shopping", "Great range of shops available here as well as some top restaurants. A lot of homeless, which is very sad to see. Can’t seem to find ‘little ruby’ on here to rate. But it’s an Aussie cafe & for a fellow Aussie, it was exactly what we needed. Also has the best coffee we’ve had since being in America!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "3rd Street Promenade", "When I went here it was one of the first times that I’ve ever been somewhere where they have shops on a street. Not just any regular shops, but shops that I actually shop at. The whole vibe was good."], ["Reviewed 3 weeks ago", 5.0, "great shops", "I loved all the shops they had. It was perfect for me and my friends, they had shops for people of all ages. It was very clean."], ["Reviewed 3 weeks ago", 3.0, "Try it once", "Stores come and go on the promnade. Some are interesting and some are just OK. In the end this is just an outdoor shopping mall."], ["Reviewed 3 weeks ago", 5.0, "Visiting from Brisbane", "Another great place to escape the hustle and bustle of Los Angeles, Santa Monica is a great place to visit, some great restaurants down the end of the promenade to try and a short walk to the pier must be included, especially at sunset"], ["Reviewed 3 weeks ago", 5.0, "Great place to shop", "First time here, it was very entertaining and clean. Great day with friends or family good food and shop choices"], ["Reviewed 3 weeks ago", 4.0, "The Street with fun, food and some fabulous shops in LA", "When you finish seeing Santa Monica Beech, visit Third Street Promenade Street to experince the fun, food and the fabulous shops of LA. I Liked it :)"], ["Reviewed 3 weeks ago", 1.0, "You might as well be in Copenhagen", "This used to be a unique place with its own unique shops. Now it’s all the same corporate atmosphere and stores that are everywhere in Europe and New York, Boston, etc. Santa Monica is crowded, corporate, and rather obnoxious these days — take the train to the beach and rent a bike instead of bothering with this overpriced boring promenade.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great shopping and people watching!!", "Third Street Promenade has great shopping and people watching!! I am not that I have ever really gone here to purchase anything, but a fun stroll. I have to agree, it is better at night."], ["Reviewed 3 weeks ago", 5.0, "Great start to our vacation", "Went to Santa Monica Pier and discovered this amazing shopping area. Went shopping and had a nice lunch before taking an Uber back to the hotel."], ["Reviewed 3 weeks ago", 5.0, "Better at night", "Enjoyed the night time visit better. Everything still open but the atmosphere was more a fun stroll than frantic shopping. Great Italian restaurant? Transverse? Folk were dancing along with street acts"], ["Reviewed 4 weeks ago", 3.0, "Its an outdoor mall", "Do you like malls? Fo you like being outside? This could be the place. Has a few places you wouldnt find in an everyday mall (e.g., Jonathan Adler) but alas it is a mall and thats about it."], ["Reviewed 4 weeks ago", 4.0, "Nice stroll", "The promenade is a 3 block pedestrian promenade in Santa Monica. There are always people there but it gets packed during tourist season and weekends. There is something for everyone. Theatres, shops, restaurants and street performers. Definitely worth the visit. This is not the overpriced mall that leads on to the promenade.\nShow less"], ["Reviewed 4 weeks ago", 2.0, "Mostly a crowded shopping area", "Reminds me of a typical suburban shopping center with a lot of retail. Too crowded and nothing unique or special."], ["Reviewed 4 weeks ago", 5.0, "Fun place to visit", "Definitely worth a visit. A fun place to be early evening, as there is dancing and singing in the street. Some good places to eat too."], ["Reviewed 4 weeks ago", 5.0, "Interesting place to visit", "High end stores but something to see. Street venders and street entertainment all along the promenade. We specifically had wanted to see and meet Roger Whitley. We were very disappointed that we could not find him. Plenty of places to sit and rest, enjoy and take in all the street entertainment.\nShow less"], ["Reviewed 5 weeks ago", 3.0, "Typical Shops", "The streets that make up the Third Street Promenade are typical stores found in your local mall. I was hoping there would be some local shops but it was only composed of commercial giants who could afford the rent."], ["Reviewed January 24, 2018", 4.0, "Santa Monica Staple", "I've grown up around Santa Monica and this is pretty much a staple to the city. Driving around here can be stressful, especially near the holidays and summer months so be aware that it may take a long time to go down some of the streets surrounding it. Also during the summer there are many bicyclists and people crossing which also makes it difficult to drive. There are many parking structures with decent parking rates, but during busy times in the summer these can fill up and you might have to park further away. The actual promenade is pretty much just like an outdoor mall on a street. There are a lot of stores that you see a lot in regular malls, but there are more unique stores that are scattered in as well. They usually have late hours, which gives you the freedom to come later in the day. Most of the more popular stores are closer to the Santa Monica mall at the end of the promenade is where the department stores are. Then as you keep going down, the stores get more sparse and there may be empty store fronts. There are a couple of movie theaters with 2 AMC's, an Arclight at the end of the mall, and Laemmie which is one street over from the promenade. The tickets are a little pricier since they are on the promenade or close to it, but it's only usually a few dollars more than usual. Most of the places to eat on the promenade are pretty pricey, but there are a few fast places like bruxie, chipotle, and a pizza place next to the AMC. But most the sit down restaurants will be expensive. There are usually entertainers on the promenade which can be sometimes be fun to watch. Everything is outdoors, which makes it nice and makes you feel like you aren't really in a mall. Overall, you can shop, eat, and a see a movie which is the usual for a mall, but it does have the added value of being outdoor and entertainers as well as most of the stores are pretty good if that's what you are there for. Also, it's easy to visit the pier and beach from the promenade so you wouldn't have to drive again to do those things.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Great Atmosphere!", "Nice location to spend all day with shopping, outdoor and indoor restaurant ! Lots of fun ! Can see many talented performers, nice area to walk. Love Third street."], ["Reviewed January 23, 2018", 3.0, "Not impressed", "Walk the street for a few hours does not compare with the farmers market at the grove. They have stores we see all over the country not very original"], ["Reviewed January 22, 2018", 5.0, "Shopping", "Live third streets shopping, great selections, unique shops as well as traditional stores. Fun eateries,"], ["Reviewed January 22, 2018", 4.0, "Nice Outdoor Mall & Great Atmosphere", "Very nice area, pedestrian-friendly,filled with major chain stores , outdoor and indoor dining options, great vibe, sculptured shrubs and street performers...all this reminded me of shopping in Europe. I had the same good feeling like walking on Rambla Catalunya in Spain...\nOnly one BIG MINUS for the restaurant \"Sonoma Wine Garden\": expensive and tiny portions!!! My son had lamb, me and my husband, we had pizza, and my mother had a soup: none of us can't say that the food was at least enough if not tasty...so i do not recommend this restaurant...\nExcept the restaurant not so nice experience, i highly recommend a walk on the Third Street Promenade\nShow less"], ["Reviewed January 22, 2018", 5.0, "Close to pier & beach", "Great area to walk,people watching,major shopping, movies, dining. international destination. Street entertainers(many talented performers)"], ["Reviewed January 22, 2018", 4.0, "Great way to walk and shop", "Was an easy walk from our hotel and the pier. Lost of big brand names plus a few surprises, like Tesla. Overall a good expereince. Wonderful to walk through because the street is closed-off from traffic!"], ["Reviewed January 21, 2018", 5.0, "Enjoyable Walk", "We came here on a recomendation from a taxi driver and was not disappointed at all. The amount of shops, people and street entertainment was so cool. You have your boutique shops as well as your usuals, but there are places to sit and watch the street entertainers, have a drink or go for some eats. It was not overcrowded and the vibe was so relaxed. A great place to go to unwind from the day. We went around 4.30pm and walked around for about 1.5hrs.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Shopper's delight", "This is a fun area to take a walk and see street performers and shop. It's closed to traffic which is great for the pedestrians. There are some chains here but also a few local stores. I can imagine this street getting very busy on a weekend in peak season.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Such buzz", "Crowded and crazy but great for window shopping and snack, good burgers and malts at a place on Arizona on the way to 2nd."], ["Reviewed January 21, 2018", 4.0, "Fun and neat", "This was such a neat place. It’s nice, clean and has shops to enjoy. There’s live music, restaurants and bars. Family friendly, too."], ["Reviewed January 21, 2018", 4.0, "Lots to see and do", "Great shopping. Great places to eat. Has a real laid-back feel to it. Great way for a family to spend the day. Lots to see and do and the kids won't get bored."], ["Reviewed January 21, 2018", 4.0, "Nice shopping no sales though", "Nice walk along here with big names nearby but also the smaller outfits too. Good restaurants in fact we ate at a beautiful authentic Italian restaurant with great pasta along there called Lagos. Nice street performers also. Watch out re tax though most of the street I understand adds 25 pc tax which is pretty steep.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Amazing boutiques", "If you are in the mood for big chain shopping mixed with boutiques - This is the place to go. Not to crowded in the weekdays however overly crowded in the weekends."], ["Reviewed January 20, 2018", 5.0, "Enjoyable", "There are shoppes here and there is a farmers market on the weekend. It is a great place to take a stroll only. It is just 3 blocks from the ocean. Parking is very hard to find."], ["Reviewed January 20, 2018", 4.0, "Great Shopping", "Great shopping variety of store in a different price range, good restaurants.Nice place to people watch."], ["Reviewed January 19, 2018", 4.0, "Loved this :)", "Great place to be Day or night.. loved the vibe and great for shopping.. Would love a street like this at home"], ["Reviewed January 16, 2018", 4.0, "I've always liked walking along here", "It has changed a lot in the last 5 years or so, but it is still a nice place for shopping and being outdoors. There are good stores and food - we actually had one of our best meals here! Family friendly and we didn't particularly struggle to find parking - on a weekend night :)\nShow less"], ["Reviewed January 15, 2018", 5.0, "Fun place to Shop enjoy a nice lunch or dinner", "One of my favorite place to go while in Santa Monica, there are good shops and restaurants plus musicians on the promenade. A fun place to enjoy with family and friends."], ["Reviewed January 14, 2018", 5.0, "Santa Monica to enjoy", "A lovely street lined with shops and restaurants. Lots of small kiosks and street musicians and artist. A good place for family outing."], ["Reviewed January 14, 2018", 4.0, "Vibrant Community Hub", "Festive crowds stroll through this shopping space at all hours. At the holidays the decorations are bright and tasteful. There are both local boutiques and chain stores in walkable distance. Parking garages make it easy to visit. Street musicians and performers attract lots of viewers, and sometimes the audience cluster blocks the sidewalks, but pedestrian friendly streets limit congestion.\nShow less"], ["Reviewed January 10, 2018", 4.0, "Love the shops", "The shops here are great with some unique stores mixing it with chain staples. There’s also s9ne lovely bars and cafes . Good vibe too"], ["Reviewed January 9, 2018", 4.0, "Nice shopping pedestrian mall", "It reminds me of Lincoln Road in South Miami Beach. However, the restaurants and cafes are mostly national chain. There are some interesting public artworks in the middle of the promenade. Though most of the shops do not look too interesting (as you can find most of them in other parts of US), it is sill a nice stroll after a day at the beach.\nShow less"], ["Reviewed January 8, 2018", 3.0, "Too crowded", "We used to go there every week 10 years ago. It was amazing place to take a walk and see so many talented people performing. We haven’t been here for 5 years. Decided to go see one of our most favorite places in Cali and were very disappointed. Too crowded. Tons of people, everyone’s rushing, pushing each other. Just shopping, shopping, shopping. Not so many artists and performers. Like 2 of them. For us it lost it’s unique character. Unfortunately.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Pedestrian Zone", "Lovely pedestrian zone here for the shops, cafes etc, Salsa dancing in the street dinosaur statues, clean pleasant walking lots of art around too"], ["Reviewed January 6, 2018", 5.0, "Nice outdoor Mall", "Just the right size. Nit too big, not to small. No big chains, more like mim and pop places. There is an REI which is a must for outdoor people. Plenty of restaurants and little shops. Can be crowded, depending when you go. And no matter when you go parking will be a problem, but u will manage.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Very diverse", "We always love to visit this street and see the performers and the many stores and restaurants. I’m not saying they are good performers but they are definitely entertaining. Lots of great shopping and good restaurants along the street.\nDefinitely worth many visits. We will return\nShow less"], ["Reviewed January 4, 2018", 5.0, "Shopping", "5 blocks of retail shops & restaurants line this promenade. Mainly chain stores such as forever 21, Victoria secrets, Abercrombie & pacsun etc street performers mix with tourists, angelenos & locals go for the farmers market in awe months"], ["Reviewed January 3, 2018", 5.0, "Very Entertaining", "There are many stores and restaurants along the third street Promenade. One of the biggest Apple stores is there. Lots of street entertainment. Singing, playing the drums and doing magic. We enjoyed just walking around after having dinner there."], ["Reviewed January 3, 2018", 5.0, "Great restaurants and shopping", "Great place to visit if in LA. Amazing restaurants and stores. One of my favorite places to go in Los Angeles"], ["Reviewed January 3, 2018", 4.0, "Lively and a little homeless", "Loved the stores here. Didn't love all the vagrants doing their thing, including singing and dancing to get some spare change. But its nice to shop in the sun."], ["Reviewed January 3, 2018", 4.0, "Nice shopping area", "This is a nice shopping area. The public restrooms had attendants and were very clean and safe. Large choice of stores and great statues and decorations. Liked this area better than the pier."], ["Reviewed January 3, 2018", 5.0, "Holiday", "Visited Third Street Promenade while on holiday. It has a mix of shops and eateries along this pedestrian street"], ["Reviewed January 1, 2018", 4.0, "Sunny day walk", "Shops and animations makes the third street promenade a good idea on a sunny day. Used to like it when I was a teenager, haven’t aged in ten years, it’s still a classic in Santa Monica. Head somewhere else if you want decent food though"], ["Reviewed January 1, 2018", 5.0, "Uncharacteristicly an urban downtown", "Uncharacteristicly an urban downtown in a Midwest styled City. Once called the Santa Monica of the Midwest, with still a lingering drawl, the City has reinvented itself as nearly a vibrant city. Trendy shops and lively pedestrian activity are the core of its vibrancy. Being seconds away from the pier and Palisades Park still keeps its spirit as Santa Monica by the Sea. Still, it’s a fun place to shop, walk, eat, drink, and recreate.\nShow less"], ["Reviewed December 31, 2017", 2.0, "Just an outdoor mall", "Chain stores. Lots of people. Really just a city street blocked off for an outdoor mall of national chains you get in any city."], ["Reviewed December 30, 2017", 3.0, "Nice outdoor location", "Fun place to walk around and grab a bite to eat. Street performers are usually around singing. The shops are typical mall shops and then nicer shops at the end where the mall is. Great for people watching and strolling."], ["Reviewed December 30, 2017", 4.0, "A great walk", "This is an iconic area. At one time it had a little local flavor but now it is just an open air mall. It is a nice one though, and it does offer some people watching. If you go in the streets perpendicular to 3rd you can still find some of the non chain stores.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Love the Promenade", "Love to walk and browse and shop o the promenade. There is always great people watching and lots of street performers to keep you entertained. There is pretty much a store here for every budget level as well."], ["Reviewed December 25, 2017", 4.0, "Three pedestrian blocks of shops/restaurants", "Third street promenade is one of the few pedestrian streets in the LA area. It’s filled with street performers, shops, restaurants, and movie theaters, but it’s only three blocks long. It’s worth combining a walk down the promenade with a stroll along the pier."], ["Reviewed December 25, 2017", 4.0, "Nice Stroll through the Homeless", "Nice place to shop and people watch. Too tolerant of camped out homeless but hey it’s sanctuary california, what does one expect? Pretty clean considering the crowds. I applaud the use of disinfectant/bleach to hose everything down."], ["Reviewed December 24, 2017", 5.0, "Great relaxing shopping area", "The Third Street Promenade has great stores and a very relaxing shopping venue. It is connected to a small shopping mall."], ["Reviewed December 23, 2017", 5.0, "Quick walk through!", "We always enjoy a quick trip through the promenade! A few stops along the way at stores and for a snack then on our way to the next adventure!"], ["Reviewed December 23, 2017", 5.0, "A Little Bit of Everything: A daily \"go to\" spot", "The Third Street Promenade was a \"go to\" location for us. Whether it was for breakfast, afternoon coffee, shopping or and evening dinner, we were there at least once a day. There are so many shops to choose from and the variety of restaurants is excellent. If you are there during the weekend, the evenings are filled with entertainers such as musicians, speakers and a whole lot more. A great place to shop, dine and people watch!\nShow less"], ["Reviewed December 22, 2017", 5.0, "Shopping and Food", "What a fun experience to have shops in all price ranges to explore! Buddy’s new bakery next to Starbucks offers a great treat to passify any reluctant shoppers."], ["Reviewed December 22, 2017", 5.0, "Variety of shops, sights, free entertainment", "Some of the entertainment, taking place in the pedestrian street, might make you shake your head, some is spectacular with people on their way to stardom or injury, depending. The restaurants vary from high end to fast and the stores vary as widely. It's fun, and the parking is easy with several inexpensive facilities nearby.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Walk,shop & dine", "A great place to walk and enjoy street music. Shopping at its best. Nice stores and good restaurants to dine."], ["Reviewed December 19, 2017", 5.0, "Meh! But iconic.", "So, so! Hi mean a Street with buskers and shops and lots of lights. Dinosaur landscaping. It all seems a bit too much. Trying too hard to have European feel. Fast food, walk around if you are at a loose end. Better food and restaurants that are cheaper and better down the road.\nShow less"], ["Reviewed December 19, 2017", 4.0, "Shoppers paradise", "From Nike to tori to Anthropologie and Nordstrom..it’s all here. Not too crazy for holiday week and there were bargains to be had.spent a few hours checking out street performer s and favorite retail therapy joints. We usually always stroll this area when in town..\nWe like to get a bite at shutters in the area ..or walk the pier or some to farmers market.\nShow less"], ["Reviewed December 17, 2017", 4.0, "Shops shopss and more shops", "If you are looking to spend some money thennthis migt be that place. Has almost every brand known. Look its got everything you need when shopping. So if you love to shop till you drop then you need to see THIS"], ["Reviewed December 15, 2017", 4.0, "Great little shopping spot!", "Spent the afternoon here. Good mix of shops for all and also lots of eating places. Short walk and you can be down at Santa Monica Pier Fun afternoon!"], ["Reviewed December 14, 2017", 4.0, "Plenty of variety for food and specialty stores", "After an easy 5 minute walk from Santa Monica beach, took a walk through the promenade. Plenty of specialty stores that would suit all tastes. Plenty of eateries, juice shops and espresso bars to fill you up. The odd busker and a sprinking of homeless add to the atmosphere.\nPlenty if Xmas idea's in one compact area.\nRecommend.\nShow less"], ["Reviewed December 12, 2017", 3.0, "Not that special!", "We walked the promenade after dinner a few weeks before Christmas. The decorations and lights were nice. Other than that, it's the same old stores. I thought there would be more musicians and street entertainment but there wasn't. I wouldn't make a special effort to go unless you want to shop the same old stores.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Shoppers heaven", "If you'd rather shop than swim then the Third Street Promenade has you covered. There's a Nordstrom, a Bloomingdales, Lorna Jane and so much more to keep you occupied."], ["Reviewed December 11, 2017", 5.0, "This place TOTALLY ROCKS", "Parking isn’t a problem if you snag a spot in the garage (super affordable!)\n\nThe street performers were absolutely incredible and the statues and vibe was exactly what LA is all about. Hit neat, classic shops and grab a bite to eat from tons of restaurant options. I always make this a stop when I’m in town!\nShow less"], ["Reviewed December 9, 2017", 4.0, "Lovely shopping strip", "Over the years 3rd street has just got better and better. With high end shops, relaxed and safe feel, this area is one of the better LA shopping strips. Very clean, little bit of art and American architecture.\n\nI particularly like the American sports bars and eating options in the area.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Superb causal stroll", "Had a laid back feel to the place with medium to high end range stores. Best since it has a pedestrian walk compared to Abbot Kinney stretch, which are along streets and more unique but higher priced shops."], ["Reviewed December 9, 2017", 5.0, "The best outdoor mall", "This is by far the best outdoor mall that I’ve been to. Something for every budget and it’s even possible to sit and people watch if you’re not spending. A great way to spend the evening and just a few blocks from the Santa Monica pier! I’m not a big shopper but this was pure heaven!\nShow less"], ["Reviewed December 8, 2017", 4.0, "crowded, but festive", "It is crowded, full of tourist traps in terms of food, but also nice shops and street vendors, which add a festive touch. A lot of benches and seating areas (in the sun/in the shade), so it is good for people watching. Also, good for walking in the evenings, being more crowded it feels safer than the otherwise empty streets around.\nShow less"], ["Reviewed December 7, 2017", 4.0, "Decorated for the Holidays", "Pretty good shopping, people watching, and restaurants here. It's really nice when it's all decorated for the holidays."], ["Reviewed November 30, 2017", 5.0, "Mrs Maria Ann Laver Gordon", "Super shops lively street entertainment would definitely recommend. So much to do there was my Birthday 21-11-17 did Mussel beach Venice ended up Santa Monica and Cheesecake Factory. Then shopping lots bargains! Walk along the Santa Monica too! Fun a must to do list."], ["Reviewed November 29, 2017", 4.0, "Nice for strolling", "Stroll along and pop in and out of the many retail shops there are along the way. Plenty of eateries to choose from. There are usually street performers to watch and enjoy."], ["Reviewed November 29, 2017", 5.0, "Very lively area with lots of shops.", "This place can be very crowded at times but it's a nice place for shopping and eating. There are lots of street performers, and homeless people around asking for money but most of them won't bother you."], ["Reviewed November 28, 2017", 4.0, "Great dining and shopping area in Santa Monica", "Parking at this area is expensive. If you go on a week day park at the pier which is only $7 whole day if you will visit both the pier and the Promenade. There are lots of good restaurants and this area on the Third is closed to traffic. Shops mostly closed at 9 pm, so in the winter time where sun sets before 5 pm after watching the sunset at the pier you have plenty of time for shopping and dining at the Promenade!\nShow less"], ["Reviewed November 27, 2017", 4.0, "Nice walk", "It is a street where you will enjoy a nice walk. You can find plenty of people singing in the street, or any other type of artists. Also, there are a lot of shops and it's near the beach."], ["Reviewed November 26, 2017", 5.0, "Most European part of the West Coast?", "First, Third Street Promenade is just a stretch of road with shops and most of the shops are not that exceptional. However, it is pedestrians-only which is largely unheard of in the USA; it has great people watching, great musicians and performers, good restaurants, and -yes- shops. And it connects to a beautiful open-air mall, Santa Monica Place. My favorites are a particularly good Barnes and Nobles, Puzzle Zoo (a game and toy store), and the REI (on 4th St).\nShow less"], ["Reviewed November 26, 2017", 4.0, "Great shops and food spots", "This was a cute little find, dotted with loads of shops and food spots galore. Nice to be able to stroll down (and back and forth) without having to worry about cars. A few bars and places to watch sport too, so something for everyone and it’s just a short walk from the pier and main beach.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Very nice shopping/dining area", "Area was really cool and a pleasant surprise. Few blocks of no cars with quarantined dining and shopping. Excellent area. Very nice food options. Solid retail options. Good street performers. Felt safe at all times. Visited multiple times during our stay. Santa Monica did a nice job here - other cities should follow suit.\n\nWould definitely revisit.\nShow less"], ["Reviewed November 25, 2017", 3.0, "Nice setting for an outdoor mall", "The stores are nothing special, typical midrange mall stores and chains. But its clean and nicely decorated. Good for a stroll. The Apple store is one of the largest i have ever seen!"], ["Reviewed November 21, 2017", 5.0, "Amazing!!!!!!", "Every time I walk again on third street promenade I feel happy. There are so many things happening here, it is amazing :) Just fabulous ... The shops, the restaurants, everything is just amazing... for me anyway... You cannot go wrong with this place"], ["Reviewed November 21, 2017", 5.0, "Tons of shopping", "After going to the Pier and to Venice Beach we walked to this area and was surprised with all the things to do and see! If you are in Santa Monica you must check out this area, such a cute area with great restaurants and shopping. Loved this area!!!\nShow less"], ["Reviewed November 20, 2017", 4.0, "Very Californian ATMOSPHERE", "Loved walking around here, so much to take in, however, hard to manage during the heat of the day, closer to twilight is much more interesting and definitely more comfortable. Restaurants, shops, stalls, street performers & loads of colourful people"], ["Reviewed November 20, 2017", 5.0, "Hipster Heaven", "Lights, street music, shops, people watching, and great food - all in one spot. Not the nostalgic place of mom and pop stores - now it's more mall, less quirky. But the outdoor vibe can't be beat."], ["Reviewed November 18, 2017", 5.0, "Great place to shop, eat and meander.", "An enjoyable open air shopping experience. Great variety of shops, cafes and restaurants to visit during the day and evening. It was always thriving with life and entertainment. One night people took to the streets for a salsa dance party. So much fun!!"], ["Reviewed November 18, 2017", 4.0, "Friday night walk on the prominade", "My wife and I recently visited the Prominade with friends. This is a nice little shopping area near the pier in Santa Monica. The shops are nice and the area is very well kept. There are numerous places to eat as well. We enjoyed our visit and had dinner at one of the restaurants on the Prominade.\nShow less"], ["Reviewed November 18, 2017", 3.0, "Corporate American Promenade", "Nice shops that you would find in most any upscale mall anywhere in America. Great for people watching and lots of places to shop, just not a lot of unique or local things to see."], ["Reviewed November 15, 2017", 4.0, "Shopping", "I remember coming here as a child to wonderful street performers and a bustling promenade. Things have changed greatly. Many stores with few performers. Restaurants mingled among the stores. Unless you are there for shopping or dinner it wasn't an evening out. May go back tomorrow for that specially. We did stop and get dessert at Carlos Bakery that just opened and the cannoli was fantastic!\nShow less"], ["Reviewed November 15, 2017", 4.0, "Crowded but fun!", "I live several blocks from the Promenade, and go there regularly.\nGreat for people watching w/ lots of street performers. A variety of restaurants, from casual to nice sit-downs. PLENTY of places to have a drink. Movie theaters as well.\nNo cars or bicycles allowed, so safe for kids, who do have fun running around.\nA word of caution for tourists: you cannot smoke on the Promenade, or anywhere in Santa Monica within 20 feet of a door or window. No smoking in outdoor restaurants, either. You can get a hefty fine from police patrolling on bicycles.\nShow less"], ["Reviewed November 13, 2017", 5.0, "If You're Looking For An All Around Experience or Family/Date Night", "3rd Street Promenade has VARIETY. There are numerous stores, restaurants, vendors, and lots of foot traffic. Everything from live music to yoga class to salsa dancing. Depending on the season, you will see different street performers doing/singing different tunes.\n\nThe most festive times to come here are during the end of the year (holidays) or the summer (beach crowd).\n\nTraveler Tip: There are a lot of people here so just if you are looking to avoid the crowds, I'd head elsewhere. I prefer a more relaxing environment on the day to day, but when I go out with friends or for a date I like lively music and energy. For those nights, Third Street is a great place to be.\n\nOverview: I'd recommend this place to a friend for shopping, food, a date, or family night.\n\nI'm a fellow traveler so I appreciate when other people have given me tips/recommendations while in a new city. If this information is helpful, please let me know by hitting the like button. Even if this review helps only one traveler then it's worth it to know I'm contributing towards making someone's experience better, giving to the global community, and paying it forward. Safe Travels!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Beautiful Walk, Great Shopping Options", "I LOVE the Third Street Promenade!! It's obviously a very touristy destination, but I still love to come here even though I live here, because it's such a beautiful pedestrian street to walk along and has pretty much every shop that you could imagine.\n\nAt the end of the Promenade is the Santa Monica Place shopping mall, with a lot of high-end shops. The Promenade itself has a nice mixture of shops, from the higher-end to the more affordable. If I need something, I can almost always find it somewhere along the Promenade.\n\nIt's also a very beautiful and relaxing street to walk along. You feel very safe since it's pedestrian only. Also, there's always street performers and very talented musicians performing throughout the Promenade, giving a very relaxing and chill vibe.\n\nI love the Third Street Promenade for both the experience and the shopping options! Great for people watching. I come here regularly!\nShow less"], ["Reviewed November 11, 2017", 4.0, "Great people watching", "I lived 7 blocks from the Promenade for years. Huge selection of eateries, great shopping, and the best people watching ... including the street performers!"], ["Reviewed November 10, 2017", 5.0, "Holiday shopping on the promenade", "Fabulous selection of shops and eateries along this strip. There is a wide range of prices to suit everyone’s budget and taste. Friday nights are fun with buskers, music and a general air of activity. Make Sloane’s icecrem a priority as this is delicious. The service is terrific.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Walks down 3rd St., Promenade Bliss!", "Really lovely to stroll third street promenade and the beautiful weather in Southern California looking at all the shops enjoying all the restaurants -really enjoyable family day out -nice to take the pooch too! dogs are always welcome :)"], ["Reviewed November 9, 2017", 3.0, "Nothing Special but some nice artwork and common shops", "Not sure why this is so special....they closed a road and put on some benches, etc. The walk was nice and some of the shops and restaurants seemed interesting and nice. There was some neat artwork, but again, I would not go out of my way to visit this location, but it was nice.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Great to walk and shop", "It is a place like other cities have, a peatonal street where they have plenty of stores shows and you can spend five hours walking around and shopping."], ["Reviewed November 8, 2017", 5.0, "Shops & bistros, just three blocks from the beach & Santa Monica Pier", "With its several blocks of Third Street closed off to traffic, this pedestrian shopping area is always lively and fun to check out on a visit to Santa Monica. The street features numerous shops, restaurants and a movie theatre, and it's always filled with street cart vendors and various street performers.\n\nOn one end it abuts a high-end, multi-level shopping mall that just opened a few years ago and includes expensive shops and eateries as well as a couple of large chain retailers. But the outdoor Promenade has something for everyone, and the people-watching is always great.\n\nJust a short walk from Santa Monica Pier's attractions and the beautiful municipal beach, this area is also now accessible via the new light rail system, with the Metro's Expo line terminating just a stone's throw from Third Street Promenade.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Shop and Eat", "A great place to go on a weekend , take your family or a date to spend the day. It is for pedestrians only . Plenty of shopping stores catered to all budgets, lots of restaurant options as well as coffee and ice cream stores."], ["Reviewed November 5, 2017", 3.0, "Stroll or sit & people watch", "Have been here a couple of times with family from the area. Nothing special as far as shopping but lots of places to look and you may find something. I always enjoy the people watching too especially the tourists. Nice for a walk on a pleasant weather day. As others say, a change from indoor malls which aren't doing so well lately either. No choice of Family visit other than 'young children' or 'teens' - we are adult female relatives who vacation together throughout the year.\nShow less"], ["Reviewed November 3, 2017", 4.0, "Lots of places", "No shortage of places to shop and eat in the area. I think there's something for everyone here. I liked walking up and down the street in the morning."], ["Reviewed November 3, 2017", 4.0, "Great choice of restaurants", "It was very convenient to be able to walk to a place with lots of restaurant choices in the Los Angeles area, and leave the automobile behind."], ["Reviewed November 2, 2017", 5.0, "Main street..", "Street singers, players, beggars... All colors and smell you can find.. not so long, closed for car traffic.. Good to walk around while waiting amazing sunset at pasific coast.. Apple store is on this street)))"], ["Reviewed November 1, 2017", 4.0, "Vacation", "Third Street Promenade has many local restaurants which we tried a couple Stefano’s pizza which was very good. Shopping is plentiful but is the same stores you get at almost every shopping mall in the country not a lot of local as far as shopping goes. Street performances like singers and dancers were fun. I was surprised you didn’t see street artists though.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Shop and eat", "Its pretty nice. It always have street singers and offer diferent kinds of food and stores. It is close to the pier so you can do both in half a day. *Saturdays you can find a street organic market!"], ["Reviewed October 31, 2017", 5.0, "Very good shopping area", "The 3rd street it an excellent shopping/eating/drinking area to visit whilst on vacation. The shops are of good standard selling some nice things, most of which you could probably get back home (And cheaper)"], ["Reviewed October 30, 2017", 3.0, "Great date night...", "Movie theatre, great restaurants, lots of shops, and great place to stroll holding hands. Very safe and clean. Something for everyone. Try some of the local fare. Ice cream is the bomb."], ["Reviewed October 30, 2017", 5.0, "Nice shops, not too crowded", "Nice little walk, car free zones.\nThere are lots of shops, mainly international brands like Victoria secret, footlocker, etc.\nThere was also a farmers market on Saturday.\nI really enjoyed being able to shop outside instead of being in a freezing cold mall (coming from Europe, I’m not used to the American air conditioning).\nShow less"], ["Reviewed October 29, 2017", 5.0, "Great for shopping!!", "I would usually shop in the Citadel Outlets or in the Grove however, after I visited the 3rd street promenade, I am sure this will continue to be my #1 choice for shopping! There is everything from high end designer brands to local to more affordable brands such as Old Navy, H&M, Uniqlo, etc.\n\nSeems kinda limited at first but as you walk around, there are a ton of shops to visit. There were restaurants too but didnt get to enjoy any due to time limitations.\n\nI recommend this place for shoppers definitely! You can also visit the Santa Monica Pier as it is walking distance from all the shopping :)\nShow less"], ["Reviewed October 28, 2017", 4.0, "Always fun", "Been here several times. Fun shopping experience, good restaurants too. Saturday evenings are always interesting with street performers and musicians - does get crowded though. So far, have always managed to get parking in the area, lots of parking lots."], ["Reviewed October 28, 2017", 3.0, "Great shopping choices", "A great way to shop without being stuck inside those giant monolithic westfield like centres. Easy to walk the shopping strip and a pleasant thing to do on a sunny day. There are a variety of food/drink options but a definite negative is a lack of free restrooms. Many restaurants have signs up saying restrooms are only for guests so this must be a well known problem.\n\nVery close to Santa Monica Pier and very easy to access a cab or Uber. I would rate this location higher if they improved the restroom availability.\nShow less"], ["Reviewed October 28, 2017", 3.0, "Noisy and no good food", "Place is rather boring. It lacks good restaurants. Shopping seems to cater to teenagers. Too many noisy street entertainers playing over each other. Lots of homeless people. It lacks good bars or other entertainment. Maybe a good brewpub would help. On the plus side parking is ample and quick walk to beach.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Love this Street", "Pedestrian street full of an array of shoes and amazing restaurants. Shops range from chain stores to surf shops. Every different food you can imagine. There’s usually people playing music all along the street."], ["Reviewed October 27, 2017", 5.0, "Amazing", "The atmosphere at the Third Street Promenade is out of this world. It has a great mix of street performers, shops and restaurants."], ["Reviewed October 27, 2017", 4.0, "Very Nice !", "Lovely pedestrianised shopping area stretched over 4 blocks. Relaxed, with a very nice mix of shops and eateries in a great location. An enjoyable place to lose yourself in for a couple of hours !"], ["Reviewed October 27, 2017", 4.0, "Great shopping but a lot of homesless", "Walking down this street felt a lot safer than other parts of Santa Monica. I did not like Santa Monica in general as it felt dirty and unsafe. There were a lot of homeless and we saw a drug affected person nearly get hit by a bus, yet it seemed normal behaviour as people did not react when he did it. This street was clean and had a lot of people, mostly tourists. A lot of shops, all the big ones. There were some good street artists playing music and the food options were good also.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Visit toward the evening - people, music and the stores are fun to see", "A great evening adventure for some free music, people watching and great shopping. A great relaxing spot."], ["Reviewed October 27, 2017", 4.0, "Mall just behind the Pier", "Third St Promenade is a large pedestrian mall right behind Santa Monica beach & Pier. It’s got everything you could want in terms of restaurants, clothing stores and entertainment but a mall is a mall is a mall and it is really not that different to others of it’s kind apart from the fact it’s in a great location not far from the Pier. There is a shopping centre, Santa Monica Place nearby as well which is worth a look. If you like malls, you will like Third Street Promenade a lot. And it’s a great place to get a coffee and some lunch after a walk out to the Pier & along Ocean Front Walk.\nShow less"], ["Reviewed October 27, 2017", 4.0, "Chilled", "Nice and relaxing. Lots of variety for food and shopping. Easy to get there with the hop on hop off tours."], ["Reviewed October 26, 2017", 4.0, "Browsing and walking", "This is an outdoor shopping mall filled with stores and entertainers playing for tips. It's a good place to walk and watch people, but watch your purse also."], ["Reviewed October 25, 2017", 5.0, "a circus", "this is a circus. hang onto your wallet because there is a lot of homeless and a lot of crime. the entertainment is good the people watching is good. get good walking shoes. it is a place for men because it may scare a woman. none the less there are a lot of shoppes for home made goods\nShow less"], ["Reviewed October 25, 2017", 5.0, "A lovely street to browse on", "There are many high end shops on this street Apple, Superdry and Diesel to name a few there are also several street stalls too you can certainly pass many an hour on this street"], ["Reviewed October 24, 2017", 4.0, "Great place to shop!", "This is a great place to spend a few hours. There are lots of shops and it’s only a few blocks away from the beach. I definitely recommend checking this out if you’re in the area."], ["Reviewed October 24, 2017", 3.0, "Full of the same shops as everywhere else", "Disappointed to find it full of the same brands of stores as everywhere else. I remember it having query local shops but now dominated by the boring chain stores."], ["Reviewed October 24, 2017", 5.0, "Great shopping area!", "Lots of stores in walking distance. Nice spacious walkways. Much nicer than an indoor mall. Enjoyable shopping area."], ["Reviewed October 23, 2017", 5.0, "Very nice street", "By accident we got to this street. There are a lot of activities in this street such as music, dance, shows, and much more."], ["Reviewed October 23, 2017", 5.0, "Something for everyone", "It's my favourite in the States - not so focussed on brands as say Fifth Avenue or Michigan Avenue but a wonderful range of diverse stores, cafes, buskers , even a Farmers Market. It just seems more personal and friendly than other cities."], ["Reviewed October 22, 2017", 5.0, "All types of dining, shopping & entertainment", "This is a pedestrian ONLY street located ONLY a few streets behind the Santa Monica Pier with all types of dining restaurants, street vendors (food & merchandise), shopping (both unique and major chains) & live on-street and inside entertainment locations"], ["Reviewed October 22, 2017", 4.0, "Fabulous, spicy and flavorful polla asado street tacos", "Great, authentic street tacos with deliciously flavorful pollo asado. The corn tortillas must have been hand made. They were delicate, flavorful, and perfect! A squeeze of lime and sprigs of cilantro....fresh, spicy perfection!"], ["Reviewed October 21, 2017", 5.0, "If You Cannot Find Something To Enjoy Here, Don't Go Elsewhere", "Shopping? Got it covered. Farmers Market opportunities? The best around. Want to eat something different? You will definately find it here. What is new? Carlo's Bakery is coming soon and it is right next door to Starbucks. Want to get a few new items of clothing? Head for the mall. Need to impress guests? Cannot see it all in one day. Look for the free map offered to visitors and you will have no problems navigating the entire city.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Wonderful shopping", "3rd street promenade has it all. Bloomingdales, Burberry, and many other luxury and budget-minded stores. Cashmere overdose! Great place to shop."], ["Reviewed October 21, 2017", 4.0, "Good place to go", "What a nice place to visit for hanging out or shopping. It has a wide variety of clothing and home decor shops. Nice mixture of restaurants. A few of the Street Performers were a bit aggressive when asking (almost demanding) tips. Good place to go with the family. Ample parking is available at reasonable rates.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Amazing spot", "Really nice area to walk around and dine out! Really good choices. We stayed at Fairmont and it was only 3 min away. Santa Monica place is also superb shopping mall."], ["Reviewed October 20, 2017", 5.0, "Great atmosphere", "Was fun to shop here! Great atmosphere and good restaurants. All the shops you come to the US to visit"], ["Reviewed October 18, 2017", 5.0, "Great shops", "Great selection of shops, clean area, nice layout. Nice modern area that’s a must visit if in Santa Monica."], ["Reviewed October 17, 2017", 4.0, "A good after dinner stroll", "We didn't come to shop, just to walk around at night for a bit to get out and about. It seems to be a typical pedestrian street. Lots of brand name shops, street musicians and places to eat. There was free city parking for 90 minutes, so we had nothing to lose. Three blocks long, it's a good stroll for people-watching and enjoying some of the evening.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Safe, Varied and Enjoyable Stroll", "Not being a shopper an open air “Mall” type environment is not top of my list of things to do.\n\nHowever, this is a nice place to stroll and watch the world go by with plenty of seating and plenty of chain and independent shops to browse if that is your thing.\n\nIt goes on for ever too.\n\nWell lit, plenty of food concessions and proper restaurants and an enjoyable evening of people watching.\n\nMust visit as it is the hub of Santa Monica on an evening especially. Some homeless and mental health problems in evidence but also some buskers - with a Russian lady quite the worst singer I have ever heard - funny and ironic in equal measure but she seemed to be enjoying herself.\n\nWould recommend an evening stroll.\nShow less"], ["Reviewed October 16, 2017", 3.0, "Overpriced", "Many street performers looking for handouts or sitting on the available benches. Everything is overpriced."], ["Reviewed October 16, 2017", 4.0, "Enjoying SoCal EveryDay of the Year! Walking Streets are making the experience even Better-", "it's kind of a shame, that here in some of the most beautiful weather and most beautiful people watching, we don't have more Walking streets- so when you get a chance to do this Santa Monica Highlight- it's a good Idea, and for Lunch or Dinner, even better- Very Nice and Casual Restaurants & Bars- Boutiques, Stores and Movie theaters round out the retail landscape- the Fun is on the street - with performers and creative happenings\nShow less"], ["Reviewed October 16, 2017", 5.0, "Shop ‘til you drop!", "Most of the best brands, urban outfitters,free people,adidas,Nike,lululemon,H&M, nice to walk and plenty of cafes and restaurants."], ["Reviewed October 16, 2017", 5.0, "High density shopping", "By far our favorite area in Los Angeles to shop. Not just the promenade, but the whole area. Good stores. Lots of them. Good food."], ["Reviewed October 16, 2017", 5.0, "What a great place", "I remember discovering this place after spending a while on the pier. As I walked back into town, I discovered this pedestrianised road starting on the left and really loved it.\n\nLots of shops and places to eat and you can even sit down on the benches that line the road, which were not dangerous to sit around late afternoon as one would think.\n\nIt has almost an European feel - great place.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Hectic Experience", "We accompanied our daughter living in LA on a shopping expedition to Santa Monica and in doing so went in shops that us \"old folks\" normally wouldnt. Being an outside mall really gives the place a real \"feel\" .... and we do like the fact that there are lots of restaurants interspaced within the shops.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Santa Monica walking street", "This street is perfect for dining and shopping, the had a good sale going on in october and everything was like outlets prices, we spend a great afternoon there with 2 kids."], ["Reviewed October 12, 2017", 5.0, "Such a great place to hang out", "This area always has great, free, live entertainment to go with the excellent array of shops. Outdoor shopping areas are perfect in this climate which is great all year round.\n\nThere is a an excellent balance between the established global shops and the local treasure spots to keep all interested.\n\nHighly recommended!\nShow less"], ["Reviewed October 12, 2017", 3.0, "Great shops", "We were headed to the beach and saw these shops and decided to take a walk down them. It was great exploring the cafes bars and high street stores. There is also a mall with designer shops inside so definitely something for everyone. Worth checking out if you're in the area and need some new threads.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Too Many Options!", "This is a cool, outdoor walking mall with a lot of unique shops and great food options! It’s a place to go for food after leaving the pier!"], ["Reviewed October 11, 2017", 4.0, "Fun scene", "There is always something going on on the promenade - early morning to late at night. Plenty of different restaurants and bars and shopping. One thing that bothered us about Santa Monica was the number of homeless. Every where you looked you saw them and were even asked for money. We saw police giving parking tickets but ignoring the homeless. I felt bad. But basically the promenade is a great fun place to go.\nShow less"], ["Reviewed October 11, 2017", 4.0, "A Great Time!", "I strolled along the 3rd Street Promenade 2 times during my trip to LA. It was such a fun and relaxing experience. The street performers were wonderful and my favorite time was in the evenings, after the sun went down. Always something to see and great places to drop in and shop or eat!\nShow less"], ["Reviewed October 11, 2017", 4.0, "Good shopping", "A very nice and clean street. Many good stores. Noisy due to music and singing on the street. Best place to shop"], ["Reviewed October 11, 2017", 5.0, "Best Outdoor Mall in SoCal", "Third street promenade is one of the most beautiful shopping centers in California. You are steps from the ocean, and there are dozens of shops for everyone’s tastes. It’s great for people of all ages because of the variety of shops and restaurants. Just don’t go when it’s raining or extremely hot outside.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Sketchy at night", "Walking around after dinner around 8pm looking to get some steps in and it was cut short by way to many homeless / drugged out people. Went back to hotel earlier than I wanted. Just didn’t feel safe"], ["Reviewed October 10, 2017", 5.0, "Shopping Haven", "This is the place to do all your shopping at, a lively street and full of amazing shops, nice cafes and restaurants too, you gotta wait till street performers are there, they add a lot to the general atmosphere of the place, must visit..."], ["Reviewed October 10, 2017", 5.0, "Great shopping and restaurants", "This is a pedestrianized street full of high street fashion and some luxury designer brands. There are cool bars and restaurants off 3rd Street that are good for brunch or dinner."], ["Reviewed October 4, 2017", 5.0, "Worth spending a couple hours", "Although it’s a bit of a tourist trap and meant to part wealthy travellers from their money, there’s a wide selection of shops to see and restaurants to visit. Also a good place to grab a coffee or a pint."], ["Reviewed October 3, 2017", 5.0, "Pedestrian Precinct with good shops and restaurants", "Useful shops and inexpensive restaurants. Many shops that you would find in the UK. Pleasant to stroll there in the evenings and watch the buskers."], ["Reviewed October 2, 2017", 4.0, "walk the out door mall..enjoy the fabulous california weather", "only 2 blocks from Palisades Park over looking Santa Monica bay lots of shops from major retailers like Banana Republic, Anthropologie,Old navy to small independents. Sur le Table beautiful kitchen store. Apple store good food perfect people watching outside performers..singers, guitar players, classical to country"], ["Reviewed October 2, 2017", 5.0, "Perfect relaxation station. Close to all events & accommodations.", "Perfect location by ocean for great shopping, great eateries & just relaxing. My daughter & 6 year old granddaughter had a great time shopping all the varieties of stores. This is our 4th summer trip to the area and will return in 2018."], ["Reviewed October 2, 2017", 4.0, "Great place for hang out!", "I go to this place at least once a moth with my little nephew, I found this place very neat to visit and a lot to offers and family oriented environment ."], ["Reviewed October 2, 2017", 4.0, "Great Stroll", "Created about the same time cities across the country were turning at least one downtown street into a pedestrian mall, this one has flourished while others have withered and died. There are many reasons for the success of the Promenade: Santa Monica's pleasant year round temperature, lack of rainfall, plentiful parking nearby and a demographic that attracts and holds major stores. The mall is attractively landscaped and makes an pleasant venue for street performers. Stores include a big Nordstrom's and a huge Apple store as well as most major clothing stores. Along the way there are smaller stores, attractive restaurants and some seasonal pop-ups. I live around the corner now, so the promenade is a great convenience, but even when I lived miles away, it was worth the drive to get to this 5-block long place to walk, shop, eat and watch people.\nShow less"], ["Reviewed October 2, 2017", 4.0, "tourists are delighted, but not sure why", "Mostly chain stores, but a variety of restaurants. Early evening is a great time to stroll, especially if you want to watch the many street entertainers."], ["Reviewed October 2, 2017", 5.0, "Tons of stores and a bunch of street performers.", "No shortage of shopping choices here that's for sure plus some very talented street performers! Lot's of eating choices too."], ["Reviewed October 2, 2017", 3.0, "Ok, nothing special.", "If you have visited any other outdoor mall then this one is nothing special. It has average shops and is about three blocks long. You can not see the ocean from this area."], ["Reviewed October 2, 2017", 4.0, "Great Shopping and People Watching", "This is a fun place to go in order to feel like you're in the middle of it all. There are lots of restaurants and shops to stop in. If you'd rather sit on a bench and take everything in, you can do that too!"], ["Reviewed September 30, 2017", 4.0, "Great Shopping", "The Third Street Promenade in Santa Monica is a wonderful place to find excellent shops and good restaurants. We had a great time exploring all the shops, listening to the live music and eating good food."], ["Reviewed September 30, 2017", 4.0, "Shopping area of luxury brands", "This is really a shopping for all. If you are a branded wear person, this should be the area. Some shops has discounts at certain time it's really cheaper than other places. Look out for the offers."], ["Reviewed September 29, 2017", 4.0, "Another shopping mall", "Yes, it is nice and yes it is clean. The shops here are the same shops you will find in pretty much every shopping centre in the US. The difference? It is an outdoor mall that spans around 4 blocks. It is pleasant to walk and shop and there are a couple of really nice restaurants. I would recommend visiting and shopping at around dinner time. That's when there is real atmosphere here with street performers and some great people-watching.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Beautiful street with high quality buskers", "This is our 3rd visit to santa monica and the promenade is always a favorite. Very good shopping, restaurants to cater for all with high quality buskers as you dine. Great location with the pier and beach so close. Always clean and tidy."], ["Reviewed September 28, 2017", 3.0, "Average", "This is just like any overpriced mall in my opinion. We actually had a bad experience - our bike was stolen (and it was locked!). Nothing was done and security wouldn't even check their cameras without a police report. The police wouldn't both to come out.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Fabulous shopping in a beautiful environment", "If you have teenagers, the third street promenade is a must! Great stores, restaurants and people watching. near the beach, close to everything - highly recommend!"], ["Reviewed September 26, 2017", 5.0, "Trendy!", "Great place to walk through. Lots of restaurants and eateries but make sure you don't leave dinner till too late as it gets very busy. Definitely recommend seeing this place."], ["Reviewed September 26, 2017", 3.0, "Third Street, Just like the Mall", "If you're staying in Santa Monica avoid the tourist push on Ocean Avenue and walk one or two blocks North to reach the Third St. Promenade without being hassled. If you can try to coordinate your visit to 3rd St during a Saturday when the farmer's market is open and you can get two bits of shopping done in one day. Then consider hitting the bigger stores on your way back.\nShow less"], ["Reviewed September 25, 2017", 3.0, "Overpriced shopping in santa Monica", "We walked along this Promenade to check out the shops and restaurants and it was nice to view but at the end of a 2 week tour not much left to spend. Still a nice place to walk around and Browse"], ["Reviewed September 24, 2017", 4.0, "Great shopping in Santa Monica, CA", "If you want to shop, eat, and have some good drinks, this is the place for you while in Los Angeles, CA area. Near Santa Monica pier and very lively and busy at night."], ["Reviewed September 24, 2017", 5.0, "amaizing fun people watching, shopping , safe", "This is a LA gem. Great location, super safe and fun to walk, explore and people watch. Short walk to the Santa monica pier"], ["Reviewed September 21, 2017", 5.0, "great place for restaurants", "great for people watching and eating lunch or dinner. shopping is good -- mostly chain stores, not too many locally owned businesses that we saw."], ["Reviewed September 20, 2017", 3.0, "This is basically an outdoor mall", "The promenade was a nice place to walk around and be outside taking a break from a meeting nearby. Well maintained and lots of shops. However, it is a mall by another name so if you don't like malls, you wont like it. If you do, then go. I enjoyed being outside, but wouldn't travel to visit this.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Lots of different shops,nice and clean", "Well worth a visit. Lots of high street shops and eateries. The street is well kept,clean and tidy so even if you don't want to shop still good to walk along as we did."], ["Reviewed September 19, 2017", 3.0, "A Nice Stroll!", "A pleasant place to meander through, or mission shop at any of the common merchants along the strip. This is just another shopping mall, albeit outside, with the same old retailers as any other mall."], ["Reviewed September 19, 2017", 5.0, "Yes, go here!", "OK spend an hour or two walking this, especially if you are from out of town. shops places to eat, street performers, no cars. Great ice cream places and healthy eating. Bathroom at the starbucks and some shops. good for kids too."], ["Reviewed September 19, 2017", 5.0, "Great shops", "Shops here a little cheaper and lots of choice great atmosphere and some good Restaurants and bars also good in the evening great place worth a visit night and day time"], ["Reviewed September 19, 2017", 3.0, "lack of restaurants", "It's a street without car traffic which is nice. Some \"artists\" are entertaining the poeple walking by. There are many shops for clothes etc. but almost no restaurants. So, when we wanted to find a restaurant in the evening we had no success, there are mainly cafes.\nShow less"]]}}