{"Torrey Pines State Natural Reserve": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Torrey Pines State Natural Reserve", "url": "/Attraction_Review-g60750-d208324-Reviews-Torrey_Pines_State_Natural_Reserve-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/fb/fb/9b/torrey-pines.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "3254"}, "address": {"@type": "PostalAddress", "streetAddress": "12600 N Torrey Pines Rd", "addressLocality": "", "addressRegion": "California", "postalCode": "92037", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 5.0, "Amazing views", "We parked in the parking lot off the 101 for $15. We then walked up the road, eventually making it to the lodge. We then proceeded to razor's point, yucca view point, down to the beach and then walked the beach back to the parking lot. My iPhone said we walked 4.1 miles and 10,000 steps. Great walk/hike, amazing views, very picturesque.\nShow less"], ["Reviewed 4 days ago", 5.0, "One of top places to hike!!!", "The wife and I have been going to the San Diego area for the 8 of the last 10 years and we always make this one of our entire day stops!!!! The views, the plants, the hike to the beach is amazing, plus it’s a great workout!!!! We both so sad when the day comes to an end, but it gets us excited for our next visit. We meant so many nice people from all over the world which also adds to the learning.\nShow less"], ["Reviewed 6 days ago", 5.0, "Very beautiful hike down to bottom where you reach the Ocean!", "This place is so beautiful and fun. We hiked down to the bottom, walking down slightly steep steps to get to the ocean. The hike probably took 45 minutes one way. It is very pretty as you see the sites around you of the water, flowers. I will be going back again.\nShow less"], ["Reviewed 6 days ago", 5.0, "A great hike", "Amazing views and hike! If you're an active group it's well worth a visit one morning. Remember good walking shoes."], ["Reviewed 1 week ago", 5.0, "Excellent hiking", "After spending a half day subjected to air travel and all that comes with it, I was thankful to have the option to pay for parking rather than hike up the steep road, even if the cost of parking was a bit steep. Gorgeous views. The people watching was also great.\nShow less"], ["Reviewed 1 week ago", 5.0, "beautiful gentle walk", "If you are looking for a beautiful view of the coast take this walk. It can be done by almost anyone if you pay the entry fee and don't walk up the step hill."], ["Reviewed 1 week ago", 4.0, "Excellent beach views", "Decent place to kill a few hours. The hikes are not very intense, some good uphill walks but nothing major. Great views of cliffs and the pacific. There were quite a few people in the park, especially for a Friday morning. Fee at the gate ranges from $10- $20 depending on the season, mid Feb was $15. You can either park at the bottom and walk up, park halfway up or park at the top. Majority of the trails are towards the top.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great scenic hiking", "I was dropped off at the entrance and proceeded to walk to the hiking trails away from the ocean though you could go straight to the beach or run along a trail parallel to the beach but with a paved surface.There appear to be many trails or paths to choose from but I just enjoy the trail that begins after walking on the road for a while and winds up a near an information spot. There may be some to answer questions on the weekends or you can study the sign showing the trail paths and where they lead. I found the one to take you to the beach. It is a winding trail with lots of nice views of the ocean and cliffs. The path is pretty well maintained but you do need to be careful since the footing varies. I made it the beach then took a left took the very narrow walkway around the rock and there you will find the beginning of Blacks Beach I believe. It is then a nice long walk down the beach where you will eventually see the Gliderport where you can the stairs back up the cliff. A great way to hike and enjoy the scenery for a couple of hours.\nShow less"], ["Reviewed 1 week ago", 5.0, "Spectacular views", "We arrived fairly early on a Friday morning and walked in from the golf course on the south end. We started with the Guy Fleming trail at the north and worked our way back.\nThe trails are all roped and small gravel or sand. Although we came early it was very busy with locals, tourists and school groups.\nWe took every trail and went to every overlook. We took the trail to the beach and enjoyed relaxing and having a snack and water we brought.\nRestrooms are in the parking areas, they were portable. There was a water bottle filler and hand sanitizer. There is a small visitors center and gift shop. There are no trash cans, you take it out with you. Food is only supposed to be consumed on the beach.\nWhen we were there they were working on the North Fork trail and it was closed and no beach access from there. We did enjoy the South Fork trail which was much less traveled of all the trails and had a spectacular overlook.\nWe spent about four hours and experienced sun, clouds and breeze. Recommend dressing in layers. Wonderful hiking!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful Views and Great Beach", "Very nice trails with breathtaking views. The naturalists answered questions and were very informative. The beach access hike was my favorite and the beach south of flat rock is amazing. Highly recommended this place."], ["Reviewed 2 weeks ago", 4.0, "Fantastic scenery", "Glad we took the time to hike through this park. From the lodge to the beach, it was a worthwhile experience."], ["Reviewed 2 weeks ago", 5.0, "Great beach to surf !", "Great surf spot. great beach for surf fishing, great place to take the family and take long walks on the beach. I have not been there in a long time. So things do change here but all and all you should have a good experience. Suggest not to stay late and hang-out on the side of 101. Have experieced trouble there at night only.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "BEAUTIFUL hike on the coast!", "Parking is plentiful, people move in and out of spots quickly. It is quite the hike up the hill, but you'll be so glad you did it. The view at the top is out of this world! Take a friend and hike up here and really just take it in.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great Hiking!", "So many hiking options with amazing views! The kids loved the hikes. They have many options for different abilities."], ["Reviewed 2 weeks ago", 5.0, "Short, lovely walks", "The walks here are short and easy, with gorgeous views of the rare pine trees, the azure Pacific, marshland, and dramatic cliffs. Get here early because by 11 a.m. it's crowded. 3 hours is about all you need to hike all the trails (some of the trails were closed to visitors on the day I was there). Wear sun protection.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Hikes are too short for outdoor enthusiasts", "Some terrific views, and of course it is incalcuably important that this place is saving these pine trees, but the hikes were too short for my liking."], ["Reviewed 2 weeks ago", 3.0, "Overcrowded but Beautiful scenery and beach", "Went with family and three kids.\nBeautiful views and beaches.\n\nHiking is easy and trails well set. Beach was beautiful. If you want to get down to the beach I think you need to be +/- 3 hours from low tide. Hiking down to flat rock was a great decision.\n\nOnly significant negative was the absurd amount of people. This resulted in the AVE rating. We went right at opening. On the way down still heavy traffic. On the way back up it there was an absurd amount of people. All bumping into you and with the trails heavenly roped off, there is nowhere to go.\n\n15$ to get a car in as well. Bit expensive.\n\nBottom line - this is a beautiful, well kept park that it extremely overcrowded on the weekend. Resembles the crowded aspect of a mall, not a park. Do not go on the weekend.\n\nI will return, but it will be a week day and early in the day.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very nice walking and scenery", "A hotel staff member suggested we visit the Torrey Pines State Reserve Park during our La Jolla trip. It offered pretty vistas of the sea coast and a nice work-out. Sadly, the Torrey Pine trees are dying due to the draught and insects that are eating the bark, so you must visit soon before these trees (which only grow in this area) are gone forever.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Nice Hiking with Pacific Views", "The Torrey Pines reserve is located on the Pacific Coast on the northern edge of San Diego (just south of La Jolla). Entry is free but parking is $12 on weekdays and $15 on weekends. You can park along the beach just outside the gate on the north end of the reserve for free and walk in if you can find a space. Upon entry you can drive up the long opening hill to small lots above or, if you park in the large lot at beach level or walked in, you start with a long uphill climb along the road. Once on top, the reserve has many hiking trails which start downhill toward the ocean and therefore require some effort to hike back up, but there are trails for just about every level of fitness. The trails are wide and well-marked-NO chance of getting lost, and you are afforded many views of the ocean. There is a home formerly owned by the patroness of the preserve on site and viewable, but we did not stop in (I believe there are bathrooms here.). I saw no snack bar so it seems wise to bring a bottle of water. The trails are almost completely in the sun so sunscreen or hat are also helpful.\nIf you are looking for a fine hiking experience on the north side of San Diego The Torrey Pines reserve is a good choice.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Simply Gorgeous!!!!", "I stopped and walked around part of Torrey Pines City Park. What beautiful shorelines and views of the Pacific. There were tons of people taking pictures of the beauty of the area. Lots of easy parking and just a fabulous place to take in all the ambiance of San Diego!!! All free……no monetary charges!!!!!!!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Hike", "We did a 4 mile hike . The first half mostly uphill but doable for couples in their 60's. The trail then moves downhill with spectacular views of the hills and the beach. You end on a beautiful beach under the cliffs with the final mile on the beach back to the parking area. There is done free parking along the beach, if not there is a pay lot. Bathrooms are available at the parking lot and porta potty up near top of cliff. Great views , beautiful beach the entire hike took us about 2 hours, but could be done much quicker. We took our time and strolled on the beach.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great place for a hike and to feel like you're in California", "We had a wonderful walk through the trails up a steep hill climb and then down to the beach and along it. Worth the effort!"], ["Reviewed 3 weeks ago", 5.0, "Beautiful vistas", "The biggest challenge is parking. We got there later than we wanted to and uit was already very crowded. We paid $15 entrance fee and parked half way up the hill that only allowed for about 5 cars. We took the first trail which had the best viewing spots of all the trails. The water is super clear and we could see sea lions and dolphins even from very high up. We saw many hummingbirds and a few other birds, as well as sea gulls and squirrels.\nNice hike. Even the hills weren't bad. We saw many families with small children. Port o pots at top parking lot. No eating allowed in the park? I highly recommend.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Hiking site.", "I lived in San Diego and this park is one of my fav. Nice weather all year long. Easy access to freeway. Beautiful scene everywhere . Beautiful to max"], ["Reviewed 3 weeks ago", 5.0, "A must visit - reserve enough time to enjoy the views", "Visited on a cold and misty day in January and still the views were amazing. We started from the Ranger station and did a total of 3 trails. Saw a lot of dolphins (and perhaps also a whale) - but you need to bring your binoculars, without them spotting is quite difficult. The trails are in a good shape and offer wonderful views to the coastline but also to the delicate nature in Torrey Pines.\n\nWe stayed here about 3 hours and left when it started to pour. I would definitely come here again and reserve more time and do the shoreline trails as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful!", "This was my first time hiking in Torrey Pines. We hiked Razor Point and Beach Trail. Razor Point Lookout had AMAZING views. Beach Trail leads down to the beach were we got to explore around. Beautiful.\n\nFor me, it was a really fun hike and not too strenuous it wasn't enjoyable. Perfect really! Heading back up Beach Trail has a few steps and you work up a good sweat. I am so jealous of everyone that lives in the area and gets to hike/run/walk these trails as their weekend workouts!\n\nWe got to the park around 9 am and we were glad we got their early. As we were finishing up (10:30ish) it was getting really busy. It was nice to enjoy the views with only a few runners around.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Beautiful Scenery", "The view spectacular, the history of the place amazing, and the beach uncrowded and clean. However, overall I was disappointed with the experience. We had to wait in a long line to get into the park (gotta get that $15 park entrance fee!) and then found the road to the top of the hill/mountain was closed. But as mentioned, the scenery was very beautiful and serene, even with all the other visitors around. This place is ideal for an escape from the bustle of the city without even leaving the city.\n\nParking at the entrance was plentiful when we arrived so there wasn't a wait for a place to put the car, but we had a baby with us that therefore had to be carried up that hill (and it seemed more like a mountain the more we walked). Every once in a while a flurry of cars would drive up so we eventually realized someone was controlling the road and letting cars up when others went down - probably to ensure parking was available at the top for those venturing up there. However, there was no selection process for who got to drive vs walk that I could determine. Families with very young children and geriatrics were walking along the road (no trail available) while what appeared to be healthy young adults were driving...not really complaining here - just observing...huff, puff. In 90 degree weather, no less - in JANUARY (sub-zero weather where I come from so not acclimatized for this type of hike).\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great views and ,ots of hiking trails", "This is a popular park in Torrey Pines that offers great ocena views, and a variety of hiking trails ranging from easy to strenuous. Can get quite crowded on weekends."], ["Reviewed 4 weeks ago", 5.0, "Amazing views", "There was beautiful scenery all around and hiking. Great photo ops. Very peaceful. We surely enjoyed this"], ["Reviewed 4 weeks ago", 5.0, "Scenery to die for", "Must see and hike while in San Diego. You can basically spend the whole day there. On the top and by the Pacific. Views to die for."], ["Reviewed 4 weeks ago", 1.0, "Walk to it at your peril", "We recently tried to walk to Torrey Pines state Natural reserve from Del Mar along the cliff tops\nThe cliff top walk was breathtaking although the pathway was falling into the sea.\nOn reaching N Torrey Pines Road we crossed the bridge to walk to the reserve\nNo sidewalk. We had to walk behind parked cars for 1/2 mile dodging vehicles leaving and arriving.\nThen we got to the reserve.\nNo paths just a road with cars going up the hill. Turned back !!!!\n\nCalifornia truly is a State in love with the car\nEven the Natural reserves force you to drive to be safe\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful hike, Interesting History", "This is a beautiful place to hike. The young people can start at the bottom and hike up, and the older folks can park up at the visitor's center for an easier hike. There are several different routes you can take, each leading to fabulous vistas of mountain sides, pounding surf, or even the beach. You can hike up, then down to the beach and follow the beach back to your car.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Beautiful views", "Entering by car costs $15, well worth it. The hiking trails are well marked and maintained, and the views are gorgeous. Not to be missed."], ["Reviewed 4 weeks ago", 5.0, "Gorgeous views!", "This is an easy short hike with amazing views. It's not rugged hiking at all, however. The road is paved for the most part. However there are some smaller trails that lead to some amazing lookouts. One of the major perks of this tourist attraction is that it is situated overlooking the beautiful Pacific. On the way back down you have the option of taking the trail that leads down to the beach. It's narrow at some points but your walk along the beach once you get to it is very well worth it. I took my 67 & 68 year old parents just last weekend and they absolutely loved it!\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Absolutely Gorgeous!", "This place is gorgeous! The hike to the top was tough so be sure to wear comfortable shoes and clothes. Bring water. The walk down to the beach was a little easier. The beach itself was stunning. Great views and fantastic photo opportunities."], ["Reviewed 5 weeks ago", 5.0, "Great Hike", "Great Hike over the the Torrey Pine cliffs to the beach. Secluded, clean, well marked, and great exercise"], ["Reviewed January 23, 2018", 5.0, "Beautiful grounds + Ocean = AAA+", "Beautiful sandy/rocky beaches on the Oceanside depending on the tide. Everywhere you look is picturesque! Then drive up to the hill and walk several trails to get magnificent views from above."], ["Reviewed January 22, 2018", 5.0, "Best views in San Diego", "I've been to Torrey Pines more times than I can count and it is by far my favorite place to go for a walk and catch the sunset. Biking, hiking, full days at the beach, field trips - it's just perfect all around. Free parking is somewhat limited but you can usually find a spot - unless it's a weekend afternoon, then you'll have to pay or walk a long ways. The hiking trails are not too difficult, a couple different fun loops, and there is a drinking fountain and bathrooms at the top and bottom of the hill. The cliffs are magnificent to walk along as you follow the water. Excellent views of La Jolla, the lagoon, and occasional dolphin spotting!\nShow less"], ["Reviewed January 22, 2018", 5.0, "Awesome place for hiking trails!!!!", "My wife and I drove our car to the top and then went hiking on all the trails leading to the ocean. We captured some awesome photos around 4:15pm and it was great exercise with gorgeous scenery!"], ["Reviewed January 22, 2018", 5.0, "Bring your camera for the \"money shot\"!", "Hiking Torrey Pines is NOT for the faint at heart. make sure you are in good shape and wear appropriate clothing and shoes. ONCE you do reach the top it has spectacular views and photo opportunities that are breath taking!"], ["Reviewed January 22, 2018", 5.0, "Easy hike, beautiful trails and sunset", "A friend recommend we go for a hike here, and I'm glad we did! We had our Uber driver drop us off at the parking lot, and there's no fee if you enter on foot. We didn't do every trail or go down to the beach, but what we did was gorgeous, and we had a nice view of the sunset. It was an easy hike so I definitely recommend to anyone.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Great walk from Torrey Pines Hilton", "Stayed at Torrey Pines Hilton and walked the sidewalk and then paved park road into the park. Hiked several of the trails off of the paved road- they were groomed, Sandy, very well traveled and requested to stay on the paths as the wild areas are protected. Many families, many single and groups going for their exercise on the road and paths. Restrooms and visitor area about a mile in. Then a very steep road going down to the beach. This was a very challenging part of the walk. Great views on most of the trails.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Great Hiking and Views at Torrey Pines", "Our family has hiked around Torrey PInes State Natural Reserve and we love going. If you go on a weekend know that parking will be tight and plan to park at the lower lot and walk up. There is a visitor's center with some information and resources. The views are great and there are a lot of different trails.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Very well-marked trails - assigned paths actually - nice scenery", "Very well-marked trails - assigned paths actually - nice scenery. A very enjoyable place for fairly easy hikes."], ["Reviewed January 21, 2018", 5.0, "Nice well marked trails", "$15 to park or find a place in the street and walk up. It is a good steep walk up. Trails are well marked and none are too long. A nice area and obviously used a lot by locals."], ["Reviewed January 21, 2018", 5.0, "The most beautiful hike", "This is a gorgeous hike! I recommend going early in the morning as parking can fill up and there will be less people. It's a fairly easy hike once you climb the road to the top. It can be as short or as long as you want based on what trails you take. I like hiking up the road and down the stairs at the end so I can walk along the beach. Some people do it the opposite. Restrooms are at the start of the hike and at the top.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Beautiful natural area with miles of trails and beautiful vistas!", "Our family loves hiking in nature and often times it can be boring with miles of hiking to get one great view. Torrey Pines offers great vistas from almost every point on any trail. We visited on a Sunday so there were many other people enjoying the park as well and it did not distract from the natural beauty at all. The nice thing is if you don't want to hike up a large hill you can drive your car to the top and take short hikes that are more flat and less strenuous.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Absolutely a view that will stay with you", "Great place to reflect and enjoy a Pacific sunset. You can hike the cliffs walk the beach or just sit and take it all in."], ["Reviewed January 14, 2018", 5.0, "Beautiful beach", "Went to the beach at Torrey Pines, since we live in a community in Florida called by the same name. It was a dreary day, but the surf and the beach were nice to sit and watch the waves and surfers."], ["Reviewed January 13, 2018", 5.0, "Must see in San Diego!!", "This place is vast and beautiful, on the coast,lots of walking trails, so much to see, and it is all gorgeous. Have a picnic, a long hike, stroll by the ocean - the options are many"], ["Reviewed January 13, 2018", 5.0, "Amazing scenery", "We hiked a couple of the trails on the bluffs toward the ocean. Great views. Trail was slightly busy but no bad in January. We drove back down to the beach area and walked along the cliffs. Rock formations and sand color variations were very cool. Highly recommend if you have a few hours to kill.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Shhhh -- Special Site", "The Torrey Pines State Reserve Extension Area deserves a separate entry here as it's located in a separate space across Los Penasquitos Lagoon from the main park/reserve. I just discovered the extension today and certainly will go back for more excellent birding, no dogs, young and mature Torrey Pines, and sweeping vistas of the lagoon and ocean. The signage is good, maps provided at the entry off of Del Mar Scenic, and the paths with sandbag steps were totally dry two days after two unusual days of rain. There are several paths and entrances (free); we entered from Del Mar Scenic Parkway that is opposite to the North Beach Entrance to the State Reserve and parked on the street where the road dead ends into the extension. During our hour hike we only encountered 3 others at the beginning and end. Thus, go to this extension of the Torrey Pines State Reserve for an urban forest and coastal sage scrub experience in relatively solitude.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Breathtaking views", "We hiked Torrey Pines and were in awe of the views from ever vantage point. Safe trails for younger folks too."], ["Reviewed January 11, 2018", 5.0, "Great walk", "Friends took us to take a hike here as it is one of their favorite local spots. We walked out along the beach and walked back up through the upland area. Being easterners the environment was new and exciting to us. There were many people hiking, lots of family groups. A very good afternoon out.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Wow! Beautiful Hike", "This may be the most beautiful location for a hike have ever seen. We arrived early and enjoyed our hike down to the beach. On our way bake the park became quite crowded which somewhat reduced the enjoyment. However, I am still really pleased we spent time a this beautiful location.\n\nI definitely recommend seeing this park. I suggest starting your day early.\nShow less"], ["Reviewed January 9, 2018", 4.0, "Great views of ocean", "This park is a short distance from downtown San Diego. There are walking trails. Beautiful cliffs to look at the ocean. Nice beaches to play. You can watch sky gliders. Parking is not too bad. We spent about half a day driving and walking. Nice way to enjoy the beautiful weather.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Stunning Beach", "My wife and I love the Torrey Pines State Natural Reserve and stop frequently on every visit to the San Diego area. The beaches, sided by steep cliffs, are beautiful and rugged. Be sure to consult a tide table before hiking the beach south - the tides come all the way in to the cliff faces and you can find yourself trying to wade out if not careful. We try to time our arrival 2 hours before low tide which gives us about 4 hours to wander without worrying about the water being much higher than when we arrived.\n\nThe hiking trails along the top of the cliffs are also very enjoyable with great views over the nearby ocean. On this stop we visited the lodge, looked over some of the exhibits and enjoyed taking with the nice lady manning the desk.\n\nA very worthwhile stop if you are in the area!\nShow less"], ["Reviewed January 8, 2018", 5.0, "Beautiful spot for a family day out", "We have visited Torrey Pine Reserve with our family. We were lucky enough to see Dolphins from high up. The hike is a must if you are visiting San Diego. Good comfortable hiking shoes or trainers are recommend. it might be a bit of a challenge for people with walking difficulties due to uneven terrain. I would not recommend the hike for families with very young kids/infants.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Beautiful views of the coast", "Nice hiking but crowded/busy trails. Beautiful views. Arrive early to be able to park up near the trail heads, otherwise it is a decent hike uphill just to get to the trails and the traffic on the trails is heavier. Saw LOTS of dolphins as well as a few migrating whales, which was awesome. Friendly staff at the park.\nShow less"], ["Reviewed January 7, 2018", 2.0, "Terrible overcrowding", "I searched for hiking round San Diego and unfortunately this was high on the list. We visited on a Saturday when it was ridiculously overcrowded. People being funnelled into narrow paths after paying 15 dollars for parking. Very short 'hikes' suitable for small children and if I'm honest, average scenery. Much nicer spots in California and even in the UK.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Beautiful spot for a family hike", "This made a good family hike for our kids ages 6 and 8. It got busy so I suspect if you want fewer crowds, you should go early in the morning. We got there at 11 and drove to the top parking lot. $15 for park entrance during January. We did the razor loop since the tide was high affecting the beach trail a bit. Gorgeous views and we even enjoyed a bit of an air show as F-18s from the base did some flights above. I would go back and try some of the other trails as well. Kids enjoyed the park ranger animal tracks game near the entrance to the trail. (Not sure if they have the tent/ table all the time but the lady ranger was very nice and helped the kids learn a bit about the environment and animals in the area)\nShow less"], ["Reviewed January 5, 2018", 5.0, "Unexpected lovely beach", "We drop by this park not knowing what to expect. It's a perfectly lovely spot to spend a couple hours exploring the beach, watching birds and and critters, and having a pic nic. It's uncrowded and is very aesthetically pleasing. No need to enter the state park if you just want to visit the beach, but parking along the highway is limited. Next time I'll plan to do a hike!\nShow less"], ["Reviewed January 4, 2018", 5.0, "Pristine beach and cliffside", "Aptly named, La Jolla really is the jewel of San DIego. Come here to beach and hike, relax or exercise, if you are a lover of the ocean or nature, you cannot go wrong."], ["Reviewed January 4, 2018", 5.0, "What a place", "By mistake we ended up at Torries pines. A huge nature reserve just passed la jolle. All we wanted to do was kill some time before heading of to L.A. We walked down some cliff route to the beach below and it was fantastic the views the beach was to die for and there were loads of local people there surfing and sun bathing. You know you've found a good place when you find the locals there. We walked for miles on the beautiful pristine beach so much so we ran over time but it was worth it. On the top where we parked the car was a restaurant so we had z bite to eat and a drink. We didn't go into the forest but the cliffs and beach second to none. This is not an ideal spot for people who are not fit as to get to the beach it's all down hill getting back up was a challenge as it was fairly steep but we all enjoyed the experience.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Torrey Pines State Park", "Nice easy hike and beautiful coastal views! Plenty of parking and rest rooms. Go early to avoid crowds."], ["Reviewed January 3, 2018", 5.0, "Love walking along the beach", "You can go anytime during the day and always enjoy it. We went with a family friend of ours, both children and adults enjoyed it."], ["Reviewed January 3, 2018", 5.0, "Free beach, lots of sand!", "What more could you ask for in late December than an expansive beach at low tide? It's a beach, so it warrants little explanation :)"], ["Reviewed January 3, 2018", 5.0, "Great Hikes", "I take everyone to this location. It is very unique and special. The hiking is easy to moderate I would say. With the rewarding beach views. The water is usually very calm."], ["Reviewed January 2, 2018", 5.0, "Beautiful Hike", "Such a beautiful place to see. This is a must see when you are in the area. We drove up the hill and parked in the park instead of when you first drive, Otherwise you will have a long walk up a big hill.Try to get there when the park opens. It is much quieter and less people. Where comfortable shoes and clothes. If you can do all the trails even the one down the road. We stayed through sunset and it was amazing. The park closes at 5pm during December but we were able to stay for the sunset and then leave.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Just what the family needed", "Great day as the sun broke through the morning clouds and it turned into a beautiful day. We parked in the state park designated parking for $20 and hiked up the hill on the main trail by the road. Relatively easy walk with only minor vehicular traffic. We all made it and the temperatures seemed perfect for the outing. We selected a number of different trails and explored for quite a while before deciding to take the beach trail down and spend time there. Delightful experience with minimal technical issues on the trail. Great time for the family to be together and relax. Two thumbs up... Cheers!\nShow less"], ["Reviewed December 31, 2017", 3.0, "Beautiful But Expensive", "Before you drive up here, know the parking is $20. You are able to hike around and it is scenic. Only you know how much you're willing to pay for scenery."], ["Reviewed December 30, 2017", 5.0, "Great Sunset View", "Our family hiked the trails each day that we were staying at the local Hilton hotel. The hiking trails were well marked, the hikes were moderate in difficulty. Need to wear good hiking shoes. There were porta potties at the trail head parking lot near the beginning of the trail system. The local volunteers were helpful in guiding newbies on where to hike and what to look for. We enjoyed making it to beach and walking the beach north. Need to be careful, as there are loose rocks.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Must do when in the area", "Great place for hiking with stunning views. We went there twice during our one week stay in San Diego."], ["Reviewed December 24, 2017", 5.0, "greak walk", "This is about a one mile beach from the parking lot, and it's fun at the end to climb the cliffs among the rare Torrey Pine trees, and walk to the upper parking and enjoy the view of the ocean from up high"], ["Reviewed December 23, 2017", 5.0, "Beautiful! Geological Layers", "This place is truly incredible. It has sweeping landscape views of the ocean from above and then a lovely hike down to the ocean. This would be a great place for people interested in geology. While we were walking on the beach, we could see the layers of rock in addition to fossilized shells on the ground layers of rock. Be prepared for a $12 parking fee per car. They do take really good care of the park, so if you stay a while to enjoy it, you will get your money’s worth while also supporting great natural places like this one, keeping it pristine for your future generations.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Fun for everyone", "Every time I visit San Diego, I have to visit here because of the wide varieties of environments that are here. It has beaches, mountains, plains and all of it within close range of greater San Diego. It’s a perfect place to come for a hike to build up an appetite for a fantastic dinner.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Good hiking & ocean view", "Great combination of cliff & beach hiking. Can get crowded & the runners tend to think that it’s “their” trail. Some will literally run you over & not consider yielding in narrow areas. One of the few places to see the Torrey pine tree. Can walk the beach south to Black’s beach or north to Del Mar. Can view migrating whales...check with the locals for the season.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Stunning hikes+ perfect views-wonderful family time.", "A perfect family outing for the nine of us!!\n\nWe all hiked down to Flat Rock and got some great family pics... then all 5 kids went on the coast hike all the way down to the beach for a nice beach walk back. The four of us adults went over to the Guy Fleming Trail for spectacular views and a lovely loop of a hike.\n\nEnjoy our beautiful Torrey Pines park/preserve and bring your family..... a delightful day of sun and beauty.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Hidden gem for nature walks and ocean views", "This is one of California's most beautiful parks. It is right on the coast, on top of spectacular bluffs and full of the native Torrey Pine tree. A must see!"], ["Reviewed December 21, 2017", 5.0, "Torrey Pines Park Thanksgiving 2017", "I have gone to Torrey Pines Park for years! It is so Awesome! It is about 300 feet above the ocean beach. From the park you can look down into the ocean and sometimes see dolphins and whales. Torrey Pines Park has a Tree that is basically no where else..TORREY PINES tree. It is so awesome!\n\nThere are several places to hike in the park, so I go several days and hike at least one place each day. You can see very cool animals and plants, and hear the OCEAN the whole time.\n\nI plan to go back within a year!!!\nShow less"], ["Reviewed December 21, 2017", 5.0, "MUST visit - Best beach in San Diego", "We came to do 3 things and one of those things was to re-visit Torrey Pines State Reserve. Well worth the $15 per day on the weekend. Many paths and the best views in SD as far as I am concerned. We got married up there 15 years ago. Well worth the trip.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Must see in San Diego", "Spent the whole day here. Drive to the top if you get there early as parking is limited at the visitor center. Take a free guided hike with one of the park rangers if you can, they are very informative. Then hike around on your own and spend some time on the beach and catch sunset.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Priceless Views", "If you are a person who appreciates beautiful hiking and amazing beaches, then Torrey Pines State Reserve is a must. If you live or visiting the San Diego Area you will have a great day. If you are a person who just needs some downtime or alone time Torrey Pines State Reserve is the place.\n\nIf you are in shape or not in shape you will have plenty of flat walking to make your hiking experience much easier. One of the nicest and cleanest places you will ever find. All the people that come here are very friendly. I have to say nothing like taking a break and get some stress out of the way.\n\nNo questions one of the best views you will ever seen of the Pacific Ocean.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Amazing", "There are tons of places to walk during the week it isn't that crowded. There's a small fee to get into the park, but it's not unreasonable."], ["Reviewed December 5, 2017", 4.0, "Beautiful trails on the ocean’s edge", "We knew this would be a spectacular walk but we didn’t know the friendliness and hospitality of the guides and volunteers! The visitors center is a must stop and visit as the building, made of adobe, has historical significance. The volunteers here also offer local knowledge of the rare Torrey Pine and the beetle which has been attacking the already reduced numbers of the tree.\nThe seascape vistas from atop the cliffs and from the beach only add to the experience. We were here at sunset and saw a pod of dolphins frolicking in the surf!\n\nNote: Broken Hill Trail is currently closed for maintenance work (Dec 2017).\nHint: For a quieter hike, the Guy Fleming trail offers the same vistas without the crowds.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Put Away Your Cell Phones and Seethe Beauty!", "Beautiful place to hike! There are trails for all levels and you can park at the top if unable to walk up the hill. It is always cooler there, too."], ["Reviewed December 1, 2017", 5.0, "An interesting area quite well preserved.", "We are always attempting on our holidays to find interesting trails to hike though not necessarily difficult ones. We found the Torrey Pines Reserve to suit our needs perfectly. The trails were easy to navigate with various vista points along the way. The views of the Pacific Ocean from atop of the cliffs were just amazing. The entry fee was very minimal and the 3 parking areas were more than adequate.\nShow less"], ["Reviewed November 27, 2017", 5.0, "A must-see in SD!", "Whenever you look up hiking in San Diego, you are sure to find Torrey Pines SP in the list. We went at the end of November, and it was still sunny and dry...as you would expect Southern CA to be. However, be aware, there is not much tree cover if you are looking to escape the heat! There are magnificent ocean views if you want some selfies, but if you park at the main parking lot after the toll gate, you will have to hike a ways uphill to get them. This SP has lots of out and backs, with similar views, but don't be discouraged...all are pretty desert, but desert pretty! Hopefully, global warming will allow these succulents and trees some much needed water sometime soon! We will be back to check and see. Thanks!\nShow less"], ["Reviewed November 27, 2017", 4.0, "Trails are fun.", "The starting points of trails are just so-so, but the further you go, the better the view. And trails are very fun and I recommend to walk all of them and they definitely worth it."], ["Reviewed November 26, 2017", 4.0, "Nice hiking spot", "This is a pleasant place to hike along the coast of the Pacific when the temperatures across the rest of San Diego are high. The hiking is not overly strenuous. Parking is a bit tough, but patience is the answer. The Torrey Pine trees, ocean views and ocean air make this a great spot.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Also stop at the golf course", "Super busy spent a couple of hours on the beach. The lodge was fun on the top of the hill and the views talk your breath away. Glad it was saved from development. Informative volunteers"], ["Reviewed November 26, 2017", 5.0, "One of the best hiking areas in San Diego area", "There are such wonderful views of and from this park/reserve. Some days during the year there is even free entry. Of course, I especially love the views of the Pacific and the fact you can hike down to it and along the water line."], ["Reviewed November 23, 2017", 5.0, "Worth the $15 fee!", "My 8 year old son and I decided to go hiking on our vacation. We paid the $15 fee (able to pay by credit or cash) and drove to the top of the mountain. Be careful if you drive as people are walking in the roadway even though there are several signs instructing them to walk on the paths. The volunteer at the lodge was super friendly! She showed us some routes on the map and offered to get some color brochures for my other son who was unable to make the trip today. The trails were nicely marked and easy to commute and some park benches were available if you needed a break. The views were breathtaking and I'd highly recommend spending a couple hours at the park!\nShow less"], ["Reviewed November 23, 2017", 3.0, "Just Passing Through", "Walked through Torrey Pines on the Susan G Komen 3 Day walk. Quiet place with lots of trees. Didn't really see any animals."], ["Reviewed November 23, 2017", 5.0, "Impressive cliffs, great beach for walking", "We very much enjoyed walking along this beach as the tide receded, leaving flat hard-packed sand. The red cliffs are very scenic, with trails through the reserve lands up top. Check high tide time before arriving."], ["Reviewed November 20, 2017", 3.0, "Susan Komen 3 Day walk", "Beautiful but a brutal incline to walk to the top. Not for the faint of heart! I think on normal occasions you can drive but unsure."], ["Reviewed November 16, 2017", 5.0, "Memorable hiking trails and views", "This was a highlight of my trip to San Diego. The sandstone cliffs, vegetation, beaches and views are amazing. Arrive early to get parking at the top parking lot. The fee to visit the park is less expensive during the week. Wear sturdy shoes, bring water and your camera!\nShow less"], ["Reviewed November 16, 2017", 5.0, "Fun hike with great views", "Fun hike with great views. Loved seeing the cliffs, water, and various trees. Would definitely recommend to anyone visiting."], ["Reviewed November 15, 2017", 5.0, "Fascinating", "Great hike with beautiful views, towering cliffs, and great history of the rarest pine tree in the country."], ["Reviewed November 14, 2017", 4.0, "Stunning views", "Moderate hike a few good trails closed very cool plants and views walk as much as you can stand great photo spots"], ["Reviewed November 14, 2017", 5.0, "Amazing!", "We spent the afternoon here, first hiking the Guy Fleming trail and the hanging out at the beach until after sunset. Not crowded on a Saturday in November and not too cold (though chilly once the sun went down). Plenty of parking spaces in the park. The $15 day use fee was worth it for an amazing afternoon with friends and kids!!\nShow less"], ["Reviewed November 12, 2017", 5.0, "Visit to Torrey Pines", "My wife and I recently visited the Torrey Pines Reserve with friends. This is a great natural location with fantastic hiking trails and fabulous views. We enjoyed our visit and would definitely recommend this place for a day trip while in the San Diego area. Great exercise, beautiful natural habitat, and stunning views.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Great views of the Pacific while hiking", "Great place to hike while catching scenic views of the ocean. Paths are easy to follow and there are water fountain stations at the start in case you need to hydrate."], ["Reviewed November 11, 2017", 5.0, "beautiful views", "I loved seeing all the land naturally preserved and the visitor center was a nice break at the top of our hike. Be sure to allow enough time to walk along the beach tool"], ["Reviewed November 10, 2017", 4.0, "Stunning views but way too crowded for my liking", "The hike was beautiful but crowded with people in front of me, behind me and walking by me. I prefer hikes with a bit more solitude.However, the views were amazing as were the plant life and terrain."], ["Reviewed November 10, 2017", 5.0, "Chill by the water under an umbrella", "Talk about a Zen spot. After a greuling work week, my best friend and I came with chairs and an umbrella to sit and chill. It definitely did the trick. Be aware that parking is $15.00. But you can park all day"], ["Reviewed November 9, 2017", 5.0, "The Best View!", "This is a great place to hike! They have several trails to choose from, beginner to experienced.... And you get a fabulous view of the ocean......bring your camera, lots of photo ops!"], ["Reviewed November 9, 2017", 5.0, "Southern California at its best!", "This state park has wonderfully scenic and informative trails. Try especially the \"Guy Fleming\" trail which for most of its length skirts the bluff over Torrey Pines beach......vistas up and down the coast, and at some, and lucky, times of year sitings of dolphins at play surfing the waves below, possibly migrating gray whales. A more energetic trail will take you down to the beach, but back up is \"up\".......\nShow less"], ["Reviewed November 9, 2017", 5.0, "Beautiful, Varied Terrain- Oh, the Vistas!", "Wow, if you don't take a ton of pictures here, -well, you should. The trails are great, some steep parts- I would not take small kids due to the hazards, there are some quite steep dropoffs. There are gorgeous views all over the place, it's almost too picturesque. When you get near the top of the cliffs by the beach, the vistas are incredible. At least 180 degree ocean views, the sunsets are unbelievable. Just be sure your car is out by 6:30, they claim they close the lots then. I would also avoid the trails after wet weather.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great Walking Trails", "Being Mom always take me on great adventures, we love to walk and take in the sights. If you're an amateur or avid hiker, these trails are for you."], ["Reviewed November 8, 2017", 5.0, "Beautiful!!!", "I highly recommend a visit here. The views are incredible! The hiking trails are easily accessible and not too difficult. Wear good shoes and bring lots of water!"], ["Reviewed November 5, 2017", 4.0, "Fabulous views and beach", "The pass to the park is $15 valid for the whole day. But the views and the opportunities to hike from the top to the beach, they are priceless.\nThe parking lots at the top aren't big, but you can park at the base and then hike up and down.\nThe eponymous Torey pines are everywhere.\nThe beach is splendid, but the cold weather proved a deterrent for anyone to enter the waters.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Nice hiking trails!", "You will see a lot of people walking up the road. They are avoiding the pass and parking fees, but unless you want to basically climb a mini mountain to get to the trails, then pay the fee drive to the top and have a great hike. You can actually get down to the beach at low tide and walk the beach back as well.\nShow less"], ["Reviewed October 31, 2017", 5.0, "One of the most beautiful places in San Diego. You have to visit ...", "One of the most beautiful places in San Diego.You have to visit .. The view is beautiful. And the bar has delicious snacks.."], ["Reviewed October 28, 2017", 5.0, "Hike to the beach", "Beautiful view of the ocean as you hike down to the beach. Lots of people on Saturday in October, but not packed. Easy parking. $15/car. Fun on the beach."], ["Reviewed October 26, 2017", 5.0, "Awesome place", "Walking the beach below the towering cliffs is incredible. It is stunning to say the least. Pay a fee to enter the park and hike around as well."], ["Reviewed October 25, 2017", 5.0, "The jewel of Southern California's State Parks.", "The Southern California coast is blighted with development, but Torrey Pines is an oasis.\n\nAs a Reserve, the trails, mesa, and wetlands enjoy the highest level of protection. This keeps the Torrey woodland, chaparral, sage scrub, and coastal bluffs pristine. Visitors walk through the miles of trails, looking over the natural setting to the ocean. Check out the historic lodge, now housing a museum and gift shop. Take advantage of the TIK (information kiosk) or docent-led, interpretive walks. Enjoy spring's wildflowers. Walk on bluffs, to viewpoints, or along the beach cliffs at mid to low tide.\n\nBut this is a preserve, not a recreational park...stay on trail, leave your snacks in the car, respect the plants and animals, and appreciate being a visitor in nature's home.\n\nShow less"], ["Reviewed October 24, 2017", 5.0, "Our favorite scenic park in San Diego", "Torrent Pines is an oasis in the urban scene of San Diego. Magnificent coastal views from the colorful sandstone cliffs with rare Torrey Pines and native chapparal. This is hiking park, so make sure to go up to the top, check out the visitor center, and then take a hike. The beach below is a fun beach to walk or swim Our advice us to go early, especially on weekends. The upper parking lot has limited parking. There are two other lots at beach level. The one closest to the entrance station has trail along the road to reach the top. Bring a picnic lunch as their are tables at the upper lots.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Hike", "Had a great day. See my review of the beach. It was a combo visit. We hiked and did the beach too. It was awesome!!! The extreme brought out a lot of people but the beach is lovely and everyone is very nice.\nThe scenery is great.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Breathtaking views of the Pacific - the best walk-hike ever!", "I like to walk and hike but that's not everybody's cup of tea. However, Torrey Pines has trails that are suitable to all skill levels. We went with another couple and after the first trail, we all said \"Let's do another and then another, another....\" The majestic Pacific is always in view. A good time was had by all. Make sure you're wearing a sturdy pair of walking shoes. Really needed on some of the better trails.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Worth the drive in my opinion. Awesome views.", "I drove past the North end of the park, which i later found out has excellent hiking trails as well as beach. I parked at the glider port on the south end and walked the bluff as well as climbed the stairs down to the beach. A word of warning to those sensitive- the beach just to the North of the stairs is nudity friendly, I saw no signage.\nWatching the gliders is also a ton of fun,and I think you can even try a tandem flight if you are crazy enough!\nShow less"], ["Reviewed October 18, 2017", 5.0, "Lovely beach walk and then a must-do hike", "This should probably be on top of the list of things to do in San Diego unless you are totally into zoos, in which case the city has one of the best\n\nThe reserve has a unique species of pine after which it is named and you will do well to observe them as you walk up. This isn’t an exactly easy climb if you aren’t a regular walker or runner, but it’s really worth it\n\nCarry your binoculars too because one gets to hear and see some lovely birdlife. Apart from this, do make it right to the top of the cliff where you get some breath taking views of the Pacific and a steep cliff\nShow less"], ["Reviewed October 16, 2017", 5.0, "Tons of hiking trails", "Good for walking. Nice views. Easy to get too. Wear good shoes and have good balance. Small price for admission. Worth it to keep the place up."], ["Reviewed October 14, 2017", 5.0, "Beautiful views", "Georgeous scenery does not describe what you'll see. I've come to visit this location the last three times I was in SD. Either walk or drive to the top; pretty steep climb. Great walking paths if you're wearing closed toe shoes."], ["Reviewed October 12, 2017", 5.0, "Best", "San Diego's finest. Not only is the drive into this beach breathtaking but the views are astronomical! Getting there isn't the easiest so I tends to be the least crowded as well so tit for tat on that one lol. I honestly can't give this beach high enough praise.\nShow less"], ["Reviewed October 12, 2017", 5.0, "Fantastic!", "Great place to hike and view the ocean. Some of the paths even lead down to the ocean beach. Make sure you wear your sneakers and sunscreen."], ["Reviewed October 12, 2017", 5.0, "Awesome views and hike!", "A must do while in town. If you are into hiking plan to spend a good part of the day at this park. Plenty of trails and stops along the way to enjoy the views."], ["Reviewed October 11, 2017", 5.0, "The Torrey Trail", "Tired of walking concrete and asphalt? How about a walk on an actual trail through a natural preserve with views every step. The trail starts at the Torrey Pines Golf Course parking lot. The dirt trail winds through protected torrey pines and native vegetation. The walk culminates with a overlook of torrey pines state beach and the Pacific ocean. There is just something special about this preserve that has to seen and enjoyed, hopefully forever.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Start your morning", "Take an hour, two hours or three and enjoy this scenic walk/hike. Several different trails - you choose the difficulty and length. One ends at the beach. Awesome for morning or a stroll before sunset. You can pay for parking $10 or park on the highway if you can find a spot. If you pay for parking you can go “up” the road to find additional spots closer to where the trails begin. Anyone can enjoy, including those with some walking issues. Great for kids.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Great hike to start the day!", "We are visiting San Diego and wanted to exercise early morning, this is sooo beautiful. We started at 7:00am and walked for 1 hour along the beach and trail. Soooo beautiful, lots of surfers, just very worth it to go if you like nature."], ["Reviewed October 3, 2017", 4.0, "Hike in La Jolla", "You can hike along the beach in the cliffs. Many trails from easy to difficult. The Torrey Pine trees are indigenous to this area hence the name. I’d recommend bringing a walking stick. There are parts of the paths with no railings for safety. The trails are well kept. Lots of people come. Just pay attention to the path and your footing. During summer months there are rattle snakes in the bush. I haven’t seen any but I hear them. The views are nice.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Beautiful View & Walk", "A must see if you like walking and looking at the ocean. Tends to get crowded, especially on the weekend. No vendors so take your own water, especially if you walk up the hill from the beach parking. Well worth the price of parking"], ["Reviewed October 3, 2017", 5.0, "Great views", "Torrey Pines is named by a particular kind of pines which appears only there and a further place. Its trees and plants are supposed to be very special, I am no expert there. The park also comtains accessible trails, which is good for me. We were, however, most impressed by the view from the Broken Hill - do not miss.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Nice trails, great views", "There are a few trails that are ascend the hills overlooking the beach. They are pretty steep in parts, but are well maintained and have steps in some places. There are numerous viewing platforms where the views are best. Some of the cliffs are dramatic and beautiful. Depending on the routes you select, you can hike a couple of miles and take about 2 hours doing it. You can also hike on beach, which is wide and beautiful.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Absolutely beautiful views", "Last week the main entrance was closed for repaving, so we were forced to walk the beach to the trailhead there. Boo hoo...it was a beautiful clear Sept. morning, the tourist had left, & kids were back in school. The Beach Trail is intermediate, some rough looking terrain but easily navigated, with steps where needed! Other hikers were friendly and easy going. The views go on forever. A few benches available to sit and enjoy the ocean. Worth a couple hours out of your day!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Favorite Hike", "Torrey Pines State Reserve/Beach is a wonderful hike. Come early in the morning ~0600 or sunrise if you want to avoid the exorbitant parking ($15 fee) - there are about 80 no-pay parking spaces along the beach."], ["Reviewed October 2, 2017", 5.0, "Inspiring views and an invigorating hike!", "We frequent The Torrey Pines State Reserve frequently through out the year. It's one of our family's favorite weekend hikes. The views from the top are incredible and ever changing. W have seen an incredible array of wildlife from coyotes to Falcons, and we've even seen whales migrating north from the bluff tops! Be sure to time your visit around the high tides so you can walk back along the shoreline!\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great hiking all year around!", "Great ocean views, various difficulty hikes, beach walks, biking ... A lot of trails are kids-friendly."], ["Reviewed October 2, 2017", 5.0, "Scenic views of the unspoiled coast and cliffs", "wonderful place to spend time along the unspoiled coast. Take a hike along the cliffs and / or venture down to one of the most beautiful beaches in southern California."], ["Reviewed October 1, 2017", 5.0, "Gorgeus vistas of Pacific coastline", "If you are in decent shape and if you have 2-4 hours (or even less) go visit Torrey Pines Natural Reserve. It offers beautifully stunning hike through Pacific cliffs and offers gorgeous views of the Pacific coastline. Numerous trails, some no longer than 0.2 miles. Pak on the free parking (paid parking lot with bathrooms also available) along the beach towards Delmar, hike up the hill to the top to the visitors center and take the path that takes you past the Red Rock all the way down to the beach. About a mile long walk on the beach takes you right back to the beachside parking lot.\nTorrey Pines is a must if you find yourself in the San Diego, LaJolla or Delmar area.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Just a beautiful spot in San Diego to hike or walk.", "Back in my running days - I would love the challenge of running up to the top and then through a few trails. The views are spectacular and the park is kept in pristine shape. If you want an easier route - walk along the beach. Children love exploring the tide pools.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Try to wander the beach", "Even if you don't want to see the gliders, park outside of the gate and wander the beach. You may be able to spot kite boarders!!!"], ["Reviewed September 21, 2017", 4.0, "Very Enjoyable Area", "We visited the park and hiked all of the trails near the visitor center. We were only about three hours. The walk down to the ocean was really enjoyable. Moderate short hike with a pretty good size hill."], ["Reviewed September 19, 2017", 5.0, "A must for the active traveler. Best Hike in San Diego. Many paths for all levels.", "This is one of my favorite hikes. I do the longest from the Torrey Pines golf course (I park on the road East of golf course) and walk to the trail. I hike down to beach, walk the beach until the bathrooms. Then walk back up the road. A great hike. Go early in hot weather and on week-ends and holidays to avoid crowds. A must for the active traveler. Helpful to go low tide if you want to walk the beach.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Amazing Hike and Views", "We didn't know what to expect and where to start but you can't go wrong with any trail. All of them had amazing views. I highly recommend the beach hike and be prepared for breath taking views. Wish we had more time to do more trails.\nShow less"], ["Reviewed September 15, 2017", 5.0, "What a view!", "We went here for my Birthday and no regrets were had. Its a beautiful place to be. Great Hikes, breathtaking views, glider port entertainment, and nature's gifts all around. This won't disappoint."], ["Reviewed September 13, 2017", 5.0, "Subset", "Great views for sunset! Went about 30 minutes before sunset but didn't want to pay for a day use pass so we parked on the hill and walked to the cliffs. No beach access from up that high but the landscape is phenomenal!"], ["Reviewed September 13, 2017", 5.0, "A must do in San Diego.", "Sunrise, sunset, mid afternoon. The ideal San Diego hike to Torrey Pines beach. Not challenging. Go at your own pace. Should take 90 minutes to make the entire circle (including the final walk along the beach to the parking lot again. Parking is a bit steep at $17. But the atmosphere, incredible views to the ocean (both south and north facing) and location can not be beat. Whether you're visiting from out of town or looking for some fun exercise, this is a must.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Magnifique!", "This hike was beautiful and a nice workout, as well! The scenery is magnificent, especially at the top overlooking the beach and the ocean! I am very much into photography and the photos I took here are amazing. All in all, a proper treat for nature lovers!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Amazing, amazing, amazing", "we hike at the bottom the beach and then drove to the top of torry pines reserve and hike around the top, u must stop in the reserve house and listen to a short 17 minute video about Torry pines...im not giving away her secrets...worth visting, YES...\nShow less"], ["Reviewed September 7, 2017", 4.0, "Natural Vistas of the Pacific", "You can go back in time with the Torrey Pines Trail hikes. It's unspoiled by technology and development. Beautiful scenery and natural landscapes. I almost hate to review it because I love going there when there are fewer people. The more word gets out about this gem, the harder it will be to give it five stars.\n\nCaution this is not an easy hike so put on your best walking shoes and give it a whirl. You'll be glad you went.\n\nWe like to park at the bottom at the beach lot, then walk up the winding road to the cool State Parks adobe. Some interesting history in that building. Then pick the beach trail you like and head down to bathtub rock. From there you can walk back on the beach if it's low tide. High tide you may get a little wet.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Great hiking area", "I only briefly visited the location to check it out while in town for a business trip. If you come from the south (mission bay) you will need turn right after the bridge to get into the parking lot under the bridge. The cliffs are beautiful with lots of natural vegetation and foot trails. Miles and miles of beach to enjoy. Definitely a must see.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Classic SoCal Landscape", "Torrey Pines is THE outdoor place to visit in the San Diego area. Its gotten extremely crowded over the years and that does impact the experience here, but the views are still spectacular and the beach is beautiful. Definitely worth the visit. If you can time your visit so the tide is low the best thing to do is park at the bottom, hike up the hill down through the trails and end up walking back to your car along the beach.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great Free Activity-San Diego Nature", "Torrey Pines is a San Diego Nature must-do. The views from above the cliffs & from down below on the beach are wonderful. If you get lucky you may see Dolphins, Whales or Pelicans along your journey.\n\nDo stay on the paths set by the park service. Let's keep this natural gem intact & avoid unnecessary erosion & danger! Mother Nature takes its toll enough during heavy rains. Yes, occasionally we get rain and some trails will be closed for your safety.\n\nDo wear comfy supportive shoes, no sandals or flip flops unless you plan to twist an ankle. Water, hat, trail snacks & suncreen at must. There are no toilets on the trail but they are available at beach level near the parking & up top near the interior parking area. (I believe you need to pay to drive inside. I never have just parked on street.)\n\nGenerally, I spend about 2-3hrs there. Just depends on how long I linget on the beach.\n\nWhat to do after? Lunch, dinner, happy hour at the famous Torrey Pines Golf Course. My favorite is sitting outside at The Grill, great Salade Nicoise! The course is a short drive or walk from Torrey Pines. The Lodge is worth a walk-thru while there too.\n\nDo plan drive time carefully. San Diego traffic is no pleasure. Head there after morning rush hour ~9:30AM and leave by 2PM otherwise stay for dinner and get on the road around 7PM. Maybe hot a few balls on the practice putting green.\n\nHappy hiking!\nShow less"], ["Reviewed September 5, 2017", 5.0, "Great views on easy to moderate hikes.", "We spent a few hours at this park, and were able to get in a few hikes. The views are spectacular. The trails can get quite crowded. Arrived around 4 pm and the ranger told us that it was ideal at that time because most people were leaving. We had enough time before sunset to take a few hikes, all which were very scenic.\nShow less"], ["Reviewed September 1, 2017", 5.0, "Beautiful. Great information centre.", "What a joy this place is. Easy to get to but a feeling of wildness on the beach. The information centre and staff were excellent. Easy or harder walks, but nothing too strenuous. Go at low tide, do the beach route and walk back along the beach to the carpark. Take a picnic to eat on the beach (not permitted on the trails), there's no cafe, just a vending machine in the car park.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Beautiful hike", "Hiking in the Torrey Pines Reserve is pleasant - and although many people go there to walk, it does not feel crowded.It has beautiful views."], ["Reviewed August 28, 2017", 5.0, "Great hike", "Try to park on road other than that pay the $15 to get into the park... Great views from everywhere and awesome best.. does have bathrooms to change into swimsuit.. could spend the whole day if you want.. food truck on site."], ["Reviewed August 28, 2017", 5.0, "Great place to hike or ride your bike", "It is a steep but very pretty ride up the hill and through the park. Well worth the effort even on a foggy day"], ["Reviewed August 28, 2017", 5.0, "Beautiful hike!", "We hiked all over Torrey Pines on a beautiful day in June. I highly recommend stopping at the ranger station/museum near the top because they will give you information about the different trails. The scenery is amazing and you can choose how challenging of a hike you want. Definitely recommend if you are in the San Diego area.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Beautiful walk on the beach. Not what you expect", "We walked Torrey pines starting in Del Mar, and walked down to the metal stairs in the nature reserve. The views at the beach are inspiring with massive walls of sandstone rising to the scrub up above. The water was cold and clean . The sandstone cliffs are stunning, and a 45 minute walk shows different attitudes of erosion and weathering. Hike up the metal stairs and a walk through dessert scrub will bring you to the parking lot at the top of the hill, and then a nice walk down to the base. The hike on top has plenty of arid plant life and for a dessert environment is full of life and an abundance of varied plant life. The aromas are something very different from your average park... so use all your senses. The park on the weekend is not over crowded, but there are people there. The trails are well marked. Wear shoes. Be ready for up and down if you are going up to./down to the beach. Either way, enjoy a little quiet nature in your day.\nShow less"], ["Reviewed August 22, 2017", 5.0, "The wild beach at its best", "One of the few wild beaches in San Diego. Its a state park so no encroaching development. Nice single restrooms for security. Parking fee but worth it for the location to beach and restrooms. No other amenities so bring your own food and drink and please pack it out. Lifeguards on duty. A beautiful long long stretch of beach sometimes along side towering fragile cliffs which have come down on beachgoers so stay clear and obey the signs.. Very clean. Outside parking lot is a long strip of beach front parking which a a vignette of the SoCal surfer and water sports lifestyle: boards, dogs, campers, dudes and dudettes. One of the nicest beaches in San Diego Up top and along the trails you will find lots of educational info and park ranger tours. Its natural eco coastal gem.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Stunning hike", "Absolutely amazing Sunday hike with friend through the reserve. It's a great hike and full of interesting things."], ["Reviewed August 16, 2017", 5.0, "Beach Entrance", "One way to enter Torrey Pines State NMatural Reserve is to walk in via the beach. Instead of driving or walking up the fairly steep hill, you can stroll along the flat beach going past the entry kiosk and then climbing up stairs near the end of the beach that's walkable. You immediately come onto one of the nature trails that has sweeping views of the Pacific Ocean. Along the beach you can see both fishermen and surfers in action. For car free entry to Torrey Pines, try the beach walk/entrane.\nShow less"], ["Reviewed August 16, 2017", 5.0, "GREAT VIEWS AND NICE HIKING", "Torrey Pines is a wonderful outdoor resource, located a short drive north of downtown, and so easily accessible to most San Diegans, as well as visitors. A network of trails provides easy to moderate hiking opportunities. One trail leads down to the beach below. Gorgeous views of the coast are visible throughout the reserve. A paved main entry path allows access for wheelchairs, strollers, etc., though it is a bit steep. The parking lot fills up on weekends and holiday, so arrive early or go on a weekday.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Beautiful hiking options", "I spent about four hours hiking through the trails. It was a fantastic experience, although I wish I had brought my swimming suit for the beach. At the end of the trail there is a fantastic beach with a lot of tidal pools where you can watch a variety of sea creatures scurrying about. There are two parking lots - one right after the entrance and the other at the top of the hill.\nThe trails start at the top parking lot - so that is the one I would recommend going to first.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Nice sunset hike!", "Sunset evening hike was nice as was the ocean at the base. Lots of people doing various activities, not just hiking. Traffic nor parking seemed to be an issue.\n\nNot what I expected to find along the coast, but glad it is preserved and well maintained in sunny California.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Hike to the Cliffs", "Take the entire day and hike to the cliffs to see all of the area the park has to offer. Everything is wonderful and when you have hiked them all, go to the beach trail and go down to the beach for the 2 mile walk back to the parking area. What a fantastic time we had.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Beautiful views while getting a workout!", "The hike down to Black's Beach (located at the Glider-port) has a beautiful view of the ocean/La Jolla. Watch your step (it's a little steep); however, don't let that deter you from dipping your toes in the sand! The hike back up is definitely a great workout.\nShow less"], ["Reviewed August 13, 2017", 5.0, "The Rarest Pine Tree in America", "We have been in the park many times in the past and didn't realize these were such rare trees. The views of the ocean from the cliff tops with the cooling on shore breeze is nice. The park road to the top was crawling with hikers and bikers, some of whom aren't familiar with the concept of walking on the trail...not the road, be careful driving here! Watch the video of the park history in the visitor center, only 13minutes and full of information.\nShow less"], ["Reviewed August 11, 2017", 5.0, "One of my favorite places", "A friend took me here when I first moved to San Diego. It became my favorite place to take anyone who visited us. In 2006, I decided I wanted to know more about this magical place, and I became a Docent. Now, I can really tell my visitors about not only the vistas, but about the vegetation and flowers, the geology, the creatures and the wonderful rare trees that give Torrey Pines State Natural Reserve it's name. This is a MUST when you come to San Diego. Be sure to try to go on one of the Docent led hikes on weekends and holidays.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Beautiful scenic views", "We drove up to the Torrey Pines forest area and then the road continued down to the beach area. We did not have time to go to the beach (the kids needed naps!) but the drive was beautiful with several scenic overlooks to stop and take pictures of. If you like college campuses, the drive takes you right through the middle of UC-San Diego. There's also a hang gliding airport, which we had never seen before! Very cool to see people hang gliding off the cliffs there. I wish we had more time because we would have definitely gone down to the beach, which was beautiful.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Beautiful views", "We visited Torrey Pines for the hiking and views. We took our infant son and the weather and views were amazing. This park is huge and well tended, very lovely place."], ["Reviewed August 6, 2017", 5.0, "A great beach location for walking along the beach or playing in the surf", "Parked here for an afternoon with close access to the beach along some cliffs. It was great surf for playing in the wVes but the cliff face was so nice spent time walking along the beach for awhile. Plenty of space for visitors to all swim and kids play.\nShow less"], ["Reviewed August 5, 2017", 4.0, "Outstanding reserve that comes with crowds", "Seven of us went on a Sunday afternoon. Not surprisingly, it was packed with swimmers, surfers, hikers, and bikers all enjoying the sunny summer day. Weather was relatively cool since it's right along the Pacific Ocean.\n\nWe paid $15 for parking which we figured was a good return since we had 2 seniors with us over 75yrs and it would've been a trek to walk from the free street parking on the other side of the marsh. Entry is free if you walk or bike in.\n\nWe parked up top by the visitor center and started from there. The short film gives a good overview of the park. The docent volunteers are happy to help. There's a few free guided tours thru the day. We decided to pick up a map and do a few easy trails on our own.\n\nYou can easily spend the entire day there. The trails are well maintained and the park well equipped. Rentals for umbrellas and chairs are available if you decide to hang out at the beach. I didn't see restaurants, just a food truck in the lower parking lot.\n\nIt's a great place if you want to stretch your legs and enjoy some fresh air with ocean views.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Absolutely breathtaking!", "I can't express how much I love this place. The views are just breathtaking from all of the trails. The landscape changes from trail to trail with desert cacti, flowers, cliffs, ocean, beach and of course the famous torrey pines. Trails range from easy to moderately difficult depending on your fitness level. You could easily spend all day hiking the various areas, and spending some time down at the beach. Make sure you bring sunscreen and a hat, as some areas very much desert like and it gets blazing hot in the midday sun. It is totally worth it though when you make it to the vistas of each trail.\nShow less"], ["Reviewed August 1, 2017", 5.0, "Let's Be Honest....", "This is a wonderful place to hike as a visitor or take friends that are visiting San Diego. Park at the bottom of the reserve. There is free parking along the beach if you are lucky enough to find a place. If not pay the parking fee and hike up (or drive up and park at the top). Such a beautiful hike and retreat. Another option is to park at the Torrey Pines Lodge...walk past the golf course onto the Torrey Pines State Park for a great vista overlook or keep hiking.\nThen come back to the lodge.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Beautiful Vistas", "Hiked here early on a Thursday morning. They open at 7:15 am. The trails are well maintained and overlook the Pacific Ocean. The hiking was beautiful here and we plan to return the next time we visit San Diego. Make sure you bring water as they don't sell any in the gift shop. They provide a water fountain to refill containers, if you bring one with you. When we left the park at 11 am, the park was filling up with hikers. Go early as it's cooler and less busy. Wear good shoes for the sandy trails.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Daily Hike", "This is a great day hike when you are in San Diego. Trails, overloooks, nature walks. Walk down to the beach from the top of the reserve and enjoy!"], ["Reviewed July 25, 2017", 5.0, "Favorite activity in San Diego!", "We spent a few minutes in the Visitors Center talking with the Park Ranger. He supplied us with a map which outlined the various hiking trails. We chose to hike the beach trail and it was spectacular! Great opportunities to take some fabulous pictures along the vistas and cliffs. Be prepared by wearing shoes appropriate for hiking and bring water. We parked at the Visitors Center, hiked the beach trail down to the shore, strolled the beach and then walked back up to our car via the paved road. There are many hiking trails and one can send an entire day at Torrey Pines. The fee is $15/car to enter the reserve.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Amazing coastal views of cliffs and ocean.", "Wear good shoes for hiking. Take water and explore the trails. The more adventurous among us can take the path all the way down to the water, but remember you have to hike back up...great vistas for photos. There is a nature center at the top near the upper parking lots. There is an entry fee for cars.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Great View from Above the Beacj", "We parked on the side of the highway...you must pay via the Paybox for the hours you want to stay. Recommend you wear athletic or walking shoes as the dusty trail can cause slipping and sliding. I saw one snake slithering over the rock so one might assume snake friends are in the area. We chose to sit on one of the benches and see the view from on high but if you follow the path it will take you right down to the beach. It was not over crowded on that Sunday afternoon. View is spectacular and the place is very calm and serene.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Beautiful reserve with lots of hiking in this desert by the ocean", "If you are looking for a beautiful hike with breathtaking views, this is a place for you to enjoy a few hours! There is ample parking at the bottom of the park right off Torrey Pines Road. Plan for a few hours. Today we took the hike down to the beach and then walked on the beach back to the parking lot as the tide was out. The changing landscape, sandstone, diverse plant life (including Torrey Pines) and beach just make this location spectacular!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Surprising Coastal Gem", "Everyone thinks of Torrey Pines Golf Course but this state reserve is a pleasant surprise. There are numerous short easy hikes through out the park. You can make this a morning or full day activity. In addition the history of the park and learning about the preservation of the rare Torrey Pine forest is worthwhile for anyone visiting California.\n\nRecommend your go early in the morning for both the cooler weather plus to take advantage of the limited parking. You can park down by the beach and walk up saving the $15 per car fee but it is a good hike up the hill, although definitely doable.\n\nBe sure to first visit the lodge at the top of the park to get advice on your hikes for the day. There are also stunning views that shouldn't be missed.\n\nNote - using your GPS can take you to the wrong location if you don't plug in the correct name. You need to enter Torrey Pines State Reserve, if you only enter Torrey Pines Park you end up in a residential area.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful Family Hike to the beach", "We went on a July morning with our 7and 9 year olds boys. Took the trail to the beach. It was a great hike down to the water with beautiful views. We paid the $$ to park in the lot."], ["Reviewed July 19, 2017", 5.0, "Hike and Swim!", "I've been here many times to hike. My favorite agenda (in the summer) is to park at one of the lots at the top, hike down to the beach, go for a swim, then hike back up. There are easier hikes if you have older or younger people with you. Gorgeous views of the ocean from several points. It's a California State Park, so you have to pay to enter the parking lot. It's crowded on holidays. I'm a local, but I love going here regularly because it's so beautiful. It's a great place to take visitors, too.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful walking paths.", "Go here all the time. Parking in the summer is an issue so either go early or be patient or pay. There is free parking along the coast but is usually full. Parking lot next to beach is available for $15. You can park on Carmel Valley Rd which is free but you have to be patient sometimes and walk through the North Parking lot to get to the coast trail and then head to the south parking lot and up the hill for the views or out to the beach.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Nature walk", "Great place for a hike. You can even hike down to the beach. Parking is limited. Otherwise you have a great view of the Pacific coastline"], ["Reviewed July 18, 2017", 5.0, "An awesome place!", "Beautiful hiking trails down to the rocky beach, which is beautiful. Get there early, especially on the weekends. Parking is free outside the reserve but it's very limited. Be sure to so the Beach Trail and Razor Point."], ["Reviewed July 17, 2017", 5.0, "Priceless visit with fantastic scenic views", "This is one of the hidden treasures in San Diego.\n\nParking: you can park at the bottom of the preserve for FREE or you can pay $15 to park within the reserve.\n\nBring some water and get ready to blaze one of the many trails in the preserve. The views are amazing. You can see La Jolla, Torrey Pines Golf course, Ocean views, and Military planes and helicopters in the landscape.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Amazing!", "Torrey Pines is definitely a must visit for a So Cal trip! You will find some of the most amazing viewpoints ever, just be prepared to do some hiking to get to them."], ["Reviewed July 16, 2017", 5.0, "Great hikes", "We had a great morning of hiking at Torrey Pines. We hiked to Red By the and climbed up on it. Then we picked up the beach trail and went down to the beach. The tide was relatively low, so we got to do lots of scrambling over rocks and exploring tide pools. Lots of fun, definitely an adventure for kids.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Beautiful Views! Tricky paths!", "We hiked this trail with six kids ages 8-19. We all enjoyed the view. It was crowded and the parking was minimal. The outhouses, the only toilets available, were clean. The docents were helpful. I found the paths to be full of ruts possibly due to the uncommon amount of rain this season?\nShow less"], ["Reviewed July 15, 2017", 4.0, "Ocean-view hiking in La Jolla", "If you enjoy hikes that afford great beautiful ocean views but are not too difficult, we recommend the Guy Fleming Trail in Torrey Pines State Natural Reserve. It's worthwhile to go up to the Visitor Center first to watch the short video about the park, and then hike back down to the trail. This 0.6-mile trail affords spectacular views of the coastline as you hike amid wildflowers, cacti, and the unique Torrey Pine trees. The hike has two scenic overlooks that provide wonderful panoramic views. Parking tip: You can park for free on the street by the beach and then hike all the way up to the Visitor Center and the park's trails. Note that this makes the hiking a bit more strenuous.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Best stop of our vacation", "I loved the hikes. They were slightly challenging but not so much that my children couldn't handle it. And we were rewarded with the most beautiful scenery at the end. The cliffs and beaches in this area were some of the prettiest we saw on our trip to the San Diego area.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Stunning Views", "The hiking trails are very easy and extremely easy to navigate. Lots of rocks, sand, and some hills, so be sure to wear appropriate shoes. We did stumble upon a rattlesnake, so keep your eyes pealed! ;) Be sure to take the path down to the beach. You won't be dissappointed!\nShow less"], ["Reviewed July 13, 2017", 5.0, "Great hike!", "A great way to spend the day hiking through the trails. Spectacular scenery at every turn. bring water and a comfy pair of shoes"], ["Reviewed July 12, 2017", 5.0, "Bring plenty of water", "The hiking trails are fairly easy to navigate and provide a nice work out for the average couch potato. Make sure to bring your camera and lots of water, it gets pretty warm as you climb."], ["Reviewed July 11, 2017", 4.0, "A gem along the pacific coast to San Diego", "we spent 3 hours follow the walking trail of Torrey Pines State Natural reserve. Easy parking. Moderate incline and we discovered a number of shrubs bearing unusual fruits. Amazing to find flowering creepers with vibrant colourful flowers. Rangers had a table with display including the Torrey Pine nuts. Beware and hang on to the rocks when you take the steps to the beach. The last few steps were not leveled with slippery sand. My sister slipped and felt pretty badly and thank god she did not break her bones. I really think the Park authority must fix this problem. Its dangerous. The beach is full of colourful smooth rocks. Be prepared to get your feet wet.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A hike to remember above the beautiful Pacific!", "This hike is rather an easy adventure that offers great vistas and numerous different flora and fauna that are fairly unique to this little gem of a park! It can be a little bit hilly with lots of rocks/sand; so wear comfortable shoes(that you don't mind getting wet for a walk along the shoreline at low tide. Also be careful if venturing of off of the well-marked paths- cactus and rattlesnakes abound! There are some bathrooms and water fountains along sections of the hike. Don't forget to check out the hang glider port just South of the reserve.\nShow less"]]}}