{"Torrey Pines Gliderport": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Torrey Pines Gliderport", "url": "/Attraction_Review-g32578-d877873-Reviews-Torrey_Pines_Gliderport-La_Jolla_San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/73/40/0c/torrey-pines-gliderport.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1182"}, "address": {"@type": "PostalAddress", "streetAddress": "2800 Torrey Pines Scenic Dr", "addressLocality": "La Jolla", "addressRegion": "California", "postalCode": "92037-1004", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 5.0, "DON'T TAKE THE KIDS!", "This place is beautiful. Great views. Lovely sunsets. Good date stop. BUT, it's not a great place for little kids. The cliffs are very steep and dangerous."], ["Reviewed 2 weeks ago", 5.0, "Great spot for viewing gliders and wildlife", "Depending on the wind, there can be many non-powered aircraft taking off over the cliffs here. Many birds can be seen here, especially at dusk. There's a snack bar and portable toilets."], ["Reviewed 2 weeks ago", 5.0, "What a Great Place!!!!!! WOW", "After the Torrey Pines golf course I stopped in at the Torrey Pines Gliderport just behind the golf course. This place was gorgeous and right on the edge of the cliffs. I took a lot of pictures and walked to the edge of the cliffs….. simply breathtaking……. And there is so much to do in the Torrey Pines area of San Diego…its definitely a must see!!!!!\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Beautiful sunset / ocean views", "I was working at the Farmers Open and spent a few lunch breaks here enjoying the sights. I also spent a few evenings watching the sunsets here. I did not eat at the counter here but have heard that the food is good. Watching the paragliders is very cool.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Money well spent", "I came early in the day because it's first come first serve to paraglide. Unfortunately, I had to wait a few hours for mother nature to cooperate and give us some good flying conditions. That wasn't an issue though. I put down my name with the staff there and hiked up and down the cliffs to get to the beach. It was a great workout. I was the first customer to fly for the day. And it was truly amazing. I spent a little extra money to get the photo package. I had my GoPro with me and got amazing videos and shots, but it was also nice and worth it to have their photographer take pictures of you in the air. Matt was my tour guide and he was great! He let me control the chute for a little bit. It was not what I expected. Way easier than I thought it would be. All said, the flight was about 30-45 minutes. After I flew, I spent a couple more hours just watching others go and chatting with other people. I'd definitely recommend this to any adventure/adrenaline junkie. I'd also do it again if I have the opportunity.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Bucketlist activity", "Hanggliding with a pro, overlooking ocean pacific and experience flying. Close to La Jolla and easy to find, rather expensive activity."], ["Reviewed January 21, 2018", 5.0, "GLIDERS Exciting and Facinating", "I'm a local. I, as a matter of course, start my tours at the Gliderport. The view is impactful. There is a cafe for lunch or snacks. One could \"hang\" there for more than an hour. The breeze is right off the ocean. It is cool even in the summer.\n\nMy tour continues, eventually, on to the LJ Shores and then over to the Children's Pool to see the sea lions.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Climb, climb, climb", "We can spend hours at Torrey Pines. It is unbelievable place where you can walk the trails and stare at the water. Please drive up and that walk the trails. It is worth every pennies"], ["Reviewed January 11, 2018", 5.0, "Careful!", "We didn't see anyone fly the afternoon we were there, but the views were spectacular (climb up on the little tower just south of the gliderport) and we saw surfers and a photoshoot on the beach below. See separate review of the Cliffhanger Cafe located at the Gliderport.\nShow less"], ["Reviewed January 8, 2018", 5.0, "What a delightful surprise!", "Torrey Pines Glidport is a wonderful spot to spend a day or a few hours with kids and family. The view is excellent, and the gliding activities are enjoyable for all ages. Try the cafe for a toasted sandwich or simple coffee. The french toasted chicken sandwich is yummy!!\nShow less"], ["Reviewed December 31, 2017", 5.0, "Exciting", "Whether you are hand gliding yourself, watching others hand glide or just taking in the view this is an often overlooked spot. If you haven’t ever hand glided before and want to I highly encourage you booking a tandem reservation here. These people are professionals, super knowledgeable and very nice. I’ve done it three times. You fly/glide over the Pacific Ocean, the beautiful beaches and on occasions I’ve flown over some of the waterfront mansions you would otherwise never be able to see from the road. It truly is a must do if you are into this kind of thing. If not, watching people take off and land is amazing also. There is a little snack bar/restaurant where you can get food. I would bring some sunglasses and maybe a light jacket, the wind comes up through there, and spend a few hours there for sure!\nShow less"], ["Reviewed December 30, 2017", 4.0, "Fun to watch, great views!", "This is a sport I do better watching... I am sure there is tons of thrills, but it is fun to lay back and watch. The views of the ocean makes it very nice..."], ["Reviewed December 29, 2017", 5.0, "Fun place to see", "Visited this place upon a recommendation from a friend. Watched some lessons and ate some great sandwiches. Beautiful views of the ocean from the property."], ["Reviewed December 28, 2017", 5.0, "Stunning view", "Amazing place to watch the sunset. Come early to watch the gliders. Easy parking if you get there well before sunset."], ["Reviewed December 25, 2017", 5.0, "Great view", "Breath taking views! Unfortunately it wasn't windy enough to see the gliders but it was worth the trip"], ["Reviewed December 25, 2017", 4.0, "Spectacular view over classic beach.", "The glider port is just by the steep cliffs above Blacks Beach. It has tandem flights available and a small restaurant/snack bar. Friendly staff make sure you feel looked after. Watching the pilots souring the cliff edge is great. A trail leads down home made stairs to the beach where you can watch both hang gliders and paraglider go back and forth along the edge of the cliff.\nShow less"], ["Reviewed December 17, 2017", 5.0, "Best Views of the Ocean", "The glider port is accessed through a State Park with lots of parking. This is a popular spot and it's usually pretty crowded.\n\nWe combined it with a trip to Torrey Pines Golf Course. After checking out the historic golf course, we just walked over to the glider port. We could see the gliders from the golf course.\n\nThere is a snack bar and commercial companies have shops where you can book a ride.\n\nBasically, it's a grass hill that slopes gently to the cliffs above the ocean. The gliders set up their flying rigs and then just walk to the edge and launch. There are usually at least ten of them soaring above the cliffs at almost any time of the day. If it's really windy, only the pros launch, but you are bound to see someone flying if it isn't raining.\n\nThere are picnic tables where you can sit and watch the continuous show. And it doesn't cost anything to hang out.\n\nThis is a fun place to visit on a nice day and the colorful gliders sail by at eye level like psychedelic birds. I would set aside at least an hour at the port, and then I would walk down the crazy steep trail to Black's Beach (nudist) and then walk down the beach to La Jolla Shores. It's a couple of miles of easy walking and the views of the cliffs, the ocean, and the million dollar homes perched atop the cliffs is like no other on earth.\n\nFor more travel tips, please check out my popular travel blog.\nShow less"], ["Reviewed December 11, 2017", 5.0, "Great day", "This was a great place to hike, glide around, swim, the trails going down to the beach is very steep I dont recommend for people with health issues, but if you can make down to the beach it is awesome place to visit."], ["Reviewed November 26, 2017", 4.0, "Great Time - Even When Not Gliding", "We've been to the spot several times and have always had a good time watching the gliders take off from this beautiful cliff location in historic San Diego.\n\nBring a lunch or buy one there, and probably a light jacket, and enjoy an afternoon watching the activity and enjoying the stunning scenery.\n\nThere are out houses but no traditional restrooms.\nShow less"], ["Reviewed November 19, 2017", 4.0, "Great Scenery", "When visiting Blacks Beach & Torrey Pines State Park you have to stop hear to see the gliders which make the amazing view even better. On a Saturday afternoon there were a few in the air and you could see the crew people working on others. There was a good crowd of observers but plenty of room to watch. The place also offered sandwiches, snacks and a gift shop.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Fun place even if you’re not riding", "I went to watch one of my Kids go on a flight and it looked amazing. But I enjoyed it just sitting at watching all the hangliders. There are chairs and benches and even a little cafe. It was the least expensive entertainment in town !\n\n\nShow less"], ["Reviewed November 13, 2017", 5.0, "Easy to wile away hours here.", "Just looking to get a walk/exercise in. Hotel sent me here. Easy walk from the Estancia. You can watch the gliders taking off which is fascinating and soothing or take the steep walk down the cliff to the beach. Walk to your left for the surfers. I zoned out, hypnotized watching them attempt the waves. I'm sure my BP dropped 20 points watching the surfers. To your right, or on the day I was there, the nude beach will greet you at the bottom of the path. So if you have kids, you may want to avoid this beach. It's mostly men nudists, but there were a few women.\nShow less"], ["Reviewed November 11, 2017", 4.0, "Parents- please refrain from having the kids look at the beach!", "People who set you up here are friendly and its a beautiful view, however, it is also the only nude beach down below the rocks so you'll have a great view from the glider, but lets keep the kid innocent, okay?"], ["Reviewed November 9, 2017", 5.0, "See San Diego like the eagles do.", "Learn to Fly. What other three words could fire the imaginations of people? The view is indescribable, the thrill lasts a lifetime. Highly recommended."], ["Reviewed November 9, 2017", 5.0, "Took Friends To See Gliders & Hoping Whales🤞👍", "Holy Makerel! What a Spectacular View! I took some friends up to watch a few Hang Gliders taking off and, also, Was Hoping to catch a glimpse, of perhaps a few Whales passing by but, no such luck on this particular day but, STILL, they thoroughly enjoyed the Awesome View! So, that being said, if you are fortunate enough to Vacation in San Diego, please give it consideration, plus, your in La Jolla so, many places to see and other things to do as well so, Safe Travels and God Bless you and Your Family!✌\nShow less"], ["Reviewed November 9, 2017", 3.0, "OK view", "Interesting history behind this area. There were no flights of any kind while we were there so the sightseeing was limited."], ["Reviewed October 30, 2017", 4.0, "If you have the guts, go for it!", "There was little wind the day we were there, but I can say if you have the guts, go for it!! It's really pretty, instructions are great. You can practice and watch others practice. The only draw back is the walk back up the cliff with your gear.\nShow less"], ["Reviewed October 26, 2017", 5.0, "My first time", "My travel companion was adamant on doing this. Me not so much. Fear of heights here. I have to say when she signed me up I almost threw up. When I was strapped to my pilot and flew off the cliff. Wow. Amazing experience. I will be back. Ty to our Uber driver for the recommendation\nShow less"], ["Reviewed October 25, 2017", 5.0, "YIKES!", "This is an awesome place to go! The man said it costs over $5000 to own all the gear required to do this sport and It is an amazing thing to watch, They have a small snack bar, and a nice shop."], ["Reviewed October 25, 2017", 5.0, "Paragliding", "Quick trip to San Diego. Planned a lunch in La Jolla and a walk at the cove. Called to check out paragliding. After a few discussion decided to go check it out. They have flights so that both of us could fly at the same time. After legal paperwork we loaded up our go pros and went out to get suited up. Within 10 minutes we were in the wind. After a quick pass for photo shots went south down the bluffs checking out how the 1% lives. After checking out the dolphins and then the clothing optional beach we did some great s turns and then picking up drafts along the bluffs. Flying north past the gliding port did a 180 turn for landing. Easy take off and landing for both of us. About 20 min flight time. Great place to watch other paraglider, RC planes, and a couple of birds of prey. It was a GREAT experience and one We would do again. Best thing to do in the area hands down. It you have a go pro take it along for amazing shots if not pay to rent one.\nShow less"], ["Reviewed October 17, 2017", 5.0, "A must if you want to try glider flight", "I didn't want to try it, but my girlfriend had a blast! Nice snacks and souvenirs available, but live music on the Saturday we were there was great. Only downside was only Porta potties are here on the park land."], ["Reviewed October 17, 2017", 5.0, "Fun Stop", "This was such a fun place. The people were friendly, there was plenty of parking and an unbelievable view. It was a large grassy area with plenty of people taking flight. It was fun to watch them take off and land and the excitement of the families. It was a bit out of the way but easy to find. I would recommend it!\nShow less"], ["Reviewed October 16, 2017", 5.0, "Cool place to hike", "This place is very cool to hike it, or just stroll sit by the beach watch the surfers and the paragliders"], ["Reviewed October 15, 2017", 5.0, "Unbelievable", "I did the tandem para glide a few days ago and it was spectacular. The entire staff were so helpful and encouraging. The entire atmosphere is so much fun. Beautiful views that you can’t describe in words. My flight was amazing. A life changing experience.\nThanks again for a wonderful day!\nShow less"], ["Reviewed October 13, 2017", 5.0, "What an awesome place & view!", "What an active place with ocean views and lots of parking! Just down the street from the Salk Institute and up from the iconic Black's Beach, you'll find awesome ocean views and lots of activities at Gliderport. The short 1/2 hour that we were there, we saw a Gliderplane, lots of parasailers taking off every 20 minutes (light winds were just right), and 4 raptors being trained for a film. There is a light refreshment stand and loads of adjacent free parking in a gravel lot in this City of San Diego Park. Have fun either soaring over the Pacific or just watching that's free.\nShow less"], ["Reviewed October 11, 2017", 5.0, "See it while you can", "Charles Lindbergh practices his flying skills here. It is a perfect spot for gliders, birds and tourist. Unfortunately the local university owns the land and has announced plans to build on it so come to enjoy it while you can"], ["Reviewed October 10, 2017", 5.0, "Fun and thrilling", "A little out of the way to get to, but you will be rewarded. Even if you don't fly it is still fun to watch others. You can eat from their snack shack as you watch. Also this is close to Torrey Pines Golf course on one side and Blacks Beach (nude) on the other side at the bottom of the cliffs.\nShow less"], ["Reviewed October 9, 2017", 4.0, "A dynamite View", "We came here for lunch and the vies are spectacular. Unfortunately, it was too windy and nobody was gliding. There is a rough path down to the beach but need good grip shoes since it is rough and sandy. You don't want to slip and roll down several hundred feet to the beach. The sandwiches from $8 up are very good and quite large. Soft drinks are $2. a nice place to spend several hours relaxing by the shore on a cliff.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Adventure in the sky", "We and our grandson enjoyed the acrobatics in the air, while along the Torrey Pines Country Club and over the cliffs above Scripps."], ["Reviewed September 21, 2017", 5.0, "To the Skies", "Very fun place. We had a blast just sitting and watching the Parasails glide back and forth. We were going to go back and do it but the wind died the last two days we were in San Diego."], ["Reviewed September 18, 2017", 5.0, "Good sandwich with amazing view", "It is amazing to see the gliders taking off and landing. The food is quite basic, but honest. You really come here for the view. No other places like that."], ["Reviewed September 14, 2017", 5.0, "the glideport and sights", "Where else would you see peopel take off into the air over a beach? Lots of fun and quite originaloriignsal"], ["Reviewed September 11, 2017", 5.0, "Great Views", "Although you can go for a ride, I did not. I did enjoy the spectacular views and enjoyed watching the hang gliders and such float about in their aerial ballet. Just beautiful I was there on a Saturday afternoon. Parking is challenging but not impossible. THey had a performer singing, concession stand, and gift shop. Plenty of outdoor seating.\nShow less"], ["Reviewed September 7, 2017", 5.0, "If you like to watch gliders up close, this is the place.", "You can park, have a snack, and sit and watch as all types of gliders take off and land - and even get ride if you wish. Nice spot on the cliffs above the ocean."], ["Reviewed September 6, 2017", 4.0, "Fun and interesting", "A close up view of the adventurous hang gliders, occasionally remote control gliders, a sometimes nude beach (far) below, and the famous Salk Institute."], ["Reviewed August 29, 2017", 5.0, "Awesome Kickback Time.", "Went here to watch the gliders of all types. Got more than I asked for. Great Live band playing. Tesla Autos were there. Drinks, sun, constant breeze, view &/or hike down to Blacks' Beach. Next time I go tandem."], ["Reviewed August 28, 2017", 5.0, "Fun to Watch", "We spent about an hour here, watching paragliders landing, taking off and just floating in the air. Their colorful parachute-like canopies brightened the cloudy day. These enthusiasts far outnumbered the hang gliders and those flying tandem with a certified instructor. But everyone, including the spectators, seemed to be enjoying themselves.\n\nWe attempted to park in the huge dirt parking lot nearby, but it proved to be totally full on this weekday afternoon. So we drove along a side road and grabbed the first open parking space that we saw. Then we walked to the cliff, overlooking Black Beach 350 feet below. This area offers a close look at the gliders landing on a nearby grassy knoll or running and launching themselves into the air. We then walked along a path to a picnic area, keeping a close watch for any gliders heading our way.\n\nAt least 20 people sat at picnic tables, feasting on sandwiches, salads or soup purchased from the Cliff Hanger Cafe, which appeared to be nothing more than a big concession stand. Others stood watching the gliders soaring in the distance. We gazed at the scene for a long time, captivated by the sight.\n\nTorrey Pines Gliderport is close to both the University of California San Diego and the Salk Institute.\nShow less"], ["Reviewed August 28, 2017", 5.0, "spectacular", "very nice view and it's really fun watching the gliders come and go. Its very relaxing, i could spend hours their hanging out in their restaurant and listening to this guy serenading.. recommend this place, its not something you can see in many places."], ["Reviewed August 22, 2017", 5.0, "3rd time back", "Our family likes to be active and to see beautiful views so this is perfect. There are so many trails to take to fit different activity levels and the views are out of this world."], ["Reviewed August 21, 2017", 4.0, "Watching vs Doing", "We went just to look vs. actually doing the gliding. No doubt this is a full setup for gliders to do their thing. Also appears they have the full lessons & tandem experience available for the adventurous. Very rustic setup, but they do have food & drink as well as picnic table like shaded area to sit & enjoy. Gliders literally fly over/next to you. What also makes this trip worth the extra effort is that you can literally walk up to the edge of the cliff yourself (over to the left side), which is really a stunning view. The gliding is pro sport -- not for Joe tourist. I'm not sure how long it takes to get proficient at this sport, but if I lived in the area I would definitely make the effort to learn. It really looked exciting & fun - flying like a bird up there. Not sure what the prices for the tandem experience is, but they have pros right there willing to take you out/up/over (the cliff). Maybe next time.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Excellent!!", "We spend an entire day there. Waiting for a wind to pick up, watching the view and just hanging out, this is a fantastic location. My son went first and had to land on the beach (375 ft below) and hiked back up the cliff! His instructor (Charlie) was awesome. Because the flight had been so short of took our son out a second time once the wind picked up. My husband went later and had an equally awesome flight with Ki. Great place, great instructors, great views. Would definitely recommend.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Amazing experience", "Every member of our family experienced the paragliding. It is amazing to glide in the air and looking around or down. The breeze from Pacific Ocean is very pleasant. The pilots are very professional and experienced and we feel very safe, although it is a bit scary when you start to jump down the cliff.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Stunning views", "Weekend parking is very painful but the views are stunning. Even if you don't go for a glide is worth the trip just to watch the para gliders."], ["Reviewed August 12, 2017", 5.0, "Awesome experience", "We attended the Glideport to watch our daughter and her husband paraglide. What a thrilling experience for them and a pleasant day for us ."], ["Reviewed August 11, 2017", 5.0, "AMAZING place to watch people take flight!", "What a great place to come see these amazing pilots take flight on their paragliding kites!!!\nThe weather was perfect and there where a dozen or more flights going on! So amazing to watch them \"jump off the cliff\" and FLY!!!\nWe are going to return and do a tandem flight with one of the licensed pilots!!\nThe views were incredible and you can look over the ocean and Blacks Beach.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Beautiful view. Exciting to watch.", "My husband and I have always been curious about the hang gliding up in Torrey Pines. We went up and we're so surprised to not only see the amazing gliders but also the absolutely fabulous view from so high. It was breathtaking. On that particular day there was a band playing. People were picnicking and there may have been good and drinks to purchase. We want to go again.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Fun short stop if it's not too crowded", "There is lots of parking in dirt lots nearby. You can walk out across the grass where the gliders take off and land, and get quite close to them."], ["Reviewed August 8, 2017", 5.0, "great views and para gliding watchin", "good for a afternoon picnic, lots of sigths to see, great view's of the Pacific, sunsets would be marvelous too."], ["Reviewed August 2, 2017", 5.0, "Helpful, skilled pilots", "Went tandem paragliding with a cousin who was determined to face a fear of heights. The pilot talked with her before, during and after the flight, making her completely comfortable. Discounted price for cash fees. Food at the grill was excellent quality and generous portion."], ["Reviewed August 1, 2017", 5.0, "Let's Be Honest....", "This is a GREAT place to see! When we have friends visit we always take them here to watch the gliders! Such a beautiful and unique place with gorgeous views of Black Beach and La Jolla and coastline. The barbecued hamburgers are great too!"], ["Reviewed August 1, 2017", 5.0, "Wish We Had More Time For A RIde!", "Having seen much about the Gliderport, I was anxious to visit on a recent trip and was glad I did. There are many opportunities to fly with an experienced pilot and the cost is quite reasonable. There is a concession stand on the property and many place to just sit and watch.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Good place in the end of the day", "The view in the evening when clouds start ti come in from the ocean, the pleasant temperatures, the sun rays that shine through the clouds, the geological features, where di yiu see the effect if rain so clearly as here? Trails lead to the beach about 100 yards below, I did not try them with my slippery shoes. What I dud nit see were restrooms. Maybe in the clubhouse if the glider club?\nShow less"], ["Reviewed July 25, 2017", 4.0, "Worth a visit!", "Great place to relax for a while and watch the hang gliders. There is a snack bar with seating to grab some food while you watch the gliders. We also visited at sunset and it was awe inspiring to watch the sun setting over the Pacific Ocean. There is no admission or parking fee.\nShow less"], ["Reviewed July 24, 2017", 4.0, "A great view near UCSD", "Why did it take us so long to discover this? Free parking on dirt lot. You can watch those taking off at the gliderport or just enjoy the view of the ocean near La Jolla. Nice place to watch the sunset."], ["Reviewed July 21, 2017", 4.0, "Great close up views of Gliders!", "Gliders seams to pass just over your head, great views of these magnificent aircraft. Enjoy the view, have a snack on the deck, stroll around , walk down to the lookout points above the cliffs, lots to see bring binocular to see the gliders even closer!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Watch others defy death for free!", "Looking out over a nice view of the Pacific and the city and suddenly someone starts running. They get closer and closer to the edge and then they jump off the cliff. The wind then lifts them easily into the air and they fly further and further out over the water.\n\nIt's something pretty magical to watch, free, and easy to get to.\n\nCheck this out.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Good for breakfast, beware there is a nude beach below...", "No gliding going on when we were there as the winds were not right. Suggest you call ahead if you are going for that purpose. We were there early so grabbed some breakfast, Breakfast burrito was large and made to order. Beware that if you walk out to look over the beach, Black Beach is a nude beach, not so great for your teens... Other than that, pretty neat place. Just wish gliders had been flying.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Torrey Pines Glider Park is awesome and free!", "Definitely one of our favorite places to spend a few hours.The gliders are fun to watch and the cliffs are amazing.\nLooking down over the beach front, the people are SO tiny. The views are just awesome. Come see the sunset!\nThere's a casual restaurant that welcomes sight seeing ppl. With excellent views of the ocean and gliders.\nShow less"], ["Reviewed July 20, 2017", 4.0, "Pretty cool views", "A great place with amazing views. You can see the ocean, walk along the top of the cliffs and you have the added bonus of the beautiful gliders in the sky. There is no cost to stop and take in the views, if you are adventurous you can sign up for tandem rides.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Enjoy the view!", "Even if you don't plan on hang gliding...it's fun to watch the others as they do. The view of the ocean isn't bad either!"], ["Reviewed July 15, 2017", 5.0, "Don't be scared. DO IT.", "The absolute highlight of my trip to SD with my kids. Tandem paragliding. I have a 10 year old and a 14 year old and they both did it without fear. It was magical. We went on a brilliantly sunny day and the views from Torrey Pines are insane. I think it was $175 each. The rides are between 20-25 minutes. If it's in your budget and you have the balls, do it! It was memory that we'll share as a family forever ever and I don't mind spending extra for those.\nShow less"], ["Reviewed July 14, 2017", 5.0, "One of my favorite spots for an amazing sunset view", "When I was a student at UCSD, this was one of my favorite spots to decompress and meditate. (Yes, how spoiled was my college experience HA!)\n\nIt's also my favorite spot to bring family and friends from out of town to witness one of the most gorgeous sunsets right off the cliff. Just bring a warm blanket, some food, and set up a little evening picnic to watch the gliders take off into the setting sun.\n\nPicturesque. Romantic. Relaxing. Simply beautiful.\nShow less"], ["Reviewed July 11, 2017", 5.0, "One of the coolest attractions in the area", "Stopped by here on a whim, and it was a busy day with beautiful views, hang gliders, and paragliders taking off and landing over and over again. Highly recommend swinging by on a busy day."], ["Reviewed July 11, 2017", 4.0, "Beautiful Coastal Views", "This is an amazing place that has fortunately not been developed into gazillion dollar houses. This is a great place for a beautiful view of the ocean and coastline. You can paraglide or watch if you wish too. Plus, it has an amazing trail to the beach which is excellent for training and much more fun than a stairmaster.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fascinating spectacle", "Unbelievable to see people walk off a cliff and float off into the air. Has a wonderful sandwich shop there as well. Well worth a visit for the family with a nice hikes down to the coast from the top."], ["Reviewed July 6, 2017", 5.0, "Great day for watching", "Stopped by here to show this area to my wife on our drive down the coast from Cardiff. Found a parking spot up front. Beautiful day outside with a gentle breeze blowing in off the coast. Amazing views of the cliffs and beach below. We walked up to the cafe area and watched people get ready to paraglide. It was relaxing to sit around and take it all in. There are food options if you are hungry or thirsty with a decent looking menu. Bathrooms in porta pottys if that need arises. Wonderful area to relax and people watch if you are not hiking down to blacks.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Hang Gliding at its Finest", "I had been to Torrey Pines Golf Course several times, but this was my first trip to the Gliderport. What a memorable experience in a stunning setting!!!"], ["Reviewed July 3, 2017", 5.0, "Choose a Sunny day with breezed to visit", "Great views of the gliders as they look almost suspended in their pouches. A nice but cautious trek down to the beach below is possible. A quick meal at the nearby small restaurant was good. Depending on what time you go, parking can be an issue.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Hike trail to beach", "2.7 miles from hotel walk to beach. Unbelievable view of ocean and cliffs Wonderful experience. Hiking, jogging, sightseeing"], ["Reviewed June 25, 2017", 5.0, "Love it!!!", "Even our 5yo did it too! View is great, cafe food is surprisingly very decent. It is definitely a family outing!"], ["Reviewed June 22, 2017", 5.0, "Fun abd thrills", "Kinda spendy but worth every penny. Safe and friendly staff and never a dull moment. Also, good eats at a shack that has a patio with views of the ocean and glider activities."], ["Reviewed June 20, 2017", 5.0, "Awesome", "Paid just under $200 to have an amazing experience I will never forget. Really cool to just sit and watch these people walk of a cliff and sail for hours. Super cool"], ["Reviewed June 17, 2017", 4.0, "Fun!", "So neat to go and watch people take off and land. Beautiful beautiful area and such a cool thing to experience! Our son loved watching them."], ["Reviewed June 14, 2017", 4.0, "Watch the gliders while eating", "We have been here twice for lunch. The first time a grill was set up and we were able to order hamburgers, etc. The second time just the deli sandwiches were available. Both times we enjoyed watching the gliders and view!"], ["Reviewed June 8, 2017", 5.0, "Fun", "This was a nice stop on the way to Torrey Pines State Park. Be sure to take pictures of the gliders over the cliffs!"], ["Reviewed June 7, 2017", 5.0, "wonderful day!", "Came here as a glider pilot to see if we could soar along the cliffs. Had a nice ride with a pleasant pilot on a paraglider; their operation is efficient, safe and enjoyable. My non-pilot wife had plenty of people watching, and there was live music for Memorial Day weekend.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Unique to watch; bucket list to try!!", "I love going to the glider park. We live nearby and the paragliders often fly overhead. It's so cool to see them filling the sky riding the updrafts and better yet to watch them step off the cliffs and catch a thermal. I catch my breath each time!\n\nThere's an old-fashioned snack shack at the gliderport so get a lemonade, some chips, and an ice cream and watch some pretty cool adventurers fly into the beautiful blue sky along the coast.\n\nIf you really feel adventurous yourself, you can go tandem with a teacher/pro and experience gliding yourself. It must be amazing. I haven't done it but I have flown in a glider plane and I have gone skydiving. That incredible feeling of quiet while cruising in the air.... magic!!\n\nSo enjoy this special gem of La Jolla. There's plenty of parking or you can hike out the gliderport.\n\nAlso, there's a trail down to the beach from the gliderport as well. It's all so gorgeous.... very few places can bring these types of days.... watching a sky full of gliders amid coastal beauty.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Mezmorizing experience !", "Great place to spend an afternoon ! What a great time to see the professionals and others hang glide. Bring the sunglasses, get a sandwich at the restaurant right there and make a day of this. Probably my favorite thing to do in San Diego !\nShow less"], ["Reviewed May 24, 2017", 5.0, "Fun to watch the paragliders!", "This is a fun place even if you don't want to join in the fun. You can sit on the deck and have a bite to eat or just hang out and watch the paragliders. It's windy so I would recommend bringing a light jacket. The views are beautiful and there is plenty of parking though it is a dirt lot.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Beautiful views from the cliffs", "I have loved this place since I was a kid. The views of the coast from the cliff are just gorgeous. And you get to watch the paragliders and hanggliders! Now there's also a seating area and food available for purchase. Love this place!! Wish I could go there every day!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Terrific views", "This is a great spot on a clear day because you can see all the way past La Jolla to the south and up to Carlsbad to the north. It's a great spot to take a picnic, or a cup of coffee and a breakfast burrito and listen to the waves and the wind.\n\nIf you're feeling so inclined you can hike down to Black's Beach. You'll almost always find surfers and people running along the beach. You'll also find plenty of wild life. Plenty of birds and oftentimes you'll see dolphins swimming in the waves.\n\nWith some luck and good timing you'll get to see people actually using the gliderport for its intended purpose.\nShow less"], ["Reviewed May 24, 2017", 3.0, "Great place to Watch or Fly", "If your looking for a place to chill and enjoy the scenery as well as watch or fly your para-glider then this is the spot. Great backdrop of the ocean. Beware of the nude beach below if your bringing your kids."], ["Reviewed May 17, 2017", 4.0, "Gliders paradise", "The day was clear with just a little wind. Ideal for gliders to get a quick lift and away they would go. Very colorful display of gliders, so bring your camera. Dress in a wind breaker to keep the breeze from cutting you. Take a lunch to picnic and watch the folks fly.\nShow less"], ["Reviewed May 13, 2017", 5.0, "View with a show", "Watch paragliders and hang gliders while enjoying a spectacular view of the ocean and cliffs, lounging in the grass or hiking along the trails."], ["Reviewed May 10, 2017", 3.0, "Great views off the cliffs", "Few places can claim a location to launch personal gliders off over the Pacific. This is a remarkable opportunity to see both the scene and sport up close. Recommended."], ["Reviewed May 9, 2017", 5.0, "Fantastic Views", "Visited out of the blue. And it was worth the stop. No gliders went out because it was too foggy. It did eventually clear up when we were leaving. But the views down the beach were amazing. Small overhang to see down cliff side."], ["Reviewed May 8, 2017", 5.0, "Not to be missed whether watching or participating!", "Beautiful setting, even better experience, Father, mother and our 11 year old son all went tandem paragliding, separately of course! It was outstanding, worth every penny and not to be missed. Get off the sidelines and do it, you will not regret it!!"], ["Reviewed May 7, 2017", 5.0, "Fun (free) stop in La Jolla!", "We tried to visit La Jolla Cove on a beautiful Sunday afternoon but were deterred by others with the same idea... We exercised plan B and went to the Torry Pines Gliderport where parking and trails abound... Hike down to Black's Beach.\n\nSame sun, same fun just with a view of La Jolla rather than Torrey Pines. A great afternoon.\nShow less"], ["Reviewed May 6, 2017", 4.0, "Great afternoon at the glider port", "This is a terrific place to go on a Sunday afternoon. There was free music, a great scene and even after a short climb, Blacks Beach. The Glider port wasn't real busy but there was plenty to see do and hike. The ground is uneven, so being good hiking shoes and have a great time. Also, parking is very challenging, so be ready to cruise for a while to find a spot.\nShow less"], ["Reviewed May 5, 2017", 5.0, "Soaring with the birds at Torrey Pines Gliderport!", "I had the most awesome time soaring with the birds in a paragliding ultralight over the beaches below Torrey Pines Gliderport, in beautiful San Diego, CA! Having zipped some of the world's best zip lining courses, jumped from an airplane in San Diego, taken a lesson in flying an ultralight (motorized glider) in Hawaii, and having ridden in an open cockpit biplane over the seacoast of San Diego, this paragliding excursion was, by far, the most exciting, and yet serene, flight, ever! Gracefully soaring along the cliffs, over gorgeous, multi-million dollar homes, and distant (sometimes nude) sunbathers on the beaches far below, this fantastic, thrill-seeking attraction newly tops my list of favorite things to do, anywhere!\n\nMy flight instructor/pilot was Steve. He was great, and very easy going, with a happy disposition. Instructions were minimal, understandable, timely, and to the point. And I'm happy to say there was no pain involved in this, at any point. Everything was comfortable, and Steve managed to find a helmet that perfectly fit my tiny head, because they even take tiny little toddlers on this adventurous excursion, for those parents inclined to accept the inherent risks on behalves of their children.\n\nIf you are a heights junky, like me, this needs to be on your bucket list! Just realize that this excursion is highly weather dependent, and wind speed and steadiness are *huge* factors. The first time I came in February, I was unable to fly. This time, my husband was unable to fly. So you have to be able, and willing, to go with the literal \"flow\" (or lack thereof)... of winds! :)\n\nI give this experience a hearty, and enthusiastic, TWO THUMBS, WAY, UP!!\nShow less"], ["Reviewed May 3, 2017", 5.0, "Fun to watch", "We didn't participate in the gliding, but enjoyed watching the gliders. It was a quiet and peaceful, and we really enjoyed it."], ["Reviewed April 30, 2017", 5.0, "Glide Port visit", "I had never been to a glider port before. I had always been intrigued by hang gliding and Para gliding before. I went there to see the activity and ended up doing the tandem paragliding. What a fantastic once in a lifetime experience. I would be lying if I said I wasn't nervous. They did a good job of handling the prep and the flight. A great place to visit just to watch or to take flight your self.\nShow less"], ["Reviewed April 28, 2017", 4.0, "If they had a bathroom, I'd give them 10+ stars", "I flew today with JC. Very professional, very kind and made me comfortable flying with him. Even while waiting for the wind to pick up he joked and made made small talk and made sure I understood what was to come. Didn't eat at the cafe but bought water and was greeted warmly. While completing waivers and such to fly the staff on that side were knowledgeable and professional. If you don't mind a porta-potty ( I really, really mind) this is a fabulous place. But without a restroom it's just an awesome experience.\nShow less"], ["Reviewed April 27, 2017", 4.0, "Fun even for the cowardly", "We escaped the crowds and traffic of LaJolla on Sunday to this spot a few miles west of town and it truly is worth the trip even if you choose not to go for a $225 ride. There's a mix of experienced solo fliers, along with novices who ride with a guide/instructor. The flights, including takeoff and return, are fascinating to watch this close, as many other reviewers have also testified.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Great for Spectators & Beautiful Views", "We don't actually participate in this sport, but it was very cool to watch. Very nice scenic views. A nice little place to eat there too."], ["Reviewed April 22, 2017", 4.0, "Nice Ocean View", "There weren't any gliders or hang gliders the day we visited but enjoyed the ocean and cliff views and could definitely see the potential thrill of jumping off a cliff with a glider attached! Terrain is reasonably rugged, parking lot is dirt and a little tricky. Overall, a nice view and glad we stopped by while in the area.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Humans can too fly!!", "A visit to Torrey Pines Gliderport is simply beautiful. Watching the paragliders take off and land gracefully just feet away is just really so captivating. The wind was strong but somehow gentle, and the pilots and their kites were so elegant in the efficiency and smoothness of their take offs and landings, it was really just enchanting. I could have sat there and watched for hours. As is, we had lunch from the little snack bar (good basic sandwiches) and watched for about an hour. Thats really all there is to do there, unless you are brave enough to try a flight yourself!\n\nWe didn't have the time to go for flights ourselves - but we will next time!\nShow less"], ["Reviewed April 18, 2017", 5.0, "The Great Escape!", "At Glider Point You Can Leave Your Worries On The Ground And Soar Over The Beach Below. If You Aren't Feeling Like A Daredevil, That's Alright, You Can Escape The Hussle And Bussle Of The City With Someone Special On The Hillside Watching Other Glide Above You.\nShow less"], ["Reviewed April 16, 2017", 5.0, "BEST VIEWS", "The gliderport is a fun place to go watch hang gliding, but the views of La Jolla are truly the reason to go."], ["Reviewed April 12, 2017", 4.0, "Nice Stop", "Nice stop to watch Gliders. Great views and you can pay to glide with an instructor. It is kinda of pricey though, I think it was close to $200."], ["Reviewed April 12, 2017", 5.0, "Great fun for the adventurous!", "If you are into adventure, this is great fun. You glide over the cliffs along the coast. The views from the cliff and from the ride itself are well worth it. If you don't want to try gliding, the beaches here are still amazing!"], ["Reviewed April 11, 2017", 5.0, "great place for views,no charge,great family spot", "Something most people don't get a chance to see close up. Got to be very brave or nuts to jump off a cliff. Fun place for family. Some eats and drinks. Good fun at low cost."], ["Reviewed April 11, 2017", 5.0, "lots of fun to sit and watch", "On a nice, windy day, it was a blast just to sit and watch for an hour or so. If our teenagers had been with us, I'm sure they would have wanted to take a tandem ride. We old folks didn't, but we checked the price: $125 for 20-25 minutes. Pretty good, actually, if you compare it to various ziplining things we have priced.\nShow less"], ["Reviewed April 10, 2017", 4.0, "Glider port", "It is a beautiful spot to observe the gliders take off and land. The is a snack bar there but no alcoholic beverages. You can go on a tantrum ride for a price. I'm did not try this. Great place for a sunset view."], ["Reviewed April 10, 2017", 4.0, "Offbeat, Interesting Activity", "This place is only hopping when the wind is up, but the view is gorgeous all the time. The little cafe is open til 4:00, food is very good, sandwiches and salads. The ground is rough on the way to the grassy area, so watch old ones and toddlers.... Really delightful and a little heart-stopping to see people just drop off the cliff and then circle back up. Seems magical....\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great Place to Relax and Watch the Colorful Paragliders", "My friend and I stopped here for a couple of hours to watch the paragliders take off and land. It's located on a bluff above the Pacific with panoramic views. There's a grassy area as well as tables with umbrellas for sitting. There's a little deli if you don't bring your own lunch. Porta-potties are available, and there's plenty of free parking. You can also sign up for tandem flights if that's your desire. If the wind goes down, the gliders may be grounded for awhile. Kids may get bored if you sit here too long; you have to watch them that they don't get into the restricted area or too close to the bluffs. There's also a fairly steep path down to the beach for those who want some more strenuous activity. The only shade is under the umbrellas near the deli so be sure to wear a hat and sunscreen. Bring water for hydration. This is great free entertainment for a couple of hours.\nShow less"], ["Reviewed April 8, 2017", 5.0, "Relaxing and different!", "We went to the gliderport as observers only, so I can not speak to the actual gliding/lessons etc. It was amazing to see all of these people hangliding and paragliding. Beautiful scenery and just a really relaxing place. We could have grabbed a bite to eat there, but we had already eaten. It was chilly the day we visited, but on a warmer day, I would have been happy to hang out up there for an hour or so, just watching people go up in the air. Beautiful!\nShow less"], ["Reviewed April 6, 2017", 5.0, "Iboss", "When wind is blowing offshore and sunny this is a special place Lessons are available and there is a snack bar Also great walking trails"], ["Reviewed April 6, 2017", 5.0, "Great to try or just to go and watch!", "We had originally planned to do a paragliding experience - looked so much fun! We went to just watch and see what was involved the first day. Was sooo much fun just watching the paragliders take off, beautiful scenery along the coast and had a nice lunch at the cafe watching the goings on. We had another reservation for later that day so needed to leave but planned on coming back next day to do one of the tandem paragliding experiences. However, there wasn't enough wind the next day and the day after that there was too much wind, lol! But, everytime we went, we had a great time just taking in the scenery, the views from the outside café are spectacular! My recommendation is, if they are doing their tandems, do it! We're keeping this on our list of things to do next time we visit the area but even if we weren't interested in doing the paragliding, it was just a wonderful place to sit and have lunch!\nShow less"], ["Reviewed April 5, 2017", 5.0, "Awesome adevnture", "For someone that is afraid of heights , this was exhilarating ! I could have stayed there for hours flying around. Sights were amazing , also saw a pod of dauphins too ! Did the walk to the beach , quite a hike but well worth it !\nShow less"], ["Reviewed April 5, 2017", 4.0, "Nice and beautiful view", "Good sandwich and a nice place to take a break, after climbing up the hill from the beach. Could watch people who try to glide"], ["Reviewed April 2, 2017", 5.0, "Amazing experience", "This is truly one of the great local experiences. The views along the coast are amazing. The guides are very experienced and provide a fantastic tour of the area. Unfortunately, it is a bit expensive for a family activity. But a really great experience."], ["Reviewed March 31, 2017", 5.0, "What an experience", "My dad did the paraglide and won't stop taking about it! Money well spent. I had a really good California sandwich at the snack shack. Good food and fair priced."], ["Reviewed March 30, 2017", 5.0, "Who was the first to jump off this cliff???", "Crazy high cliff, which has been used for over 50 years for gliders. Walk down to Black Beach, its a hike - running shoes, no sandals"], ["Reviewed March 30, 2017", 5.0, "Gliderport", "Staff is super friendly. Great food. Professional. Plus the experience was amazing. Very highly recommend. I am now wanting to get my own independent license to pilot. You won't request this experience. Michael Robinson"], ["Reviewed March 30, 2017", 5.0, "Relaxing activity to spend on a sunday morning", "We came early morning to relax and just sat down at the benches at the coast to watch people making their attempts to launch into the air. Saw others brought breakfast and coffee and were just chitchatting beside the background of beautiful coast line. So nice and relaxing!\nShow less"], ["Reviewed March 27, 2017", 4.0, "relaxing", "Relax and take in the spectacular views and watch the hang gliders take classes while the experts fly overhead. Excellent views for miles up and down the coast. It is FREE, and there is easy parking on the street off season."], ["Reviewed March 21, 2017", 5.0, "Fun fun fun", "This was a truly nice surprise. It's free to watch the paragliding and small gliders flying around the cliffs over the ocean. This is a really cool free activity."], ["Reviewed March 20, 2017", 1.0, "No good on a foggy day!", "The reason for the rating was the dense fog. It would be an awesome piece of coastline otherwise to watch the gliders. Could not find out if they only glide on weekends or also during the week?"], ["Reviewed March 16, 2017", 5.0, "Awesome", "Had a fun afternoon with beautiful weather, could not have asked for better conditions. A once in a lifetime experience."], ["Reviewed March 15, 2017", 3.0, "I Believe We Can Fly", "This is a unique experience and you can ride tandem too. These brave ones fly right off the cliff riding the winds from the beach and ocean below. The take off and land right in front of you. You can buy a coffee and have a seat to take in the moment. Amazing what these people do.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Lots of action!!", "We found the gliderport by accident and so glad we did. People were just taking off, others gliding around just having fun. It's mesmerizing. Park and get out of the car to walk around. If you are interested you can go up in tandem. Not sure whether you have to make reservations or not.\nShow less"], ["Reviewed March 10, 2017", 4.0, "Nice view of the ocean + bonus wind gliding show", "Kill two birds with one stone. Take in the views of the ocean, and waltch the paragliders soar up and put on a spectacular show for you. You cannot get any closer to paragliders as the take off from the edge of the cliff, then soar right in front of your eyes.\nShow less"], ["Reviewed March 10, 2017", 4.0, "Glider thrills", "This is exciting free fun - watching men and women strapped to a glider soar off a cliff overlooking the blue Pacific Ocean."], ["Reviewed March 8, 2017", 4.0, "March 4th", "Located in LaJolla about thirty minutes from San Diego. This place has beautiful views. We enjoyed watching the gliders going off the cliffs over the ocean. You can buy something here to eat from the snach bar or bring a picnic basket. You way want to walk down the cliffs to view the ocean from the beach and watch the whales. (We seen three)Also be on the look out for nude bathers What A Surprise. Better be in good shape to walk down because it's alot harder coming back up. Stan H.\nShow less"], ["Reviewed March 7, 2017", 4.0, "Great views", "There's a small snack bar, and you can certainly bring your own picnic as there are plenty of tables. You can see a lot of interesting coast line here. Only one guy flying his plane today, I would think there might be a website to see if there are any events. Big parking lot, we had no problem on a weekday morning, not sure about weekends. Have sturdy nonslip footwear if you want to walk out over the rocks but there are plenty of views without doing that. The walk up to the overlook is a dirt trail.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Fascinating and Fun!", "Not really an attraction in the classical sense, but great fun if you have an hour or more to spend watching these talented folks take off, fly and land. If not visiting in the summer, bring a sweatshirt of jacket. The breeze carries quite a chill. Plenty of room to bring a picnic basket. Parking can be a bit of a challenge.\nShow less"], ["Reviewed March 3, 2017", 5.0, "Relaxing Viewing", "Watched individuals gliding around on a gorgeous early March afternoon. No charge to watch. Crowded parking area."], ["Reviewed March 3, 2017", 5.0, "Very cool", "It is quite a sight to see the gliders soaring out over the cliffs and ocean! The view is beautiful and there are paths to walk and hike on. There are many spectators and there is a convenient parking lot that is available. If you are adventurous enough to participate in gliding, you can do a tandem or single but FYI it is pricey.\nShow less"], ["Reviewed February 26, 2017", 5.0, "Marvelous Views, Great Hike", "One of our favorite places in San Diego. We love to watch the gliders take off over the cliffs. You can do a tandem if you wish. There is also a great hike down to the beach near the Gliderport. They have beefed it up recently and the steps are much safer and easier to make. Of course then, you have to come back up. But worth it.\nShow less"], ["Reviewed February 23, 2017", 5.0, "An Unusual and Interesting Attraction", "My wife and I went to visit to do something different and unusual. We went on a cool and changeable weather day, yet the parking lot was pretty full and there were about 30-40 spectators and 20 or so paragliders. It was really interesting to see the paragliders prepping for their launches, taking their steps off the cliff, and stick their landings. Very relaxing, with abundant colorful photo ops as you watch them glide silently all about. Highly recommended.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Most memorable sightseeing in La Jolla", "We went to the Gliderport to see the sunset, which was magnificent with the entire La Jolla shorelines in the view. We got there early enough to see several paragliders - for the first time. The colorful paragliders flying above the vast shoreline was truly amazing.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Fun to watch!", "Noticed the gliders in the distance and drove over to watch. Very fun to want watch! Can rent or go with an instructor"], ["Reviewed February 19, 2017", 4.0, "Awesome gliders", "We found this gliderpoint by mistake. We were driving around and happen to pull in. The day we were there, there were not a lot of people. We could walk almost up to the cliff and have a front row view of the gliders. They were swooping up and down over the cliffs. It was very quite, and sometimes you could hear them before you could see them.\nShow less"], ["Reviewed February 18, 2017", 5.0, "Good views, beautiful gliders", "We stopped by this place on the way to another. Nice views. They offer glider rides to anyone. Ride is about 25 mins, but overall takes about an hour including the prep and paperwork. We were too late to try this time but will be back again.\nShow less"], ["Reviewed February 11, 2017", 4.0, "Wow!", "A must see. Wish I was brave enough to give it a go. Spectacular views and nearby walking trail as well as watching the arial activities."], ["Reviewed February 5, 2017", 5.0, "JUST DO IT!!!!!!!!!!!!!!! WORTH IT !", "OH HECK YES! I was just going with a friend ... but it was such a beautiful day I decided to Paraglide ... FANTASTIC !! All the folks are professional and friendly , there to help you~ Go ahead and get the Video and pics!! The was hardly any wait time ... the the flight was ..... just WOW!!!!!!\nShow less"], ["Reviewed January 30, 2017", 5.0, "Something New to See", "Went here by accident when looking for a sandwich near La Jolla. The little sandwich shop was delicious and got to watch people gliding. Really neat to see something like this. Didn't actually try it - quite expensive, but cool to watch while enjoying a sandwich on the cliffs. Quick walk down to the beach, too.\nShow less"], ["Reviewed January 23, 2017", 5.0, "Watch the sunset!", "Rated one of the best places in La Jolla to watch the sunset, my husband and I went to the gilder port to soak in the vibrant colors of the passing of the day. There was great energy, plenty of space, and free parking."], ["Reviewed January 18, 2017", 5.0, "Amazing experience for Hubby. But fun to just watch also.", "I gave my hubby a hang gliding experience as a gift. We have gone here many times and even if you are not wanting to jump off a cliff :) it is still a great stop for locals and tourists alike.\nThere are a few options if you would like to go out, they take their time and make sure it is safe and fun. Hubby was out for what seemed like forever, probably closer to half an hour. BUT enough time I stopped taking pics. There is also a cafe for quick eats if you would like. Lots of places to sit and watch. Parking is not great and the bathroom situation is porta potties yuck. but the over all experience is a must do. Not just for the experience but the scenery as well. Hubby went over Torrey Pines golf course as well a down the shore and across the water.\nShow less"], ["Reviewed January 17, 2017", 5.0, "On my list of \"Must Dos\" for La Jolla visitors", "(And pretty great for locals too)\n\nI have been lucky enough to travel extensively, and there really isn't another place like our beautiful gliderport.\n\nThis is a wonderful place to come when you just want to relax and watch the amazing parasails and gliders swoop off the cliffs and float over the ocean.\n\nThe views are stunning and it's a perfect picnic spot (bring your own or buy there)\n\nIt's one of the best free things to do in San Diego.\n\nA few tips:\n\nI typically go on weekdays- weekends may be crowded\n\nUse the facilities before you visit- no bathrooms!\n\nIf you are braver than I am you can actually pay for a tandem flight (no experience necessary)\n\nThis is a great combo with Torrey Pines State Park\n\nShow less"], ["Reviewed January 17, 2017", 5.0, "great place for kids and adults", "Brought out of town family here and the kids loved it. Watching the gliders launch from the cliff is always amazing, then watching them maneuver along the coast is so relaxing. The view is picturesque and should be enjoyed by all. Makes a great back drop for any photo. We sit on top to get a birds eye view of the area and brought our snacks and drinks to enjoy. There's a small cafe on site but with limited items and also some what pricey. Just remember to clean up after yourself and leave it presentable for the next person. No restrooms only porta potty.\nShow less"], ["Reviewed January 15, 2017", 5.0, "Wow", "I saw some of the most breath taking gliders.Awsome views of the ocean and people enjoying the opportunity of a life time."], ["Reviewed January 12, 2017", 4.0, "Fun for a short visit", "We don't glide and we only stopped here for a short visit. It is beautiful and exciting to watch the gliders launch and return for landings. Incredible ocean view. Stop by to watch for a few minutes if you're in the area. It is free to watch, lots of free parking.\nShow less"], ["Reviewed January 6, 2017", 5.0, "Great stop for anyone visiting La Jolla", "Where else can you sit on a beautiful cliff and watch hang gliders, RC glider operators, and other crazy people jump off of a perfectly good cliff?"], ["Reviewed January 5, 2017", 3.0, "If you haven't seen it once, you really should.", "Yes, there are great views. Yes, it's fun to watch the gliders soar off the cliff. But there's not much to keep you busy for more than 15-30 minutes unless you're going to do a glider flight. It was fun to see, and if you haven't been there you should go. I've seen it now, it was cool, and next time I'll explore somewhere else.\nShow less"], ["Reviewed January 4, 2017", 5.0, "Cliff views", "I did not go for the gliderport activities. I went for the cliff view - awesome. There are many, many steps to get you down to the shoreline. Many people surf here too."], ["Reviewed January 4, 2017", 5.0, "Beautiful view, great place to see gliders", "Great scenery, kids enjoyed viewing the gliders, there's a path to the beach below and an observation point. highly recommended stop."], ["Reviewed January 3, 2017", 5.0, "Cannot beat the view!", "Love Torrey Pines. I visited before, but the gliders weren't flying due to the wind conditions. Traveled back last week and got lucky. Great photo opportunities !"], ["Reviewed January 1, 2017", 5.0, "Incredible views", "We really enjoyed the Gliderport. The parking lot is dirt and you do have to walk over quite a bit of dirt to get to the viewing area. When we went, there were a ton of gliders out. Excellent view of the coast. There is also a long stairway / walk down to beach access. Probably 1000 feet drop though, so be aware it's not for the faint of heart.\nShow less"], ["Reviewed December 31, 2016", 4.0, "Fun free clean fun", "When we were driving the coast we came upon this gem! Take a look over the edge of the cliffs. The gliders look crazy. The ones we were watching just missing the crows flying around.\nIt had just rained, the parking lot was a little bumpy.\nShow less"], ["Reviewed December 29, 2016", 4.0, "Access To The Beach, Cliff Views", "We had first driven to the Torrey Pines Nature Park but the lines were crazy and we would have had to park quite a ways from the entrance.\n\nLuckily, we were given information by a local that by going to the Gliderport we could access the beach -- at the bottom turn right and it's 2 miles to Torrey Pines. It's all the same scenery but you avoid the crazy parking and line ups. A great tip.\n\nWe walked the beach for quite a while and had a picnic lunch on the beach. A great way to spend a sunny day. And we didn't have to pay any entrance fee and parking was easy.\n\nI'd suggest this over Torrey Pines if you're looking for the beach and cliff views.\n\nPS: The Gliderport address is 2800 Torry Pines Scenic Drive\n\nPSS: Be aware the beach as access from the Gliderport is clothes optional so if you go, you'll see some free spirits walking the beach nude.\nShow less"], ["Reviewed December 20, 2016", 5.0, "Beautiful bluffs", "Beautiful view of the ocean from bluffs. Very peaceful location. Not a lot of glider activities going on when we were there but great views!"], ["Reviewed December 17, 2016", 5.0, "Fun walk and watching", "Great place to visit on a sun shinning windy day. They seem to be everywhere and 99% of the flyers know what they are doing so its entertaining as heck. Its a ncie walk too from Hotel Estancia which is 5 Star all the way."], ["Reviewed December 14, 2016", 5.0, "Spoiler alert, I'm a pilot.", "The Torrey Pines Gliderport, or \"Torrey\" as its known is a true gem. It is the only gliderport in the middle of a big city anywhere in the US. Not only that the view is stunning. The fact that it is there has helped keep that land un-built since WWII when the area was camp Roberts. In addition it has a rich aviation history including the Lindberghs. It is the most heavily utilized site in all of San Diego, both for its scenery and convenience. Go take a tandem instructional flight, it's an amazing opportunity.\nShow less"], ["Reviewed December 8, 2016", 5.0, "Wow; Torrey Pines gliderport", "Visiting relatives wanted to see the gliders. My husband and I had not been to Gliderport. We are so glad we went. What fun. The gliders are colorful and a delight to watch gliding over the ocean."], ["Reviewed December 7, 2016", 5.0, "Great place for hang-gliders and also dramatic coastline", "Beautiful spot but beware of dangerous cliffs. There is a lot of erosion so the cliffs can be dangerous. There are plenty of warning signs so respect those. The view is stunning, strongly recommended"], ["Reviewed December 2, 2016", 4.0, "Fascinating", "On our way to San Diego we stopped here to see what it was all about. We did not participate but just watched and were fascinated by the take-off and landing process. Beautiful location. If you have an extra 30 minutes or so, stop by and take it in\nShow less"], ["Reviewed November 27, 2016", 5.0, "What an afternoon", "What a great afternoon of watching paragliders and hang gliders take off into the wind coming off the ocean. The cliffs and views are amazing. Watching the skill of those pilots was truly awe inspiring. It's a great place to take a picnic lunch to enjoy the spectacular views and watch the paragliders. You can also get snacks and sandwiches at the Torrey Pines Gliderport Cafe. Definately a great way to spend an afternoon in La Jolla.\nShow less"], ["Reviewed November 22, 2016", 4.0, "No flying that day, but still nice", "What a cool thing to have for seaside cliffs! Too bad that while I was there, no one launched or flew off the cliffs. Instead, we parked our low-riding convertible in the large, free dirt lot (since nothing was going on, the lot had plenty of availability) and enjoyed the cliffside scenery. Below looked to have great surfing waves, so we decided to hike the sandy trail down 460 ft to the beach for some better views. Amid neoprene-clad surfers, we also discovered that this particular beach was clothing-optional. That didn’t bother us, but we didn’t stay long as the sand itself isn’t the nicest nor softest in the world, and the sun was glaring hot that day. The ascent to the top is steep, but I thought it was actually easier than descending because you’re fighting gravity rather than bargaining with it and hoping not to slip on the ball-bearing-like sand.\n\nThere are warning signs all over the area to keep you safe since it is an active aviation facility perched on unstable land. There is a little café with a patio and umbrellas, but we didn’t eat or use the facilities.\n\nIf I’m ever in the area when the winds are favorable, I’d return.\nShow less"], ["Reviewed November 21, 2016", 5.0, "Don't miss this spectacular haven in the midst of billion dollar biotechs and hotels!", "Still the ramshackle hang glider port dating back to the 1930s, way before all the insane development along Torrey Pines that has nearly shut off access to all but the super-rich. The views of the water and the coast are unbeatable, and you can just sit and watch the lovely hang gliders launch and float effortlessly along the bluffs. Parking is free!!\nShow less"], ["Reviewed November 20, 2016", 5.0, "Great to watch", "A pleasant couple of hours watching the paragliders, and tandem paragliders, with some great views thrown in, and a added bonus, they do great sandwiches and coffee."], ["Reviewed November 20, 2016", 1.0, "Please read before you go", "Please read! This is what u need to know before u try this. U need to carry about 40 pounds equipments if the pilot landed on the beach and walk up the cliff! The path is about 30 mins. When I talk to the owner to have him located where in the waiver says we need to be able to carry that weight and he said u don't have to if u don't want to, but I was just provided the bag and the pilot told me \"u take this\" the owner Robin told me \"I don't need to tell u to go pee before you need to go\" extremely rude too. Basically you are paying ur life to help them make money!\nShow less"], ["Reviewed November 19, 2016", 5.0, "Great Views and fun", "We wnt to see the View and were not dissapointed. Had a drink and wated the activities. Long way to the Beech!!!"], ["Reviewed November 18, 2016", 4.0, "Terrible parking lot, beautiful area", "Although there was no one in the sky the morning we visited, we did get to see the beautiful area and lots of people heading down to the beach for the day."], ["Reviewed November 14, 2016", 3.0, "Great Fun, Terrible Parking", "We visit the gliderport every time we visit San Diego. It is on our top ten \"must do\" list. The only downside is parking. Look up Torrey Pines City Park on your Google or Apple Maps app, and park anywhere on the street as you approach the gliderport. The parking lot is dirt and full or ruts. You may/will get stuck behind someone who is waiting in vain for a parking spot to open up. It happens all the time.\n\nThe gliderport is great fun once you get there. This is a hoot for kids and adults alike.\nShow less"], ["Reviewed November 13, 2016", 3.0, "They are not very organized", "My friend is taking a class at the glider port school and the teacher is never on time. They are very disorganized. I had lunch at the little burger joint and it was pretty good!"], ["Reviewed November 8, 2016", 4.0, "Beautiful", "The Gliderport is such a beautiful place. The ocean, the sky, the sun usually, some breeze, some surfers down in the water and, last but very certainly not least, the exhilarating spectacle of watching the gliders take off and whirl around catching the thermals. Spectacular."], ["Reviewed November 1, 2016", 5.0, "Where else can you see this!", "Whenever we have out of town visitors, we always take them here. It is awesome watching the guys take off and land their gliders."], ["Reviewed November 1, 2016", 5.0, "Different", "The Torrey Pines glider port is always on my scenic route of places to visit around San Diego when I have family and friends in town. It's a unique thing to see and the views of the ocean and Torrey Pines golf course are a plus.\nShow less"], ["Reviewed October 28, 2016", 2.0, "nude beach", "We were told if you want to get away from crowds to go to this beach. You have to walk down the cliff to the beach and once we got down there we were surprised that it was a nude beach. It's a very hard walk going back up the cliff. I wish we would of just went to La Jolla instead. The hang gliders were not going because there wasn't enough wind that day.\nShow less"], ["Reviewed October 23, 2016", 4.0, "Beautiful Views", "We were there without much wind so the gliders and parasailors were not flying. Great for people watching and ocean views. 600 feet above the surf."], ["Reviewed October 22, 2016", 4.0, "Fun on a windy day", "Nice place to stop for a snack or lunch and watch the gliders . Fun to watch the people who do tandem with a pilot for the first time."], ["Reviewed October 20, 2016", 4.0, "Amazing View", "We had a great time. Took our dinner there and just enjoyed the scenery. The gliders were done for the day but we were able to see some dolphins or whales out in the ocean."], ["Reviewed October 11, 2016", 5.0, "Fun place", "Whether you are participating or watching, it is great fun to observe these gliders in the air. Beautiful location overlooking the pacific. You can go down the steps, but we didn't have time. Very relaxing."], ["Reviewed October 8, 2016", 4.0, "Gliders!", "One of our favorite spots! Incredible views whether or not the gliders are up! Nice spot to sit and watch or enjoy a snack. There's a manageable stairway and 10 minute hike to Black's Beach below. Lessons and tandem rides available."], ["Reviewed October 7, 2016", 5.0, "Boy, that's quite a drop!", "This is a great tourist spot, just North of La Jolla and the wondrous Mt Soledad. The gliderport is a huge area. For flat-landers from Kansas or Texas, this destination has an unbelievable cliff view facing the Pacific Ocean. There is a goat trail which can lead visitors down the several-hundred foot cliff face to the former nude beach called Black's. Great surfing at Black's on most swell directions. The Rainbow People used to maintain the goat trail on every Full Moon, as they used to have drum circles there on those evenings. I'm not sure if that still happens.\nWarning if you do venture down to Black's, the bluff collapses are real. I have almost been killed there by a bluff collapse. Someone carved the huge stone which almost fell on us into Radharani, the Monkey King of Indian Lore. The sea claimed it eventually. So, don't walk or sit directly next to the cliff.\nThe gliders and all sorts of other dangerous thrill seeking parachute gizmos are entertaining to watch, especially on windy days. Sunsets from this spot can capture the mystical \"Green Flash\" for lucky visitors. This is a great spot for a picnic basket and a good date. It can get chilly and breezy, so have a jacket handy.\nShow less"], ["Reviewed October 7, 2016", 5.0, "Sunset at Torrey Pines--Amazing!", "What a perfect way to end the day with our little one, a nice walk on the beach and an unbelievable Sunset!!"], ["Reviewed October 5, 2016", 5.0, "Very special", "If you are visiting la Jolla stop by this place. Beautiful view Very short walk I donot know how many spots like this in the US. You can cover it in less than 45 minutes"], ["Reviewed October 4, 2016", 5.0, "So. Cool.", "I went today for my tandem paragliding adventure. It was incredible! I may have the name wrong, but I believe my instructor was J.C.? My instructor was so awesome. I really wasn't nervous before or going up (like I thought I would be) but in the air I felt a little nervous. My instructor made me feel 100% at ease. After I felt settled & he asked if I get naseous (& I said no) he started doing some really awesome moves. I felt like I was on a roller coaster. So awesome. The views are insane & it is unreal to soar above the cliffs and ocean. Also, I was told there would be a wait as 4 other people were ahead of me. I think I was in the air within 15 minutes! Highly recommend this!\nShow less"], ["Reviewed October 4, 2016", 4.0, "These guys are crazy!", "The guys flying the paragliders must be really good at flying these things. They make it look so easy and effortless. Still I cant work up the nerve to jump off a cliff even with the paraglider."], ["Reviewed October 3, 2016", 4.0, "Awesome Way to See the Views and Watch the Gliders over the Ocean", "We just went to watch but certainly will give it a try next time were in the La Jolla Area. Cost is $175.00 per person but looks like a once in a lifetime experience."], ["Reviewed October 1, 2016", 4.0, "Fun to watch!", "A fun place to watch all the paragliders and hang gliders. There is a refreshment stand, porta potties and large parking lot for parking. The view from the cliffs was awesome. We watched the gliders for quite some time from the patio that has picnic tables and umbrellas.\nShow less"], ["Reviewed September 25, 2016", 4.0, "Fun to watch", "The view from the glider port is spectacular!\nI have been here multiple times. Twice I waited to take a tantrum flight to not avail. These type of activities focus on safety so it is hit and miss based on mother nature and what her winds are doing. I will try again when I have a couple to 3 hours to invest.\nShow less"], ["Reviewed September 25, 2016", 5.0, "Amazing!!!!", "I went there with my wife to watch gliders and enjoy the cliffs. It is to access the airport and watching the surfer above the ocean with the scenery view is an enjoyable experience."], ["Reviewed September 24, 2016", 3.0, "Awesome to watch glider dudes", "Beautiful place easy to get nice place great place beautiful area lots of scenic views etc not sure what else to say went there along time ago watch glider people take off over the cliffs into on top of the ocean"], ["Reviewed September 24, 2016", 5.0, "Ride of a lifetime!", "I highly recommend taking a flight at the Gliderport, it was the thrill of my trip!\nThe food at the Cliffhanger Cafe is excellent and the price is more than reasonable.\nA great place to just hang out and eat lunch and watch the gliders even if you don't take to the skies like I did,,,\nShow less"], ["Reviewed September 24, 2016", 5.0, "Peaceful & Beautiful", "What a beautiful place to just relax and appreciate the beauty. We go there and sit on there elevated patio and watch experienced glider or watch the trill of people going for their first time. The views are breathtaking...... You can buy a drink or sandwich and just relax and take in the beauty. Don't miss this Free experience in La Jolla...\nShow less"], ["Reviewed September 21, 2016", 5.0, "Beautiful Views and fun to Glide", "This place is a great place to just sit and watch the gliders soar through the air and land. Also a great place to enjoy the beautiful ocean views. We have tried the tandum glider and what an amazing adventure it was. Just being able to glide over the ocean was beautiful. It's not cheap, but if you can splurge then it is worth putting it on your bucket list. When my daughter was 5 years old she tried it too and LOVED it. You can also walk down the cliffs, but if you go to the bottom you run into Blacks Beach which is a nude beach so don't bring the kids to the bottom or they will get an eye full. We found that out the hard way.\nShow less"], ["Reviewed September 19, 2016", 5.0, "Amazing views", "If you are crazy enough to jump off a cliff...go for it. If NOT, just sit on the deck and watch the fun and enjoy the incredibly view of cliffs and ocean."]]}}