{"Tunnel View": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Tunnel View", "url": "/Attraction_Review-g61000-d593212-Reviews-Tunnel_View-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/1e/9c/f4/view-after-snow.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "5.0", "reviewCount": "2530"}, "address": {"@type": "PostalAddress", "streetAddress": "Wawona Road", "addressLocality": "", "addressRegion": "California", "postalCode": "95389", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 3.0, "Gunshow guru", "Beautiful drive ! Careful of slow and inconsiderate drivers ! Long drive ! Very scenic view ! Pack a lunch"], ["Reviewed 1 week ago", 5.0, "What a View!!!!", "Well this is where the journey of Yosemite begins. The views from here are just totally amazing. From here look forward to a breathtaking day of wonderful scenery and landscapes. Going to Yosemite was totally wonderful and definitely worth it."], ["Reviewed 1 week ago", 5.0, "Close to Artists Point", "OK, Tunnel View was nice, but even better? We hiked up to Inspiration point which was okay, but on the way down found Artists point which was spectacular and worth your effort to find. (It's located on the trail between Tunnel view & Bridal Veil falls)\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Drive to photo leave boring and unimpressed", "Title says it all. Unimpressed. For uncultured people probably great.... for well traveled it is. A half day trip. Better things to do and see"], ["Reviewed 3 weeks ago", 5.0, "Classic stop to take a scenic picture", "A classic stop you must take if it's your first time visiting Yosemite. You get a great view of The Valley! And its a perfect photo opportunity. This place is very popular, so expect to see many people taking pictures, and many parked cars as well.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Breathtaking", "One of the many amazing views in Yosemite. Easy to get to, as it is right off the side of the road. A great stop for those who may not be able to venture far due to mobility issues."], ["Reviewed 4 weeks ago", 5.0, "Amazing!", "I arrived at my hotel in Fish Camp one evening. Overnight it snowed 8\" in Fish Camp, less at Tunnel View and even less in the valley. But everything was a beautiful white along with a beautiful clear blue sky!\n\nDefinitely a place to stop for pictures when you're in the Yosemite Valley!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Vacation with sister", "Beautiful area with some of the most fantastic views and scenery that I have ever witnessed!! If you have never been it is a definite must on your bucket list!!!"], ["Reviewed January 22, 2018", 5.0, "Stunning View", "What a stunning view! The tunnel leading up to tunnel view is a long one; so if you are like my husband and I and hold your breath while driving through tunnels prepare for a challenge. This was our favorite vista point in the entire park. We did not get a chance to go up to a couple other places because the roads were closed on MLK day.\nShow less"], ["Reviewed January 18, 2018", 5.0, "A must for any visit to Yosemite!", "This is an amazing view in and of itself, but at sunset.... wow!\nThis was on my itinerary thanks to other reviewers and it was the perfect ending to a long day of exploring in Yosemite.\nIf you have a car, you can drive here, but keep in mind there are limited parking spots.\n\nHighly recommended!\nShow less"], ["Reviewed January 14, 2018", 5.0, "Ever Changing View", "This is a stunning view that everyone can take advantage of regardless of physical abilities. The view changes throughout the day and with the weather. It is ever changing and one should take advantage of this and visit several times throughout your visit. I always enjoy early mornings and dusk especially when there is a low fog hovering in the valley.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Love at First Sight!", "At any time of year whether this is your 1st or 100th glance of Yosemite Valley, it is always the most moving view you will have of this magical place on earch!"], ["Reviewed January 9, 2018", 5.0, "Best View of the Valley!", "This stop has the best view of the Valley. We stopped here in both the morning and the afternoon to get the different perspectives with the Sun."], ["Reviewed January 9, 2018", 5.0, "The most amazing view of this NP", "It was our most liked place of Yosemitte NP. Easy accesible by car and no need to go anywhere, just enjoy the wonderful view of this valley."], ["Reviewed January 8, 2018", 5.0, "Excellent viewpoint of the highlights of Yosemite", "I've seen this view on my Macbooks before but the photos can never give justice to actually seeing it in person. It's a must-see if visiting Yosemite."], ["Reviewed January 6, 2018", 5.0, "What a view!", "This is the place to be as sun sets. Because of the orientation of the mountains, the setting sun throws a glow on part of the view, keeping the other part in the shadows, like no other view we had ever seen. There were professional photographers at the location trying to get a perfectionist picture. Stunning overlook and the sunset, a real experience. If you can time it right, it may well be one of the highlights of your visit!\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great views with patience", "Yosemite was zooey with visitors. Driving required diligence and patience, but well worth the wonderful views and scenery."], ["Reviewed January 2, 2018", 5.0, "Wow!!!", "This place is mesmerizing! It is worthy of a #nofilterneeded. We have been to Yosemite numerous times, with friends, and family members. We always make sure that we stop at Tunnel View because everyone is always in awe! One can usually see both Yosemite Falls and Bridalveil Fall from Tunnel View.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Another Great View", "Tunnel View is another place with a great view of Yosemite Valley. Having hiked all the way down from Glacier Point to Tunnel View allowed us to begin with a great view and end with a great view. It can be a pretty busy place, but we were easily able to see the view and take photos.\nShow less"], ["Reviewed December 29, 2017", 5.0, "Magical", "Everyone should experience the awesomeness that is Yosemite at least once in their life. The view was just beautiful."], ["Reviewed December 27, 2017", 5.0, "beyond words", "I was saying, before we came through the tunnel onto this view that these mountains were not really as pretty as The Blue Ridge in Virginia. Then, as we came out of the tunnel, I all but gasped, as this view is simply one of the great sights in all of nature...a bucket list place, for sure.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Place to end the tour", "At the end of the day I suggest you to drive up the hill to the Tunnel View. The most interesting about it is the view, of course, but during sunset it is better.\nRemember that it can get crowded so there might not be enough parking place.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Amazing views.", "Great for photographers this overlooks some of Yosemites best features and landmarks. A must stop for anyone visiting here. Even looking back at the tunnel is amazing... we even saw a deer!!!"], ["Reviewed December 21, 2017", 5.0, "The best spot to view the entire Yosemite Valley", "Wonderful view of Yosemite Valley all year around. A must for anyone visiting Yosemite. A short drive from the valley floor."], ["Reviewed December 21, 2017", 5.0, "Nearly a Walt Disney moment each time I pass through the tunnel", "Nearly a Walt Disney moment each time I pass through the tunnel. I have visited the Yosemite Valley many times. Yet it is still exciting to reach the tunnel knowing in moments I will have a spectacular view, unique only to Yosemite. It remains a Disney moment, slightly unreal and fabricated. Exciting every time.\nShow less"], ["Reviewed December 13, 2017", 5.0, "Iconic view", "This is the defining iconic view of Yosemite National Park and is what instantly springs to mind when people mention Yosemite.\n\nIt's a popular spot and gets quite packed as all the tour buses stop here and parking is limited.\n\nThis location was the number one reason why I wanted to visit Yosemite and it did not disappoint.\n\nAbsolute must see!\nShow less"], ["Reviewed December 13, 2017", 5.0, "Try to come twice", "Stop here at least once for goodness sake! This is the utterly iconic view of an unreal valley. It will always be busy. We came late evening to see the sunset and early morning to see the sunrise; both times with plenty of other tourists but not so crowded that we couldn’t get a spot in the car park. The different light of evening and morning were both magical but if I had to choose just one it would be afternoon/evening when the sun is illuminating the valley from the West. If you’re coming East into the valley on the Wawona road be prepared to turn quickly into the parking when you exit the tunnel. There are lots on both sides of the road.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Gorgeous", "This is one of the essential viewpoints in Yosemite National Park. This is first significant place to stop for photos."], ["Reviewed December 9, 2017", 5.0, "worth a stop", "Definitely stop off here to orient yourself on the way in and/or to grab some amazing photos on the way in or out of Yosemite. Breathtaking"], ["Reviewed December 9, 2017", 4.0, "The Classic Tunnel View of Yosemite!", "We visited back in May.\nAlthough it is a classic viewpoint for its breath taking view, right behind every photo (literally) there’s a lot of traffic of cars, buses and tourists.\n\nTo enjoy the view away from the commotion, hike up to Artist Point! The trail starts across the street in the other parking lot. It is about a 2 mile round trip hike.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Most beautiful point in Yosemite", "Spending time here was surreal. The outstanding viewpoint is a MUST stop. I would pack a picnic and just take it in if you have time."], ["Reviewed December 2, 2017", 5.0, "The classic Yosemite Park photo point.", "The classic Yosemite Park photo point. Be careful getting in, there are many people on foot not really minding the traffic."], ["Reviewed December 2, 2017", 5.0, "A near miss", "If you're coming through the tunnel and not paying full attention to the views and being a super careful driver; you might miss what may be the most beautiful view I have ever seen.\n\nWe missed it on our first drive through the park but on our return from the camp site the next morning we passed it from the other direction and my god; I am so glad we did.\n\nIt's iconic, let's face it; every google image of \"Yosemite\" will bring this place up but my lord, photos do NOT do this view justice. You are captivated and memorized from the moment you approach the little wall and view on. It is magical.\n\nI've traveled a fair bit across the US and around the world and this is the most spectacular view I have ever seen in my life, it stunned me.\nShow less"], ["Reviewed November 27, 2017", 4.0, "Classic view of Yosemite", "This is the classic picture postcard view of Yosemite, and amazing any time of year. Parking can get crowded, everyone coming in from Hwy 41 stops here right after the tunnel."], ["Reviewed November 26, 2017", 5.0, "The to die for preview view of the Yosemite Valley", "A must stop on your visit to Yosemite Valley. You come out of a tunnel and there it is...a view of a lifetime. Do it!!!"], ["Reviewed November 26, 2017", 5.0, "Vista/Lookout Point", "This is the first real place to stop and view the valley from above. Get there at sunrise for some amazing views and to avoid crowds.\nThis isn't really a place to start your hike, just a place to marvel at the wonder that is Yosemite.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Definitely a must stop", "This is a must stop spot in Yosemite, the views of El Capitan and Half Dome and wonderful! Easy parking and plenty of space to walk to get the shot you want."], ["Reviewed November 25, 2017", 5.0, "Need more time", "I didn’t plan this trip but if I did I would have spent more time here! It’s beautiful I wanted to hike and see everything however when visiting places we were short on time. Small park fee to enter."], ["Reviewed November 21, 2017", 5.0, "Easy access to amazing view of the famous Yosemite sites from one place.", "This place can be crowded with tour buses, but what a view. What is nice is that if you have limited mobility, you park here and get out and have a beautiful view. We came several times during our stay and it looked different each time depending on the clouds and rain. Didn't know, but that would have been even better.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Excellent place for pictures", "A great place for getting the full impact of the majesty of Yosemite and some great pictures. We stopped here during our tour of the valley. You can get some great pictures within 15 to 30 minutes."], ["Reviewed November 17, 2017", 5.0, "view is stunning", "We ate lunch here one day and ended here with the Pohona Trail (and got to see sunset). Amazing view of the valley with both El Capitan and Half Dome. Well worth a visit"], ["Reviewed November 15, 2017", 4.0, "What a scenery!!", "It's on the road, you have to stop and watch and enjoy this amazing view. One big minus: it's very crowed, so you have to be patient to enjoy the great scenery."], ["Reviewed November 13, 2017", 5.0, "Asume views", "It's hard to imagine the beauty of the views from this vista point. Looks back into the Valley towards Half Dome. A nust see area!"], ["Reviewed November 13, 2017", 4.0, "Incredible view", "If you only have a day in YNP go to tunnel view; there are several walks from here, but simply stunning views"], ["Reviewed November 10, 2017", 5.0, "Fall 2017", "The views from here were picture perfect!! From all directions it was nature at its best!! Even found some mistletoe in some trees!! Had to get a selfie with my honey!!"], ["Reviewed November 10, 2017", 5.0, "Breathtaking views", "Tunnel View is on the way to Glacier Point next to the tunnel. You see El Capitan on the left, and Bridal Veil Falls to the right. Unfortunately, to the back of this view, you get the silhouette of this summer's massive fires."], ["Reviewed November 9, 2017", 5.0, "Tunnel View", "We didn't have a car when we went to Yosemite and the only way we can see this was joining the Valley tour and it was worth the price."], ["Reviewed November 9, 2017", 5.0, "The classic Yosemite National Park view", "This is the place to get that view into the valley with El Capitan on the left and the valley stretching out in front of you from elevation. (You can hike higher, but the view from the parking area is great.)"], ["Reviewed November 9, 2017", 5.0, "WOW!", "as you come out of the tunnel to the valley, pull over to the left or right to park. the view is outstanding!"], ["Reviewed November 8, 2017", 5.0, "Gorgeous. Must stop.", "Worth the extra stop for beautiful photographs and a serene view to meditate on. Lots of tourists, though in mid-day when I went!!"], ["Reviewed October 31, 2017", 5.0, "Impressive is an Understatement", "If you enter the Yosemite Valley on the Wawona road (south entrance) you will go through this famous tunnel. As you come out of the tunnel the panoramic view of the Yosemite Valley greets you. There is a large parking area immediately at the tunnel exit and, assuming you can find a place to park, it is a great place to stop, take in the experience and most likely take a lot of pictures. Before you even get to the tunnel on this road there is another vantage point with a large parking area that give you a similar panorama; higher but a bit further away. Both views are pretty amazing and will, I expect, be a highlight of your visit to Yosemite Valley.\nShow less"], ["Reviewed October 30, 2017", 5.0, "Exquisite View", "This is one of the most beautiful views I've ever seen in a park. Here you can see El Capitan, Half Dome and Bridal Vail Falls in one shot. Plus more beautiful vistas. If in the park definitely don't miss it."], ["Reviewed October 30, 2017", 4.0, "A must stop", "Yosemite National Park has been on my travel wish list for years. We decided to visit as part of a large road-trip, so only had the one day to explore. Thanks to articles on here – we discovered that Tunnel View was one of the top rated attractions. It's a wonderful spot for a photo opportunity of all the favourites – El Capitan, Half Dome and Bridal Falls. We visited in August and I was surprised that we didn't have to wait for a parking spot.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Great view of the park", "See El Capitan Half dome and some of the falls from one point of view. A great look straight threw the valley. You only need about 30 minutes here and the parking lot is small so try and hop on the bus. But worth it a great view\nShow less"], ["Reviewed October 28, 2017", 5.0, "Impressive", "This is the view of Yosemite that most of us have seen in pictures. It is so impressive to come through the tunnel and actually see it. It is something so beautiful and majestic that it is hard to find the words to describe it. It has to be on your must see list. We spent time enjoying the view and taking pictures and drove back later in the day to see it in a different light.\nShow less"], ["Reviewed October 25, 2017", 5.0, "Must see", "How could you miss this! Anyone you ask or any research you do tunnel view is in top3 things to do! We visited couple times but I definitely recommend to stop by and see the stars from here at night! It was absolutely amazing!!"], ["Reviewed October 25, 2017", 4.0, "A must see.", "This one on the finest views in the world. Very impressive. A tip,however, is to visit late in the morning or later. Earlier there is a haze in the valley until about 11 AM."], ["Reviewed October 24, 2017", 4.0, "Great view, but not by far the best Yosemite can offer", "The tunnel view is a great view point, especially if you are coming from the south side of the tunnel.\n\nAll though, if you have been or going to be in Yosemite for a while, this isn't the best it can offer. By far. On the plus side it's easy accessible, all though with very limited parking options (the place is crowded). But people doesn't stay for more than a 5-10 minutes, so the waiting time for a parking spot shouldn't be that long.\n\nIf you are looking to drive to a great view point. Head over to Glacier Point instead. :)\nShow less"], ["Reviewed October 23, 2017", 4.0, "Beautiful", "Just coming either off or into the tunnel, the car park is right there. We came in the evening and again in the morning. The morning has a beautiful mist, fog or low clouds hanging around the valley which makes for a lovely photo."], ["Reviewed October 23, 2017", 5.0, "no words", "This is one majestic view. Really breathtaking and incredible. We pulled off the road after going through the tunnel. There is parking space, but it is small."], ["Reviewed October 22, 2017", 5.0, "Classic View of Yosemite Valley", "We drove right to Tunnel View after entering the park on 9/13/17 and came back again for early evening light on another day. Situated at the extreme western end of Yosemite Valley, it provides a classic breathtaking panorama looking east toward El Capitan, Half Dome and Bridal Veil Falls. TIPS: 1) The lighting for dramatic photos is best in early morning to catch fog or late afternoon and 1-1 ½ hr. before sunset. 2) Telephoto and tripod can be put to advantage here. 3) There is a trail starting in the parking lot across the road that can be used to get photos from a higher perspective.\nDid this review earn a “Thankful” vote?\nShow less"], ["Reviewed October 20, 2017", 5.0, "Visit it!", "Crowded but worth the drive! It is very beautiful to see the valley and the mountains when the sun is setting so that the sun enlightens the valley, so go there after your hike/visit."], ["Reviewed October 19, 2017", 5.0, "A wonderful view of the Yosemite Valley.", "If you don't have the time or inclination for the hour-long drive to Glacier Point (or if the road is closed),this viewpoint gives you an amazing view all along Yosemite Valley. Watch out for the tour buses, though -- it must be a routine stop and they take up a lot of space. It's worth stopping, however, if you're visiting Yosemite, and only takes a few minutes to get there from the valley floor.\nShow less"], ["Reviewed October 19, 2017", 5.0, "Great way to start your Yosemite visit", "I had never been to Yosemite so it was exciting to actually see the park. We flew to Fresno from San Diego and rented a car. If you are not keen on driving long distance I would definitely recommend that. The drive up was nice going through open country and one lane winding roads.\n\nAlthough you pass through the paid entrance from the south you really don't get the feel of Yosemite until you drive through the tunnel and come out at Tunnel View! Park and enjoy the beauty of nature. The sheer rock mountains is what makes Yosemite so spectacular and this is a great vantage point to soak it all in. Beautiful valley lead up to tall trees and the sheer rock mountains. This is not really an active location so don't expect to hike. Rather it is a view point but a gathering place where you can meet and talk to others and get some insight into the park. Tunnel View means you have arrived in Yosemite!\nShow less"], ["Reviewed October 19, 2017", 5.0, "Iconic view of Yosemite!", "This is one of the best views of Yosemite. You can see Half Dome, Bridal Veil Falls, El Capitan along with much of the valley. It is a must-stop for that classic Yosemite photo."], ["Reviewed October 19, 2017", 5.0, "Spectacular View", "Visited last week of September.\nThis is a popular spot ,one of the best views of the park,the view is breathtaking.You can see everything from this vantage point,Half Dome in the far distance, El Capitan right there in front of you,Bridal Veil Falls on the right,and Yosemite Valley opening in full view.You don't even need to hike to see it.Really It looks like a Great Painting.We had a great time taking a Beautiful Pictures.\nAlthough there are two Parking Areas for this site but most of the time it is full by cars and large tour busses,but people come and go frequently so just be patient and wait a bit!\nDon't miss this view point on your tour of Yosemite, it's near the Yosemite Tunnel.\n\n\nShow less"], ["Reviewed October 18, 2017", 5.0, "Worth the drive for the view", "This is a stopping point just before the Tunnel, the car park is opposite to the lay by and the view is straight down the valley taking in all the main points in the valley (El Capitan, Half Dome)"], ["Reviewed October 17, 2017", 5.0, "Definitely stop at tunnel view", "GORGEOUS views. A must quick stop in the valley. I loved the views. It was very crowded. Lots of buses and cars everywhere .but worth the stop. We stopped on our way out to glacier point....then stopped again on our way back from glacier point."], ["Reviewed October 17, 2017", 5.0, "Spectacular Way to Start Your Yosemite Vacation!", "As we passed through the tunnel on our way to Yosemite Valley Lodge, we couldn't believe our eyes as we pulled over to take in the view. We later took a bus tour of the valley floor, and it returned to this beautiful spot for additional Kodak moments. Of course it looks different, depending on what time of day you go there, but it is always gorgeous (unless it's too foggy to see the view).\nShow less"], ["Reviewed October 15, 2017", 5.0, "Stunning views", "The view here is nothing short was spectacular. We were just in awe! Wow, you must stop and take it in. Can't miss spot."], ["Reviewed October 14, 2017", 5.0, "Get there early in the morning in the fall for amazing views", "Got to Yosemite early, the fog and mist was hanging in the valley, fabulous views. Went hiking for the day and then up sentinel dome. Returned back to tunnel view late in the afternoon and the valley looked great then as well, if you are at Yosemite you must build this into your day\nShow less"], ["Reviewed October 13, 2017", 5.0, "Spectacular", "Fantastic views, you can't quite believe it until you see it for yourself. Parking is limited however there is a lay-by just before, which can accommodate more vehicles particular RVs; the car park does not offer RV parking at all! Restrooms are available and suitable for strollers/ wheelchairs.\nShow less"], ["Reviewed October 12, 2017", 5.0, "amazing sunset", "beautiful view of Yosemite sunset, oversee all major landmarks of the park, half dome, bridal falls, El capitan."], ["Reviewed October 9, 2017", 3.0, "Good for a picture or two, nothing more", "This is one of the more famous views of Yosemite, but it really isn't much more than a tourist picture spot. Go for a couple of minutes, get your pictures and move on to the other attractions. Also, make sure to go when it is clearest (not in the morning) if you want to be able to see all of the park features.\nShow less"], ["Reviewed October 8, 2017", 4.0, "Cool, Till a Tour Bus arrives", "This is a very nice viewpoint, with a decent parking area. Lots of good photo ops. But it gets busy there, and if you spot a tour bus approaching, time to go. The place will be inundated and you will not be happy trying to find a way to get out of there. Think \"zombie movie\" once that bus starts unloading a plethora of tourists.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Stunning", "As you drive out of the tunnel park the car and then say Wow. This is the best view of Yosemite. You can see Half Dome and Bridal Veil Falls. Lush green trees frame the view. I have visited Yosemite three years running and this view still makes my heart miss a beat.\nShow less"], ["Reviewed October 6, 2017", 5.0, "amazing view from tunnel", "Great spot to take photos of Half Dome and the Yosemite valley. A must when you visit the park. Return several times since sky varies. Views can be hazy, clear, cloudy etc so it all depends. Regardless it's a great view!"], ["Reviewed October 5, 2017", 5.0, "Just fantastic", "The tunnel view provides one of the best views in Yosemite, and that is saying something. And no hiking is necessary! The views are fabulous right from the turnout. If you cross the street and hike up about 20 feet the views are even better."], ["Reviewed October 4, 2017", 5.0, "Amazing in a different way", "After spending the previous day at Sequoia and Kings Canyon park, we could not help noticing how differently organised this place was. We enjoyed this experience and the amazing views you also get here. Great place to come again to."], ["Reviewed October 3, 2017", 5.0, "Worth the stop", "I was into the hiking, and we didn't have time for any more hikes. But, my wife suggested that we stop - and it was well worth it. Make sure to read the sign that describes how different spots within Yosemite were named."], ["Reviewed October 2, 2017", 5.0, "THE view", "Try to go mid to late afternoon for the best lighting. This is the famous, iconic view seen everywhere. It shouts \"Yosemite.\" Yet every tourist, us included, likes to take his own photo. Since it says \"Tunnel View\" I also took a photo of the tunnel.\nShow less"], ["Reviewed October 2, 2017", 5.0, "A place to take the most amazing pictures", "Got tons of great pictures from the Look Out Point. Got to see a rainbow in the falls and the entire valley floor."], ["Reviewed October 2, 2017", 5.0, "The Most Photographed Natural Vista in the World", "As you drive up Hiway 41 to the South entrance of Yosemite Valley, this the first glimpse after exiting the tunnel (hence the name!). It is literally drop jaw beauty, with El Capitan one one side of the valley and Half Dome on the other. I take tours into Yosemite frequently, and my groups are always stunned by the magnitude. GO!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Wonderful!", "Wonderful spot to view. Bridal View Falls are lovely, with rainbow. However, very busy area. There is a pull off for cars but still, very busy."], ["Reviewed October 1, 2017", 5.0, "Just Stunning", "Just an awesome view in to Yosemite Valley.\nWe stopped here twice when going to and from Glacier Point. In the morning it provided an eerie view down to a mist filled valley and coming back gave clear views of the valley floor, El Capitan and Bridalviel falls.\nThere is parking on both sides of the road although neither lot is very big.\nShow less"], ["Reviewed October 1, 2017", 5.0, "A quick photo op view of the Valley!", "We stopped here 3 times during our Yosemite stay. The best light for photos was when we stopped in the afternoon, around 3pm-ish. You pull in, take your photo, and then head on down the road - great views for very little effort!"], ["Reviewed October 1, 2017", 5.0, "Minnesota Nice", "Great place to pull over to take pics. Tour busses making parking sometimes a challenge to get around in the lots. Be prepared for a variety of people...some friendly and some very rude."], ["Reviewed September 30, 2017", 5.0, "You must stop here!", "This viewing spot is one of the best in the park. You can see 3 of the main attractions of Yosemite: El Capitan, Bridalveil Fall, and Half Dome. It is worth a slight drive. You will not be disappointed."], ["Reviewed September 30, 2017", 5.0, "Another stunning view", "Another great view in Yosemite, pictures just dont do it justice. And again, easily accessible by car. Plenty of parking available."], ["Reviewed September 30, 2017", 5.0, "Must see", "Nicely set up. Good parking. Must visit. The view is classic of course but being there in person just tickles the right nerves."], ["Reviewed September 29, 2017", 5.0, "Breathtaking View!!", "I have been to Yosemite many times and Tunnel View takes my breath away every time!! It is, however, very crowded most of the year so be careful when driving."], ["Reviewed September 29, 2017", 5.0, "Great view", "We didn't have a ton of time in Yosemite during our trip so coming in on tioga and seeing immaculate sights like this were perfect for us. Seeing it all at once is so awe inspiring. Definitely recommend."], ["Reviewed September 28, 2017", 5.0, "A very good stopping point on your trip to Glacier Point", "This is a beautiful overlook on Glacier Point Road. Definitely worth a stop for some great photos. A popular spot."], ["Reviewed September 27, 2017", 5.0, "great views", "Beauty beyond comprehension, what an amaizing view and place to stop this has got to be one of the best vista's in the park a must see"], ["Reviewed September 25, 2017", 4.0, "Breathtaking view", "If your travelling to Yosemite National Park this is probably the entrance you will take and when you come through the tunnel for the 1st time the view will take your breath away & that's no exaggeration,unless your don't like beautiful scenery.It really should be on everyone's to do list for those who like the Great Outdoors\nShow less"], ["Reviewed September 24, 2017", 5.0, "Really Great View", "We stumbled upon this view point on the way to Glacier Point, and were amazed at how gorgeous the pictures came out. The lot is usually crowded with people, but it's worth a stop to see three landmarks (Nevada falls(?), El Capitan, and Half Dome) all in one place!\nShow less"], ["Reviewed September 24, 2017", 5.0, "Amazing views!!!", "We stopped for about 30 minutes and were just blown away by the views. A absolute must in Yosemite and no doubt you will pass it at some stage on your trip. Finding a parking space can take a while (took us 10 minutes) there is a 2nd car park away from the main one at the tunnel which is quieter!\nShow less"], ["Reviewed September 23, 2017", 5.0, "tunnel view", "Easy quick stop. For great photos of valley, El, Captain, and Half Dome. Parking can get crowded at peak times. But so worth the wait."], ["Reviewed September 20, 2017", 5.0, "What an Opening", "As you exit the tunnel, the splendor of the valley unfolds before you. We experienced it 3 times, first when we were leaving the park for our hotel, the following morning when we went back in and again at sunset. The morning views were softened by haze caused by forest fires burning to the SW, but it made for interesting images one would not ordinarily see. At night the setting sun outlines first the trees in the bottom of the valley, then the sides of the valley highlighting Bridal Vail Falls and the remainder of the valley to the rear. Highly recommended.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Stunning view even with some of the wildfire smoke", "While I was unable to take good early morning photos from Tunnel view because of the wildfire smoke, the afternoon provided a stunning view."], ["Reviewed September 20, 2017", 5.0, "Crowded", "A crowded view of the \"tunnel\" that inspires awe and wonder. A must-do when in Yosemite. It's not a hike, just an overlook so everyone can do it."], ["Reviewed September 19, 2017", 5.0, "One of the Best Views in the World", "One of the many reasons Yosemite is my favorite National Park. It is hard to believe how so many icons of the valley lined up for this amazing panorama. It is a short drive to Tunnel View from the valley loop. Hopefully you'll keep going to Glacier Point from here. Beautiful.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Breathtaking", "I'd seen the pictures before we visited from England and assumed they must have been touched up. But this is breathtaking. Came twice as the first time it was a bit hazy due to forest fires. Sunset here is hard to describe. If you ever get the chance go!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Superb view", "This stop, at tunnel view, is an amazing viewpoint of Yosemite valley and changes not just from day to day but also at different times of each day. It is really stunning.\nFor those looking for a hike I can recommend the trail that goes from the back of the top car park to inspiration point - it is steep in places but an easier hike than the mist trail and with hardly anyone on it. The views as you climb up are fantastic!\nShow less"], ["Reviewed September 18, 2017", 5.0, "Tunnel View Excellence!", "Entering the park is a small adventure in itself, but be prepared to take pictures before, during, and after the tunnel view on Wawona Road at Yosemite. It is a masterpiece of construction!"], ["Reviewed September 16, 2017", 5.0, "Like a postcard", "This is a MUST STOP location in Yosemite. Truly breathtaking. If the view is smoked when you get there make sure to circle back at another point in your trip when it clears. Completely worth the effort. Also, sunset here left me speechless."], ["Reviewed September 14, 2017", 5.0, "the view of which Ansel Adams was made famous for or by (depending on how you see it)", "after you've seen the Village, trails, hikes, etc take a journey through what is surely going to be \"your canvas\" never, ever to be forgotten. a nice scenic drive upward, let's say as you're heading over to Mariposa Grove to see the Giant Sequoias, you will come up to a tunnel with a small parking area right before you go into said tunnel, turn into parking area, park and grab a camera. once you turn around and see the majestic view of Yosemite Valley, you may start to get a grasp on what John Muir saw when he stumbled upon it. (PBS special for those National Parks fellow enthusiast: A Film by Ken Burns: The National Parks: Americas Best Idea) <<<<<5 stars, a it will give you a better understanding of what you're experiencing once your eyes have had the complete and utter joy of witnessing this park, the Valley and multiple waterfalls within.\nOnce my wife fought and survived breast cancer: we both decided it would be our National Parks we must see as soon as possible, since our time here on beautiful mother Earth in never guaranteed. It all started here, at Yosemite N.P. *actual visit date was 2013 but no other option was given\nShow less"], ["Reviewed September 14, 2017", 5.0, "MY FAVORITE VIEW IN THE WORLD!", "You can't beat the view as you exit the Wawona Tunnel and see El Capitan, Half Dome and Bridal Veil Falls with the valley spread below looking like no one had ever been there. You don't even have to go through the Tunnel; just drive up to it and park outside. It's stunning!\nShow less"], ["Reviewed September 14, 2017", 5.0, "A MUST DO!", "We have come home with the most amazing photo shots of this view and would highly recommend going, seeing and snapping."], ["Reviewed September 12, 2017", 4.0, "Best view in springtime: lots of waterfalls", "We always stop here on our way into the Valley, and we never tire of the majestic cliffs, Half Dome, and Bridal Veil. Fall photos contrast markedly with those from April & May, but it's still an impressive show. Easy parking. Best views in afternoon."], ["Reviewed September 6, 2017", 5.0, "Great View Even with Smoke 🔥", "Great views. Very crowded. Come early or late to avoid crowds.\n(First of all, don't go on a holiday. Second don't go on a holiday weekend when there is a fire! We drove 7 hours on Labor Day weekend. We noticed that highway 41 was closed due to a fire, thus we drove in via highway 140. The line to get into the park was 4 hours long! Yes 4 hours!!!! The valley was full of smoke from a fire 36 miles away. It took us so long we were there for an hour or so. We went back the next day and we're thrilled that it only took us 2 hours to go in. We had elderly parents and young kids with us and couldn't get there before 10, but we were told that there was no wait at 7 am. Once we got there it was so crowded it was hard to get around. I recommend to avoid summer holidays and weekends. Nevertheless the sites are beautiful to see.)\nShow less"], ["Reviewed September 6, 2017", 5.0, "Intriguing View", "Different perspective of the valley and worth the stop. Can be busy by times but so can everywhere else in the park. Just watch out for the special people who tend to run in front of moving vehicles."], ["Reviewed September 5, 2017", 5.0, "Smokey vs Clear", "We visited the site twice today and around noon it was so smokey we couldn't see past El Capitan. We went again at sunset when it was not smokey and the entire valley was visible, including Half Dome. An awesome sight!"], ["Reviewed September 5, 2017", 5.0, "The tunnel view of the valley is so exciting that 3 visits to that was not good enough!", "What an exciting view of the Yosemite National Park from this point, adjoining a very long tunnel! Without smog, the view could have been far more blissful!"], ["Reviewed September 4, 2017", 5.0, "Fantastic view`", "Worth the drive. I reached by 5 pm after finishing all other attractions inside the park. Didn't find any problem with the parking."], ["Reviewed September 4, 2017", 5.0, "Iconic View of Yosemite Valley", "Take a photo from this overlook on the Wawona Road as you leave Yosemite Valley and all of your friends will think you're an amazing photographer. It's impossible to take a bad photo from this spot, with Bridal Veil Falls on the right and El Capitan on the left and the pristine Yosemite Valley in between. It looks as if nothing has changed in a thousand years and makes you appreciate the people who fought to preserve this land and the park service for not overbuilding it. Bravo National Park Service and the Yosemite Conservancy! Thank you for making incredible experiences like this possible.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Gorgeous!", "This is just a vista point, but beautiful! Definitely worth driving to, as it is not far from the valley. You see straight down into and through the valley. It was smoky from the fires when we were there and still worth it!"], ["Reviewed September 2, 2017", 5.0, "Fantastic View", "Fantastic view of Yosemite Valley. One of best views and vista points. We also drove through the tunnel for fun. Must see Vista!"], ["Reviewed August 31, 2017", 5.0, "A Must See", "The view of the valley from this vantage is just the opening chapter of your Yosemite experience. A fellow Yosemite traveler took our group photo and we reciprocated. Everyone is giddy from experiencing the vista."], ["Reviewed August 30, 2017", 5.0, "awesome views after going thru the tunnel!", "one cannot miss this drive whenever in Yosemite! after going thru the tunnel one is presented with one of the best views of the valley!! It's a can't miss spot!"], ["Reviewed August 30, 2017", 5.0, "Most Beautiful view ! A MUST ! !", "if you are driving in or out, THIS is where you have to stop. and take in the view, it has to be the most beautiful view in all the world ! there is a web cam if you look online that is here also , you can view this all the time, its my screen saver !\nShow less"], ["Reviewed August 30, 2017", 4.0, "Easy place to stop and take in the view. Limited parking but high turn over.", "An easy stop toward Glacier Pt. road. The mountain side of the two parking lots always seems to have more available spaces than the valley side. There's some dirt trails on the mountain side which will get you above the crowds with a little better view. It's a bit steep but not horrible. I tried to find the artist point lookout further up the trail but I couldn't find any signage and I ended up just looping back around. No idea how to find it. Personally, I prefer Glacier Point and Sentinel Dome lookouts over this one but don't get me wrong, it's a easy and must-do stop.No restrooms available at this stop.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Perfect view and beautiful spot for pictures", "This place is a must. You should go there, park your car and stay for hours. The best time is sunset because the place is beautiful. You could also take pictures in the afternoon."], ["Reviewed August 29, 2017", 5.0, "Fantastic", "Immediately upon exiting the tunnel you're presented with this stunning location and view of the Yosemite valley. There's a small car park available and specific photo opportunity locations. As ever, watch your step here when talking pics! Highly recommend!"], ["Reviewed August 28, 2017", 5.0, "The Best!!!!", "What a view....I could stand there for hours!!! Easy to find, easy to park... Plenty of space to walk around and take your pictures (don't forget your tripod)! You have almost everything in front of you (Half- Dome,Bridalveil fall, El Capitan)!!!"], ["Reviewed August 28, 2017", 5.0, "Dramatic view", "Maybe you've seen lots of photos of Tunnel View. It's not possible to imagine how breathtaking it is until you cross the tunnel and stop to stare this dramatic view of the valley."], ["Reviewed August 25, 2017", 4.0, "Nice View", "Long drive from San Francisco. But it all worth it. Love the mountain and river view. Limited car park lots."], ["Reviewed August 23, 2017", 5.0, "Spectacular Preview", "Rather than reiterate all the superlatives that you can read elsewhere, I'll provide some advice. (1) Spring is when you can expect more impressive waterfall displays. (2) Try shooting photos of the scenery in HDR (high dynamic range) mode on your smartphone, or if you're advanced enough, use automatic exposure bracketing and process the HDR photos on your computer. (3) Be patient and considerate, this can be a busy place.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Amazing view!", "After the view from glacier point this was my favourite viewpoint in Yosemite. You will drive past it when driving from glacier point to Yosemite valley/village. There is parking either side of the road so you can stop off to enjoy it. There is a trail from this point but we didn't do it. The majority of people were stopping quickly and then moving on.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Great view - no kidding", "I read the reviews before we stopped here. I was skeptical but they were right. There is a parking lit right before the tunnel. Definitely stop and get out and look back toward El Capitan. The view is wonderful. Additionally there is a hike on the other side of the road that will take you higher than the parking lot and give you a better view. Definitely recommend for fellow travelers.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Simply spectacular!", "Clearly one of the most visited parts of Yosemite and deservedly so. At the end of a long tunnel, one emerges into daylight and can see some of the Park's most outstanding sights. Suggestion: Get there early in the day since parking is limited."], ["Reviewed August 16, 2017", 5.0, "A Must See", "Tunnel View is a great place to stop on your way to Yosemite. Holistically, you can view, Half Dome and El Capitan. Highly recommend to come here during the summertime to get a clear view. My family and I came here on a temperate day with some clouds but when viewing the pictures, I'd say the view was still gorgeous and amazing.\n\nEnjoy!\nShow less"], ["Reviewed August 16, 2017", 5.0, "Must See View", "This is the iconic Yosemite picture with both Half Dome and El Capitain. The best photos are at the end of the day when the sun is striking the cliffs!"], ["Reviewed August 16, 2017", 5.0, "Glorious view, small parking lot", "Highly recommended as a stop. Parking lot is very small, and the viewpoint can be very crowded. The vista is glorious and worth stopping to see."], ["Reviewed August 15, 2017", 5.0, "Spectacular", "This is a popular place that offers a terrific view of the valley. The parking lot is small and you can take a free park shuttle bus to it. You can walk back into the tunnel to the air shaft."], ["Reviewed August 15, 2017", 5.0, "A Must Stop", "One of the 2-3 must views of Yosemite to get your bearings. You can see the main highlights of the park.\n\nI highly encourage both a day and night stop, especially if you are a photographer.\n\nThe sun sets from behind you focusing gorgeous colors onto the valley in front of you. On cloudless nights, the valley, especially Half Dome and El Cap are lit by the stars and moon.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Excellent view", "A great stop off point on the way to/from Glacier Point. Great views, as you would expect, of the valley. Very popular and busy."], ["Reviewed August 13, 2017", 5.0, "Stunning", "Words can't describe how amazing this view or any view in Yosemite is - there is no such thing as a bad view in Yosemite"], ["Reviewed August 13, 2017", 3.0, "Smoke screen", "Unfortunately when we stopped there was a forest fire near by and the valley was in a haze of smoke.\nIt made for some interesting photos but does not do the view justice so I did not include them in this review.\nI'm sure that it is breathtaking normally and I would recommend the stop. It is just as you exit the tunnel after the park entrance and there is lots of free parking but get there early.\nFirst and last photo opportunity of the trip.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Great view!", "This is worth stopping at on your way up to/down from Glacier Point. Sadly, the current forest fires are hindering the view somewhat, but you're able to appreciate how magnificent the glacial valley is from here."], ["Reviewed August 12, 2017", 5.0, "Special Place", "Tunnel View is a very special place to see the highlights of Yosemite in one spot - Half Dome, Bridal Veil Falls, and El Capitan are all in front of you as you look out.\n\nWe were there during the Detwiler fires - first day - and each subsequent morning, the views were terrific. Each afternoon the view deteriorated dramatically to the point of not being able to see any of the sites.\n\nWe were very fortunate with our timing.\nShow less"], ["Reviewed August 12, 2017", 4.0, "Great view", "A must visit place in Yosemite for the famous rock formations El Capitan and half dome ! Parking isn't an issue great views"], ["Reviewed August 11, 2017", 5.0, "Excellent view point - go early or late for a more relaxed experience", "Take a quick stop at this vista point for a postcard view of the iconic peaks of Yosemite - El Capitan up close and Half Dome in the back. There maybe other points where you can see both peaks but this one is probably the best. Two parking lots right at the exit of tunnel but always crowded middle of the day so try to get there early or late. We stopped there on our way back from Glacier Point, Sentinel Dome/Taft Point, at 5 pm (on a Tuesday) and the lot was half empty. We then continued onto Bridal Veil Falls which was just as uncrowded.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Iconic View", "This area was usually backed up with traffic and is well worth stopping to see. Earlier in the day the view can be covered with morning fog or mist."], ["Reviewed August 8, 2017", 5.0, "Spectacular view in the afternoon!", "After leaving Bridalveil Fall, we continued on Hwy 41 toward the Wawona Tunnel. The best time of day to take in this iconic view of Yosemite is late afternoon when the sun lights up the valley. This one of my favorite landscapes in America. There is a parking area on both the left and right side of the road, immediately after the tunnel. From here you can see El Capitan and Bridalveil Fall, with Half Dome in the background.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Don't miss this pull out", "This is the most Famous view of the park. Don't miss a photo op here. You will stop here if you take the tour of the park from your hotel. You will also pass this on your way to either Glacier Pointe, Wawona or Mariposa Grove.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Great first view of the valley", "Stop here and take pictures, or even just look. Our view was even slightly obscured by mist or maybe smoke, but still breathtaking. What a great way to see the Yosemite valley for the first time."], ["Reviewed August 7, 2017", 5.0, "Must stop just to take in the View.", "Worth stopping if you can find a parking spot! Iconic view of the Yosemite Valley. We had stopped in September so most of the waterfalls had slowed to a trickle. A lot of brown trees as well due to the drought but still a pretty picture.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Colorful", "This overlook is crowded but gives a view of the valley that's hard to beat. Sunsets are good here (but better in other places) yet allow you to see the valley lit up in orange and red. If you don't have time to get all the way to Glacier Point, this is a good bird's eye view of so much of what Yosemite has to offer.\nShow less"], ["Reviewed July 31, 2017", 5.0, "The Iconic view", "We had just one day in Yosemite (nowhere near enough!) and therefore set off early to make the best use of the day. The plan was to stop at Tunnel View on entering the park and then head onto other things. Unfortunately the mountains were shrouded in cloud and we just got the occasional tantalising glimpse. Off we went and as the day progressed, so the weather improved. Later in the day, tired and hungry, we headed out of the park and just managed to find a parking spot to gaze on what was now an almost clear view. It is a wonderful view but sad to see so many dead and drying trees as a result of earlier drought and attack by a beetle pest.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Don't miss this great photo op", "Whether you're on a guided tour or driving yourself, stop by this place for an great view of El Capitan, Half Dome and Bridalveil falls. A very popular tourist stop but we were lucky it wasnt as crowded when we stopped by."], ["Reviewed July 28, 2017", 4.0, "Fantastic View - Often Busy", "This vista point offers an incredible view through the Yosemite Valley and is, at the same time, an historically significant one. Unfortunately, however, following the trend within the park, the view is spoiled by the masses of tourists crowding to get a look"], ["Reviewed July 28, 2017", 4.0, "great view from the road", "Tunnel view is spectacular. You can see the view right from the road. The point is the big picture, not getting up close to anything."], ["Reviewed July 28, 2017", 5.0, "Just magnificent", "If you'd like to stand in the shoes of Ansel Adams for a view of the site of one his most popular and well known images"], ["Reviewed July 27, 2017", 5.0, "Impressive", "Coming out of the long tunnel by car we parked on the right hand side facing the Tunnel View. There was a crowd waiting to get to the best place to photograph this but within minutes it was our turn and soon we were on our way.\nShow less"], ["Reviewed July 23, 2017", 5.0, "This is \"THE\" photo stop in Yosemite!", "When you are approaching from the south, please note that once you come out of the tunnel, the pull over for pics is on the left, as the mountain is on your right. You will have to cross oncoming traffic to pull into the lot. Be aware that there is quite a bit of congestion in this area and the lot isn't large because of the terrain. We opted to stop on the way back, where the pull off would be on our right, and we could easily exit. Also great lighting in the late day for the pics.\nShow less"], ["Reviewed July 21, 2017", 5.0, "The best stop", "I didn't realised until i was there if how many pictures i have seen of that amazing spot with the dolphin the captain the cathedral.... The veil... extremely difficult to park avoid weekends"], ["Reviewed July 20, 2017", 5.0, "Amazing View", "This is the iconic viewpoint in Yosemite. We found it to be breathtaking. Visitors are usually there for a short period of time so it is easy to get a parking spot."], ["Reviewed July 20, 2017", 5.0, "A Must See", "This view is probably the most iconic of Yosemite Valley, and well worth at least one stop. The look of the valley can change drastically depending on where the sun is and the clouds."], ["Reviewed July 19, 2017", 5.0, "Must do for any Yosemite visitor", "This site is on every magnet, postcard, website so if you travel to Yosemite you have to get the picture and experience yourself! Google ho to get here and get plenty of gas before you enter the mountains. Not many options. Be prepared for your buses and local open tours groups seeing the site. It won't take more than 10-15 mins to park, take picture, take in the sites and continue on your drive. No amenities here just California Gorgeousness!!!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Best Views", "We only had one day and there was no way we could see everything in a day, but of all the things we did see and do, which was plentiful, this one offered one of he most fantastic views, and required very little work. Do stop to check out the views and get some great pictures.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful in the morning", "My friend and I arrived to see the sunrise over Yosemite... We finally made it over to Tunnel View, and while the sun had already risen it was still a beautiful sight to behold! I recommend this spot, simply because it's beautiful and easy to get to. Go early in the morning. The fog over the trees, and mountains is just amazing.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Speechless", "The early bird catches the parking space for amazing views of El Capitan, Bridal Veil Falls and the Half Dome all at once. Catch your breath and then get that camera clicking."], ["Reviewed July 18, 2017", 5.0, "Amazing", "Very close to the valley - this is an amazing view both for all seasons. Parking is limited, but there is not much else to do - so a place stop over to spend a few minutes savoring the view and taking some pics"], ["Reviewed July 17, 2017", 5.0, "For those \"Mac Wallpaper\"-type photos, come here.", "I think everyone who has a Mac post-2011 will recognize this view. It's iconic. Pretty easy turn-off along the road into Yosemite. It gets pretty crowded in the afternoon, so go early. We went first thing in the morning and El Capitan was \"glowing\".\n\nImportant note: Going in the AM makes it difficult for pictures since the sun is facing your direction. Its still very impressive, but the photos you will take may look less scenic with the bright sun.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Breathtaking", "A simply breathtaking sight. You can look at this view for 15 minutes then turn away and when you look back it takes your breath away all over again."], ["Reviewed July 14, 2017", 3.0, "Ok, as you drive by anyway", "You drive by anyway from glacier point to yosemite valley, so it is ok to stoppen and have a short look. Nice, but not as extraordinary as the others Attraktion."], ["Reviewed July 14, 2017", 5.0, "Must see stop", "Yes, you must go. It is crowded-but all the better to have someone take your picture. Best place in the entire park to realistically get El Capitan and Half Dome in the same shot. And it is an easy drive not too far off the Valley.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Tunnel View", "Very good pull off area to take panoramic photos of the valley and the trip through the tunnel is cool!"], ["Reviewed July 14, 2017", 5.0, "Great views, hiking trail for even better ones", "We stopped for the amazing views and were just blown away. It was a clear day and we had great visibility. There was a hiking trail behind the car park that we walked up for better views. It was a bit rocky and my mother had a little trouble keeping good footing, but it was worth it.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Amazing - But don't go in the morning!", "We made a quick stop at Tunnel View on our drive to Glacier Point around 8-8:30 am on July 4. Easy to park as no one stays too long. No hiking (as far as I know). Just a great view. The mountains are lined up beautifully. This makes for amazing photos. HOWEVER- The early morning is NOT the time to go. We were actually disappointed. Sun is behind us. Mountains appeared \"hazy\". You really must wait until later in the day. The issue is that we did not want to move our car once we had a great parking spot in the Valley so we drove to Tunnel View (then Glacier Point) just after checking out. We should have gone later in the day. Next time!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Fantastic", "Well worth pulling over to get the view. It is suddenly there at the end of the tunnel as you come in on the Wawona Road. Amazing first view of the Valley"], ["Reviewed July 12, 2017", 5.0, "The perfect picture of the Valley", "Best photo opportunities are mid-day to late afternoon. Can be crowded because of limited parking but worth the effort."], ["Reviewed July 12, 2017", 5.0, "Best View I have Ever Seen !", "Tunnel view is a must visit. It is truly one of the most picturesque places i have seen amongst the 20 odd countries i have been to. Make sure to go there early in the morning to avoid the crowds and see the colours change as the sun rises.\nShow less"], ["Reviewed July 11, 2017", 4.0, "The most crowded spot in Yosemite Valley", "Tunnel View is the most crowded spot in Yosemite as almost all cars stop there for an entrace picture. There are 2 small parking slots but there isn't always enough space. If you are able to stop there, a few trails leave from there too. Anyways, it's a a good place to get a wider picture of the valley.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Classic", "One of the best entrances to Yosemite Valley via Hwy 41. Next best and quite different is Hwy 140. Usually open all year and is the classic view one sees in pictures of Yosemite."], ["Reviewed July 8, 2017", 4.0, "YNP - Tunnel View", "Our first stop upon entering the Park. The view was amazing, this spot fills up quickly! There is a trail to hike but we didn't find it until we stopped for some pre sunset photos on the way out of the Park. I wish we would have found it earlier\nShow less"], ["Reviewed July 8, 2017", 4.0, "Great view", "This is a great view and awesome stop for a photo. It is usually very crowded so be prepared. It is a short drive from the entrance of the park but is a must see while in the park"], ["Reviewed July 7, 2017", 5.0, "Another awesome site to see", "Tunnel view is an awesome place to stop along the side of the road to get a view of the mountains known as Yosemite. There are lots of ppl who visit each day so be sure to get an early start or you won't find parking. The views are outta this world. Mother Nature gets an A+ on this one!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Stunning!", "Worth stopping for an amazing view! Just one of the thousands of places to stop in awe and appreciate. You need a couple of weeks to really see this place."], ["Reviewed July 7, 2017", 5.0, "A gorgeous quick pit stop", "We stopped here on our way down into the valley from Glacier Point, and arrived at around 11 am. There were still maybe one of two parking spots left, so if you drove I would recommend going about this time or earlier even. The view here is very famous and it is a great way to look into the valley itself. You don't need to allot a lot of time here; we stayed maybe 10 minutes to take our photos and appreciate the view and then left. It is definitely worth seeing though.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Great views", "Definitely coming up on the 4th of July weekend is crazy...the whole park was like a parking lot and was disappointed with the lack of communication with the Park Rangers The park is beautiful"], ["Reviewed July 6, 2017", 5.0, "Only need 5 minutes..GO Early", "Go here first than to Sentinel Dome hike. worth stopping quick for a great view. after 9 am it can be maddening crowded"], ["Reviewed July 5, 2017", 5.0, "Breath taking", "How do you give nature anything less than a 5 star review?? Lol. Anyways... this place is definitely worth stopping in the parking lot and taking it all in. This area is one of the times in your life you'll ask yourself, \"is this even real?\". Thanks to all the rainfall in California recently, all the waterfalls are raging and you can see them from the overlook. I can't say it enough, when given the opportunity to turn-out and see this, you must!\nShow less"], ["Reviewed July 5, 2017", 5.0, "Holey Cow! What a view!", "This is a must see for anyone coming into the park from the south entrance. As soon as you exit the tunnel, immediately turn into a parking lot (on left or right) for an absolutely stunning view of the valley."], ["Reviewed July 5, 2017", 5.0, "I just love tunnels!!", "This is one spot you want to cross, my friend always laugh because every time here I want to go through the tunnel and trust me you will too when you come, if you are into history I suggest you look into when you come or just at the view point look at the scale miniature of the tunnel and read it! You get an amazing view of The Valley and you get to also experience the route! Over all I will continue to be excited to be here even when is like ..... i don't remember how many times I have been here! But I love it!! You will love it too!!\nShow less"], ["Reviewed July 4, 2017", 4.0, "Beautiful Stopping Area", "We stopped at the Tunnel View area on the way out of the park. The views are beautiful in all directions and you can see down the valley. We stretched our legs, took pictures and drove on. For us, I didn't see much to do but it was a nice stop on the way out of the park.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Beautiful!", "Yosemite has so many amazing places and this one would certainly be included. It's a beautiful place to stop amazing views. Definitely worth stopping for a few pics."], ["Reviewed July 4, 2017", 5.0, "Incredible", "Tunnel view is one of the most scenic spots in Yosemite. It's also one of the most popular. We visited early evening to watch the sunset across the valley. There is plenty of free parking but no facilities like rest rooms etc. We went twice as it's that amazing to see!\nShow less"], ["Reviewed July 3, 2017", 5.0, "The first place to catch the awe.", "As you enter the valley from the tunnel immediately turn into the parking lot for a jaw dropping view of the valley. The beauty is staggering. Only a loving God would leave such a beautiful place for us to enjoy. STOP take it in and get ready because Yosemite does not disappoint.\nShow less"], ["Reviewed July 3, 2017", 4.0, "Awesome view", "A great place to look back at where we visited in the valley. We went on the Yosemite Rangers valley floor tour open top trailer and she pointed out loads of interesting points and didn't need to worry about getting a parking space."], ["Reviewed July 3, 2017", 4.0, "First view of Yosemite Valley is a stunner.", "This is the iconic scenic view of the Yosemite Valley. The view includes El Capitan, Bridal Veil Falls and Half Dome. This is a very busy location with lots of tour buses. This is a must stop, but not a place where a visitor will spend a lot of time because of the congestion.\nShow less"], ["Reviewed July 2, 2017", 3.0, "Nice quick view before exit or enter of the park", "This was a nice last view to amazing Yosemite Valley when exiting the Valley by car. Really worth to stop your car and step out to take nice photos and to just breathe the air and the view."], ["Reviewed July 2, 2017", 5.0, "LAKE TAHOE, YOSEMITE, SEQUOIA TRIP", "A very scenic view from here. We were lucky to get a parking space, someone was leaving as we arrived. When we arrived 3 buses, quite hectic, after buses left fairly calm and were able to take some great pictures. Great views of Bridalveil Falls, Half Dome, and El Capitan. There is also a good photo-op right before you come out of tunnel.\nShow less"], ["Reviewed July 1, 2017", 5.0, "A must stop!", "As anxious as you may be to get in the Valley, do not skip this stop. It is literally at the end of the tunnel you drive through so slow down in the tunnel and get ready to turn left in to the parking lot as the tunnel ends. (If you miss the turn, there also a parking lot ever so slightly further on the right.) This is a different view from Glacier Point as you are about halfway down elevation-wise so offfers yet another perspective......and a beautiful one!!\nShow less"], ["Reviewed June 29, 2017", 5.0, "Great Way to be Welcomed into the Park.", "This is the first official viewpoint from the South Entrance of the Park and what a sight it is. No saving the best for last. We arrived at 7:15 a.m. Although the sun ruined our pictures the view was breathtaking at this time of the morning and the crowds had not yet arrived to spoil the peacefulness of the area. Really wanted to go back later in the day but we left from a different entrance.\nShow less"], ["Reviewed June 27, 2017", 4.0, "postcard view", "postcard view if you can go in off hours before 10 am after 4 pm, this decreases crowd size. most stop at at least once on your visit"], ["Reviewed June 26, 2017", 5.0, "Glorious view", "We entered Yosemite through the South gate and the road turns off onto a scenic spot with ample parking stalls. All I could say was \"Wow!\" You look straight into the valley with El Capitan on the left and Half Dome in the distance, and beautiful water falls on the right. So captivating. The parking is well done, with good signage and information, with beauty all around. Because there was a wet winter, many of the roads were closed for repair so going into the valley was a little disappointing. Many detours and waits, never made it to the visitor center because the signage there is not very good with all the detours. Never made it to half dome, etc... so coming into the park with the Tunnel view was the highlight of our trip to Yosemite.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Great tour, beautiful scenery and wonderful information", "Sights are breathtaking....our tour guide, Marsha with Discovery Yosemite Tour, was incredible. She pointed out all the famous sites but also showed us all different points in the park that we traveled with so much knowledge of the park. Had plenty of time to take pictures out the stops and was very well planned to see everything and enjoy them.\nShow less"], ["Reviewed June 26, 2017", 5.0, "Two visits: At night with stars and during day coming from tunnel", "The best view after Glacier Point but perhaps equal as it covers different sights on the Valley. Come early or late for access, it's popular. Driving from 41 into the Valley makes a great video as its dark, with an approaching bright end coming and then the money shot.\nAlso, not sure who signs up for open carriage with full sun? The ranger is in the shade...\nShow less"]]}}