{"Union Station": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Union Station", "url": "/Attraction_Review-g32655-d116315-Reviews-Union_Station-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/56/41/04/caption.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1509"}, "address": {"@type": "PostalAddress", "streetAddress": "800 N Alameda St Downtown", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90012-2177", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "Fun Walk", "This is a great place to wander thru. As you walk around you will probably think you have seen this place before and you have. It has been the location for many movies, TV shows and commercials. I used to walk thru because I took the train there to go to work every day. It is always a great spot to people watch during rush hour.\nShow less"], ["Reviewed 4 days ago", 4.0, "Convenient location", "Picked up my son at Union Station who was coming from Santa Clarita to spend the night and visit with his Old Man. Save us time, parking and gas money.\n\nI hope he can visit the next time I am staying in a Downtown LA Hotel.\nShow less"], ["Reviewed 5 days ago", 4.0, "Beautiful Architecture", "Beautiful Architecture, but very large and hard to find your way around even with asking I got lost twice. I have been here about 5 times and still do not know my way around, between the busses and muni trains it is confusing and if your trying to get to the Airport it will take at least 1 1/2 hours by bus, and most people are not too friendly. All being said I did enjoy the trips.\nShow less"], ["Reviewed 5 days ago", 5.0, "The Station is Historic, well located and very well policed with lots to do besides take a train", "Union Station continues to grow and last week I went to see a set of videos\nwhich featured ME , taken by a Frenchmen on the Subways throughout\nthe world. Mine was on the Metro Red Line in LA and it was a great\nexhibit. The space is very 'deco' and thus evokes history.\nShow less"], ["Reviewed 1 week ago", 4.0, "well laid out and tourist friendly", "We arrived by train late at night with 2 young children and I was feeling apprehensive. The transfer from train to taxi couldn't have been easier. The station is set out well, signage is excellent and the station staff are all very helpful and efficient. It turned out to be a very efficient transfer and to top it off, it's also a very beautiful train station.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Connecting the Bridges :)", "It has been just first few months that I have moved to LA and am already a fan of this Union Station. Literally traveling to different places of LA & California via this station only! Keep up the good service, keep up the cleanliness, keep up connecting people & places. Love. J\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Not just for train travelers", "When you are touring downtown, be sure to include this in your itinerary. It is just across from Olvera Street. While you are at it, have lunch at Philippe's and walk through China Town."], ["Reviewed 3 weeks ago", 5.0, "History+Efficiency", "I used to live in LA back in the late 80's and would visit Union Station simply to photograph and document the fantastic moderne/deco architecture. The tile work is about as high level as you can get, and the interior design is easily as fantastic as the exterior. Today, so much growth has occurred around the station, which itself has undergone renovation without sacrificing the Deco charm. When in town, I take the train down to San Diego - it's easy to navigate the station and get yourself to the appropriate tracks; there is an Information booth right at the entry if you need that, and a handful of food outlets. You can buy your scannable Amtrak ticket online. Personally, if you can avail of some train travel over renting and getting into a car, I think it's worth the experience, and this central transportation hub makes things easy and while getting a huge visual treat and history lesson.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wonderful venue", "Great place to visit and catch trains Easy to get around and a fun place to eat People watching is the game of the day"], ["Reviewed 4 weeks ago", 5.0, "Connects w different lines of trains & Flyaway Bus to LAX", "One can use machine to buy tap card but on weekdays there is a customer service staff where you can buy tap cards from them. The different trains there take you directly to downtown, Japan town, Hollywood, & other lines to Long Beach or Sta. Monica.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Vintage L.A. Transportation Hub Comes Alive", "Born and raised in Los Angeles, it's funny to think that me and my contemporaries grew up in cars, rarely buses, and never even thought of subways and trains. Today's Union Station changes all of that. Its now the up of all of the above.\nI have a couple of clients in downtown L.A., and I never drive there. Instead, I park in North Hollywood, pay a couple bucks, and 24 minutes later I'm in downtown. Saves on gas, time, and aggravation. And the end of the line is Union Station.\nI occasionally commute to San Diego. I start out on the same subway, then hop on the Amtrak at Union Station. It's WAY more productive, I can get something to eat, use the restrooms, and even wifi.\nBut I digress, those are the USUAL reasons to go to Union Station, for the transportation (a central bus depot and light rail depot there as well!\nWant some retro fun? Just take an hour or two to visit. The architecture is AWESOME. Art deco baby!\nFor glimpses of it, think back to movies like Sunset Blvd., Bugsy, and To Live And Die In L.A. Or think of music videos from Fiona Apple, Brian Setzer Orchestra, and yes, Farrell's Happy!\nHungry? Casual, there's Subway, Wexel's Pretzel's, and Trimana. There's T&Y Bakery, a Starbucks, and more. For a nice dinner, try Traxx Restaurant after 5 (call ahead for dinner reservations).\nGet your shoes shined, visit the gift shop, or my favorite, borrow a bike. Yes, there's a Metro bikeshare right out front (fee to ride). Hope the subways or buses to Union Station, grab a bike, and take off for Olvera Street, Disney Concert Hall, of if you have 20 minutes (about 2.5 miles), ride to Straples Center, L.A. Live, and the L.A. Convention Center.\nLots of people avoid downtown L.A. because of traffic and parking, but Union Station is a cool place and a springboard into Downtown and all it's museums, restaurants, bars and attractions.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "An Iconic Art-Deco Railway Station and Transit Hub", "Union Station is an iconic railway station built back when grandeur was in style. It has been fully restored over the last few years to its original art deco appearance, and as the major Los Angeles rail hub it still has a vibe reminiscent of the old days. The building itself is awesome, and there are also pleasant courtyards worth looking at. Apart from looking around, you can enjoy any of several restaurants and fast food places in the building, and many more are available in the nearby Olivera Street district.\n\nAs for travel, Union Station is the primary Los Angeles terminal for Amtrak, the eastern terminus of the Metro Red and Purple Lines, and eastern terminus of the Gold Line. It is served by numerous bus lines, and if you drive there you can park under the adjacent Patsaouras Bus Center. Hertz and Budget both have car rental offices in the station, very coinvenient for arriving passangers.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Main station of LA", "The best station in the city. Has cafes & grocery shops as well for a quick grab. Interesting Holiday decor as well."], ["Reviewed 4 weeks ago", 5.0, "As it was , beautifully kept", "We actually used the station to catch the train, also the buses link just outside! However spent long time dreaming how it used to be when built for the luxury traveler. The old furniture and fitting has been kept immaculately.\nStaff, security staff, and information desk full of useful information. Thanks\nShow less"], ["Reviewed January 24, 2018", 2.0, "This station does have Mega Bus Service", "This station is in need of renovation and updated with modern equipment. Access to this station is terrible due to parking enforcement."], ["Reviewed January 22, 2018", 4.0, "Beautiful architecture, great train station", "Loved the art deco architecture of this place - and the fact its been in so many movies. Parked here and walked to Olvera Street"], ["Reviewed January 21, 2018", 5.0, "HELL YES!! Go and just SEE this throwback in time!!", "Well...I know it sounds strange, but if U R at all inquisitive, and like seeing old buildings GO SEE THIS... It's been in tons of movies and is so well preserved.... Built in 1939, there's nothing but QUALITY to see.. And check out the new addition to the rear...great glass dome ceiling... The station is a hub for the METRO/Subway system too... Afterwards, go across the street to PHILIPPE\"S for a French Dip sandwich and some local history & culture!!\nCheck out my pictures......\nShow less"], ["Reviewed January 21, 2018", 5.0, "Well organized, safe, clean. 15 minute walk to the LA Downtown heart", "I did travel to/from Union Station twice a week for more than a year. The Flyaway bus to/from LAX has great bus schedules over there. Union Station has everything for travelers. All sorts of good fast food. Free seats. The passengers are well informed. The place kept clean and safe, kudos to police and services.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Historic Piece of Los Angeles", "Beautiful historic establishment! I've been here during weekday morning rush and on a Saturday morning and though the crowdedness is completely different, both times were enjoyable.\n\nThe workers standing around were readily available to help me find my way.\n\nThe one restroom I ventured into was surprisingly clean and well stocked.\n\nThere are police presence around every turn making me feel more secure given the many mentally ill and homeless people walking aimlessly around.\n\nIt was easy to get into and out of. For my day trip, I parked around the back. I haven't tried overnight parking yet. There is an aquarium located at the back to view fish swimming while you wait.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Cool mid century modern building", "Worth a quick pop in, loved the aged leather chairs in the waiting area.A taste of old LA but parking lot can be crowded."], ["Reviewed January 12, 2018", 4.0, "Beautful Building", "A must to visit, it takes you back in time when train stations were grand places to meet. A MUST even to sit in the foyer and watch people pass."], ["Reviewed January 11, 2018", 4.0, "Beautiful building", "Besides being the practical place to go when traveling by train, the building is a must visit while in downtown LA. The hall at the entrance and the decorated floor, the high ceiling and the chandeliers. Warm feeling in such a practical location."], ["Reviewed January 10, 2018", 4.0, "Classic Massive US Train Staion", "LA's Union Station is a masterpiece of its style. This is the last of the great train stations built in US before planes replaced trains as main transport. With a little imagination, walking into its cavernous glamorous interior feels like being in the 1940's. Thanks to LA for the preservation.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Clean and easy to navigate", "First time travelers to L.A. but found the transit system great to use and very reasonably priced. Union Station was decorated for Christmas and was beautiful. The station is clean, information person was sweet and very helpful. Trains were clean. We used the system to go from downtown L.A. to Rose Bowl Parade and had no problems.\n\nThere is a beautiful restaurant in the lobby of the station that is very romantic. Also has fast food type services.\nShow less"], ["Reviewed January 9, 2018", 3.0, "Conveniently Located and Nicely Decorated", "I passed Union Station several times when I visited Los Angeles in December 2017. It is a historic building and nicely decorated with Spanish flavor.\n\nIt is conveniently located. From here it is walking distance to some interesting sights, such as Chinatown, Little Tokyo, and Olivera Street. It is also photogenic.\n\nHowever, as a train station, I do not think it is very user friendly. There are not many places to sit. The selection of restaurants and cafes is anemic. There are also no place for luggage storage.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Uncomplicated", "One of the best stations I've been to. There are trains and buses plying from the Union Station. On entering, there is art all around. It feels as if one has entered a museum. A couple of stores & cafes can get you whatever you need in your journey. A large hall with table & chairs helps you unwind. The stations for trains & buses are well segregated and very simple to access, as everything in one lane.\nShow less"], ["Reviewed January 4, 2018", 5.0, "You get a taste of LA in a different way", "I am from Long Island originally, and am somewhat used to taking trains in and out of the city. I was pleasantly surprised when I came to Union Station for the first time. It was pretty clean, spacious and easy to navigate. There are different colored lines for where you need to go and machines to refill or buy new metro cards (day passes or just one rides) ... convenient and not difficult to deal with. Trains were on time. There were a few straggling homeless people, but you can always expect that in Los Angeles.\nShow less"], ["Reviewed January 3, 2018", 3.0, "We only go here if we have to", "I'm not sure why someone would go to Union Station to look around. The signs inside are helpful for finding your connecting train. The bathrooms are really nasty, my husband and I play rock, paper, scissors to see who has to take the toddler to the bathroom because neither one of us wants to go to the bathrooms here. The flyaway bus to LAX is nice and the whenever I have had questions all of the employees here have been helpful. There are always lots of police here but I barely see any police anywhere else on the metro's trains.\nShow less"], ["Reviewed January 3, 2018", 4.0, "An architectural marvel, but a sometimes confusing travel experience.", "A recent renovation and restoration of the ornate lobby ceiling and ongoing art exhibits throughout the tunnels to the trains helps ease the usual anxiety of traveling. You can catch Amtrak and local Metro trains from the station, which is on the near outskirts of the booming neighborhoods of Downtown Los Angeles.\nThe retro station has adapted to modern needs by upgrading the food options, creating designated zones for shared rides and keeping the lobby seating open only to ticketed passengers. However, the FlyAway Bus drop off in Patsaouras Transit Center is more cumbersome than ever, now that cars and taxis have to drop passengers inside the parking garage. From the garage, you have to figure out without the help of signage how to schlep your luggage up a ramp, into an elevator, across a roadway and down to the ticket booth.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great travel hub connecting all of LA!", "I love traveling through Union Station in downtown LA, mainly for its historic beauty. It's also clean and I do feel safe there. The only downside is the bathrooms. They're small and need to be updated to accommodate the level of traffic traveling through the Station. Food options are limited but sufficient.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Beautiful symbol of LA's transportation evolution", "Opened in 1939, Union Station was the last of the great rail stations built during the heyday of rail travel. It was placed on the National Register of Historic Places in 1980. The interior, decorated in the Art Deco style, is beautifully preserved. Some of the original furnishings are still in use today. In the 1990's, Union Station was re-purposed to serve as a transportation hub for Los Angeles Metro subway, Amtrak and MetroLink. It is a beautiful building and is home to LA's transportation evolution for almost a century. If you are an architect or rail buff, a tour of this historic building should be on your bucket list.\n\nLocated in downtown LA, Union Station is a few blocks away from Chinatown, Little Tokyo, Japanese American National Museum, Olvera Street, and Cathedral of Our Lady of the Angels.\n\nWithin Union Station, you can catch the Metro Red Line to connect to the Blue Line to Long Beach and the Expo Line to Santa Monica. The Blue Line will connect to the Green Line that will take you to Los Angeles International Airport (LAX). On the Red Line you can reach Kaiser Sunset Hospital, Children's Hospital, Pantages Theatre, Hollywood, Universal City and North Hollywood. The Metro Gold Line will take you eastwards to Pasadena and ending in Azusa, until the next extension to the line is built.\nShow less"], ["Reviewed January 1, 2018", 5.0, "LAX to Union Station--NICE!!!", "Discovered the fastest--and probably cheapest--way to escape LAX and end up at the gorgeous Union Station landmark. Outside LAX ground transportation is the FlyAway shuttle bus to Union Station. Had to wait about 15 minutes, but I hopped right on and ended up at Union Station faster, cheaper, and easier than having my brother pick me up (especially since he overslept and forgot to meet me at the airport-)\n\nOn arrival at Union Station, the driver instructed everyone to pay for their tickets and then they could get any luggage stored on the bus. At $9.75, cash or credit, it was a bargain!\n\nMy brother showed up at that point and we got to walk into the 1920's Art Deco Union Station and admire the high wooden beams that reminded us that even Art Deco had to incorporate a Spanish monastery design...it was so beautiful, I almost thanked my brother for being late...almost.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Great old beautiful Art Deco building", "Like alll train stations, they are challenging with tracks, timetables, and wild collections of people. But, the terminal and waiting area is gorgeous. A mid-century temple to large Art Deco it is a must visit. Occasionally good music events in the space. Near downtown. Love the place.\nShow less"], ["Reviewed December 27, 2017", 5.0, "A museum inside of a train station", "I met a friend at Union Station as a meeting place for lunch. I had the opportunity to look around the place, and admire it's amazing architecture from the early 1900s. I sat in the original waiting room chairs, and imagined what it would have been like back in the 1930s. Travel was glamorous back then. Now not so much. But it's still a great place to travel to and from your chosen destinations. And I still wear fancy earrings out of respect for the the way it was.\nShow less"], ["Reviewed December 25, 2017", 5.0, "over the top", "We checked in early as we had a sleeper Amtrak had a hospitality room. Large TV, Drinks and snacks provided without cost. The staff in both the room and at the information booth were the best."], ["Reviewed December 21, 2017", 4.0, "A stunning throwback to another time", "Union Station in downtown Los Angeles is a jewel of a building, designed in the Mission style and exuding an air of casual sophistication from another era. The building was finished pretty much around the time that train travel gave way to other forms of transportation, but the city and Amtrak have maintained the structure over the years. Even if you're venturing no further than Olvera Street just a few blocks away, a visit to Union Station is a treat.\nShow less"], ["Reviewed December 21, 2017", 5.0, "A Train Station And So Much More", "A Train Station And So Much More\n\nYou will love the architecture of Union Station and may well see a film or television show being filmed as you enter the station. Allow yourself, ten minutes more time than you would have thought it was going to take you to get to your train and wear comfy shoes as you may have some walking to do.\n\nNow for the good news. Pop your head out of the station and get to the first street and turn right. You will see this Philippes. Yum. If the walls could talk the stories they could tell. Rich and poor have all dined here. Get their famous French dip with blue cheese and a piece of cherry pie for dessert. If on the other hand you turn left you will after about a nine minute walk arrive at Olivera street which is famous for great Mexican food and some great shirts in the shops there. These two places are safe to walk to but watch yourself in the other surrounding areas. Bit rough down there.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Transit Terminal", "A Huge place.Indoor and outdoor, an architectural gem.with connections to subway and trains. Metrolink, Amtrak, Red Line etc. Even larger than it needs to be."], ["Reviewed December 20, 2017", 5.0, "Union Station", "This train station is iconic in its design the station has been used in many movies and Television ads. Across from the train station is Alvera Street one of the first settlements in Los Angeles."], ["Reviewed December 17, 2017", 4.0, "Great architecture", "I wouldn't necessarily go here if I were not using an actual train. But the building is very neat, the architecture is wonderful. It is close to other places you can walk around to."], ["Reviewed December 11, 2017", 4.0, "Re-visiting the 1930's in Los Angeles", "Love the style of architect for this building. It is like going back in time. You truly appreciate the style and yet they have modern food places that meet your needs."], ["Reviewed December 7, 2017", 5.0, "A landmark and a good station", "This place is a must see if you're visiting downtown Los Angeles. You'll see a whole cross section of Los Angeles that you won't anywhere else. Along with that you'll be in the midst of art and architecture that are not to be missed."], ["Reviewed December 6, 2017", 4.0, "The guided tours!", "It's not just about taking the train; the station itself is beautiful! Go on line and check out the schedules for the guided tours. I took an art tour that expanded beyond Union station and into other stations. It was so much fun! The reason for the 4 stars is that I generally don't use the station but once in a while to head out of town like Santa Barbara (which was smooth and pleasant).\nShow less"], ["Reviewed December 3, 2017", 5.0, "november visit", "very nice station we walked inside after seeing the Olvera street and china town in the neighborhood"], ["Reviewed December 2, 2017", 1.0, "Stay away from Security", "The Security detail at this station is subpar. The young people are ill equipped to be ambassadors to a large metropolis like Los Los Angeles and a beautiful architectural structure like Union Station. The younger group that we encountered were the very first \"Angelenos\" we met and all they could do was bark at us about don't sit there, sit here! You can't leave your bags there. Bad experience. All other Amtrak personnel was great.\nShow less"], ["Reviewed December 1, 2017", 3.0, "Huge but Navigable", "Union station is easy to get around; even though it is huge. It is easy to find your way to the Metro or Amtrak areas. There is even a bus circle outside for airport transport which is very reasonably priced for the quick service. I would say it is average in cleanliness. Oh, there are fresh hot pretzels on the main level and the are yum!\nShow less"], ["Reviewed December 1, 2017", 4.0, "Good atmosphere", "The staff that works there is very helpful. They have a variety of places to eat. They have beautiful artwork and architecture."], ["Reviewed December 1, 2017", 5.0, "A Pace Where Time Stands Still", "It is like going back in time. It's beautiful. The architecture is a throw-back to the Art Deco era. The historic Phillippe's restaurant is 1000 yards down the road, and the famous Olvera Street market and cultural community is directly across the street. SO many things to see and do in walking distance.\nShow less"], ["Reviewed December 1, 2017", 5.0, "California Art Deco Masterpiece", "I have many memories from my childhood of meeting relatives at Union Station who arrived by train from Texas each year. This beautiful structure built in the 1930's has weathered the test of time and is now a modern transportation hub for the Los Angeles area. Whether you relax in the spacious lobby or walk down the tiled tunnel to awaiting trains you will be amazed at the Art Deco decor. If you look closely you will find the original train schedule board from the early days in the lobby noting the original passenger railroads serving the station, Union Pacific, Southern Pacific and Santa Fe. On our last visit we noted there are now shopping kiosks in the main lobby as well as a Subway, Starbucks and Wetzels Pretzels. TRAXX, a fine dining restaurant, is also located in the lobby area. Just a short walk from the station is historic Olavera Street and a visit to the area would not be complete without enjoying a french dip sandwich at Phillipes.\nShow less"], ["Reviewed November 30, 2017", 4.0, "Union Station", "walked from here to Plaza Olvera just across the street. It has beautiful architectures and elaborate windows, tile and colors."], ["Reviewed November 18, 2017", 5.0, "Lovely building and a haven of peace.", "I stopped by about ten times in two LA visits.Each time I used the station as a quiet resting and watering place,\nThe main waiting area is stunning. The courtyards on either side of it are a tranquil aerea to sit and eat in. The lobby has shoe shine stall, eating places and shops.\nThe excellent trams link into the station and Metro lines. The local and long distant trains go from platforms along a long corridor.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Remodeled and improved", "It's good to see that Los Angeles means of transportation has developed into one of the more current stations in California. I do look forward to taking a trip in the near future to maybe San Diego and will travel through this station."], ["Reviewed November 17, 2017", 4.0, "Clean and organised", "Been here many times. Has a grand entrance, nice old style hallway and shops. Well sign posted for all the trains and buses, plenty of staff around to help you with the ticket machines."], ["Reviewed November 16, 2017", 5.0, "This place should be in a movie! Wait, it is!!", "If you want Californian history and culture summed up in one place go to Union Station. This place is absolutely wonderful. If you are on a short trip to LA, take time to visit here as well as the theme parks.\n\nLook, the theme parks are fun, but they are 'theme parks'. Union Station is the real deal. It is deeply, fully, solidly, authentic. It is a place of art, but mostly a place of work. Real trains come and go. Real people walk through the halls and purchase real tickets to go on real trains.\n\nThe leather, wood and glass doesn't come from a 1950's movie - they are from the 1950's. Forget the trains. Just spend some time sitting and watching the life of this magnificent centre. Marble floors, marble walls, decorations, attention to detail, the colours that diffuse through the halls and rooms.\n\nSome of my favourite movies (Bladerunner, The Dark Night Rises, The Fabulous Baker Boys, to name a few) have scenes shot here. Californian film noir needs Union Station.\n\nI am a sucker for trains, so I'm biased in favour of stations. But I think I'm amongst good company when I say this is an architectural triumph. If you're thinking of taking a train in LA (and you should) then make sure Union Station is on the list or stops.\nShow less"], ["Reviewed November 16, 2017", 5.0, "Walking tour? You must come to Union Station!", "There was in the 60's something called the Santa Fe Railroad Club for train riding afficionados, and my grandmother belonged. Though we were only small children, my brother and I were just old enough to go on some of the trips with her, and they all departed from Union Station.\n\nIt was a thrill to go back and see the place. Though it's been spiffed up some since those days, the beautiful art deco-ness survives, and there are now a creperie/coffee place and an upscale dining option called Traxx to entertain unticketed visitors like me. There are also these tall wood-and-leather square back chairs that are are original--I remember sitting in them pretending they were thrones.\n\nThis time I sat in one and imagined the Simon & Garfunkel song \"America\". Though that song was about a bus ride and not a train station, you can nonetheless be endlessly entertained looking for \"the man in the gabardine suit\" whose \"bowtie is really a camera\". And if you're super lucky, as I was, the air might be full of the music of a not-very-recently-employed but obviously gifted musician who wandered in off the street to play the free piano.\nShow less"], ["Reviewed November 16, 2017", 4.0, "Destination Station", "Union station is beautifully built, easy to maneuver, and very user friendly. There are always people about to assist you. And, the restaurant at the front serves remarkably good food. Great place to travel from or to!"], ["Reviewed November 14, 2017", 5.0, "BEAUTIFUL", "Have visited here to get the Amtrak and the Dodger Express. What a beautiful, well maintained building. There is a great selection of places to eat and drink. It is worth a visit just to see the building. One of the best stations I have ever been in.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Architectural Beauty", "Union Station is a functioning railroad station as well as a beautiful look into Los Angeles from years gone by. Built in the 1930 and has served the Western USA ever since. Well worth a visit."], ["Reviewed November 13, 2017", 5.0, "Gateway to Los Angeles", "Just the perfect way to see old LA!\n\nWe rode the Metro Link from San Bernardino (Riverside didn't have a direct route at the time we needed) and was able to visit Phillipe's, China Town and Olvera Street. From Union Station you can catch a connecting train to anywhere in Los Angeles. Plenty of trains headed back to the Inland Empire so we didn't have to rush or try to cut our visit short or have a long wait when we were ready to go. We will do it again real soon!\nShow less"], ["Reviewed November 12, 2017", 5.0, "RARE ARCHITECTURAL GEM", "An aesthetic functional experience. Not to be missed Traxx for a delicious mea. The entire ambiance of Union Station we owe to the Parkinson Team."], ["Reviewed November 12, 2017", 5.0, "Rennovations are good.", "For the past 5 years Union station got a lot of nice upgrades. A lot of people are traveling, LA Metro did satisfactory job. There is room for improvement for underpasses, signage, schedules. Security is satisfactory taking in consideration an increasing criminal activity."], ["Reviewed November 11, 2017", 1.0, "Never again", "Maybe was better or I'm just bitter now. I've just seen 4 flyaway van Nuys buses and not one union station one. It has been over an hour and fifteen minutes. Stupid waste of time and never taking it again from the airport. I will say taking it to the airport has been an ok experience. I give up on flyaway though. Terrible\nShow less"], ["Reviewed November 11, 2017", 4.0, "Architectural Gem still functional", "Filled wih history and worth seeing You can double up by taking light rail to the shared location,touring the station(s) and then embarking on a rail trip. trip will allow you to see even more of the station and enjoy the hospitality of AMTRAK.\n\nIf you don't opt for a train ride, you can cross the street and visit Olvera Street and see more of old Los Angeles's history. Parking is limited, so the light rail arrival makes better sense.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Enjoyed the Metropolitan Lounge", "This renovated station is a nice step back in time. Access to Metropolitan Lounge with Business Class ticket. Snacks, soft drinks, and TV while waiting for the train. Friendly staff who shuttled us to the train even though it would have been a short walk."], ["Reviewed November 10, 2017", 5.0, "gorgeous !", "We lived near by, so I walked through it every day. The historical building is very magnificent and attracted a lot of tourists and passengers. It was the background for many movies like Pearl Harbor etc."], ["Reviewed November 10, 2017", 4.0, "I love trains!", "The fact of the matter is that I love trains. So my opinion is a bit bias. Trains are an AWESOME way to travel, and it all starts with the good train station which Union Station is.\n\nNow... I've traveled across Europe, India, and some parts of the middle east, so I really can't give it 5 stars, given that, unfortunately, trains are not the main mode of transportation, especially in LA, it is simply not as impressive as some of the train stations I have crossed in my travels.\n\nHaving said that, the architecture is very nice, it's easily accessible, centrally located, with a good set of routs (this could be improved but I can't fault the station for it, this is more the train providers, but still). The station itself has all the amenities you'd expect with multiple eateries, bus connections, a lounge area, two gardens to hang out in while you wait, and it even has a rental car facility.\n\nAll in all, a good, iconic train station. Certainly above average, what would really make it a true five star (and again, I really can't blame the station for this as much as the train companies) is the lack of routs. Union station could be an awesome waypoint for travel via trains, but as I mentioned above, unfortunately we Americas are way to dependent on our cars. Trains provide such a wonderful way to travel instead of driving that I simply don't get why our country is not criss crossed with tracks. There is nothing like sitting in a shared space with people you don't know, striking up conversations while beautiful scenic vistas pass you by.\nShow less"], ["Reviewed November 10, 2017", 4.0, "Fantastic architecture and venue", "This is a beautifully restored station from the heyday of Trains. The waiting area is amazing and there are good places to eat and fast food. It is a terminus for buses and subways too."], ["Reviewed November 9, 2017", 5.0, "Like Stepping Into Set of LA Confidential", "Walking into Union Station is like stepping back in time to an era of glamour in terms of its beautiful architecture. Of course, DTLA isn't the best neighborhood, so that part isn't great, but it's worth a visit to marvel at the architecture which has appeared in many movies. I believe key scenes in several movies have been filmed here. It might be interesting to watch them right before visiting.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great Architecture", "What I like most about Union Station is the architecture and decor. The main hall is a great place to just rest for a bit.\nIt is also a good place to connect not only with trains, but the LAX Fly Away bus and the metro\nShow less"], ["Reviewed November 9, 2017", 5.0, "Decade After Decade!", "When I was little (and the world was, perhaps, a bit safer for kids) I could take the RedCar from where I lived (near the ocean) all the way to Union Station alone. I would feel so tiny sitting in the (then and still) gigantic seats in the waiting area. I would walk right across the street and get some taquitos at Olvera Street (with green mystery sauce on it) and then visit the basement candle shop just to smell the hundreds of fragrances. They say it became a rough and seedy area years ago, but I still go regularly and don't find it anything other than perfectly authentic. Lots of places to eat Italian food, Chinese food, and traditional American food as well. Nobody will be disappointed with a visit to Union Station and Olvera Street (two places, one parking space).\nShow less"], ["Reviewed November 9, 2017", 5.0, "Making a Big Comeback", "I remember when Union Station was on its way to becoming a derelict. When i was dependent solely on Amtrak -- and Amtrak's service was beginning to dwindle -- things looked bad. But then with the new subways, Metrolink lines, and Metrorail, Union Station has become a happening place. There are restaurants, stores, and even a bar.\nShow less"], ["Reviewed November 9, 2017", 4.0, "Great to get in L.A. and steps from Olivera Street.", "I have used the transit to Union City. I always to Olvera Street and ten blocks down one get get to the Grand Central Market. There is now a little funicular that takes you up close to The Broad and Disney Concert Hall for $1 or 50 cents if you have metro/tap card...there is also a very nice restaurant inside the station.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Classic LA", "One of the most unique buildings in Los Angeles. Everyone has seen it in numerous movies and commercials. The trains run all day long, and there's a great bar, solid restaurant and phenominal people watching."], ["Reviewed November 4, 2017", 5.0, "Oh, yes, there are trains too...", "Even if America hasn't quite fully rediscovered the appeals of train travel, it has clearly embraced the love, life and romance to be found in many of the country's most historic train stations. The palatial splendor of Washington, D.C., the meticulous display of westward power in Kansas City (including Pierpont's, its restaurant of classic redwood, brass and leather with an inclining ladder to reach its six tiers of bar shelves) and then, perhaps the best of all, the Union Station of Los Angeles-- a gemstone landmark of the city's downtown renaissance.\nUnlike the ornate limestone museums of other railway capitals, the L.A. has restored its monastic one-story coolness of Spanish Colonial design from its hand-painted paneled wood ceilings to its waiting floors of over-sized leather club chairs and enormous arched windows, comfortable enough to spend the afternoon people-watching without having to bother catching a train. There are three restaurants, all diamond star quality, clearly favorites of people who never leave Los Angeles: Traxx Bar and Restaurant, stylish dining, and Café Crepe, which turns out crepes for every hour of the day, from breakfast croissants and eggs to dessert savouries, a list long enough to impress any Belgian on his way to the Grand Canyon. There is a variety of smaller bake shops and a handful of recognizable stops like Subway and Starbucks. Even the six-day shoe shine & repair stand, overseen by its maestro Marco, is a throne-like section of leather and brass that makes anyone want to shed their sneakers.\nAnd because this is Los Angeles, Hollywood, after all, there is an endless collection of street characters, including people who look like they were or should be in show business: at Traxx, two men in the usual black on black outfits of the movie trade, are trading pitches over white wine and the hostess is so theatrical she looks ready to faint on cue. The only thing that's missing is a body, real or just a prop. If you happen to be passing through Los Angeles, make sure you leave a few hours between trains.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Historical and main railway station in LA", "We travelled by Amtrak train and departed from San Diego (Sante Fe) and arrived at Union Station Los Angeles.\n\nThis historical railway station is the largest railroad passenger terminal in the Western United States and was opened in May 1939 and was placed on the National Register of Historic Places in 1980.\n\nThis is a lovely old building of Spanish Colonial architecture.\n\nWe organised an Uber to take us to Santa Monica from here from the shared ride bay at the front of the station.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Train Hub", "This place is a hub from where all the metro lines and armtrack trains goes on different routes. This station is so big that it consists of even some cafes."], ["Reviewed October 29, 2017", 5.0, "Gem in LA", "Passed through Union Station checking in for our trip on Amtrak's Coast Starlight. Never knew that anything like this existed in LA: beautiful architecture and well maintained. And compared to train stations in many other stations - amazingly clean."], ["Reviewed October 29, 2017", 5.0, "Beautiful building", "The hub of the metro we got our tap cards here and the lady on the desk gave us maps and was happy and helpful Station is clean and tidy and well policed ,worth a visit"], ["Reviewed October 22, 2017", 5.0, "Historical", "As a high school student, I was a docent for DTLA. Union Station was definitely one of my stops. It is such a historical building and offers many amenities now that it is a transportation hub."], ["Reviewed October 19, 2017", 4.0, "Blast from the Past", "If you want to experience a blast from LA's limited historical past, go to Union Station. A relic from the early 20th century, it is a beautiful architectural tribute to an era of class and effortless glamour. The main hall is magnificent and the patio to the side is lovely. The best way to-and-fro is the MetroRail (\"Last stop, Union Station!\"). And if the eateries here don't do it for you, it's a VERY short walk to Olvera Street, Phillipe's (Home of the French Dip Sandwich), and Chinatown.\nShow less"], ["Reviewed October 17, 2017", 5.0, "A must see location", "When I was planning a trip to LA and San Diego California, I had to book a trip on the Amtrak (Business Class). What an amazing train ride down the Southern California Coast :-)"], ["Reviewed October 16, 2017", 5.0, "Fun trip", "Took Amtrak train to Disneyland, short ride, avoiding traffic. Bus free from Train to Disney if you show train tickets."], ["Reviewed October 16, 2017", 5.0, "A nice historical landmark", "It's a nostalgic, historical landmark. It's a nice place to visit to get a feel for old Los Angeles."], ["Reviewed October 16, 2017", 5.0, "Wonderful historic building", "Any train trip into or out of LA will most likely send you through Union Station. The building is wonderful and spread out with great features throughout. If you are waiting for your train or to collect someone, the seats are a perfect place to sit and watch the world wander by.\nShow less"], ["Reviewed October 11, 2017", 4.0, "beauitful building", "sometimes I take the metro to this station, it is very historic building. Take a small tour time if you get time there or wait while metro."], ["Reviewed October 3, 2017", 5.0, "Stepping Back In Time", "My beloved and I were headed to San Diego and rather than driving, we decided to take the Amtrak Surfliner and we were thrilled that we did! First, Union Station is a meticulously maintained lovely piece of nostalgia. The large leather seating chairs are plush and comfy... enough to lull me into a delightful nap. The ceilings are arched which makes for pleasant acoustics and ambiance. We now have only fond memories of our San Diego excursion which delightfully began with Union Station.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Union Station", "A great place to visit, have lunch and make your connections via Rail Travel. You can even take the Dodger Shuttle Bus to the ballgame and it is free. Connect to Amtrak, MetroLink, etc."], ["Reviewed October 3, 2017", 5.0, "Excellent facility and easy to find", "We arrived here to board our Coastal Express to San Francisco. All arrangements were fine, the waiting area is very comfortable and food offerings varied. Pleasant staff everywhere."], ["Reviewed October 2, 2017", 4.0, "Beautiful place", "Here is so nice. I liked this station so very much. A kind of historical place that remembered me 70th movies 😊"], ["Reviewed October 2, 2017", 5.0, "Los Angeles must see Train Station", "This iconic Los Angeles landmark is now a vibrant symbol of downtown’s renaissance. Dramatically reimagined as a dynamic destination for the arts, entertainment and culture, forging a vital new connection to the community, Union Station is now more than a bustling transportation hub in the heart of the city. It's a true cultural hub connecting the infinitely varied and wonderful elements of one of the world’s great cities... a gateway to the best of Los Angeles.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great place to wonder around if you have to pass though if you have some time between transits.", "This landmark location where a lot of trains, buses and subways all meet up for transfers. When I know my travels will pass me thru Union Station I always allow an extra hour or so to admire the architect and people watch. There are a few places to get food if want to plan a snack into your travels, I often get a pretzel there. You can train watch if you are into that. Union Station is well kept and clean every time I have visited. You may run into a panhandler or wayward spirit but they seem to keep pretty good control all of that.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Amtrak Tour", "Union Station always have that ancient looks to it, I love visiting this place every time I'm in Los Angeles, aside from the quiet ambience the excitement of riding the Amtrak train or Metro Lines are worth experiencing.\nDon't forget to get your Tap card!\nShow less"], ["Reviewed October 2, 2017", 5.0, "A little function, a lot of history", "Met a friend here who had a lay over on Amtrack. Went to breakfast up the street and took her for a quick tour through LA and downtown before it got busy."], ["Reviewed October 2, 2017", 5.0, "Love the building so much!!", "I dig the building so much.. just wish there were places to grab a dink and bite. I was there and nothing was open.. i walked over to alvero street."], ["Reviewed October 2, 2017", 4.0, "Union Station a blend of nostalgia and new", "The ease and convenience of navigating LA and its traffic can be achieved by maximizing the use of the Metro rail system. The heart of the system is the Union station with its beautiful mix of yesteryear and modern day amenities and facilities!"], ["Reviewed September 30, 2017", 5.0, "LA's Central Station", "Union Station was the first place I visited in the States (after transferring from LAX to my hotel) so it was a memorable experience. A popular Hollywood filming location since it was opened in 1939, especially noir detective films, the classic architecture of Union Station is unmistakeable and you feel like you are walking onto a film set from the 40s.\n\nThe station gets busy around peak times but the mood is more historical & reflective than fast and furious. There are plenty of food outlets and shops & there is a community piano added as part of the 'Play Me, I'm Yours' program which is often used. They also have paid shows & art exhibitions in the famous Ticketing Hall from time to time.\n\nAt the station you can get a 7-day metro pass that covers the whole of LA & beyond for $25 including stops at Universal Studios, Hollywood Boulevard and many more which I thought was good value.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Clean, safe and historic!", "We arrived at LAX and took the Flyaway to Union Station. It comes about every half an hour. The limo bus was comfortable and clean and we got to Union Station in about 40 minutes. Catching the Metro was easy. We got Tap cards and just loaded them with fares. We took a train ride to San Diego and were able to wait in the lobby with the nice brown leather old fashioned chairs. There were security guards that checked our boarding passes before entering the area. All around there were security guards at entrance areas, so, even with the crowds of people, you had a sense of safety. There were places you could buy snacks and light fare. There was even a live piano player giving Union Station a real flashback to the 50's. Enjoy the beautiful art deco architecture and the modern art on the walls. You can even cross the street for authentic Mexican food on Olvera Street.\nShow less"], ["Reviewed September 27, 2017", 5.0, "Grwat Service, Beautiful Achetecture! Get a cocktail in the lobby while waiting for your train!", "I recommend first class traveling. It's a tiny extra fee and so worth the extra service, prompt delivery to appropriate train and admission to a tiny complimentary waiting room with free ' average ' beverages and a television. The chairs and tables are comfortable and the windows are nice, large and clean; so is the bathroom. ;)\nFirst check out the magnificent main lobby. The cocktails and coffees are excellent. Service is prompt, polite, and engaging. A great travel experience!\nShow less"], ["Reviewed September 26, 2017", 5.0, "Center place for transport", "We stayed at hotel near to the Union Station hence we used Metro fairly. This is virtually the Central station for city train services further airport bus also starts here. The building looks ancient but very well preserved. There are restaurants and other amenities are here. The only downfall I saw was on off hours there is no staff to serve you.\nEven the outer appearance is very green and pleasing.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Well preserved/restored historic art-deco station", "Cool place to photograph. Great architecture. Worth a short stop, easily combined with Olvera Street visit just across the street."], ["Reviewed September 24, 2017", 5.0, "Fun!", "When we decided to take the metro to Little Tokyo we had to get out at Union Station. Really pretty waiting room, good directional signs, places to eat and drink."], ["Reviewed September 20, 2017", 5.0, "Step back in Time and Travel in Style!", "Any time I can take the train out of Union Station, I jump on it. Not only is it incredibly convenient but it is literally liking stepping into history. Walking through the interior, it doesn't take much for your imagination to take hold and whisk you back to LA in the 30's and 40's and of course any movie that was shot there. It's super easy to navigate and a pleasure to be in..anytime.\nShow less"], ["Reviewed September 20, 2017", 5.0, "A classic gem", "Many years ago this was a very popular spot, and was in danger of being demolished,, but because of a revival of train travel, it is getting busier again. The building is spacious, with two lovely gardens. I wish the Great Hall was open to the public.\nShow less"], ["Reviewed September 19, 2017", 4.0, "A Nostalgic Flashback To The Days When Travel By Rail Was King!", "I recently rode AMTRAK from San Diego to Los Angeles. This is a wonderful structure where one can travel to a variety of cities. I enjoy traveling through this train station each time the opportunity presents itself. It would be great if there were quality restaurants inside this station, but for now there are only a couple of low quality fast food stations. For travelers who need to get to LAX there is a low-cost FLY AWAY Bus which is available from the east end of the station. I am very much looking forward to the next time I pass through this wonderful train station.\nShow less"], ["Reviewed September 17, 2017", 3.0, "in good location", "Close to Little Tokyo, China Town and el Pueblo. Well comunicated with an airport. No drinking water dispensors, dirty restrooms. Waiting rooms just for those who bought tickets (over and over again you must demonstrate that you have a ticket). You may give performance on piano.\nShow less"], ["Reviewed September 16, 2017", 5.0, "A historic stop.", "Even if you are not a train travel fan, a visit to this iconic station is called for. State of the art in facility , yet retaining its old glory , the station is glorious from outside as well inside. Apart from trains , it provides easy access to a busy network of road and underground transport too.\nShow less"], ["Reviewed September 15, 2017", 4.0, "Nice Arcitecture", "travelled from the station to San Diego in an Amtrak train which was impressive. The station is a lovely building. We were there at just before ten at night and there were lots of police officers at the entrances which was a bit unnerving. I briefly went outside and could see why, as there were some people hanging around who didn't look too friendly. I went in to the toilet and there were two drug addicts lying flat out on the floor, not very good. Was actually glad to move on!\nShow less"], ["Reviewed September 14, 2017", 5.0, "The best train station in the USA", "this station has plenty of sights even if you aren't taking a train. beautiful tile work, gardens and old time train station feel and a great restaurant with inside and outside dining."], ["Reviewed September 13, 2017", 5.0, "On our way to San Diego", "SInce my kids have never been on the metro trains, my father and I took them to catch Amtrak via Metro trains from my parents house in Baldwin Hills. Once the Metro trains dropped us off at Union Station my kids enjoyed the atmosphere that only Union Station can bring. The people, the venders and of course the Amtrak.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A Travel Back in Time!", "This is a must see gem! This station services Greyhound bus lines, Metrolink, Amtrack, and Metro Rail subways. I love the original state it is in, a peek at the past with it's architecture, furnishings, paintings, ticket booths and more. I can spend an entire afternoon just people watching. Across the street is Olvera Street, a mexican village that you must visit. There are several eateries and restaurants at Union Station that are delicious and elegant. The garden has been used for weddings, a perfect glimpse to the past.\nShow less"], ["Reviewed September 12, 2017", 4.0, "Union Station", "Still amazed by all of the remodeling at Union Station. The process of taking the Bolt bus was extremely easy and efficient."], ["Reviewed September 11, 2017", 5.0, "Headed Home", "I was headed home to Florida when I had to take a stop this way. I never been to Union Station all my years of living in Southern California. I must say I was impressed from the architecture to the art. You will meet the most interesting people from Hippies, City People to unique individuals.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Classic!", "From here you can get to ANYWHERE really! Ride the local Metro system to locations around the LA metropolitan area. Or take the Amtrak and you can see the entire country and even make it to Mexico or Canada! Besides this when you walk inside the main wiring area it is like stepping back in time. It is a classic!\nShow less"], ["Reviewed September 9, 2017", 5.0, "Beautiful inside and out", "It's amazing that this is a functional train station because it feels done-up with beautiful furnishings and architecture- as well as a beautiful outdoor courtyard. Very peaceful and worth a peek inside."], ["Reviewed September 7, 2017", 4.0, "Museums near the station", "We took AMTRAK to LA from Seattle. The trip ended in Union Station. The station itself is nice and has some food available and sundries. We stayed at a hotel near the station since the train came in around 9pm. The next day we found several free museums within easy walking distance of the station. We went to the Chinese American, the Italian American and fire station museums. They were open 10-3. There are other places of interest including a Japanese American museum, a Mexican American area, Chinatown, Little Tokyo, Contemporary Arts museum and others. So if you have time to kill during the day, get out and walk around!\nShow less"], ["Reviewed September 7, 2017", 4.0, "Very clean and beautiful station", "Union station is a very clean, leave and beautiful rail station. This serves as a hub for Amtrak, the LA metro and various bus lines. It's also very safe inside with many people on hand to help answer questions and get you on your way."], ["Reviewed September 6, 2017", 5.0, "An historic building in LA", "The older part of this terminal is a great example of historic LA architecture, free to wander around in."], ["Reviewed September 6, 2017", 3.0, "Very Impressive Building", "There's very few railways stations as grand as Union Station in LA. I would recommend giving this place a Vista just to see the grandeur"], ["Reviewed September 6, 2017", 4.0, "Train station from LA to San Diego", "A busy station. Able to buy my train ticket and jump into the train with my big luggage within 15 mins. Train depart on time."], ["Reviewed September 5, 2017", 3.0, "I used to love this beautiful architechtural gem....its still there but now it is jam packed which is really good as the", "trains are great! The bathrooms could be expanded. as when a couple trains come at once there is a real wait...When I compare this place to Japanese rail what i really find missing...in the station and in the trains are MAPS...colour coded maps to assist hurried and often overly tired travelers.And I could not find a map to carry WITH ME anywhere!\nShow less"], ["Reviewed September 3, 2017", 4.0, "Tour of Union Station - Neat", "We got lucky and hitched a ride with a 'Red Cap''. We asked directions and he loaded us into his golf cart and took us around the station. He was a real ambassador for Union Station and clearly lives and breathes it with a passion.\nI would recommend looking out for a Red Cap, and seeking their help with directions or even a short tour.\nThe building itself is historic and dates from the 19th century. We were also lucky enough to see some movie making in the lobby area. Highly recommended for an hour or so - and of course it is a short walk to Olvera Street where LA has its origins.\nShow less"], ["Reviewed September 2, 2017", 2.0, "Los Angeles Union Station", "It's a lot of homeless people walking around in the union station. I was harassed by a man I had to call and yell for security. Someone need to get that under control."], ["Reviewed August 29, 2017", 5.0, "A breath of history", "The murals are so beautiful. Walking though the place itself is breathtaking. Parking is hard, though."], ["Reviewed August 29, 2017", 5.0, "Always nice staff", "I come here once a month for Dr visits from Las Vegas and get dropped off at Union Station. The staff is always nice, some greet me by name lol\n\nWhenever there's someone being a nuisance they are on top of it right away. Lots of plain clothes personal which I like!\n\nAlways feel safe here!\nShow less"], ["Reviewed August 28, 2017", 5.0, "Nice to see history and moden", "It's a nice place with history with modern conveniences. Nice restaurant inside but a little $$$ for my wallet. I will caution you from walking at night out from the area alone. Don't do it. Not the best surrounding area."], ["Reviewed August 28, 2017", 5.0, "Fun Times", "New York has Grand Cental Station. Los Angels has Union Station. If you are a person who enjoys taking the train from local trips to long trips then you will enjoy taking the train from Union Station. What I like about Union Station is located in the heart of Downtown Los Angeles with access from surrounding Los Angles County Cities.\n\nIf you are traveling up the coast to south to San Diego you will enjoy your short trip with coastal views. If you are a person who hates dealing with rush hours and traffic nightmare then you will love taking the train from Union Station.\n\nYou have several parking options. You have parking behind train station or parking lots within walking distance. The surfrider is the local Amtrak in CA. If you never took the train before is a great experience.\n\nYou have free wifi for travel experience. Also the option of enjoying some food or drinks to make your travel time much more enjoyable. I enjoy taking the train from San Diego to Los Angeles whenever I come into town.\n\nShow less"], ["Reviewed August 25, 2017", 5.0, "Excellent", "There were plenty of people around to offer assistance (where things are located, etc) and the station is small enough to get around easily, but also large enough to accommodate a lot of trains.\nIt's very clean, there are some places to shop for items and lots of choices for food.\nSignage is also good.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Beautiful buildling, helpful employees", "My daughter and I went to this station to get on the metro rail to visit downtown LA and use FLYAWAY to LAX. This building is very interesting. Art decorations are beautiful. There are several choices for dining. Employees are all very nice and helpful. They helped us buy tickets from the machine, too. Signs are clear and it was so easy to find where we wanted to go. We felt safe because there were security personnel everywhere. We made sure we reserved a few hours in this station to take pictures and just relax.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Timeless Union Station", "It's art deco style is truly timeless. There's a fine restaurant inside which I've heard is excellent and been there forever. You can go for the day and then hit Olivera Street and China Town nearby. Union Station is definitely is a Time Piece"], ["Reviewed August 18, 2017", 4.0, "One of the top Attractions in LA", "Enjoy Downtown Los Angeles from this old beautiful building! Watching a diversity of travelers, elegant architectural design, the garden and other related things is a very pleasant experience both for the adults and children."], ["Reviewed August 17, 2017", 4.0, "Union Station LA", "Here it is. The USLA where millions of people pick up trains 🚂 for everywhere. So particular. Visit it inside. Special!"], ["Reviewed August 17, 2017", 4.0, "Nicely restored and maintained train station", "Union Station is worth the stop. The old architecture and open feeling of the main halls and the gardens make it a very interesting spot to learn about railroad history in L.A."], ["Reviewed August 15, 2017", 4.0, "Historic Station Interiors from the 1930's", "Not really a destination for tourists; of course the central station for all rail services in the region, Amtrak, Commuter Rail, local and regional buses, LRT and subway systems."], ["Reviewed August 11, 2017", 5.0, "Great for Architect buffs", "The Union Station is an historical icon of downtown Los Angeles. The structure combines Art Deco, Mission Revival, and Streamline Moderne style, with architectural details such as eight-pointed stars, and even elements of Dutch Colonial Revival architecture. It has a garden patio and some of the walls are marble. Relax or have a bite to eat while you're waiting for the Amtrak to Chicago, Seattle, or New Orleans...or the local Metrolink to San Bernardino. Enjoy!\nShow less"], ["Reviewed August 10, 2017", 4.0, "Beautiful art deco station", "Loved the art deco style in the main lobby area. You can almost put yourself back in the 30s and 40s waiting for the next steam train. Worth a look if you like architecture."], ["Reviewed August 10, 2017", 3.0, "Big station", "We took a train into LA and arrived into Union Station. It was really just a station. Had a Ben & Jerry's, which was super delicious. The station itself was pretty spacious with comfortable seating. Wouldn't recommend the train, but that's for another review altogether. Not a ton of food options though.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Nostalgia is the key", "This is old LA Noir personified. Sad think is that the old restaurants and bars are closed and the food on offer now is so-so. Good news, many interesting food places within walking distance including Phillippe's! The art deco interior is worth the walk around the lobby. The massive train ticket sales hall is now preserved for private events but mostly used for a period movie set. When we visit this area, we plan a multi-location walking trip. Can even take the Metro as Union Station is the Metro hub. Trains are now under mild security so accessing the platforms without a ticket is dicey but we have talked our way thru on occasion.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Great hidden cafeteria!", "This station is a hidden gem right in the middle of the City. Step inside and you will feel like its the 1940's in a good way and you will instantly recognize how many commercials, films and TV shows have been shot here. Amazing architecture and a great cafeteria that only locals know about.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Early california architecture", "Union station is the hub for the Metrolink, Metrorail and Amtrak trains. The architecture is reminiscent of California missions and goes well with La Placita,Olvera Street (founding plaza) across the street. Nice visit Union Station and surrounding area."], ["Reviewed August 8, 2017", 4.0, "A Piece of Los Angeles History", "Beautiful old building with architecture you would never see in modern buildings. Pay attention to the walls, ceilings, and light fixtures. One ticketing area is sparse now, but you can still see where people once bought tickets. Info booth is very helpful! The man who was there when I was there had some interesting stories to tell about the station's past. Old oversized chairs are still in the lobby, but they only want passengers to sit there (We sat down anyway and they didn't kick us out!). The hubbub of the train area in contrast to the lobby area is a very interesting juxtaposition as to how we live our lives.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Love this historic place and the Fly Away Bus stop in the back.", "I use the Union Station mainly for traveling to and from the Los Angeles International Airport. In back of the station is the Fly Away ticketing and bus stop. For $9.75 each way, I can spare my family the agony of driving to LAX."], ["Reviewed August 8, 2017", 4.0, "Blast from the past- a must see Los Angeles Landmark", "Not much has changed since the original structure, take a glimpse of the original ticketing area and explore one of the last classic train stations in the United States."], ["Reviewed August 7, 2017", 4.0, "Visited during our Startline Movie Tour", "It ws very grand to see the least full of culture and places to sit and enjoy the scene. A place that reminds me of the major train station in my hometown. You can enjoy a bite , people watch and soak up the artchiteture.I would go back on my own.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Iconic Symbol of Los Angeles", "Built in 1939, the architecture of Union Station is stunning. The building's style combines Spanish Colonial, Mission Revivial, and Art Deco which is known as Mission Moderne. Massive Art Deco Chandeliers hang from the high ceilings. The enormous waiting room is filled with a mass of leather chairs, and is surrounded by dramatic 40-foot windows adorned with brass. The well-maintained floors are made of inlaid marble. The interior of this structure looks like the setting for an Alfred Hitchcock movie. There are several dining choices including Traxx Restaurant and Cafe Crepe. Also, you will find Ben and Jerry's Ice Cream, a Subway sandwich shop, Starbucks, and a few other snack shops. Once you exit, it's a short walk across Alameda St. to Olvera St. and Plaza and El Pueblo Historic Park. Also, nearby is Little Tokyo and Chinatown. My only issue was the messy women's restroom.\nShow less"], ["Reviewed August 3, 2017", 4.0, "Interesting place to view earlier time of Los Angeles", "Was passing through here on my way to the Dodger Game. It is actually a functioning train and bus station. Still has the older architecture and decor that was typical of an earlier time.\n\nNot sure when this facility was built. If you get a chance, come see it to view an earlier era of Los Angeles that has long passed by.\n\nThere is a Traxx Restaurant and Traxx Bar that looked kind of interesting. This place reminded me of Grand Central Terminal in New York. Had a very similar appearance.\n\nIf you have the opportunity, check it out when you're in Los Angeles.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Easy way to connect to other means of transportation.", "By far this was a very easy way to get around from one end of Los Angeles International airport to East Los Angeles with ease and economically. It was a very fun experience. The trip was fast and easy to connect from one means of transportation to another. We started at LAX and ended in San Gabriel with less than $10.00 for two people including uber which took us to the door steps of our home.\nShow less"], ["Reviewed July 23, 2017", 5.0, "The center of everything", "I have to give this full marks if for no other reason than you can get absolutely anywhere from here, so even if you're lost you won't be for long. Less than ten bucks for a direct shuttle to LAX, subway to Universal Studios or Hollywood for a buck seventy-five...if driving isn't your thing then this is the place. Across the street from Chinatown, Olvera Street, downtown LA and numerous restaurants and shopping. It's not so much a destination in itself but it's worth checking out if in the neighborhood even if you aren't planning on using it for transportation. Some food offerings, shops and services available as well.\nShow less"], ["Reviewed July 19, 2017", 3.0, "Meeting place", "Union station has a barber shop and some unique shops, it also occasionsly has a shoe shine guy. It is also located close to Olivera street where ther are plenty of specialty shops and foods, and you may catch a festival now and again or a performer.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Remember all those Train shots in the old Movies?", "Well this is the place (Sorry Brigham Young) if you like old Hollywood movies or Train stations.\n\nThis train depot is impeccably clean and neat and tidy. With some real old school and lovely atmosphere. As a added bonus, you get a taste of old LA while here.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Pacific Surfliner train", "relaxing, smooth & scenic ride. 37.00 each way. So much better than driving. I highly suggest the train from San Diego to Santa Barbara for a weekend getaway."], ["Reviewed July 16, 2017", 4.0, "A 'must see' for everyone", "Huge, clean and well managed, it's it's a place that everyone who lives in or visits Los Angeles should see. And as an added bonus, it;s right across the street from Olvera Plaza"], ["Reviewed July 15, 2017", 5.0, "Old time charm", "What a jewel. Brings you back to a black and white movie of the 1920's. impeccably clean and neat and tidy . Real old world with lovely atmosphere."], ["Reviewed July 14, 2017", 4.0, "Go back in time with architecture", "They opened the former ticketing area to the public so it was great to walk through this huge room, view the intricate woodwork, and the artistic floor tile.The restaurant building has been restored and will soon be open so the public can see this southwest motif. There are the gardens for sitting or eating, away from the hustle and bustle of today or years ago, We see this station in movies, TV shows, and commercials. You can stand in the waiting area putting yourself back to the day of the Pullman trains, the station full of people, many celebrities.\nShow less"], ["Reviewed July 12, 2017", 4.0, "very clean ane bright", "you feel u ae in LA and the people working there are friendly and nice, it is well lighted and clean, U feel safe"], ["Reviewed July 12, 2017", 4.0, "Union Station Review", "I was using Los Angeles' metro rail to travel from the westside downtown, leaving my car behind. I found the journey by light rail to be pleasant and efficient, and Union Station provided a host of eating venues, washrooms, etc. that were clean and pleasant. I expect to take the train and pass through Union Station often in the future!\nShow less"], ["Reviewed July 12, 2017", 4.0, "Union Station: Worth a visit", "Clean and functional. Worth a walk around before heading to Alvera St.. The stations offers dining options(more like good snacks)."], ["Reviewed July 12, 2017", 5.0, "A \"Must See\" for visitors and locals alike!", "I recently brought out-of-town visitors here and they thought our tour of Union Station was a highlight! The Station, completed in 1939, is beautiful mission moderne architecture with many art deco elements. The inlaid marble floors and mission tiles are gorgeous. The clock tower, massive windows and seating area with restored benches are something to behold. There's a nice restaurant, a variety of eats and a nice bar. Don't miss this historical structure in the center of downtown LA.\nShow less"], ["Reviewed July 12, 2017", 5.0, "it was a fun time with a nice view of functional architecture", "it was a very well-kept, clean environment; we enjoyed the ride as much as walking around the grounds. had a cup of coffee out front and people watched for a bit first, i mean youre going to a \"station\", so as long as youre expecting that, youll have a good time!\nShow less"], ["Reviewed July 12, 2017", 3.0, "A decent train station overall", "The folks working here are very nice & helpful...The seating is comfortable, but w/ all the 'ropes', getting to them can be tricky - no idea why all the roping off...the place is noisy as one would expect, so announcements can be hard to hear at times...\nShow less"], ["Reviewed July 11, 2017", 5.0, "Beautiful Architecture!", "One of the most beautiful train stations I have ever been to (including Grand Central)! Soaring ceilings and beautiful art deco architecture and seats with huge windows, letting TONS of natural light in. If you had to wait hours in a station...this is the one you'd want. Def worth a visit.\nShow less"], ["Reviewed July 11, 2017", 4.0, "I love old train stations!", "This station is just beautiful old school station. Very high ceilings, beautiful architect. Feels like you walked into another century. Lots of places to sit and we had crepes at a great little stand there. Kids were in awe, they had never seen something like this except in movies. Travel by train, great experience for the kids.\nShow less"], ["Reviewed July 11, 2017", 4.0, "A big beautiful train station with history.", "A piece of history and the last of the Grand Railway Stations built in the USA. It has a large sunlit airy feel coupled with the working afifancy of a transport hub. Dark wood and wide public areas beautiful floor tiles and ceiling. Many movies have been filmed here.\nShow less"], ["Reviewed July 10, 2017", 5.0, "A Gem In the Heart of the City", "I feel like Los Angeles gets the short end of the stick when it comes to people associating the City of Angels with vibrant culture and unique attractions. Union Station is one of those things I urge people to visit when they come to L.A., because it is a lovely structure with fantastic works of art and architectural points of interest that equal better known municipal structures throughout the country, and world. You will be pleasantly surprised, and I hope that Union Station will inspire people to dig deeper into the rich history and culture of Los Angeles, and the communities that come together and pass through its halls daily.\nShow less"], ["Reviewed July 10, 2017", 5.0, "LA's grand central railway station", "this is where it all comes together: metro (the local underground subway system), amtrak trains and busses, city to city busses, all united at a great historical building."], ["Reviewed July 10, 2017", 5.0, "Blast from the past into the future", "Great place to bring the family. If the kids are older go on a walking tour of the station, rsvp ahead of time. Beautiful station and you can also lunch there or go to nearby LA mainstay Phillipe's or to Rudolfo's across the street at Olvera Street.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Much better now...", "old Spanish tiled areas are now remodeled. Yeah !! but still difficult to park . You can also take the \"flyer\" bus to LAX or make your transfers to JERRY BROWN?S FAST TRAIN."], ["Reviewed July 10, 2017", 5.0, "So beautiful it is in movies!", "Fortunately, some smart city fathers made the wise choice to keep this building landmark instead of creating another one of less beauty. The interiors of this train station are from another era when train travel was sexy and classy. Give it a look when you are in the area dining at Philippe's across the street or going to ChinaTown next door. You will be glad you stopped by....\nShow less"], ["Reviewed July 10, 2017", 5.0, "Take a trip before you take a trip.", "Union Station in downtown LA has been revitalized, and restored with great style and a richly respectful salute to an important classical building. It features a marvelous culinary experience in TRAXX restaurant, and you'll find artworks and fascinating things to purchase throughout this engaging space. It neighbors Olvera Street which can be a great combination to a memorable visit.\nShow less"], ["Reviewed July 10, 2017", 5.0, "The station is the hub of the Amtrak's California regional routes.", "The station is the hub of the Amtrak's California regional routes, Amtrak's long distance trains, Metrolink commuter trains, several Metro Rail subway and light rail lines, buses,coach services and Los Angeles Dodgers commutes."], ["Reviewed July 10, 2017", 4.0, "Nicer than I expected", "Union Station was nicer than I expected it to be. It was pretty easy to navigate and there are really nice sitting areas when waiting for your train. Also there are lovely gardens outside to explore!"], ["Reviewed July 10, 2017", 4.0, "Liked the 1920's deco of the station", "Nice to walk through - clean enough. Interesting to see and some filming was actually going on when we were there."], ["Reviewed July 10, 2017", 5.0, "LA Port of Exit", "Los Angeles means Holly wood, Universal Studios, Disneyland and various other attractions... Its a city for cuisine varieties... Its a land of innovative cinemas & actors... But we are bound to always forget its 'Entry / Exit' points. Here is a review of one of them... who travel by train! The \"Union Station\" is world class and invites people of all ethnicity...\nShow less"], ["Reviewed July 9, 2017", 5.0, "Nice to walk thru", "It was great just to go and take a look at what the union station had to offer and we did it with a tour group so we got to see and hear about things we didn't know about."], ["Reviewed July 4, 2017", 5.0, "Always an attactive historical architectural exhibit", "This station possesses a classical design of monumental buildings to respect the European styles. It is hard now to take such a lot of time to design and construct a station like this."], ["Reviewed July 4, 2017", 5.0, "Return to 1939", "Union Station was (I think) the last true purpose built train station in the USA. Completed in 1939 its interior and exterior have been used in movies, TV shows, commercials and music videos. The whole station is done in an Art Nouveau style, including the chairs, fixtures, floors, and exterior courtyards. There is even an actual, operating shoe shine stand. It is a connecting point for Amtrak, MetroLink, and the Red, Purple, and Gold light rail lines, and numerous general purpose and special purpose buses (Dodger Express and LAX Flyaway). It is also across the street from Olvera Street and near Original Philippe's.\nShow less"], ["Reviewed July 3, 2017", 5.0, "The Transportation Hub of Los Angeles", "Connect to Amtrak, Megabus, LAX Flyaway Bus, Metro Trains, Metro Buses, Metrolink. All in one place."], ["Reviewed July 1, 2017", 4.0, "Nice architecture", "Surprisingly nice architecture. Main subway station. Transfer spot for all metrotrains, busses and pretty much any other way of transportation. Some coffee/food options to grabon your way. Travelers information spot, with maps, guides, trains timetables to grab."], ["Reviewed July 1, 2017", 5.0, "Amazing", "Loved the station. It feels like you are in movie. It's an American dream location. It's a train station but felt like you could just sit and people watch!"], ["Reviewed June 30, 2017", 4.0, "Historic", "This station is most unusual, very impressive big high ceilings, unusual seating. It's worth just to see even if you don't need a station"], ["Reviewed June 30, 2017", 4.0, "hub", "you can get just about anywhere in the city from union station. It's in downtown (so not great if you have to drive there) but safe, pretty clean and extremely busy. am track and metro lines are here."], ["Reviewed June 29, 2017", 4.0, "User friendly", "Arrived on Amtrak train into station well sign posted for both buses and trains.. Nice stone work well kept restored building clean, cool, variety of food and beverage outlets and the restrooms were clean. Even someone playing a piano in the main concourse. Lots of people milling around.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Beautiful Place", "I've seen Union Station in numerous movies and TV shows and always been impressed so just had to pop in whilst I was in LA. It didn't disappoint at all and, in fact, was better than I thought it would be, Great architecture, lovely gardens to sit in and those classic seats.\nWell worth half an hour of anyone's time.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Great Architecture in the station", "Union Station is not a must visit if you aren't getting a train but the station is still fairly nice and picturesque and probably worth popping into if you're down town."], ["Reviewed June 24, 2017", 5.0, "Classical station building with plenty of stone work", "Great timeless architecture and during the heat in 3rd wk in June 20117 very nice to walk through as the halls were confortable cool."], ["Reviewed June 23, 2017", 4.0, "Beautiful station", "Amazing building to walk through, great restoration. Staff are helpful to find trains or bus station."], ["Reviewed June 23, 2017", 5.0, "Help at the end of the line", "A very helpful gent at the info booth set us on our way to numerous destinations around LA. People are very friendly and helpful and keen to show off their wonderful city"], ["Reviewed June 23, 2017", 3.0, "Nice if you walk by", "Not worth the detour but nice to check it out if you're close by. They filmed one the scene in 500 days of summer there."], ["Reviewed June 22, 2017", 5.0, "Beautiful and lively", "Union station definitely lives up to the reviews I've read describing it as being such a neat place from a bygone era. I encountered friendly, helpful people- and the hall and outside garden area are beautiful. I love the old seats you sit in while waiting. My train got cancelled and I was excited to have more time in this station, people watching and relaxing. I was traveling during the day. I enjoyed a nice breakfast at the crepe place.\nShow less"], ["Reviewed June 16, 2017", 4.0, "is this really a tourist attraction?", "this is sort of interesting, but unless you have some great reason to be here i am not sure if its worth going out of the way for."], ["Reviewed June 15, 2017", 5.0, "Just like the old days", "We recently visited Los Angeles and San Diego. Because a flight from San Diego back home would cost an arm and a few toes, we decided to take Amtrak from LA to San Diego and back. Union Station is like stepping back into time, when America traveled at a slower pace and the trip was more enjoyable because you could actually see the countryside on the way to your destination. Going into the older parts of the station is like walking onto a movie set--you can almost see your favorite classic actor/actress getting on or off the train in black and white, as steam swirls and perhaps the rain is falling. The station even has a shoe shine stand, which I didn't know still existed. The train ride itself was wonderful, but that's for another review.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Metro to Union Station at the height of Women's March", "Took the Metro from the North Hollywood Station to the Union Station and Back with a group pf 22 people during the height of the Women's March in January 2017. It was packed with thousands of people, but orderly. The security at Union Station was tight.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Good for a short visit...combine with other nearby activities", "BEAUTIFUL!!!! All you need is a half hour max. Before of after, go across the street to Olvera Street ((FUN...but that's another review))."], ["Reviewed June 14, 2017", 5.0, "Secret Charm of LA", "As soon as you walk in, you will be taken back to 60's LA with a hint of Hollywood. Not to mention all the great movies and commercials that have been filmed at Union Station."], ["Reviewed June 14, 2017", 4.0, "Easy Access", "Any train to any remote location bus, rail or subway. It is inexpensive and for seniors a real great way to travel!"], ["Reviewed June 12, 2017", 5.0, "Clean And enjoyable station", "I visited here just because it was a station. It was clean and very well maintained. The old ticket section of the station (closed to walking) looks amazing and very beautiful. It was great to see the old style seating for customers"], ["Reviewed June 10, 2017", 5.0, "Charming, historical", "Came into Union Station on Amtrak and we really enjoyed seeing this historical landmark. They have preserved the atmosphere for the most part. We also ventured out to a courtyard that many people were enjoying. It is worth seeing and perhaps exceeds the charm of the New York, Philly, and DC stations in my opinion.\nShow less"], ["Reviewed June 10, 2017", 5.0, "You must visit this Art Deco/Spanish Mission marvel - in the heart of Downtown", "If you are visiting Downtown LA you must visit and explore this amazing building. One of the last great central railway terminals to be built in a major US City, the Union Terminal is in pretty much original condition, with a more recent extension having been done very sympathetically. Make sure you wander through the whole building, including the original ticketing hall which is now used for functions and movies and not ticket selling! The Metro goes right to the building and it is right near the spot where LA started as a Mission in the 1700s, so explore that area too!\nShow less"], ["Reviewed June 9, 2017", 5.0, "Best train depot in the West", "Clean and beautifully maintained building. Fun to take a round trip to San Diego. Easy to get on the metro and go off to Pasadena or the San Gabriel Valley."], ["Reviewed June 6, 2017", 4.0, "A beautiful train station", "I've been passing thru Union Station for many, many years and must say it's never looked better and safer. The work that has been done here over the years has been absolutely successful. It' s not really a destination in that I really wouldn't go out of my just to see it while visiting LA but combined with a visit to Olvera Street (5 minute walk) it's more than worth it. One word of caution though: Be aware that the bathrooms are still \"utilized\" by a few less than savory characters. Not at all as bad as the previous 30 years but something to know in advance. With that said it remains a very safe place to visit.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Great Art Deco Train Station", "This is a historic building which is a must see in Los Angeles. It is in the Art Deco style and the furniture and tile and decorations are original. There are good restaurants inside. Make a visit part of your trip to Olvera Street. It is just across the street from the station.\nShow less"]]}}