{"Union Square": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Union Square", "url": "/Attraction_Review-g60713-d103931-Reviews-Union_Square-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/39/26/a8/union-square.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1822"}, "address": {"@type": "PostalAddress", "streetAddress": "San Francisco Shopping Districts", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94102", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 4 days ago", 4.0, "It's the major shopping area", "Every large city has this area. If you need something from clothes to prescriptions then more than likely it will be here. Prices vary from what I seen. People say it's overpriced but to be honest I was in target and Ross and they weren't different from Texas or Louisiana. Always shop around unless you are short on time then go here.\nShow less"], ["Reviewed 6 days ago", 4.0, "Great little square :)", "I loved shopping here! It was very pleasant. The cable cars roll right through! Little coffee cafe right in the middle there and so many wonderful shops! It kind of felt like New York :)"], ["Reviewed 1 week ago", 4.0, "Fun morning!", "We enjoyed roaming through the stores, had breakfast, and enjoyed all the people watching opportunities. It was cold but sunny, so the stores were a welcome refuge!"], ["Reviewed 1 week ago", 3.0, "It's great for Bars and restaurants but....", "Bars and restaurants abundance, it seems to be all about the shopping. I didn't find it that exhilarating, and I LOVE to shop. It seemed to be sprawling and no real direction. Such a shame as I wanted to love 'Union Sq' but found it to be just a load of over priced shops and eateries, with not much glue. You can high end shop anywhere in the world. Macy's is consistent as usual!\nShow less"], ["Reviewed 1 week ago", 3.0, "Interesting area", "A lot of high end shopping mixed with professional pan handlers and homeless people. I'm not into the really expensive shops but it is a place you should see. In the daytime."], ["Reviewed 1 week ago", 3.0, "High end shopping", "Very high end shopping, even the Macy’s was overpriced. If you want high end, they have them all. There is a lot of construction in this area, which makes walking around a little challenge. This is a main place for the hop on hop off tour busses. There are a few street performers and a lot of homeless people. I never felt unsafe, but they do ask for change.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic High-End Shopping", "Lots of luxury stores to visit in the area. Great place to go for some retail therapy. Many excellent restaurants in the area as well"], ["Reviewed 2 weeks ago", 3.0, "Shopping and people watching in the small square", "The square itself is a good location for people watching. There's a nice little heart sculpture in the one corner. They had a large projection screen setup but it just seemed to be displaying ads when we were there. Otherwise, there are standard stores like Macy's in the area if you're looking for shopping. It's not a very big square with most of the seating being the sides/steps to sit on as opposed to dedicated benches. I didn't notice any public restrooms in the area.\nShow less"], ["Reviewed January 24, 2018", 1.0, "Just avoid this awful place", "11am dodging drug addicts lying face down on the pavement. We had food thrown at the cab we were in the streets sourniding union square are filled with homeless drug addicts. I didn't feel safe here at all. We hired a car opposite the Hilton Hotel. Followed the sat nav 2nd left into drug addict city. Couldn't get away quick enough and didn't want to return even to drop the car off. Such a shame as I looked forward to visiting this city of wonderful sights and things to do but don't bother go somewhere else we luckily stayed in fisherman's wharf which also has it's fair share of homeless but it felt a lot less threatening. Such a shame but this was the only part of my trip to US I couldn't wait to be oer\nShow less"], ["Reviewed January 23, 2018", 4.0, "Pretty good shopping", "Check out the shoe floor at Macy’s, which has every style you could imagine. Head down to Westfield San Francisco Centre for more great shops, including Bloomingdales. Be sure to check out the circular escalators in the Nordstrom Center."], ["Reviewed January 22, 2018", 4.0, "Santacon baby ! ! !", "I have been here many times. It has a great Christmas tree and a ice skating rink over the holidays. I try to go to Santacon when I can (its a big daytime drinking party) There are stores all around it and can be very \"toursty\" But its a nice to hang out on a sunny day.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Shopping Galore", "A shoppers paradise. Lots of stores, nice to walk around. Also, lots of eateries to choose from after shopping"], ["Reviewed January 20, 2018", 1.0, "Heartbreaking!", "I grew up coming to San Francisco to shop at Union Square. Every time, such an outing was greeted with happy anticipations and concluded with happy memories. I am a fourth generation Californian who's lived my adult life outside of the state. This January we spent a week in the city. I was shocked to see what's become of Union Square. It's third world in the worst way. When walking around you have to keep your eyes open to make sure you don't step on excrement, needles or the poor souls sleeping in the street. I've travelled extensively- nationally and internationally, and only one city I've visited can match this squalor. Even in Salvador, Brazil, you see them regularly washing the streets.\nShame on the city elders for ignoring this sorrowful plight.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Beautiful Area of San Francisco!", "This is the 2nd time I have stayed in the Union Square Dist. so great to walk by all the Big stores and window shop.\nTiffany's was on my list, but it was raining and I didn't want to track mud into that sparkling store just to \"look\".\nIt was Jan 2 and they were taking down the big Christmas tree in the Square the day we walked by. Love all the \"Hearts\" around town. Walking distance to many attractions. Bustling, fun area!\nShow less"], ["Reviewed January 17, 2018", 4.0, "Surprise!", "I was surprised, after hearing so much about Union Square, how small it is - the square itself I mea. Then I realized that Union Square actually refers to the whole surrounding area, which encompasses lots of goodies - hotels, restaurants, theatres, bars etc. The trolleys run through Powell St at the west (?) end so it's really accessible. All the grand shops are there - Hermes, Saks, Macy's, Tiffany. I was there just before Xmas and the decorations were glorious - specially at night. There is plenty of seating in the middle of the open square itself, with gardens all around, so it's actually a really sensible logical place to meet up. There was an ice skating rink set up for Christmas, where you can hire skates and equipment and pre book a session. It looked really popular and I guess it happens each Xmas. So if you're in SF next Xmas check it out. On one Saturday a couple of weeks before Xmas the Square and surrounding streets were awash with red, as EVERYONE was dressed in Santa suits and other xmas gear to party up and their Xmas shopping. It was super crowded, so depending on your penchant for socializing, Union Square may be a place you either rush to or avoid on Saturdays in December! See photo's attached and you'll see what I mean. It was nuts!\nShow less"], ["Reviewed January 15, 2018", 3.0, "Usual shops and hustle and bustle", "We came here to see what the fuss was all about but actually unless you like high end shopping it’s pretty much same same as other cities. There is Macy’s, a 9 level Westfield, including Nordstrom and the Nordstrom rack next door, Bloomingdales etc. not far is Nike town a building full of Nike gear. We tend to like sales and there didn’t seem to be that many sales. So we didn’t spend long here. There are a few homeless which is very sad. Coming from a pretty good welfare system in NZ it saddens us. Still good to have been there and done that and ticked it off our list to do in San Fran but when we come back to San Fran we may skip this area.\nShow less"], ["Reviewed January 14, 2018", 4.0, "A SF Focal Point", "The Square is an inviting place to meet and sit. It routinely hosts a range of seasonal activities, and as we walked through the square today we stopped and watched the ice skating rink in full use. Around the Square are luxury boutiques and high-end stores for the discerning shopper. Plus, the terminus for the Trolley Car to Fisherman’s Wharf is a few blocks away with the never-ending line of riders waiting to board. Union Square is definitely worth a visit during any San Francisco walk about, regardless of the amount of time you wish to spend there.\nShow less"], ["Reviewed January 6, 2018", 3.0, "Ok", "Quite a busy area. Quite a few high end shops. Would appeal more to people shopping. Good selection of places to eat. Christmas tree worth a look."], ["Reviewed January 3, 2018", 5.0, "Shopping area beautifully decorated for Christmas", "We were there Dec 27th, so the Christmas tree was still up and decorated. Some construction was going on on the right side of the square which made heavy traffic around the area even worse. The square is filled with lots of high end department stores and designer boutiques.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Interesting, busy open square area", "This is definitely a busy open square area, good for walking around as a public space. However, the multitude of vendor stands, and other tourist magenets throughout the square area puts a damper on this space as a truly \"relaxing\" place to spend time at. It's good for walking around and people watching.\nShow less"], ["Reviewed January 1, 2018", 3.0, "Still underwhelming!", "Union Square is the shopping area of San Francisco for people with very deep pockets because it's an expensive part of an already expensive city and so I do suggest that you blow your dough in other parts of the city where you get more back for your buck. There are several good coffee shops in the area though and Chinatown is not that far from the main square.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Visited Union Square and saw the Huge Christmas Tree", "Quite an impressive X'mas Tree with big crowds! The atmosphere was lively and our trip from San Jose to see this was worth!"], ["Reviewed December 24, 2017", 4.0, "Winter Visit - Still Construction", "Though I was staying at the Ritz-Carlton on Nob Hill this time, I walked down the steps to Lower Stockton St, and down the block to Union Square. There was still construction, and the Stockton & Post corner to be even more barricaded on this visit? The project IS taking a long time, but at least most areas of the Square have remained open – though some access might be restricted.\n\nAs this visit was in November/December, I was in for a surprise – the Holiday skating rink had been installed, and was in full operations – so there was less open area in the Square. Still, folk were enjoying themselves, and especially the kids. I did not get information on how long the skating rink will be open for, but it is something to consider, if visiting during, or just after the holidays.\n\nOtherwise, there were few changes, since my last visit, and those plantings, which have been undisturbed by the construction, or the skating rink, are still lovely.\n\nAlways a nice place to stroll, or sit and relax (weather depending), right in the heart of San Francisco.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Beautiful Christmas tree", "Union square is so beautiful in winter at night. The Macy's christmas tree is huge and beautifully lit. Great place for photos. Parking is tough but worth to go."], ["Reviewed December 23, 2017", 5.0, "San Francisco Union Square", "Great place to go shopping! The shopping experience in San Francisco is unique with most of the stores in a central area and traveling between stores requires walking outside except for the Westgate Mall San Francisco Centre. A great place to go shopping when the weather is good.\nShow less"], ["Reviewed December 20, 2017", 5.0, "Great Union Square - the Times Square of the West", "Yes, it can be crowded and sometimes occupied by strange people, but it is quintessential San Francisco in one block. It is surrounded by the finest hotels, restaurants, department stores, and shops... it now also has an Apple Store. It is a great gathering place with access to the Powell Street Cable Cars and only a few blocks away from BART on Market Street. Great place to watch people go through, or play. At Christmas time, there is an ice skating rink and Macy's has a huge Christmas Tree in the Square. Wonderful magical place to be.\nShow less"], ["Reviewed December 19, 2017", 3.0, "Crowded", "Fun and crowded, big Christmas tree, fast pace environment, old folks may get lost here. Very central to cable car, train station and bus stops. Big atrium for ice skating, main events vicinity."], ["Reviewed December 16, 2017", 4.0, "Crowded", "Quite a relatively small area which gets crowded and packed very easily as it's surrounding by large department stores and seems to be the centre for Xmas celebrations within the City.\n\nThe huge Xmas tree is a selfie/photo magnet so if you simply want to walk through, good luck!\nShow less"], ["Reviewed December 10, 2017", 5.0, "Do not get lost", "This is a park where many things and events happen. Yesterday was no exception. It was Santa Con in the City. Many city residents were wearing Santa outfits in all shapes and forms. There were all walking up and down the streets but this was a main gathering for some events. There is a tall Christmas tree in the center and again, a place to get lost. If you are with a group, have a plan where to meet before you split with each other because you can in a split second. The plaza is in the middle of all the shopping area. There are coffee shops and also many benches to sit and rest.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Great place for Xmas spirit!", "The Xmas tree is up as are the Macy’s decorations and the outdoor ice rink. Really puts you into the holiday spirit."], ["Reviewed November 20, 2017", 4.0, "Nice Square", "Very much enjoyed the atmosphere all around the square especially since the large Christmas tree has been lit up. It's a great place to sit and people watch."], ["Reviewed November 8, 2017", 4.0, "Great spot in SFO", "Great shopping spot in SFO! Tiffany's, Saks, Macy's and Swarovski all feature. Whilst I was there the ice rink and Xmas tree went up and looked amazing! Shopping central!"], ["Reviewed November 7, 2017", 3.0, "San Francisco Union Square", "We visited there in July, underground subway is going on , so there is a lot of waiting in that area. We will be glad when its completed. I like riding the cable cars through the city to union square."], ["Reviewed November 4, 2017", 3.0, "Not very interesting", "We walked to Union Square from our hotel as we had heard it was a good place to see. We were both very underwhelmed by it. It is just a pedestrianised square surrounded by shops. We are not shoppers and therefore this did not interest us. There did not seem to be much to see or information on the history of the same which would have been more interesting to us. However, we did not spend much time there so we may have missed something. I would recommend spending your time at the wharf instead.\nShow less"], ["Reviewed November 3, 2017", 4.0, "The commercial hub of the city of San Francisco", "We stayed about a block away from Union Square at The Donatello Hotel. We quite liked the area as it was quite vibrant and gave one many options in eating shopping etc. Union Square is the commercial hub of the city of San Francisco.\n\nYou will find many hotels,department stores, boutiques shops, restaurants, nightspots and galleries in the area surrounding Union Square.\n\nNearby at the intersection of Powell and Market Streets it is fasinateing to view the manual cable car turnaround.\n\nIts a great safe area to stay but expect to encounter some homeless. If you venture towards the Donatello away from Union Square a few blocks away is the Tenderloin where the mood changes and isn't a desirable place to visit after dark.\nShow less"], ["Reviewed November 3, 2017", 1.0, "We couldn't get out quick enough. Do something ... anything ... else.", "We caught the cable car to Union Square because we'd been told it was OK through the day. Well, I suppose if you like crowded, over-commercialised tourist traps then it's paradise. We couldn't wait to leave.\nWe had considered a hotel in this area. Thank goodness we were pre-warned by someone who had been unfortunate enough to stay there.\nDon't bother. You can get the same ripped-off experience in any city without trying. Spend your time enjoying the unique aspects of this beautiful city.\nShow less"], ["Reviewed November 3, 2017", 3.0, "Shopping Central", "Just imagine every high end store you can possibly imagine in one area. The center of it has artists in the square. It’s also close to the trolley turn around! As a tourist, I can say I’ve been there, done that, don’t need to go back.\nShow less"], ["Reviewed November 2, 2017", 4.0, "Not To Be Missed", "This is one of the better areas in San Fran. More of a business area. They have many good restaurants. A bus driver (they are very friendly here) advised to go to Sixth Street and walk into Westfield Mall. I could not believe what a beautiful place. The escalators go in the round and not to be missed.Beautiful park with waterfall and just a well kept area\nShow less"], ["Reviewed October 28, 2017", 4.0, "Unique Shopping", "Stores around a square are not unique but this is San Francisco and that makes all the difference. Wander around and go into the stores if you must. Construction in the street area is huge and interesting if you look down into the deep holes.\nGood spot to pick up a tour bus or watch the street traffic.\nParking much easier in public parking garage on corner of Stockton and Sutter.\nShow less"], ["Reviewed October 27, 2017", 3.0, "A construction site for years", "Endless construction works make Union Square a disappointment for the focal point of the area. Dominated by an ageing Macy's"], ["Reviewed October 26, 2017", 2.0, "Dazed Tourists Amid the Homeless", "Disclosure: I'm not a tourist but rather a SF native.\nDowntown SF has always been one of those downtowns where those who work there clear out at the end of day and the tourists who are left are confined to a small patch of Union Square-aesthetically-pleasing 'small square' surrounded by some retail shops. But venture toward Market St. or the side streets and you are in the land of dystopia. Expensive Teslas are juxtaposed against one homeless person shooting up and the other excreting on the sidewalk (I kid you not).\nConsider Fisherman's Wharf, Nob Hill, or Presidio Heights as alternative hotel destinations. Or better, a cute little AirBnB in Noe Valley.\nShow less"], ["Reviewed October 26, 2017", 4.0, "Favourite part of San Francisco", "Feels like the heart and soul of San Francisco, so much to do whether it be just walking around, eating and drinking, shopping - it has it all. I normally stay in one of the hotels bordering the square and just wander in and out all day. Unlike past trips, the Square itself didn't appeal - it seems to have been modernised with more structures and doesn't have the relaxing nature where you can just sit and enjoy.\nShow less"], ["Reviewed October 23, 2017", 4.0, "It is all here", "Everything seems to happen or begin from here. The square itself is bustling with cafes, people, artists etc. So many shops around. Just sit here and take it all in."], ["Reviewed October 18, 2017", 5.0, "Great place to explore", "Awesome place or rather shopping Paradise for people's, full of all brand outlets and departmental store like Macy's, Eatery outlet also Lots to choose from or go to pier 39 from there to relax."], ["Reviewed October 16, 2017", 4.0, "Shoppers heaven", "Union Square is the logical “centre” of San Francisco with all the major shops and hotels in or close to it. A couple of coffee shops in the square itself offer a great place to rest weary feet or to wait while wives go shopping!! It is also a great place to people watch although there are high numbers of beggars and vagrants. Transport links are great and the Cable Cars go through the square. There used to be a heart on each corner of the square but there are only 2 left, not sure why!\nShow less"], ["Reviewed October 13, 2017", 5.0, "most happening place of city", "yes its most happening place of city. All the major offices and shops are there. Its good to have a walk in the evening. Great view"], ["Reviewed October 11, 2017", 5.0, "You should visit it", "Union square is right in the middle of SF and has lots of department stores with a Cheesecake factory right on top of one, where from you can have great views over the square.\n\nIt seems to attract lots of people sitting or with dogs, homeless and there is lots of activity.\n\nWe visited several times: on foot, by car and using the Hop on hop off bus.\nShow less"], ["Reviewed September 28, 2017", 4.0, "A square", "It's a small square, but has a cool vibe day and night. Lots going on in and around the area. Quieter at night!"], ["Reviewed September 21, 2017", 4.0, "Union Square", "Union Square is a great spot to relax, people-watch, enjoy whatever activities are being staged or otherwise just doing nothing.\n\nAs many times as I have been to Union Square there was something different I found out during this visit? I had my camera and tripod so while my wife was shopping I was simply going to take some pictures. Unfortunately, tripods are a no-no according to venue staff who was patrolling the area making sure people weren't smoking or going through the trash looking for recyclables. He was pleasant but as soon as I set my unit up he came over and said, \"sorry to be a pain but to use a tripod you must have a permit!!!\" My reaction was WHAT!!!!!!! No worries, I understood he was only doing his job.\n\nUnion Square is a must stop as in addition to the plaza there were some interesting stores on the perimeter.\nShow less"], ["Reviewed September 20, 2017", 2.0, "Good for public transport", "It's a good option to stay in the city that is close to public transport. However unless you are into shopping at high end stores that are likely the same in your own country, go shopping elsewhere. Much more unique stores in the mission district. The square itself doesn't have anything going on and is basically just a concrete slab in the middle of downtown. Skip it unless staying in the area or heading for the train station.\n\nAlso it's a pretty gritty area to be honest. So if homeless and cracked out people make you uncomfortable, skip it after dark. We saw a guy overdose on drugs and had to be taken away via ambulance in front of the Westin St Francis (our hotel)at around 6 pm.\nShow less"], ["Reviewed September 17, 2017", 3.0, "Just Like Any Downtown", "This is the main high-end shopping area. This is just like any major city's downtown core.\nIt's busy, with lots of tourists and just like everywhere in the city, a lot of homeless people milling around.\nUnion Square itself is great for people watching, there is a café and most hop on/off bus tours start here (in front of Macy's).\nYou're also a short walk to Chinatown.\nCurrently there is construction in the area. I believe they are building a subway.\nShow less"], ["Reviewed September 15, 2017", 5.0, "High end shopping", "Union Square is a very nice site to explore. I visited Union Square for the atmosphere and the high end shopping. Union Square is most even if you are not spending a lot of money. I recommend visiting this site while in San Francisco."], ["Reviewed September 12, 2017", 3.0, "Nice but strange", "We had a three night stop over in San Francisco and sat in Union Square people watching on the last day. It's a nice spot sitting in the sun with the cable car on one side and Macy's on the other but we didn't feel safe. There are lots of people begging and if you ignore them they give you a mouthful of bad language. Some people are just simply strange.\nWe found San Francisco to be a dirty city too. Rubbish is everywhere you look and any available spot has graffiti on it. Shame really as other aspects of San Francisco are really nice.\nIf you travel here just be on your guard.\nShow less"], ["Reviewed September 7, 2017", 4.0, "I came solely for Apple store visit", "I am an Apple fan. I wanted to visit just the Apple store. I did. It's architecturally very neat. You can search for more info on that aspect. There was far too much road work when I visited that really made the whole Union Square less than pleasant.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Great starting point for San Francisco", "This square is the center of town. Amidst the shopping stores (a massive Macy's) and the latest award winning designed indoor/outdoor Apple Store is a big plaza where there are bands playing or art exhibits and other activities.\n\nThis is also a key stop for all the hop-on hop-off tour busses.\n\nThere are the San Francisco hearts painted by famous artist on display at key ends\n\nOne can sit at a cafe nearby and watch the crowds go by.\n\nThe plaza is rather big and buzzing with activity\nShow less"], ["Reviewed September 4, 2017", 4.0, "Park in the main shopping district", "This is the center of the main shopping district in SF. It is a small park and you can sit and watch people. The surrounding buildings and shops form a very nice landscape for photography."], ["Reviewed September 2, 2017", 5.0, "Shopping galore, mid range - expenive", "This is an excellent stop whilst in San Fran if you're keen to do some shopping. Don't be expecting discounted prices however as I found the prices to be standard for the mid range brands to the super expensive / high quality labels (Gucci, LV etc)\n\nMacy's is fantastic as it has a his & her building, including 5 levels for men's and I think 7 levels for women's clothing. There's also a Westfield that's close by, and Saks Fifth Avenue as all your uber expensive labels.\nShow less"], ["Reviewed September 2, 2017", 4.0, "See the square and take a selfie!", "Our hotel was only a couple of blocks away, so I took the opportunity to walk around and take photos."], ["Reviewed September 2, 2017", 5.0, "Swing and dance", "What a delight it was to be wandering back to our hotel on,y to come across a swing band in the square, and a who,e bunch of people dancing to the beat. A joy! At other times there were art exhibits. Unfortunately the construction work is an eyesore on one corner but will no doubt lead to something useful. I read that there were a lot of homeless souls here but I saw few, many more in other places. The square itself could use a bit more greenery but on the whole is pleasant.\nShow less"], ["Reviewed August 29, 2017", 3.0, "Surrounded by expensive shops", "Fine. A couple of nice cultural aspects for photos. The San Francisco hearts in the square were nice and always interesting with further details. Great people-watching venue with a coffee shop with great coffee. Some market vendors to make things interesting. Worth a visit. Some of the shops are interesting to visit from a visual perspective.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Great Location to explore from", "Centrally located, easy access to various means of transport makes getting around SF simple. Lots of places to eat to suit any budget. Highly recommend the area."], ["Reviewed August 27, 2017", 3.0, "Interesting area & historical", "This is an interesting area due to the many stores, hotels.... It also is very historical as its name \"union Square\" implies. Some great photo opportunities here."], ["Reviewed August 26, 2017", 4.0, "Great photo spot", "Union Square is pretty cool to walk through and sit. Great spot for photos but not much else. There are these giant Hearts that are painted to represent the story of San Fransisco."], ["Reviewed August 24, 2017", 2.0, "Wouldn't recommend", "Stayed in a hotel just around the corner and had a look round the high end shops. It does not feel safe at all. Many homeless people, most with drug, alcohol or mental health issues. My kids felt very nervous due to all the shouting and swearing. Wouldn't recommend to anyone at all. Even in Macy's there was a homeless man wandering around begging and bothering people. The staff don't seem to bat an eyelid but it can be nerve wracking as a tourist.\nShow less"], ["Reviewed August 23, 2017", 1.0, "Disappointing and dispiriting", "The concentration of mentally disturbed people and addicts in the square area is overwhelming. Seeing a homeless man defecating and urinating, half naked, with his pants down yesterday (8/19/17) on a lovely sunny Saturday afternoon (just after the corner of Grant on Post) was pretty much the low point of the day. Union Square itself is a mess, seemingly under endless construction and disarray. Parking in SF is always a challenge, and this time we found the Union Square Garage expensive and hazardous for pedestrians.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Even With Construction - A Nice Square", "There is construction at Union Square!\n\nOn each visit, the project seems to morph a bit, taking over a different area, or expanding/contracting, like an accordion. On this visit, much of the Southeast corner, was behind barricades.\n\nStill, the Square is a lovely place to be, with two dining venues, and lots of benches.\n\nThe plantings were lovely, and probably absorbing the fog, when we walked through.\n\nOn this visit, I entered from the Northwest, and spent time in the main plaza, around the central statue, before heading to check out the construction. At that point, due to the elevational difference, I was looking down on the barricades. Work was definitely in progress.\n\nAfter a stroll, I headed to the Southwest corner, but had to wait for several Hop-On/Hop-Off buses to board. There were a lot of folk heading out for those “tours,” and the sidewalk was congested.\n\nOn this visit, there was but one “percussionist,” pounding out a rhythm on various buckets, pots and what-not. Often, there are more, competing in a cacophony of sound. Also, no “protestors” were in evidence.\n\nA nice, short visit, and I only hope that the construction will soon be finished.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Busy place", "Rode the cable car to Union Square from Fishermans Wharf. Waited in line about an hour for each way."], ["Reviewed August 15, 2017", 3.0, "Hmmmmm", "As a whole I have always liked SFO ... but after this visit someone really needs to get hold of this place... people / homeless hanging around begging ... smoking weed (which I detest) and just generally looking dirty ... Get a Grip SFO"], ["Reviewed August 13, 2017", 1.0, "Crowded and many homeless people", "Real crowded square. Can jump on the cable car (long waiting time). But not something really special going on at this square. Also a lot of homeless people on the streets. On some places you smell the pee and it gave us an unsafe feeling with the kids to be here. Relieved we stayed at fishermans wharf and not in a jotel on Union Square.\nShow less"], ["Reviewed August 13, 2017", 4.0, "Shop 'til you drop", "If you want shopping you are in the right place. It also seems to be the main hub for transport (tour buses) and places to eat and drink. Clean and very busy. Nice area to sit in the sun and eat outside."], ["Reviewed August 10, 2017", 5.0, "Advice from a local.", "I've been meaning to write this review for sometime now for those visiting SF for the first time. Union Square is one of the shopping districts in the city. It 's full of high end shops and so so restaurants that cater mostly to tourist. For the most part the area is safe and there's lots to see, The downside is the neighborhood is right next to the Tenderloin aka the TL. The TL is full of homeless people and not the safest area in the city. My advice if you're visiting Union Square is DO NOT go pass Taylor Street which is west of Union Square. It's starts to get a little sketch after that. Also do not be afraid to say no to the panhandlers in the area.\nShow less"], ["Reviewed August 8, 2017", 2.0, "Great shops, Unsafe environment particularly for the solo traveller", "The shops in this area are great, a good variety and something for everyone.\n\nNow the reason I give this a poor rating is due to the sheer number of intoxicated homeless people in the area who are constantly hassling or following you around begging. A very sad situation I appreciate, but it does make you feel very uncomfortable and unsafe. One guy was shouting, swearing and hitting things with his fists or a belt. Drug use apparent.\n\nNot a safe area, and I have been to a lot of unsafe places!\nShow less"], ["Reviewed August 8, 2017", 4.0, "One of my favorite places to sit and people watch", "I love grabbing a lunch and then going to sit in union square. It’s a busy place with lots of interesting people to watch. Things going on and shops all around you. A must for a visit to San Francisco."], ["Reviewed August 6, 2017", 4.0, "Shopping, street performers, and more", "There open area at the square contained some artwork for sale. Around the square are many stores, restaurants, and a mall. Street performers were playing music and dancing nearby."], ["Reviewed August 2, 2017", 4.0, "good shopping", "all the major and not so major shops are here; many flagship stores and high end department stores are here too. fun shopping experience if you enjoy shopping."], ["Reviewed July 31, 2017", 4.0, "A bustling area", "I stayed in a hotel in union square so it was the first place we visited in SF. The area is extremely busy with tour services and promoters everywhere. The square has a high amount of designer shops and I would say it comes across as quite an expensive area with lavish shops and dining areas, which is quite the contrast to the amount of homeless people on the streets.\n\nThere are large amounts of homeless in the area which my friends and I originally found quite intimidating and daunting - some homeless would open doors for us without asking and then ask for payment, but did not seem aggravated when we said no. There was one incident at night time in which a man attempted to mug us, but luckily (for us) he walked away to someone else - we hope that person was also ok!\n\nFor an area with such expensive shops and rich residents, one would expect less homeless but it's not enough to deter me from visiting or staying in the area again!\nShow less"], ["Reviewed July 27, 2017", 4.0, "Pretty plaza", "Nice urban open space. Flanked by buildings this rectangle is a nice place for a cup of coffee or even just to walk through. Plenty of people milling around. Pretty plants add a touch of green to the space."], ["Reviewed July 26, 2017", 5.0, "Wonderful place", "A lot of different nationalities in this place, ready to visit San Francisco by bus Also you could go shopping to Macy's and other shops"], ["Reviewed July 24, 2017", 3.0, "Shopping", "Our hotel is near here so we thought to have a look around. Macy's takes one side here with shopping all around here as we crossed the square and all around the San Fransico area there seems to be plenty of homeless/ street beggers,"], ["Reviewed July 20, 2017", 4.0, "Center of San Francisco", "It is the center of San Francisco downtown, with magnificent building around. You may find any top brand commodity here. Sitting on the square to see the pigeon is also enjoyable."], ["Reviewed July 12, 2017", 5.0, "Central Location", "Our Big Bus tour started here. Tony Bennett's self-painted hearts are on display at the four corners of US.\n\nMichael Jackson impersonator danced to a boom box blaring MJ music for tips--fun entertainment. The guy could dance!\n\nThis is meeting place and more for outdoor enjoyment:park benches, people watching, etc.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Nice open space, central location, all the shoping", "Central square with all the shopping. Great location with all at walking distance. Best location for hotel and exploration of the city."], ["Reviewed July 10, 2017", 4.0, "4.5 rating to this beautiful full congested center of SF", "I believe that, save the chronic panhandling, this is one California's finest and prettiest urban concrete parks. The term park can be innocently misleading. Union Square once a grassy knoll. The photos here on this site will show the transformation that is both liked and hated by locals and tourists alike. Seasonal ice skating and beautiful Christmas tree make this a fun place for kids and adults alike. On sunny days, this is a great place to relax for a tea or coffee during your visit to this city favorite.\nWalking about and near this highly congested shopping Mecca is highly recommended, as driving anywhere in the downtown districts of SF is very painful. Congestion, high parking fees and the lack of upgraded infrastructure is why locals only walk in this beautiful and fun neighborhood and historic park area.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Beautiful square, great shops!", "High end shopping district in downtown SF? Yes, please! Even with the current construction, it's a lovely square and area altogether. Go shopping there and don't miss it!"], ["Reviewed July 9, 2017", 4.0, "Good central point for hotels and parking.", "Vast underground parking is amongst the most secure, and not so expensive, at $36 per 24 hour period, NOT charged for each portion of a calendar day. Lock it and leave it, without questionable parking attendants doing weird things with your car. Some spaces are huge, to prevent door dings. Cable cars, theaters, shopping, and more, are all here, and you can walk for miles from this starting point.\nShow less"], ["Reviewed July 6, 2017", 4.0, "Square with Free Entertainment and Lots of Shopping", "This is really just an open park with a little cafe and entertainment on random days/nights. The shops in the area are a mix of high-end, regular and boutique. Great area to kill time or if you need to get some shopping done. Also, great place to grab non-San Francisco sweatshirts/fleeces when you inevitably arrive in San Francisco expecting California weather and realize you didn't bring enough warm clothing for the 50-70 degree weather.\n\nNote: Macy's Men and Women's stores are two separate shops.\nShow less"], ["Reviewed July 5, 2017", 3.0, "Just a open square", "Our hotel was close by so we were in the area a lot. Tour buses leave from this area as well so it can get congested. There were vendors selling art and playing music during the day. At night it gets loud with street performers looking for money. I wouldn't go visit the square itself but there is a lot of good shopping all around it.\nShow less"], ["Reviewed July 5, 2017", 4.0, "Loved the 4th July sales", "Amazing sales for the 4th July! We got some really good bargains to take back to the UK! Great shopping experience!"], ["Reviewed July 4, 2017", 4.0, "Nice area", "This place is center of City. Surrounded by hotels, shop with luxury brand name where you can start visiting city by hop in- hop out bus. For us, this area is less fun than china town, fisherman walf."], ["Reviewed July 3, 2017", 4.0, "Staying in union square", "High end shops plus a Ross, cool mall, 5 floors, food at the bottom lots of stores, homeless everywhere it is the whole human spectrum from $56 valet parking to mentally ill people living adjacent. Parts smell like pee, the Carl's Jr. had a guard, overall it is enjoyable, eye opening and interesting.\nShow less"], ["Reviewed July 1, 2017", 3.0, "Homeless people everywhere", "An amazing place but the homelessness, begging and smell of urine makes you realise that San Francisco is a magnet for homeless people. We saw begging on every corner, doorways smell of urine, people sleeping in the streets and sadness everywhere.such a shame"], ["Reviewed June 26, 2017", 4.0, "Must stop when in SF", "Central location to everything. Parking is expensive but there are garages all over the place. This place is like Times Square. A nice gathering place to chill and watch street performers, eat food and just enjoy what the city has to offer."], ["Reviewed June 26, 2017", 3.0, "Union square", "Main attraction for us in union square was going to the top of Macy's to the Cheesecake Factory which has a terrace restaurant with lovely view of the whole square"], ["Reviewed June 22, 2017", 4.0, "Lots of high end shops", "This is pretty much the centre of San Fran in terms of shopping. We really enjoyed the wide selection of stores. There's plenty of high end stores but also the likes of Ross dress for less and marshals. Lots of places to eat as well."], ["Reviewed June 16, 2017", 3.0, "Good spot for the afternoon", "I loved meandering in union square, a lot of different shops high end ones to boot. A lot of homeless people though s be careful."], ["Reviewed June 15, 2017", 4.0, "Vijay Kaul", "A great place to relax, sip a coffee, have a sandwich, fix city site seeing tours and of course, do some good shopping. You can get a good feel about SF when you visit the square....the Market Square is a few hundred yards away. Feel the buzz in the evening, enjoy the pubs, take trolley bus rides or traditional cable cars. The place to visit when u visit SF.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Heart of the city!", "When I was researching neighborhoods to stay in while on vacation in San Francisco, the Union Square area kept coming up as a recommendation. I ended up booking a hotel a block from the square and I couldn't be happier with this location.\n\nThe Union Square park is a beautiful centerpiece surrounded by great shopping and restaurants. The area is safe and lively, we visited it during the day and night. Both were beautiful and I highly recommend you check it out. The Powell St. trolley line runs next to it, there is a large shopping center across from it, not to mention it's surrounded by Tiffany & Co, Victoria's Secret, Gucci, etc.\n\nShow less"], ["Reviewed June 12, 2017", 4.0, "Nice Location", "My wife and kids enjoyed shopping here. I cried the whole time. My poor credit care. Nice square with loads of shops surrounding it. Plenty of places to eat everywhere"], ["Reviewed June 11, 2017", 4.0, "Nice shopping and free entertainment in the square.", "My teenagers enjoyed shopping here. Lots of nice stores. We had a late lunch at the Burger Bar on top of Macy's."], ["Reviewed June 3, 2017", 4.0, "Nice spot", "Nice square with loads of shops surrounding it.plenty of places to eat everywhere.the square itself is not huge but there is plenty of space to sit and watch everything."], ["Reviewed June 2, 2017", 4.0, "Big Macy's departmental store", "There's a mega Macy's departmental store at the iconic Union Square. Worth a visit. There's also an Apple store building opposite it."], ["Reviewed May 29, 2017", 4.0, "Union Square", "Union Square is a small park surrounded by high end shopping, hotels, restaurants and theaters in downtown San Francisco. Many people stop to take a picture here in front of the heart with the Golden Gate Bridge on it (I left my heart in San Francisco). This is a very busy area so despite the presence of many homeless people it is a safe area.\nShow less"], ["Reviewed May 27, 2017", 2.0, "Disappointing", "We have loved San Fransisco what a shame union square so full of homeless people begging , many with what appears mental health issues , does nobody care about these poor people Totally spoils this lovely yet dirty city"], ["Reviewed May 26, 2017", 1.0, "Did not feel safe", "I have never seen so many dirty down and outs stoned. As we walked through someone was lifting a filled hyper dermis ready to inject. People littered the ground who were so completely out if it. Avoid this area, especially at night."], ["Reviewed May 20, 2017", 3.0, "Meet at the Square!", "Non-discreet square with lotsa shopping and eateries and the classic Fairmont Hotel. Great rendezvous place for visitors and locals alike, street vendors, musicians and hawkers make it a nice place to people watch on a sunny day."], ["Reviewed May 18, 2017", 3.0, "Just a square", "The place is Nice but so Are a lot of other squares It has Nice shops around but again so do others A bit Dissapointing Thomas"], ["Reviewed May 18, 2017", 4.0, "So, you want to shop in San Francisco?", "Shop around Union Square, not Ghiradelli Square or Fisheman's Wharf. There are the very upscale shops right on this lovely downtown square. But there are also unique San Francisco shops close too. Great restaurants nearby. Perfect for a mid-day lunch and browse. Try The Burger Bar which overlooks the entire square.. Get a table next to the window. Very nice. Right in the center of the city. Beautiful and enjoyable if you are buying, window shopping or just walking.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Beware if you're a shopaholic", "Urgh when you decide to go window shopping after lunch and you can't help but purchase because it's irresistible - all the favourite brands in a convenient locale."], ["Reviewed May 15, 2017", 4.0, "Good place", "It's a nice place to visit; actually nothing great about it. I won't say it is a must visit place. You will get a nice view of this place from Macy's. If you are tired after walking around the city, you may come here and sit for a while.\nShow less"], ["Reviewed May 14, 2017", 3.0, "Neither impressed nor disappointed", "I was told that, whilst in SF, I *must* go and see Union Square. So I went ... and it's basically a square with a monument in the middle. It's not spectacular nor is it disappointing ... it's just a square.\n\nAs it was very close to my hotel, it only took 5 minutes to find but I do wonder why I was told it was a \"must see\" as, in my opinion, there's really nothing there to see. There were a few other people there but other than take a few photos there's nothing else to do.\nShow less"], ["Reviewed May 13, 2017", 4.0, "Nice spot in centre of San Fransisco", "really nice place to relax from all the nearby shopping, highly recommended. You find all the best shopping nearby, Applestore, Macy's to name a few"], ["Reviewed May 12, 2017", 3.0, "Too many homeless", "There's plenty of shops and things to see around union square however the charm of being in the city is taken away by the homeless here. Just be aware that they are everywhere. Tents, on every street, you can't walk more then 5min on Powell Street and not be asked to money. I would feel unsafe here with my young children. We even saw a homeless people pull his pants down, squat in the gutter and went #2 right in front of people walking. If that doesn't sum things up for you, come check it out for yourself. I've visited many big cites in the states and haven't seen anything comparable to this.\nShow less"], ["Reviewed May 9, 2017", 4.0, "Great stop for a long layover", "I had a 10 hr layover and it's been a while since I've been in the City so I hopped on the Bart from the int'l terminal/garage to Powell. It cost $8.95 ea way. The Bart is looking pretty tired these days but it does a dependable job of getting me from Pt A to Pt B. Within 40 minutes I found myself on Powell/Market at the Westfield mall.\n\nIt was a beautiful day in the mid afternoon before the rush hour. The area seems to be cleaner and less homeless. I noticed a\nfair amount of turnover with stores. Stopped by one of my favorite jewelers Simayoff on Powell to get my ring cleaned. Another favorite of mine, Arthur Beren shoes closed shop recently :(\n\nHad my clam chowder and sour dough fix as Boudin. Got to spend a good 4 hrs enjoying the Union Square area before heading back to the airport with plenty of time to spare.\n\nShow less"], ["Reviewed May 8, 2017", 4.0, "Great location to soak in the city", "We stayed in a nearby hotel and the square was a great place to soak up the city and there was always something going in, from live music to films showing, there is a wide range of shops and restaurants in this part of the city and a metro under the square its self and one of the cable cars lines runs past the west edge\nShow less"], ["Reviewed April 30, 2017", 4.0, "Great place for shopping", "If you enjoy shopping this is a great place for it, there's also plenty of places to eat. This is also where you can catch any of the Hop on hop off style buses, as well as the cable cars. Unfortunately it seems to have a lot of homeless people in this area.\nShow less"], ["Reviewed April 29, 2017", 5.0, "shopping", "if you looking for high end or just good quality stuff then this is the place to go such as Levi Jeans ,Sun-glass hut\nMacy's, Victoria secret Tiffany's\nits also a good place to catch the hop on hop off bus for sight seeing and get a coffee\nShow less"], ["Reviewed April 27, 2017", 4.0, "Shopping!!!", "This is the area you want to stay in if you want to shop and have access to the San Francisco trolley system. Lot of shopping options from Macy's, Neman Marcus, Nike, and on and on. I enjoyed the area more than my hotel in the area, but when I return to San Francisco this is the area I will continue to stay in\nShow less"], ["Reviewed April 23, 2017", 5.0, "Shoppers Delight", "This was another stop along our SF tour. It was one of the few places that stood out as corporate retail compared to other areas where you would see the name brands most of us know coming from other parts of the world/country.\n\nA lot of these look like flagship stores from their size and grandeur. There was multiple metro or transits along the way including the trolley and it's lazy Susan turnaround. Plenty of activity and easy to get to.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Really Nice Central Hub", "Union square was the first thing we visited in San Francisco as our hotel was nearby. It was a great introduction to the city as there were performance artists, music and shops galore. It is a big, bright, busy open square and has some lovely eateries too. Great atmosphere, we really liked it.\nShow less"], ["Reviewed April 19, 2017", 1.0, "What happened? So many homeless here now!", "OK,\nI know there have always been homeless here in the city, BUT holy cow!!\n\nThey are literally camping all over the sidewalks in tents now!!\n\nYou can't even walk down some streets on the sidewalk there are so many, and on some streets, they actually their tent set up in parking spots ON the street!!\n\nSan Fransisco is getting so un-touristy with this homeless issue that it is not fun to visit anymore....\n\nSeriously, when a family visiting has to dodge homeless tents on the sidewalk just to get around to see the sights, it makes us re-think any future vacation visits....\n\n\n\nShow less"], ["Reviewed April 14, 2017", 4.0, "Great place but..", "Our hotel was in Union Square, and it was like trying to sleep in an asylum with all of the homeless people screaming and shouting during the night.. Even during the day there were more nutters per square yard here than anywhere else I've been - not just the homeless people..\nOverall the area is vibrant and exciting... Lots of things to do, places to see and people to watching the square itself is an interesting place to sit sit for a while and watch everything happening around you - a bit of an oasis in a sea of frenzied activity.\nShow less"], ["Reviewed April 13, 2017", 1.0, "Dirty and crowded", "I am sorry, but this was not a \"must visit\" place for us. We had a two hours walk from Golden Gate Park to Union Square and it wasn't worth it. The streets were getting dirtier and dirtier when we got closer to Union Square. It was just so disappointing. I am sure there are many people who would love it, but for us the California Academy of Sciences, Fisherman's Warf and Twin Peaks were much more fascinating.\nShow less"], ["Reviewed April 12, 2017", 3.0, "What to say", "Any trip to San Fran should have a few hours here. The issue I have since our latest trip is that the entire area is becoming very dirty and not a great place to walk around. Human Excrement, needles and garbage on all the streets in and around it. A lot of high end shops that are too expensive for us normal folks. Seems the homeless are taking it over more and more as the Tenderloin area seems to be growing. Hard to recommend it but hard to say to stay away. Definitely do not be out there when it is later in the evening....\nShow less"], ["Reviewed April 3, 2017", 4.0, "Great place to shop", "Great place to shop- tons of brands all located just a stone's throw away from each other! Check out Nordstorm rack for bargain finds! GAP was in crazy sale- 50% + additional 10% sale for all items including the regular items!"], ["Reviewed March 29, 2017", 2.0, "Unsure why anyone would go here", "After reading reviews I expected this to be a great and fun place. I was quite disappointed to find a impermeable surface park with few stores other than a Macy's which will soon close. I would skip this destination."], ["Reviewed March 27, 2017", 4.0, "Holiday", "Came down to union square as was staying a 5 min walk away. Has Macys, Neimen Marcus, victorias secret just to name a few. We got the City sightseeing tour which stops at union square all day. Macys is apparently the second biggest one behind New York. Def worth a look.\nShow less"], ["Reviewed March 25, 2017", 5.0, "Favorite Destination", "Once a year we stay at Union Square and walk to all the shops. A very relaxing weekend and great restaurants nearby. Highly recommend. Don't forget to ride the cable car."], ["Reviewed March 25, 2017", 4.0, "You start your visit in Union Square", "Drop the suitcases walk down to the square get your bearings. Figure out the streets Post, Powell, Geary, Suttor and you are set to go for buses and trams. High end shops also your Macy's, Saks Bloomingdales, Nordstrom, the cable car terminal, the BART at Powell. In Post at 474 Post is the new Grayline office if you are going on trips to Napa, Montaray etc. it is your base but there is so much to see in the other districts.\nShow less"], ["Reviewed March 24, 2017", 3.0, "Fun once but ok to skip it", "I walked here since my hotel was nearby. Lots of high-end shopping and people watching but otherwise nothing special. So many other great things to do! You can skip this one unless you are eyeing something at coach, Dior or one of the other stores."], ["Reviewed March 21, 2017", 3.0, "Along of upmarket brands", "You can find LV, Prada, Chanel and many other branded stuff here. Most of the shops are big so you can spend sometime inside but may need to walk around a bit as you look for the merchandise you like. Thanks"], ["Reviewed March 14, 2017", 3.0, "Lots Of Energy", "What to say about Union Square - It is a High End Shopping District and good meeting place to intersect with friends, take tour buses or catch the Hyde-Market Cable Car. Chinatown is only a few blocks away as well. If shopping is your thing - you will enjoy - Dior, Louis Vuitton, Harry Winston, and all the other places offered in this area.\n\nI love the decorative hearts that are located on the outer edges of the square. This area is good for hanging out and checking out the local flavor of SF.\nShow less"], ["Reviewed March 14, 2017", 4.0, "Good upscale shoppng", "Wandered around the area examining the storefronts. Even found one place to actually buy something. If you are after quality fashion, you can't go wrong. Make sure you have a fat wallet."], ["Reviewed March 9, 2017", 3.0, "It's ok, but you can skip it.", "It's ok, but you can skip it. Nothing special here except the pricey shopping. That's what I remember more than anything else. How expensive this city and every thing in it is. Sure it's nice and you can get a coffee an sit, but you could do that any where else and by the water it's much nicer. You decide. I wouldn't waste the time.\nShow less"], ["Reviewed March 4, 2017", 3.0, "Downtown has really lost a lot of its charm", "The seemingly never-ending subway work and the closing of many of the smaller shops has left Union Square rather bleary. Yes, the larger retail shops are still there and tourist buses are abundant, but the area seems to have deteriorated over the past several years. With the arrival of so many tech businesses and new high rise condo housing, fewer colorful artsy types pass through. It's mostly tourists and construction machinery. Be sure to plan your visit so that you see the city's parks and excellent museums rather than looking for anything authentic in Union Square.\nShow less"], ["Reviewed February 18, 2017", 2.0, "Disappointing", "Much hype about Union Square. A large flat area covering an underground car park and a tower in the centre of the square. Surrounded by top end shops such as Maceys and Saks."], ["Reviewed February 18, 2017", 5.0, "The place to be for Shopping!", "Great area to have break while you're shopping. Crowdy and you can enjoy looking at people. All shopping malls in direct in the Area."], ["Reviewed February 14, 2017", 3.0, "Good for shopping", "It's not too special if you're not going shopping. Just a nice square. Its excellent for shopping. I've not seen a Macy or Victoria Secret this size!"], ["Reviewed February 9, 2017", 4.0, "Even in the rain!", "This square is made up of nice gardens and fountains as well as the shops and hotels. Do take a moment to wander through the green spaces on the way to the shops!"], ["Reviewed February 9, 2017", 2.0, "Macy's roof top restaurant", "Location is fab.\nFood is fab.\nDiscusting pigeons are horrid.\nThe staff do not even attempt to keep them away by clearing tables quickly so that the birds don't swoop down.\nReally spoilt my lunch.\nTip ... Eat inside as these birds are full of disease.\nShow less"], ["Reviewed February 2, 2017", 5.0, "Calling all shoppers", "This is such a great place to shop, eat and enjoy. The Macy's has almost an entire floor of SHOES!! Even if you can't afford to buy, have a look at Neiman Marcus and Saks. Go to the Rotunda in Neiman Marcus for a glass of wine if not for a meal. Kuleto's is right around the corner for some fabulous food. Check some of the streets leading out of Union Square for more shopping. If you want to sit outside on Maiden Lane, make a reservation. Enjoy! And there is ice skating in the winter.\nShow less"], ["Reviewed February 2, 2017", 4.0, "DOWNTOWN LANDMARK", "A large square surrounded by high-end shopping and historic hotels. There is parking available underground at the square, a lot of areas just to sit and people watch. During Christmas they install an ice rink and an enormous tree. Just a great place to experience San Francisco.\nShow less"], ["Reviewed January 26, 2017", 4.0, "Nice stop in between sights or shopping", "Was lovely sitting here in the sun having a cold drink in between seeing the sights and doing some shopping."], ["Reviewed January 25, 2017", 5.0, "All roads lead to Union Square", "For me, I orient myself by Union Square when walking around San Francisco. Normally I come to the city for trade shows at the Moscone Center. Union Square is where we head when we want to shop, relax, etc. If you are staying in a hotel that is close to Union Square you know you will be close to a lot of good shopping and restaurants.\nShow less"], ["Reviewed January 22, 2017", 4.0, "Good central location - plenty of activities", "Visited over New Year period. Plenty of activities in Square including Ice Rink. Closed on New Years Eve was a bit disappointing."], ["Reviewed January 18, 2017", 4.0, "Great place to people watch!", "Great place to shop, eat, and just hang out and watch people. You can catch the cable car, double decker tours, and any other public transportation. Definitely the hub of the city. I have stayed in this area and Fisherman's Wharf and prefer Union Square. You will see a lot of homeless people but we were never bothered by any of them.\nShow less"], ["Reviewed January 12, 2017", 4.0, "Christmas rules ! Union Square", "Not as grand as Times Square NY but it is still a great place to hang around for shopping people watching, skating (christmas period) and the lights up n christmas decor .\n\nMy perhaps sole source of compliant is lack of adequate seating to take a breather after a walk around.\n\nUnion square is central and close to Galleria, Chinatown and easily accessible by bus and the cable cars\nShow less"], ["Reviewed January 8, 2017", 4.0, "Landmark Upscale Shopping District", "On our visit, Union Square had built a skating rink that attracted many people (but eliminated the opportunity to relax and watch as the people walked past). This is an important center of the city, surrounded by high-end hotels, expensive shops, and usually, street performers to entertain the crowds.\nShow less"], ["Reviewed January 5, 2017", 5.0, "You should already be there", "You can catch a trolley, a bus, a taxi or just walk, but you might want to run to Union Square to catch of glimpse of all the sites to see. Macy's, Barney's, food trucks, outdoor ice skating, hotels, shops and so so so much more. It will take you all day to even try to see everything and oh yeah don't forget your camera. Lots of picturesque scenes straight out of a movie or a Nieman Rockwell painting. Oh it's cool alright and you are going to want to see. Christmas time especially because there is a tree that is guaranteed to take your breath away. Guaranteed!\nShow less"], ["Reviewed January 4, 2017", 3.0, "Festive at Christmas; skip the ice skate", "Union Square at night during the holidays is beautiful. Macy's does a really nice job by hanging a lit wreath in every single window and the square itself has a huge lit tree and menorah.\nWe wanted to do the touristy experience of ice skating there at night and regretted it. Although it was very affordable, the rink is small and the ice is horrible - lots of chips that make it difficult for novices to skate and the majority were novices. Trying to avoid a child careening around the ice, my daughter lost her balance and broke her arm.\nBetter would be to take it all in as a spectator with some hot cocoa from the cafe in the square and ice skate at the Embarcadero.\nShow less"], ["Reviewed January 4, 2017", 3.0, "Very tiny square", "It is not as large as I would have thought but worth visiting if you like shopping as there are many shopping malls close to it"], ["Reviewed January 1, 2017", 5.0, "The best location for designer and expensive shopping", "Great atmosphere to experience, ice skating and other attractions. Expensive shopping area that has it all; from Nike to Apple to designer clothes. Highly recommended even if just for window shopping."], ["Reviewed December 31, 2016", 4.0, "The center of a visit to San Fran", "This is the heart of the city, where shopping is concentrated, best place to catch the cable car (there will be a line) and the center city park (good for people watching and the Christmas tree in December). SF traffic can be tough and parking more so, Uber or public transportation is recommended along with a good pair of walking shoes. Depending on the time of year you'll see a number of homeless, in December it was not an issue\nShow less"], ["Reviewed December 28, 2016", 3.0, "Couldn't shop", "Because there's absolutely no parking, Wednesday afternoon and the place is absolutely gridlocked. Made a few passes and called it quites..... but it's a beautiful neighborhood"], ["Reviewed December 27, 2016", 4.0, "Heart of the city", "Heart of the city. Lot of shops and restaurants in the neighbourhood. The best place to catch cable car - no queues and you can have the chance to get standing place outside the tram :)"], ["Reviewed December 23, 2016", 3.0, "Busy, but lots of homeless and begging.", "It seems to be the place to shop, we went into Macy's and into there downstairs restaurant area. At the tables were three homeless characters, one was rolling up a joint, one was sniffing up some substance and the last was going from table to table begging. Have never come across like this anywhere in the world, so much wealth and poverty in such a small area, I must admit didnt feel comfortable in the restaurant so we left without finishing our drinks.\nShow less"], ["Reviewed December 19, 2016", 5.0, "Happening", "Came in on a Sunday late afternoon and it was just alive with an awesome vibe till late night. Ice skating and an awesome band playing on the street corner. Tips on any travellers list of free things to do in SF."], ["Reviewed December 15, 2016", 5.0, "A must see especially in December", "Right now the lights, tree and ice rink are worth the visit. No need to go during the day unless you want to shop. Check out the Apple Store which is an architectural marvel. the glass windows came across the seas. Stunning. the Square is delightful year-round. Lots of good coffee and often arts, not to mention interesting people. Every language in the world.\nShow less"], ["Reviewed December 11, 2016", 4.0, "Hive of activity", "There is a lot going on here between the shops, hotels, trams, tours, and an ice rink. A lot of tour hustlers so not a peaceful place. Easy walking distance to Chinatown too."], ["Reviewed December 10, 2016", 4.0, "Fun place to hang out and watch the world go by", "Have been here many times. Used to live in the city. Always walk around here whenever I return for work. Love the Christmas tree during the holiday season."], ["Reviewed December 10, 2016", 4.0, "Especially nice during holidays", "There's a lot to do in the Union Square area. There are hotels and restaurants surrounding the square. During the winter, the square is an ice skating rink and there is a big Christmas tree. Where Macy's faces the square, there are some nice decorations and it adds to the holiday spirit. There are department stores (Macy's, Saks) smaller stores (Disney, Victoria's Secret, Body Shop, shoe stores, jewelry stores and more). You can catch the trolley there or at the starting place just a couple of blocks away. There is often music and sometimes there are vendors selling crafts, paintings, food, etc. It's a place where you can sit and relax or just enjoy what is going on.\nShow less"], ["Reviewed December 7, 2016", 5.0, "Beautiful Thanksgiving and Holiday Shopping", "Beautiful lighting and tree display in the park and many, many wonderful places to shop in the Union Square area. If you have the money and time you'll have ample opportunity to run out of either."], ["Reviewed December 5, 2016", 5.0, "Christmas Season Ice Skating and Macy's Christmas Tree - Union Square", "During the Christmas Season, Union Square is fun to visit. They put it into a holiday ice skating rink. Macy's also puts in a great Christmas tree which is fun to see. There is seating around the square.\n\nThere is also the usual cafes, statue, heart statue, and other things to see which are there throughout the year.\n\nAround the Square is the major shopping district for San Francisco.\nShow less"], ["Reviewed December 4, 2016", 5.0, "Magical mini urban oasis", "It's kind of park, but not exactly. More of a \"mini urban oasis.\" Places to sit, have a snack, people-watch, etc., surrounded by posh stores in beautiful, tall buildings. Absolutely unique and right on a cable car line, as if it weren't quaint enough already."], ["Reviewed December 3, 2016", 4.0, "Park at the heart of the city", "Union Square is not only a park, but also offers restaurants, a TKTS discount and sales office, bike rentals, market, art market, special events, Goddess of Victory and Dewey monument, beautiful plants, benches and places to rest and take in the view of all the hectic events happening around you.\n\nHere you can take a breather to gather your thoughts before heading off for dining, shopping or checking out other tourist spots. The Hop-on, Hop-off bus stops here as well as the cable car line and city buses. There is a public underground parking lot located under the square.\nShow less"], ["Reviewed November 27, 2016", 4.0, "Center of attractions", "Many restaurants and shopping in this area. Attract many tourists. At this time of year there was skating ring. Big Christmas tree. Close to cable cars. If you are here for shopping this is your place. Many hotels in the area."], ["Reviewed November 20, 2016", 5.0, "best shopping place in SFO", "head to marshales or ross to do your cheapest shopping there its mega malls for clearances, but don't expect a friendly staff its very obvious that people working there are paid minimum wages and they hate their jobs so just roam around to find what you need don't expect a VIP treatment , also don't expect sizes so to save time and disappointment search by the size then see what is available ;)\nShow less"], ["Reviewed November 17, 2016", 4.0, "Bustling shopping & hangout", "This area is home to high end retail and novelty shops and restaurants and bars. It is also the hub of one of the remaining cable car lines. There was a bit of construction happening, I think it's a new subway/metro station going in. It's a good place for walking around to the shops, as well as a place to sit in the park and watch San Fran vibrate.\nShow less"], ["Reviewed November 17, 2016", 4.0, "Nice place to visit", "I stayed at a Marriott just north of Union Square. My room had a view of the square, which was nicely lite up at night for the Christmas season. First time we've seen palm trees with Christmas lights...very nice! My conference was in the Hilton, so I would walk through and pass by the Union Square. It is a nice place to visit, walk through, or just sit and relax. Definitely worth a stop...and it is right on the Powell Street cable car route.\nShow less"], ["Reviewed November 13, 2016", 5.0, "Fun stop after cable car ride shopping and cafes", "This was a fun place to visit the skating ring was set up very cool experience on a 70 degree plus day. Square was all set up with Chrismas lights, lots of high end shopping all around area."], ["Reviewed November 11, 2016", 5.0, "Great central location for your San Fran visit", "I had a conference in San Fran and stayed near Union Square. It was the perfect spot with shopping and dining and easy to get to fun spots like fisherman's wharf."], ["Reviewed November 9, 2016", 3.0, "High End Shopping Area", "My wife and I stayed at the Hilton San Francisco Union Square and had some time to fill one day on our vacation and walked around Union Square. We found the area to be predominantly high end shopping. We visited a few stores and browsed but were not in need of anything specific. For the most part, you can get the same product online or in your local store of the same brand. The homeless population is very concentrated here and can be pushy when panhandling but if you either ignore them or make it clear that you are not to be repeatedly harassed, they will leave you alone. Plan on spending 2-5 hours here depending on how much shopping you plan to do. There are several public transportation options to get here.\nShow less"], ["Reviewed November 8, 2016", 2.0, "Disappointment", "Myself and my girlfriend have both previously visited Cheesecake Factory in the states and other countries and have found the service first class, as we were in San Francisco and wanted something quick to eat, this seemed logical - sadly our prior expectations were not met.\n\nThere is no room to wait and as this is one of the busiest cheesecake factories I have been to this is a major problem. The soda machine was out of order, we understand these things happen but for such a busy restaurant this again is a problem.\n\nAlthough the previous two points are annoying you can deal with this if the food is up to the standard of the chain. Unfortunately this was not the case, the portion size was large, but the quality was not there. The food was cold and tasteless. We ordered the chicken Caesar salad and chicken madeira and finally the Nutella & Oreo cheesecake to finish. All were substandard.\n\nThis place would've received one star had it not been for the service, which was friendly (the only plus point). So well done to the waiter for making our experience slightly better.\n\nTip: If you're looking for something quick and nice in San Francisco this is not the place. You will wait for around 45-60 minutes. The food won't be as good as expected and you'll leave unsatisfied. Go to fishermans warf or pier 39, the places there are a million miles better than this.\nShow less"], ["Reviewed November 6, 2016", 5.0, "The real Centre of San Fransisco!", "What a great place to be based? The top shops, the restaurants and the famous rail car are all centered on Union Square! In winter there is a small ice rink, and a beautiful Christmas tree! Macy's, Apple, Williams-Sonoma and Victoria's Secret are all close by. It's one of our favorite parts of the city. Breakfast, brunch, lunch, chilling in the sun - these are al great things to enjoy in Union Square! Get down and check it out!\nShow less"], ["Reviewed November 6, 2016", 4.0, "Hard to do better than this", "Best area to make your base for a visit to the city. Close to everything. The holiday ice rink and Christmas tree was installed Nov 1, so I guess SF is simply skipping thanksgiving this year."], ["Reviewed November 6, 2016", 4.0, "Busy square for all!", "Union Square is a bustling place full of locals and visitors alike...many large stores like Macy's and Nordstrom's, fancy hoteliers like the Fairmont coupled with many eateries and nightspots. Take a break from the Wharf or Golden Gare areas and enjoy!!"], ["Reviewed November 2, 2016", 3.0, "Always bustling with activity", "All the times I've visited Union Square, there has been some festival or activity going on. Also, check the view to Union Square from top of Macy's at terrace of the Cheesecake Factory!"], ["Reviewed October 24, 2016", 5.0, "Beautiful, Historic Location!", "Union Square has changed a lot since my childhood visits more than 40 years ago. It's happening gathering place with public art and great for people watching."], ["Reviewed October 23, 2016", 4.0, "LensCrafters Macys Union Square", "Attended the LensCrafters Macys Union Square Grand Opening Amazing view from the 4th floor next to Starbucks Doctor on premises and then you can get new glasses Love it!"], ["Reviewed October 19, 2016", 4.0, "Nice feeling , the core of SF", "Decided to take time off to be here in the evening. There's nothing particular to see as an attraction, the whole place is vibrant and joyful. Best to go as part of the hop on/ off tour, with some briefing about the history of this place.\nShow less"], ["Reviewed October 18, 2016", 5.0, "Preferred area", "Great selection of quality hotels, shopping, and restaurants. You will not be bored in this area. Great location and public transit easily accessible for all attractions."], ["Reviewed October 17, 2016", 4.0, "The Place to begin ur San Fransisco Expedition!", "Its a perfect place to kick start your day in San Fransisco. This place has amazing energy. Many good shopping complexes and stores nearby. The place might look totally different during nighttime... A Must visit place for tourists!"], ["Reviewed October 14, 2016", 5.0, "Great location", "Although we probably would not stay at The Palace again, the location was awesome . The Four Seasons is right down the block. The location provides great restaurants, within walking distance of the Piers, Chinatown and shopping. The urban feel provides a great feel for San Francisco. The Bart is right there and provided easy access to SFO. Definitely would recommend staying in Union Square.\nShow less"], ["Reviewed October 13, 2016", 5.0, "Great place", "We visited union square whilst on a city bus tour. Glad we got off, the place is fantastic and the shopping is great."], ["Reviewed October 11, 2016", 4.0, "Great shopping!", "We were here for half a day. Stopped by union square when we visited the museum of modern art. Great shopping district! Tip - if you haven't tried Boudin's clam chowder as yet, there's one in Macy's (women's) in the lower level."], ["Reviewed October 11, 2016", 4.0, "Lovely park", "This is a nice park. It's right off of a main road at Union Square, so it's hard to miss. It's nice to have a patch of green in the city."], ["Reviewed October 8, 2016", 3.0, "Famous place with nothing to do", "We arrived in Union Square while there was some construction going on. There is only one coffee shop and pretty much nothing to do. Good to go there once to check it on the list but that is all."], ["Reviewed October 4, 2016", 5.0, "Great place to hang out that offers free Wifi", "An absolute gem located in the heart of downtown SFO, minutes to your favorite stores for shopping, bars, pubs, theatres. The architecture is pure treat to photographers and your eyes."], ["Reviewed October 1, 2016", 5.0, "Always something going on", "It's a center point of activity in this mega city. So many fun things to see and do. Shopping and restaurants and bars are all right there. Great hotels like the Hotel Nikko, the Westin St Francis and the Sir Francis Drake are right there. Even the Hyatt is gorgeous. This is a great neighborhood.\nShow less"], ["Reviewed October 1, 2016", 3.0, "Pleasant enough within its environs", "Union Square is small and a pleasant stop but you won't walk too far before you are feeling distinctly uncomfortable. The streets around Union Square are quite unpleasant for a solo traveller with a lot of extreme poverty around. Get a cab."], ["Reviewed September 29, 2016", 5.0, "Must See", "Nice place to people watch. Learn about the history from the hippies of the 60's to the protests that still go on from or to there. Look around and the buildings and stores, sit and enjoy"], ["Reviewed September 28, 2016", 5.0, "St. Francis Westin Hotel, Union Square", "Union Square is a vibrant part of the city. It is a great shopping district. The Westin is in a great location: close to the Powell Market Street Cable Car station and actually, for those who are fit, within walking distance of Fisherman's Wharf. The hotel itself is beautiful and has many views of the city from the elevators and rooms.\nShow less"], ["Reviewed September 25, 2016", 4.0, "The centre of the city", "Unfortunately at the moment Union Square is one big construction site: they are doing a new subway station. Still it's the centre of the city and a must. The shops surrounding the square are all top quality. Leave your credit cards in your hotel room if you don't want to do any shopping, it's too tempting otherwise.\nShow less"], ["Reviewed September 21, 2016", 5.0, "Very nice place", "You can enjoy this place with its live amusements like music , dancing , singing , its location is in the middle of downtown, finally it is very nice place"], ["Reviewed September 19, 2016", 3.0, "I was not lucky, it was around construction", "the area is very small, but cozy, nice to sit and have a drink Coffey, but not this time around everything upside builders"], ["Reviewed September 19, 2016", 4.0, "Shopping and Dining", "Think Herald Square NY. Tons of brand name shopping and high end restaurants. Feels very NY like. Cool place to spend some time taking in the sights."], ["Reviewed September 19, 2016", 3.0, "Not Quite an Attraction in Itself", "First opened for public in 1850, the square was not very big, only 2.6 acres (1.1 ha) in the heart of SF's downtown surrounded by high-end shopping, hotels, art galleries, theatres, etc.\nGot its name as it was used for rallies in support of Union Army during American Civil War. The 30 m tall monument there, erected in 1903 with \"victory\" statue on top, was to commemorate the triumph of American Navy led by Commodore George Dewey in the Battle of Manila Bay during American - Spanish War.\nThere were chairs and benches that we could relax on, although, as experienced by some reviewers here, there could be homeless people harassing you which did not happen to us. We came late in the afternoon and not many people were around. From here we had dinner at Cheesecake Factory on Macy's top floor with awesome view of the square and lighted buildings surrounding it.\nShow less"], ["Reviewed September 18, 2016", 5.0, "The High Dollar shopping center of San Francisco, CA.", "This place is alive with all sorts of artists, vendors and shopping activities. You need to go here for the scene, history and activities. This is the central location where all activity takes place. Get on a Hop on Hop off bus and tour the city with frequent hop on hop off wherever you want to stop, all for one price. It is well worth it.\nShow less"], ["Reviewed September 14, 2016", 4.0, "Heartbeat of the city ..", "The place is the centre point of the city with everything around - shopping place (there is a macy's right in the front of the square), restaurants, all the tours buses have a stop over here. The place has a lot of outdoor cafes and side shops for local stuff. The place gets really crowded which is not a surprise but be a bit cautious of the homeless people sitting on the roadsides although they cause no harm but you never know.. All the business houses are on the same road blocks and the tram runs through as well. A tick-mark on the tour list..\nShow less"], ["Reviewed September 13, 2016", 3.0, "Homeless hotspot", "We stayed in a hotel right on Union Square and sadly spent no time on the square itself as it was full of homeless people many sadly with mental health problems hanging out. The shops around are great so please don't let me put you off but be warned, you will be sharing the square with a number of interesting characters......\nShow less"], ["Reviewed September 13, 2016", 3.0, "Centre of town!", "The centre town of SF! Full of department stores, bars and restaurant, exactly what you'd expect from a city centre, not massively unique but worth seeing."]]}}