{"Universal CityWalk Hollywood": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Universal CityWalk Hollywood", "url": "/Attraction_Review-g32655-d156954-Reviews-Universal_CityWalk_Hollywood-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/7d/49/29/universal-city.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "1466"}, "address": {"@type": "PostalAddress", "streetAddress": "100 Universal City Plaza", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "91608", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Universal CityWalk", "The Universal CityWalk is place to visit once in awhile to see the upgrades.They have many features to explore its not my go to for adventureland.The shops are amazing,and many tourist to meet here.The Universal CityWalk it best to go at night.I'm ready to check out the CityWalk in Orlando Florida.-Anthony\nShow less"], ["Reviewed 2 days ago", 3.0, "Fun Place", "This is a great collection of bars, restaurants and stores. But the food in most of the places is good but very expensive. Be ready to shell out over $100 for a ok dinner. On the bright side the night time walk is amazing. So many lights and the people watching is a blast.\nShow less"], ["Reviewed 3 days ago", 5.0, "Shops and dinner after long day at Universal Studio's", "Bought a couple off thing there to take home for family and friends in Australia. Stopped off at the Hard Rock after as it was a 27c day there that day and needed a refreshing drink to enjoy great looking place at night neon lights everywhere.\nCheers Brett from Hastings Point Australia.\nShow less"], ["Reviewed 5 days ago", 4.0, "Fun, Eclectic, Interesting", "This is a popular walk, and deservedly so. There are all kinds of eclectic shops, lots of fun visuals, and great places to eat.\nThere is something here for every budget, but caters best to fun clothes and souvenirs.\nYou can find basically any type of food you'd want for a meal, and LOTS of places to get sweets afterwards. There are movies to see, and iFly lets you \"freefall\" in full view of all the passing tourists.\nBe sure to try to go at night, because the lighted signs and fountains add a particular fun and beauty to the experience.\nParking can be a bit steep ($25), but for a car full of people, it's worth it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great way to start and end the day", "Plenty to see and do. While not many shops are open early in the morning, it is not difficult to grab a bite to eat before starting your day at Universal Studios.After a long day at the park, there are a wide range of restaurants for every palette to enjoy.\nShow less"], ["Reviewed 1 week ago", 5.0, "Shop and eat until you're beat", "Wide variety of tasty eating options, along with many familiar plus original stores. Your wallet will never forget your visit."], ["Reviewed 1 week ago", 4.0, "Lots of restaurants!", "We always like walking through the City Walk. There's a ton of restaurants and snacks. It's pretty crowded, but is good entertainment for an hour or 2."], ["Reviewed 1 week ago", 3.0, "Nice stroll...food and shopping options", "Nothing too great to report--- fun food locations like popcorn and donuts and some good shopping, but it seems to be a bit overpriced since they have a captive audience from the park. Worth the trip if you are in the park, otherwise you can skip it.\nShow less"], ["Reviewed 1 week ago", 5.0, "go early in the morning", "This is a must see so it does get crowded. Early morning was fine but it is crazy busy by about 11am."], ["Reviewed 1 week ago", 3.0, "Usually just a normal walk with restaurants and shops", "Few restaurants and shops, but other than that? On a normal day, not much. It's your way from carpark to Universal Studios and back."], ["Reviewed 2 weeks ago", 4.0, "Been there done that", "was pleased to have had the opportunity to vist, however would not necessarily go back. It was a stop on our city tour and a must do."], ["Reviewed 3 weeks ago", 4.0, "Not just your typical mall...", "Universal City Walk has a wide variety of shops and restaurants and is a great place to grab dinner after a day at Universal Studios. A lot of live entertainment as well throughout the complex."], ["Reviewed 3 weeks ago", 4.0, "Nice walk with lots of neon lights and fun locations to visit", "Totally a tourist destination. Many really good restaurants and lots of novelty shops surrounded by neon signs, music, overhead movie screens and the like. Fun for adults and children of all ages. Parking is very steep, though. If you go to a movie, they'll reduce your parking fee (to $5, I think.) Can get crowded on Saturday nights in the summer, but most of the rest of the year, it's a lot of fun.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun in the sun", "Fun in the sun and of course restaurants and entertainment all day and all night. recommended MeuterMedia"], ["Reviewed 3 weeks ago", 3.0, "Don't go in the evening!", "We arrived around 8:30pm and half the restaurants and stores were closed!\nWe walked around, left around 10:30pm and we basically closed the place down!!\nHaving to pay for parking and not being able to see everything was disappointing.\nIt's pretty comparable to downtown Disney in Florida.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "lots of light, nicely crowded place", "i love this place as a tourist not probably as a local, it is so colorful and lots of lights and the logo of the shops is funny and different, the food probably not the best but it is fine.\nit is always crowded and this is the most amazing thing about it.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great stores and places to eat", "Some wonderful stores and food places to visit. They have some good entertainment, including a need water show and big screen TVs showing videos. The only real downside is that parking is so incredibly expensive."], ["Reviewed 4 weeks ago", 4.0, "Always nice to stroll through at night on a warm evening", "Now that most of the construction is completed, it's nice to be able to see everything opened up. Good variety of food."], ["Reviewed 4 weeks ago", 5.0, "Great Walk after Universal Studios", "We walked through here on the way and back from Universal Studios as our Uber stop was near the car parking area. There are so many shops to go into along the way. It was nice just to be able to wind down after such a busy day at Universal by strolling through and browsing at the stores.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A Tale of Two Walks", "This is really Universal City's Disneyland walk. It's an area that you literally walk through to get to the park and is filled with restaurants, some shops and you can even go dancing or to a movie including Imax movies. What's not to like? The restaurants are all of what I'd call upmarket casual dining for families and couples. Bubba Gumps, Buca di beppo, 3 broomsticks, Dongpo Kitchen etc. No problem for lunch but you might want to make reservations for dinner and afterward leave and go somewhere else for your evening. The clientele is markedly different between daytime and nighttime and a teenage testosterone overload makes for a needless scuffle or two or three in the evening from 9pm onwards.\n\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Perfect place to shop", "Lots of shopping & dining outlets for every budget. The place is vibrant and bustling with people at all hours."], ["Reviewed January 25, 2018", 4.0, "A Fun Place to Kill Some Time or Go for Date Night", "Universal CityWalk Hollywood (like its sister location in Orlando) is 3-block long outdoor Dining/Retail/Entertainment district located right outside the front gate of the Universal Studios theme park. It is comprised of more than 30 places to eat (from walk up locations, to quick service sit-down restaurants and more upscale establishments), numerous retail locations (including Fossil, Element, Billabong, Hot Topic, the Universal Studios Store, etc.), and other entertainment options, such as a 19-screen IMAX Cineplex, iFly indoor skydiving, nightclubs, numerous street performers, live music, and the 5 Towers outdoor stage. It is large, high-energy, and fun...perfect for date nights or killing time before going to Halloween Horror Nights or for winding down after the park closes for the evening. The variety is excellent, the design is appealing to look at, and the parking prices are reasonable. Expect to pay slightly higher than normal prices to eat at places like the Hard Rock Cafe, Jimmy Buffet's Margaritaville and other establishments.\n\nI have spent hours wandering through CityWalk enjoying the ambiance, people-watching, and enjoying an inexpensive dinner and free entertainment before. It is a great location for date-night and relaxing. Parts of CityWalk are covered under a roof, so you have places to go for shelter in case of inclement weather as well.\n\nA trip to Universal isn't complete without grabbing a bite to eat and spending a little time at CityWalk!\nShow less"], ["Reviewed January 24, 2018", 4.0, "Evening shopping", "It gets crazy busy around the time that universal closes. Trying to get dinner is a mission if you are on a time limit and being picked up as we were. There was live music with a trio of young men playing an accordion and electric cello and fiddle - very good especially standing under one of the restaurant heaters- when the sun drops it gets cold so wrap up. Some cute shops and a lot of restaurants including Hard Rock and Bubba Gump.\nShow less"], ["Reviewed January 23, 2018", 3.0, "Overcrowded!", "Pros-Theres so much things to do and always new things coming up. Cons-Its super overcrowded and at certain times you have trouble just moving around."], ["Reviewed January 22, 2018", 5.0, "Fun, entertaining and shopping", "After spending the day inside Universal Studios we spent the evening taking in all the sites and many shops along City Walk. Lots of activities and shopping."], ["Reviewed January 21, 2018", 5.0, "The true and amazing essence of Hollywood/SF Valley CA", "I have been going to Universal CityWalk Hollywood since early 90s. And I must say it has gotten better every time. The restaurants, the theater and the attraction shows are just great. The bars are unique and original and it captures the feel of the Hollywood/Valley. I miss it and go there when I get the chance in order to enjoy a nice meal and reminisce over some good memories.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Relax after Universal", "After your day at Universal Studios, relax afterwards along the walk. Great restaurants, bars, etc, to wind down."], ["Reviewed January 19, 2018", 3.0, "Fun to Walk Through", "We browsed through these shops. Lots of fun. A little pricey, but the unique stores and restaurants make it worth it."], ["Reviewed January 18, 2018", 3.0, "Thought it would be larger", "I really thought CityWalk would be larger and have more to do and see. There were plenty of restaurants, but not as much shopping as the website makes it seem. Yes, I realize that it's supposed to be a prelude to the theme park, but I think if there were more to do that it could be a bigger draw for locals and tourists.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Great experience", "We visited Citywalk the day before going to Universal Studios. It was a great idea to do this because it saved us time and we were able to spend more time in the park as we had already seen Citywalk.\n\nGreat day spend walking around looking through the shops and then having lunch at Jimmy Buffett’s Margaritaville.\n\nShow less"], ["Reviewed January 12, 2018", 5.0, "Great evening", "We got Metro Red Line 802 to Universal Plaza and walked over walkway to tram up hill to Citywalk. Very convenient and easy. Enjoyed the evening walking around as it was Halloween and most people were dressed up. Margaritaville for nibbles and cocktails. Staff great and happy hour fun.\n\nShow less"], ["Reviewed January 8, 2018", 4.0, "Great Atmosphere", "We had a lot of fun walking through Universal City Walk! It was definitely a unique shopping experience with great restaurants. Although the parking was $25, it was well worth it. The holiday music and videos playing on the big screen enhanced the overall atmosphere."], ["Reviewed January 8, 2018", 5.0, "Fun, fun, fun", "There is so much to see here. Going at night is beautiful. The lights and store signs exhilarate you. Watching people go through the jumping water is entertaining. Make sure you have some cash on you because you’ll be tempted to buy something. The parking alone is $25!!!! Also a camera is handy because there are lots of places for a photo-op. This place is a must-see when in the area.\nShow less"], ["Reviewed January 7, 2018", 4.0, "A fun place with good restaurants", "A nice, fun place to visit. Really nice with all the lights at night time. Has some great shops and great restaurants, including Bubba Gump's Shrimp. The water fountain display is a nice added touch."], ["Reviewed January 7, 2018", 5.0, "Brilliant", "Really loved Universal city. Really vibrant and lots to do. I ate at a sports diner that was very nice and great price. Some lovely shops also. Worth a visit."], ["Reviewed January 6, 2018", 5.0, "The city full of entertainment", "Even a day ain't enough to explore this city. With games, rides and entertainment options, you'd be tired by evening. The train ride to the studios is an absolute must as it takes you through so many adventurous places, like a Mexican city will flood as you pass by, a train station will get on fire and a train will slip in front of you! Yet it's safe as everything is dramatised.\nShow less"], ["Reviewed January 4, 2018", 4.0, "Variety and a cool venue", "Round up the usual suspects in upper level chain restaurants and add a touch of Hollywood for city walk. Hard rock, bubba gump, candy stores, crepes and bAR type food with a giant gorilla hanging above and dancing fountains below. A good place to eat, esp wit kids or if u don't have time for the amuse ment park\nShow less"], ["Reviewed January 4, 2018", 2.0, "EXPENSIVE!!!", "I know this is mainly a tourist sight, but it used to be cool to go just to go and hang out, but now the parking is $25! Now you have to be a tourist just to be able to afford it! INSANE!!"], ["Reviewed January 4, 2018", 4.0, "Fun, Fun, Fun", "I love looking at the stars on the Walk of Fame, visiting all the hot tourist spots, and people watching. That's my favorite part. Watching the scammers scam and the tour guide buses fight for customers; when they all go to the same exact places."], ["Reviewed January 3, 2018", 5.0, "Lots of great entertainment!", "Tons of shops, restaurants and things to do. The lights at night are fabulous as is the live entertainment in the evenings. We listened to a violinist who played pop music that was amazing! A really fun place to visit and explore."], ["Reviewed January 3, 2018", 4.0, "The word \"lively\" really doesn't do CityWalk justice!", "Adventure awaits you up on \"Universal Mountain\" as I like to call it =) Bright lights, loud music and tons of LED screens makes it feel like a mini Vegas. There's something to do for everyone. Prices are a bit outlandish, but it's your classic Hollywood tourist trap; even though we locals like to revel in it every so often. Prepare yourself for HEAVY crowds on the weekends, especially in the summer. Parking can be a bit extreme, but I'll give you a tip that a few of the restaurants will validate for parking, so keep that in mind if the $25 bucks puts you off. You can always park at the metro station and walk up the hill/take a shuttle - which may or may not be free! But honestly, if you have some family in from out of town and want to give them the Hollywood experience, this is just the ticket!\nShow less"], ["Reviewed January 3, 2018", 4.0, "Evening with Teens...", "After a day at the Studios, we headed into CityWalk. We did some window shopping although most of the stores are very similar to those inside the park. We ate at Blaze which was consistent for the Blaze chain. That night there was a free concert so as we ate we watched the performers and people dancing in a sectioned off area just in front of the movie complex.\nAs we left, the boys decided to play in the dancing fountain. Oddly enough I think they enjoyed dodging the water (and getting wet too!) as much as they enjoyed time inside the Studios. It was a relaxing and entertaining time!\nShow less"], ["Reviewed January 1, 2018", 4.0, "Nice place", "I felt this was a nice place to transition to after a day in the park. The theming was continued, there were good shops, restaurants and snacks available. We stopped at voodoo donuts and Tony Roma’s and enjoyed both visits. I’m not sure I would come here if I wasn’t visiting the park but it was a great place to go to after.\nShow less"], ["Reviewed December 31, 2017", 3.0, "Mainly restaurant area", "This is primarily geared for dining experience. There r some very good restaurants there and I would recommend making a reservation on open table before hand. A few stores there but nothing particularly different. There is a very cool water interactive feature in plaza. Probably more fun when it’s hot but a few kids didnt let the cooler weather stop them.\nShow less"], ["Reviewed December 31, 2017", 4.0, "Good Area for Shopping and Food", "CityWalk is a good source of food and entertainment while you're at Universal. We went to Star Wars IMAX 3D the first night we arrived, then went back for lunch and dinner while at the park the following day. Both Bubba Gump and Karl Strauss have good food, and Voodoo Donuts is a must for dessert.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Food", "This is an amazing place plenty to choose for food and shopping my favourites were hard rock cafe and johnny rockets lovely food and there's now a cinema in there.it can get busy there but well worth it"], ["Reviewed December 27, 2017", 4.0, "A nice exit from the Park", "We visit Universal Citywalk Hollywood on Christmas day 2017....it is so crowded, the street, resto, cafe are full of people, we must wait 30-60 minutes to dine. We see many well known brands there like Hard Rock Cafe, Tony Roma's, Karl Strauss Brewery Co etc. Many people \"play\" with colourfull water fountain line that on and off....yet it is cold here. Nice place to visit especially in the evening after finishing the Park. For the record....everything is overpriced inside the Universal Studios Hollywood, and Citywalk is like main street just outside the Park.\nShow less"], ["Reviewed December 22, 2017", 5.0, "You gotta come here at least once!!", "If you happen to be going to Universal Studios, there's a good chance that you will be passing through this area at least twice that day. So many shops! So many places to eat! Wanna watch a movie afterwards? Go ahead!! You can definitely spend the whole day here. Brings lots of money though!!\nShow less"], ["Reviewed December 22, 2017", 4.0, "Nice citywalk with a bunch of stores!", "You have the option to have a bunch of stores in a few blocks together. Different options and a lot of restaurants/fast food."], ["Reviewed December 20, 2017", 5.0, "So much fun!", "Wish we could have spent time walking through and watching all that was going on but we were beat down tired. We did love the new mini monster tea that had just opened. I hope they stay."], ["Reviewed December 19, 2017", 4.0, "Water/light show- best at night", "There is a cool water/light show in the evenings that the kids can enjoy getting wet at (change of cloths) Avoid “It’Sugar” a candy store at CityWalk where they still sell candy cigarettes of all things!!!! “Pinks” at CityWalk is supposed to have good hot dogs, but we ate on the deck at Karl Strauss overlooking CityWalk’s main center. It was OK- all your going to find here is the typical chain restaurants, but better than in the park. CityWalk is just outside the park gates- a quick and easy walk and worth the visit after enjoying Universal’s Theme Park. It’s best at night. If you are only going to be at CityWalk for 2 hours you should valet park by the Jurassic Parking Garage= $7 for 2.5 hours if you get your ticket validated at a restaurant.\nShow less"], ["Reviewed December 17, 2017", 3.0, "Try to combine your visit when you go to the park", "I just moved to SoCal, and decided to go there for a visit. Had to pay $25 for parking. the area is OK. Try to combine the visit when you go to the park. You will have to pass through the CityWalk no matter what."], ["Reviewed December 17, 2017", 5.0, "Lovely place and great eating", "Nice shops and loads of places to eat. We went for pizza at Blaze... great taste of wood fire pizza and resonable prices ,"], ["Reviewed December 15, 2017", 4.0, "Such a fun place!", "The shops here have things you can’t find anywhere else (such as Harry Potter chocolate frogs). If you want the best Universal Studios merchandise but don’t want to pay to go in to the park, this is the place to go! Love the selection of restaurants from Hard Rock to Bubba Gump. There is a movie theater and other fun attractions.\n\nParking tip:\nDo NOT go in to the parking garage and pay the $25 fee that people going to the amusement park pay. Instead, head over to the valet where you will pay $7 for up to 2.5 hours if you get the ticket validated by a restaurant that offers sit down dining!\n\nUniversal Studios store/AMEX tip:\nIf you use your AMEX at the Universal studios store and spend over $75, the cashier will give you 10% off. You may have to mention the offer to the cashier as it’s hit or miss if they will offer it to you.\nShow less"], ["Reviewed December 13, 2017", 2.0, "Not worth the hype, or $25+ to park just to walk around!", "My brother came to town and we wanted to see Citywalk. General parking STARTS at $25 and that is whether you are there to walk around, window shop, eat, or go to the movies! We parked offsite and got a Lyft back up to Citywalk for $4 each way.\n\nCitywalk is okay, but nothing special. It is a bunch of stores and restaurants you can find offsite in any open-air malls. I only noticed two bathrooms to service the ENTIRE Citywalk and both of them were WAY smaller (approximately 4-5 stalls/urinals each) than the demand, as they were overused and people were waiting in lines out the door for both the men and women!\n\nThe iconic Universal globe has riot gates set up all around it, preventing people from getting closer than about fifty feet and looks weird having the gates.\n\nAll in all, Citywalk is not worth the hype and definitely not worth the $25+ to park! Go to Downtown Disney for a much better, more affordable experience!\nShow less"], ["Reviewed December 7, 2017", 3.0, "Basically an Open Air Mall", "Wasn't expecting this to be as cookie cutter as most malls. The restaurants, on the other hand, were certainly different and I did enjoy walking around outside."], ["Reviewed December 6, 2017", 4.0, "Great atmosphere", "We loved the citywalk, you come straight down into it from the parking lot and it has so many places to eat. We especially loved Voodoo Donuts, absolutely amazing"], ["Reviewed December 4, 2017", 2.0, "A way of separating tourists from their money", "Meh! Lots of tourist junk at inflated prices. It was kind of grimy too. if you want a better experience then go to the one in Florida."], ["Reviewed December 4, 2017", 4.0, "Great place with a fab vibe", "Loved this place. I like being able to wander and window shop, or to stop and listen to a band or a singer. It's full of great eateries, a cinema and shops. The hotel where we stayed had a free courtesy bus which meant easy access to this place during the day.\nMost importantly the place is spotlessly clean and well looked after!\nShow less"], ["Reviewed December 2, 2017", 4.0, "Worth a visit when going to Universal Studios", "Visited here one day in late Nov 2017. Ate brunch here first before going into theme park. Better food here than in park (Ate at Poké place/Pink burger). Many shops, cinemas. Came here once before 9 years ago and went to cinema here after theme park. Free shuttle bus from metro station (red line) stops right outside.\nShow less"], ["Reviewed December 1, 2017", 5.0, "This place gets better & better", "We visit Universal/City walk every few years and I’m always happy to see our favorite regular eats and also new shops that pop up like mini monster. We travel with young kids and feel safe day and night. Great place to eat after a day at the park or shop if your close. Love the lights and live music.\nShow less"], ["Reviewed November 30, 2017", 4.0, "Fun Fun Fun!!!", "I went there for a movie and dinner with my family and it was a blast. So much to do and see!! We ate at the Hard Rock Cafe which was the standard with great service. Did some people watching along the City Walk also great stores for shopping.\nShow less"], ["Reviewed November 23, 2017", 5.0, "nice place to go after a day in the theme park.", "Lost of Shops, Restaurants,bars , Cinema and plenty of universal themed shops around. A few famous names like Bubba Gump and Voodoo Donut here also. If you have missed any souvenirs at the park itself you are bound to be able to find them here somewhere. We ate at Bubba gump here. Long wait on a table but was it was nice relief to finallly get seated after being on our feet all day. Wanted to go back and just visit the Citywalk alone but didn't get the chance ended up running out of time.\nShow less"], ["Reviewed November 22, 2017", 4.0, "Outdoor Shops and Restaurants", "Spend some time walking up and down checking out all of the shops and restaurants at CityWalk. There is easily something for people of all ages, and once you are done shopping or catching a show, stop in at a number of restaurants for a recharge.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Fun after Universal", "We went for dinner after Universal closed. Be prepared for a wait everywhere. We went to Bubba Gump's. 45 minute wait but good food under the heaters outside. Shops were fun and different to look at but expensive."], ["Reviewed November 15, 2017", 5.0, "Lots to see here", "Just outside the theme park. Plenty to see and do. Upscale shops and bars but everything is pretty pricey."], ["Reviewed November 12, 2017", 4.0, "Surprisingly fun", "I was not expecting this to be something we would enjoy. I'm not much of a shopper. We had a great time just walking around, looking at the lights and having dinner outside a restaurant with live music going in the street. My daughter loved to play in the fountain.\nShow less"], ["Reviewed November 12, 2017", 4.0, "Walk the Walk", "We have been here many times....never been disappointed. Universal Citywalk has great shops and great places to eat. Our favorite eats are found at Margaritaville and the Hard Rock Cafe. The AMC theater here is outstanding. They play All of the current movies and the seats...,the seats are extremely comfortable and so relaxing. They are like lazy boy chairs....we almost did not want to leave. The atmosphere at Citywalk is fun and exciting. If you get a sweet tooth, they have candy shops and a very yummy doughnut shop....Voodoo doughnuts. Overall, Universal Citywalk is a great place to hang out and have fun. I almost forgot.....save your parking permit. If you go see a movie, the theater will give you cash back.\nShow less"], ["Reviewed November 12, 2017", 5.0, "See the Stars", "See the Hollywood stars! But be leery of celebrity impersonators. They seem friendly when they approach you, but they want to be paid for pictures."], ["Reviewed November 11, 2017", 5.0, "Fun! Great food!", "City walk had lots of shops and restaurants to choose from. Conveniently located across from the Hilton Universal hotel. Free shuttle provided by Hilton as well. Make sure that you take your children to It’s Sugar, mine had a ball there with all of the supersized candy!\nShow less"], ["Reviewed November 9, 2017", 4.0, "Food, entertainment and fun!", "Even if you don't visit the theme park, this place is worth the cost of parking to explore! Gift shops, restaurants, snacks and entertainment....there's enough to keep you busy for hours!!!"], ["Reviewed November 9, 2017", 5.0, "It's like a mini Vegas at night...Except no Casino's", "Love visiting this place at night after a day at Universal Studios, I truly recommend taking in a movie at the upgraded movie theater with reclining seats after walking all day. Jimmy Buffett's Bar is must stop at night, it's lively and fun and you will get a great drink. So many food options to name here, but the Sushi restaurant is awesome and the Chinese restaurant next to it\nShow less"], ["Reviewed November 7, 2017", 4.0, "Entertaining and Alive", "This place is always packed with people. There is plenty to do for people of all ages: shopping, movies; dining; live entertainment; games; etc.\n\nI like the long and narrow walk ways of City Walk. It feels comfortable and like you are enclosed in a safe place. Great place for families, couples, or just to do some shopping.\nShow less"], ["Reviewed November 7, 2017", 5.0, "Visit at night", "Loved visiting this area. Right next to Universal Studios. We visited on a balmy night. Lit up it's quite an experience. Heaps of restaurants and great shopping. All well priced."], ["Reviewed November 5, 2017", 3.0, "Nice walk, typical shops", "This place was OK, well kept and even a little entertaining, but it was a quick walk around. They had that typical lineup of restaurants and stores that you would expect. Touristy of course. I would’ve probably enjoyed it more at night then in the day. Took a little day trip just to hang out at this place and it’s not enough on its own during the day to keep your attention. If you go to watch a movie at night, dinner at night, see one of their concerts or something it would probably be better. Daytime is not really the time to go unless you’re going to continue into the theme park itself.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Plenty of choice to extend your stay.", "If you've had a great day at the park - what better way to end the day then take walk down the CityWalk. There are lots of restaurants, attractions, shops and boutiques on the city walk - there is even a multi-screen cinema."], ["Reviewed November 3, 2017", 4.0, "Food and Shopping", "A great place to find chain restaurants that will provide consistent and quality you can count on. We ate there several times and found the food and drink satisfying and delightful."], ["Reviewed October 30, 2017", 4.0, "Great Place to Unwind after visiting Universal Studios", "There are many shops, retails stores and restaurants wherein you can relax after a tiring day exploring the nearby Universal Studios. From the fast eats to fine dining , you can have it here. Be wary however of the throngs of tourists who arrived at the same time, they fill popular places up. Wifi is free so you can do some browsing at the complex.\nShow less"], ["Reviewed October 30, 2017", 3.0, "VERY EXPENSIVE, staff was unpleasant and rude.", "Purchased several products from multi stores (Voodoo donuts, socks store, and Dodgers store) all staff was unfriendly, NOT helpful and rude. Prices are very expensive, not budget friendly. Nothing you cant get online."], ["Reviewed October 21, 2017", 1.0, "Security is TERRIBLE!!", "Security is horrible at Universal City Walk!! Young guys not at all mature with attitudes. It’s unbelievable that security guards can have such a financial impact on clients for Universal?! The power they have given these guys is not good for their business. They can just take theme park tickets away from you if they choose to as you walk through City Walk! We had a group of 8 50ish year old women who rarely go out to anything and security picked us out of a crowd of people walking. They took 3 RIp tickets from us.. they said we were uncooperative which was absurd!! 2 girls had red solo cups in their hand. One with water and the other had Diet Coke. Somehow they equated that to open container!! It was the craziest thing I have ever witnessed. We spent $300 a ticket and 5 of us didn't enter. 2 of our 5 had driven 2 hours, took off from work to have their first experience at the Horror Nights. I was the third to have my pass taken because I was livid and went off on the guards after their insinuations and decisions to revoke 2 passes..not to mention their unbelievable attitudes. We weren’t even close to the entrance to the park when we were walking through City Walk and got stopped and told our tickets were not going to be valid.\nI have never had such an awful experience ANYWHERE!!! Our attorneys are going to handle it but it was not enjoyable at all!!!\nShow less"], ["Reviewed October 20, 2017", 3.0, "Glamorous on screen not in real life", "We were not expecting cameras and red carpet. However we also were disappointed in the whole experience.\nVery dirty and very overrated.\nDo this as a tourist attraction but don't expect to spend a full day.\nA must on your list but beware it will disappoint, we are glad we saw it another thing off our bucket list.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Food and shopping", "I love the way California has done these eating and shopping areas at the theme parks (downtown Disney as well) it adds to the buzz of the day. Dropped off by our Lyft driver I thought he had brought us to the wrong place but as you walk past the car parks you are greeted with many shops and restaurants. So much to see and do, we explored more at night after our full day at universal studios. All in all you will walk through here when going to universal studios are just come visit regardless.\nShow less"], ["Reviewed October 17, 2017", 4.0, "A lot to do here - not just a detour before Universal Studios", "There are a ton of shops here for getting candy, snack items, souvenirs and lunch or dinner. The little kids on a hot day will like the interactive fountains, so if you bring a change of clothes with you, it's fun on a hot day to let the kids play for a little while. It's not something that you can leave your kids to do while mom and dad wander off, though. You do need to stay with the kids.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Feels like a free theme park", "Shopping and restaurants are an upgrade to Universal Studios Park and fun to people watch. It feels like you are within the theme park as it is not like most malls you have visited"], ["Reviewed October 16, 2017", 5.0, "Very fun place to end your day after visiting the attraction", "Try visiting Hard Rock cafe with it's amazing guitar and enjoy the very wide variety of restaurants at the citywalk, also they have a comic store that sells genuine comic characters which was really great."], ["Reviewed October 13, 2017", 4.0, "A Good Variety", "It seems they keep expanding this, or something. It seems like this was twice as many places available throughout this area. We had parked in the general parking, where you have a nice long walk from the garage to the front of the park. So you stroll by a number of unique shops, as well as the classics like Hard Rock, Bubba Gump Shrimp, movie theater and so on you see in some other touristy areas around the country.\n\nNo shortage of options to eat at or to spend the last of your money on the way back to your vehicle after a long day in the parks. It is a nice area, and they offer any number of different after dark opportunities from what we had been told and saw on their advertisements.\nShow less"], ["Reviewed October 10, 2017", 5.0, "A perfect place to end your \"Universal studios\" visit", "After enjoying the day at Universal Studios, what could be better then walking to your car through this vibrant and amazing walk. offering you a great variety of shops and dinning options, it really makes you end your day on a high. Bubba Gumb shrimp co is our favourite dinning place there, for the great service and value.\nShow less"], ["Reviewed October 10, 2017", 4.0, "Fun Concept but Not Too Much to Do", "The CityWalk is a “nice to have” feature of Universal. Ultimately it softens the blow of having to end your day at the park because you can just head on over to the CityWalk and continue to have fun! Well...kind of.\n\nThere are a ton of places to eat and drink here but it also feels super touristy. You will have Margaritavilles and Hard Rock Cafes more often then a unqiue restaurant that isn’t a chain. You can spend your time browsing the gift shops, grab a bite to eat or something to drink, but after that you’ve pretty much done it all at the Citywalk. My husband and I always get so excited about the Citywalk concept but never find enough to hold our attention for longer then 2 hours. Definitely grab dinner here and walk the length of it, but there probably won’t be much else for you to do here.\nShow less"], ["Reviewed October 8, 2017", 4.0, "A lot of choice fun place", "City walk is a good locsation for food and entertainment lots of choices available for all tasts. There are a few shops dotted along the walk way to the theme park entrance. There is a fee to park."], ["Reviewed October 7, 2017", 4.0, "Great to walk around night", "CityWalk is a fun nighttime venue with a great selection of restaurants, shops and entertainment. Outdoor music and convenient garage parking."], ["Reviewed October 7, 2017", 4.0, "impressive", "The city walk is a hub of activity which has shops ,bars and eateries which will cater for anybody, allthough busy ,staff in the shops and food outlets dealt with requests swiftly, so nice to see so many families just having a good yime"], ["Reviewed October 4, 2017", 5.0, "I Enjoyed My Visit", "We were on a western tour, and had a few hours of free time in the afternoon. So decided to spend it at the Universal City walk. It beats sitting in your hotel room.\nWe really wanted to go to the park but it would not have been worth paying the money for only a few hours.\nThe City Walk is great for fun photo opts, and for dining.\nIf you like to shop, this is the area to do it. Everything from Universal items to Jimmy Buffet articles. There is a great Harry Potter store.\nIt is Free to walk around here and you can stay as long as you like.\nThere are no rides in this area. You walk further down and buy your ticket to enter the actual park.\nWe ate in Jimmy Buffet Margaritaville and it was a wonderful lunch.\nthe waiter and a manager were both at our table assisting. So very pleasant.\nShow less"], ["Reviewed October 3, 2017", 5.0, "CityWalk has everything", "City Walk has everything you could want! If it hadn't been for the fact that I had been walking around Universal Studios the whole day and was tired AF, I would have loved spending more time here doing window shopping and visiting the restaurants."], ["Reviewed October 3, 2017", 5.0, "Great place to visit", "Free shuttle service from either the Hilton or the Sheraton that is located right there. Lots of restaurants to choose from depending on what you want to eat along with a variety of shops."], ["Reviewed October 3, 2017", 5.0, "NICE PLACE TO SPEND THE WEEKENDS", "Lovely and Safe place to walk around with your family, Very Safe , lots of Security. Tons of Delicious Restaurant ranging for Fast Foods to Elegant dinning, From Sushi to Steak."], ["Reviewed October 2, 2017", 5.0, "Universal City Walk Hollywood", "We went to City Walk Hollywood to enjoy the new Margaritaville. The cheeseburger was delish as always and the service was stellar. The Hard Rock Hotel still served the best cocktails. Loved the general vibe of the city walk. We were there in the AM on a rainy day and there were very few other people, but I could see how exciting the night life could be. Loved the location and the Voodoo Doughnut shop. Yum! I recommend a few minutes to look thru the shops on your way to Universal Studios, but as a destination, probably not.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Worth a visit for even if not going to Universal Studios but really ideal for dinner after a day at Universal", "Unless you want to pay $10 extra for VIP parking at Universal Studios, you will be forced to walk the \"Walk\" to and from the parking structure. That's not such a bad thing as it is an exceptionally well presented outdoor mall and dining destination. It almost feels like you are already in the theme park - giant guitar etc..\n\nHuge range of casual and family dining options (both sit down and food court) as well as ice creams/Cinnabon/donuts etc... A few shops as well but it it more about the dining. There is also an excellent movie cinema.\n\nEasy place to have dinner after a day at Universal or perfect if you are staying nearby. Even if you aren't, the Walk is worth a visit for a stroll around, people watching, and choice of dining.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Good for folks staying onsite", "If you are stating at the Sheraton or hilton the restaurants offer a good varied choice for an evening meal after a day at the park"], ["Reviewed September 29, 2017", 3.0, "Take a look if visiting Universal Studios", "I would not go out of my way to visit CityWalk. My recommendation would be to go after visiting the park next door. We did just that and went for dinner after a day at Universal Studios. It is nice and the lights are pretty after dark, but we found the crowd to not be family friendly at all. Take a look, visit a couple of shops and then leave before it gets too late (if you are visiting with kids of any age).\nShow less"], ["Reviewed September 29, 2017", 5.0, "Relaxing place to take in the sites and get a bite to eat", "A nice place to walk around when you have some time. There is a wide variety of restaurants, stores and places to relax -- something for every taste."], ["Reviewed September 28, 2017", 4.0, "Vacation", "The place is well family oriented, very clean, nice stores and food area, price is variable $$ all depend what you want. Like it!!"], ["Reviewed September 27, 2017", 5.0, "Awesome", "You gotta spare sometime if you visit Universal Studios to come here and enjoy this very lively place. The place is just so nice and would be a nice wrap up to an awesome day at the studios. Some nice shopping to be done here if you are looking to get your universal souvenirs. Right at the middle there is also this awesome stage and mostly with some activities...singing and dancing over there.\nShow less"], ["Reviewed September 24, 2017", 4.0, "Outdoor shopping mall", "Nice place to people watch. Clean mall adjacent to Universal. Fast food galore. Not a salad to be seen. After a couple of meals on the road kinda would like some salad. Mostly overpriced paid 12.00 for KFC 3 piece chicken tenders with coleslaw/potatoes and drink. Haven't had KFC for years, but that still seemed pricey. Husband and daughter had Smash-burgers with fries, very greasy 29.00. Guess it's to be expected. Other than the food prices, mall was clean and easy access.\nShow less"], ["Reviewed September 19, 2017", 3.0, "Useful for dinner break", "Mainly shops restaurants and movie theaters.\nWent to a Mexican restaurant Camacho's. Fast service and good tortilla chips and margaritas. Had the enchiladas which were not bad (don't get the lobster one as too sweet). One nice touch was avocado dip that was prepared at table.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Very Busy Very Hot But so rewarding", "If you can dodge the random sale people selling cd's of their music etc you can get some wonderful photos of the stars and hand prints. a good few eateries are available as well as shops selling tourist stuff.\nIts HOT so take a small bottle of water or simply get one in one of the many shops available.\nvery vibrant and exciting place to be but not great for getting a pic of the Hollywood sign\nShow less"], ["Reviewed September 16, 2017", 5.0, "Great for dinner and a movie", "If you're visiting the park, this is a great alternative for food instead of eating in the park. If you don't want to go to the park, then CityWalk is good for dinner and a movie or just to stroll around and window shop. The drawback is that there isn't much else to do. CitiyWalk is about quarter mile stretch of shops & restaurants and visiting just to see it might not be a good idea. Look up the restaurants and see if you could make a reservation if you're coming on the weekends because they can get booked quickly.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Amazing shops and restaurants!", "Either on the way in or out of the theme park, this place offers even more shops and more food outlets than anyone would ever need, with great brands, iconic sights and more souvenirs to buy, if you don't already have enough!"], ["Reviewed September 8, 2017", 5.0, "Fun place to explore", "Fun place to explore with shops and restaurants. Brightly lit up with neon lights at night. Street entertainers and fun fountains. Restaurant to fit most budgets."], ["Reviewed September 7, 2017", 5.0, "Amazing experience for everyone visiting LA!", "This was very awesome to visit this area and to see the stars on the Walk of Fame. Great shops. Great restaurants."], ["Reviewed September 6, 2017", 3.0, "Pretty boring I would say but I'm sure others must enjoy", "Just took my visiting relatives here as they asked to see it. I live here but have never done this. All this is is names of stars/well known people embedded in the street on a type of copper plate and loads of people just taking pictures of them. And that's it, nothing more. But, it's free so if your going along Hollywood Blvd you may as well take a look.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Fun Date Night", "with all of the Bistros and shops this is a fun place to go on a date night, There are theatres as well. People watching is a must, and once in awhile they have a concert. prices are moderate to expensive but fun is going to happen.\nShow less"], ["Reviewed September 6, 2017", 1.0, "Don't wast your time", "Always very crowded with poor to mediocre food halls. Service is rushed at best! Go enjoy Universal Studios but skip CityWalk"], ["Reviewed September 5, 2017", 4.0, "Great shopping and pleasant atmosphere", "We walked thru the Citywalk when going into Universal Studios. Good selection of restaurants and Studio merchandise stores. Clean and well laid out. Try Voodoo Donuts for a sweet treat!"], ["Reviewed September 5, 2017", 4.0, "Clean, clean, clean", "We stopped by while waiting for my son. We went thru the stores, bought chocolate, sunglasses and a spiderman figure for my nephew. Cool stores, very clean, tons of restaurants. I wouldn't go here specifically to eat dinner or have a drink but if you are dropping people off at the park or picking up its a good place to kill 2 hours. Most of the restaurants you will find elsewhere...Tony Roma's, Bubba Gump, etc, etc\nShow less"], ["Reviewed September 5, 2017", 5.0, "Great!", "We came here after having spent 15 hours (!) at Universal Studios. We were hungry, needed to sit down and needed to have food super quickly. So, our choice to go to the Universal City Walk was a no-brainer as it is basically adjacent to Universal Studios. We thoroughly enjoyed it with its many shops, all the lights, water displays, lit up advertisements, etc etc etc. Last but not least there is a very good variety in restaurants that serve food until late and fast. We recommend going!!\nShow less"], ["Reviewed September 4, 2017", 4.0, "Nice places to dine before and after or separately from a visit to Universal Studios", "Just returned to University Studios 7/3/17 and it is a nice places to dine before and after or separately from a visit to Universal Studios. The shops are super fun and now include a fun VooDoo Doughnuts and still have Sugar the best candy/novelty shop around.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Prepare to Walk at CityWalk", "Love to go to CityWalk. Lots of things to see and many places to shop and eat. Very fun and entertaining. Prepare to walk a lot and see many many shops, restaurants etc."], ["Reviewed September 4, 2017", 4.0, "A night to walk", "It is fun. Good restaurants and little shop and free concert, music... We stayed in Hilton and chose to walk here instead of having dinner at hotel and it was a right hoice"], ["Reviewed September 3, 2017", 5.0, "Never fails to entertain", "Whenever in the area, a visit here is always entertaining. Shops, restaurants, cinemas, attractions. You can even just sit and be idle while watching passers by. In addition, lots of photo spots from end to end."], ["Reviewed September 3, 2017", 4.0, "Got to be done", "Very busy place. Make sure you keep your kids close by. I would visit first thing in the morning to avoid the mad rush. This then gives you time to take pictures with out the pressure to do it quickly."], ["Reviewed August 30, 2017", 5.0, "Walking path before universal studios entrance.", "Visited 8-25-17. Met family here. Music was playing on the stage while we were able to dance and have fun adjacent to the stage. We were dancing as we watched ourselves on an upper screen. Sat and ate at Johnny rockets. Lots of restaurants to choose from and other stores to make purchases like souvenirs doughnuts popcorn cotton candy coffee and more. Loved it and definitely recommend a visit.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Better selections then Universal studios", "To me this place was better than Universal studios and had way better selections to see . The place and bathrooms were very clean. There are plenty of food options and shopping places. It wasn't that crowded and some really good photo opps. I would suggest checking it out there are some cool stuff to see .\nShow less"], ["Reviewed August 29, 2017", 4.0, "Good for food and shops", "Visited the City Walk just to eat one night, we didn't visit the studios. Plenty of options for eats and a good number of interesting shops. Best to visit at night when things light up. Used valet parking which works out cheaper with restaurant validation."], ["Reviewed August 28, 2017", 5.0, "Eating, Shopping, and Fun for All Ages", "CityWalk is a great place to visit especially in the evening. There are countless eateries and snack bars including Frozen yogurt, donuts, seafood, pizza etc.. At night, you'll experience the big lights and some street performers. We enjoy the singing acts. There are many unique stores selling everything from specialty socks, stuffed animals and toys, to shoes, clothing, and of course plenty of souvenirs. There's a colorful water-play area - perfect for the hot summer months. There are clean restrooms and parking is available starting at $25. Universal CityWalk leads to Universal Studios Hollywood and is a great place to get dinner after a fun day at the amusement park.\nShow less"], ["Reviewed August 27, 2017", 3.0, "Good place for a sit-down meal.", "Universal in general is too commercial and teen-based for my tastes. However, we visited the CityWalk due to its close proximity to our hotel and good restaurant reviews. Glad we ate there. I was surprised at the variety of restaurant choices and reasonable dining prices. Will avoid in the future, as it felt like a Teen Beat wannabe Times Square advertising hub.\nShow less"], ["Reviewed August 26, 2017", 5.0, "Pleasant walk", "For any visitors who want to visit the theme park, do a studio tour or just walk around, this is a nice way to spend an hour or two. I went there just to walk around, have some meals and look at the small shops, and it was very enjoyable. There is a small shuttle that takes visitors near the metro station to the center of the city every 10 minutes. The place is very crowded, but very cheerful and clean.\nShow less"], ["Reviewed August 21, 2017", 5.0, "Great Surrounding Graphical Design", "This place is very touristic and I would recommend getting your camera ready to take some of the most memorable souvenir around Universal CityWalk."], ["Reviewed August 21, 2017", 5.0, "Memorable experience", "This walking street has a lot of nice shops and dining outlets. We tried a few of the dining outlets and were impressed with the quality and taste of the food.\n\nThe outlets were carefully selected to ensure that the visitors have a memorable dining experience.\n\nThe street was also nicely decorated and designed, so it was nice for takings photos.\nShow less"], ["Reviewed August 21, 2017", 4.0, "Good for shopping", "The place is good for shopping because there are plenty choices of stores. The food actually very expensive and not much healthier stuff there..."], ["Reviewed August 20, 2017", 5.0, "So many restaurants!", "Really good City Walk with many restaurants and stores. I would have gone more if I didn't have to pay for parking."], ["Reviewed August 20, 2017", 4.0, "Not worth a special trip, but nice for walking around after Universal Studios", "We had 2 evenings here. We were staying at the nearby hotel and walked over for dinner. Even though it is a shopping mall, it really felt as if we were starting our vacation. The outdoor atmosphere was festive, and some of the shops were different from ones we have at home. The next evening, we came back after spending the day a Universal studios. Citywalk had better dining choices than the theme park.\nShow less"], ["Reviewed August 20, 2017", 3.0, "To crowded to enjoi", "I expected more but because of the crowd off tourists it was not so pleasant. I even got pushed aside while taken a picture from a friend posing on a star! In short it was a disappointment"], ["Reviewed August 17, 2017", 4.0, "Lots of Restaurants and Shops", "Almost every restaurant you can think of is here. Bubba Gumps, Johnny Rockets, Margaritta Ville, Hard Rock Café, Tony Romas, Subway Pizza Hut, Taco Bell and others. There are several touristy shops, an AMC movie theatre and I FLY experience"], ["Reviewed August 17, 2017", 4.0, "All very mass-produced, but something for everyone", "We didn't spend a ton of time here because we just came to Universal City for the day, but if we had stayed closer by, we probably would have returned more often. The walk had some of the stores that teenagers love the most, several appealing restaurants, and a clean, inviting atmosphere. It's also spread out enough that we didn't feel too crowded or claustrophobic. Seems like they had plenty to offer both kids and adults.\nShow less"], ["Reviewed August 17, 2017", 4.0, "Good Time", "There was a lot to do here. Great restaurants, street entertainment. Indoor sky diving. A good place to window shop."], ["Reviewed August 12, 2017", 5.0, "Cool", "This place is free to visit and is very cool! Lots of shops, restaurants and bars. It is an experience!"], ["Reviewed August 11, 2017", 5.0, "A fun place to hang out", "So many restaurants and stores to choose from. The lines at Voodoo donut are hit and miss. Kids love running through the fountains. Lots of photo ops."], ["Reviewed August 11, 2017", 5.0, "Universal City Walk Hollywood my favorite place to go!", "I do not know where to start. Revenge of the Mummy-ride, Fast & Furious, Mulligan's Pub, WaterWorld to cool down...Harry Potter,,,,,my favorite Transformers, Jurassic Park...another ride to cool down...When I go to Universal Studios with my granddaughter we always get \"Front of the Line\"---makes it more fun when there are a lot of people there. So much fun I could go there every weekend and I am not joking.\nShow less"], ["Reviewed August 10, 2017", 5.0, "Good shopping, bars, and restaurants.", "This is a great add on to Universal Studios. There is good shopping, bars, and restaurants. You can pick up some good presents for family and friends, general and Universal Studio themed."], ["Reviewed August 8, 2017", 3.0, "Reminded us of Downtown Disney", "We liked to get out of the park and go sit and cool off . Ended up getting shirts and stuff from some of those stores."], ["Reviewed August 6, 2017", 5.0, "Fun", "Walk of Fame\nThe Hollywood Walk of Fame comprises more than 2,600 five-pointed terrazzo and brass stars embedded in the sidewalks along 15 blocks of Hollywood Boulevard and three blocks of Vine Street in Hollywood, California.( Google).We went and looked around the things in the movies.\nWe can go to the wax museum.\nAfter that we went Universal studio and played Harry Potter Games.It was opened in April 30, 1912; 105 years ago . The owner was NBC . We can see other one in Florida.\nShow less"], ["Reviewed August 6, 2017", 5.0, "We spent a great 3 hours there.", "Despite the heat, and thankful for the great iced coffees, we spent 3 plus hours there. Parking is easy, though I think it was about $20, and our luggage was safe during our stay.\n\nWe actually did some shopping whilst we were there and got some great deals on gifts for family at home, as well as some great clothing for our teens age daughters.\n\nPlus it's just an atmospheric place to wander around!\nShow less"], ["Reviewed August 5, 2017", 4.0, "Lots of nice shops and restaurants", "If you like shopping, it can be worth spending time here. Also, if you are planning to come early to Universal Studios, you can grab breakfast here - or dinner on your way out."], ["Reviewed August 4, 2017", 5.0, "Great walk", "The Universal City walk is a walk through the Universal city, which is right outside the Universal studios. You can shop while you take your walk."], ["Reviewed August 3, 2017", 4.0, "Nice spot while visiting the studio", "The CityWalk at Universal studios is a very nice spot to spend some time (and some money) while you are visiting the studio complex."], ["Reviewed August 2, 2017", 4.0, "Movies experience is stellar!", "AMC at universal city walk is worth it. I give 1-star for parking because they charge $25 but you get a $20 cash refund once your purchase the ticket. Stay inside the theater... each row has a leather lazy boy with electronic recliners and very wide spacious seats. It is totally worth it if you get your tickets at Costco.\n\nBuy the black tickets if you live in California. The yellow tickets do not work. If you buy them online -- make sure you have ample time because it can take 15-30 minutes to receive them in your inbox. Otherwise, get ready to pay ~$19/ a ticket.\nShow less"], ["Reviewed August 2, 2017", 5.0, "awesome", "I'm a Raider fan & the first place I saw was rheir stall, I could have bought everything. I buy my stuff on-line but here I was in THE SHOP! I bought a lot!\n\nWe didn't hit much else which was a pity in hindsight but Universal Studios beckoned for our son so we went there! Pity!\nShow less"], ["Reviewed August 1, 2017", 5.0, "Great night", "Great food and shopping. Gets busy at weekends though. Take plenty of money lol. $10 to park which isn't too bad for LA."], ["Reviewed July 30, 2017", 5.0, "The place with something for everyone", "Restaurants, nightlife and shops are all there for one stop shop for fun.\nIf movies is your thing, there is a theatre there. If people watching is your thing, there is always plenty of people there.\nThis is a great place to meet on a first date, since you never have to settle on any one thing to do, you can do it all.\nParking is horribly expensive. Consider parking elsewhere and either taking the universal studios tram up the hill or take an (Uber, Lyft or other car service) especially if you will be drinking.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Was worth the walk", "Went here as an afterthought after universal studios. Loved this outdoor mall. Ate at Smash Burger and Pinks. Reasonable prices and good food. Unusual store and universal souvenirs at a better price than the park. Don't forget popcornopolis."], ["Reviewed July 24, 2017", 5.0, "Fun for everyone and all ages", "We went to go to the hard rock but were amazed at how much there was to do there! Triple the size and excitement of downtown Disney! So many shops, restaurants, and excitement! From skydiving indoor to voodoo donuts, this is a must!"], ["Reviewed July 24, 2017", 3.0, "Not much going on", "We went to City Walk looking for something special and unique. That was probably our mistake. The stores were mostly filled with cheap souvenirs and the restaurants held little interest for us."], ["Reviewed July 23, 2017", 5.0, "Love CityWalk!", "Every time we visit the parks we love the CityWalk part just as much. It's full of great restaurants, shops, cinemas etc. You can spend hours here, come for dinner, back to the park and then visit at the end of the day for dinner. It's a great area clean with good music.\nShow less"], ["Reviewed July 22, 2017", 4.0, "Well worth a visit", "There's a free shuttle bus that takes you up to Universal CW. It's only across the road from Studio City underground station. Plenty of shops and places to eat in a relaxed atmosphere"], ["Reviewed July 21, 2017", 4.0, "Great shopping", "All the shops that a tourist could want in one area. A great range, fabulously helpful staff. Worth a visit, especially after being at Universal Studios (although after all that walking, it might have been more enjoyable doing this on a separate day)."], ["Reviewed July 19, 2017", 3.0, "Shopping center for non park goers", "This is little more than an outdoor mall with a limited collection of stores but a few good restaurants make up for the otherwise bland atmosphere. You can get your Universal memorabilia here without having to enter the park."], ["Reviewed July 18, 2017", 4.0, "Universal good times", "Had a great time at Universal and City walk. Harry Potter ride was one of our favorites. Lots to do on City walk for people of all ages"], ["Reviewed July 17, 2017", 5.0, "One stop shop for food, fun and entertainment!", "The City walk has been a go to for our family and friends since it's inception! There are tons of restaurants, shops, and entertainment (music, theater and misc. activities) to keep the people of all ages occupied! There is no cost to get into City Walk (other than parking fee). Week nights (and non-summer) are usually pretty mellow but weekends and summers are always bustling. Recommends: VooDoo Donuts, Saddle Ranch and a movie!\nShow less"], ["Reviewed July 15, 2017", 4.0, "Cool place for shops and food", "Parking was extremely easy. Would never be this easy in the Orlando, FL location. Tons of shops and food spots here. Lots of energy. We took some time just to walk around and take in the scene. Stopped in a few shops. Had voodoo doughnuts. Very cool area.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Very energetic area", "We went specifically to eat at Wolfgang Puck's restaurant but the walk to it was very entertaining. Lots of shops and restaurants, very high energy but also very crowded."], ["Reviewed July 14, 2017", 1.0, "If you are a mall rat this is the place for you", "I don't even know why this is an attraction on trip advisor. It is just a hyped up outside shopping mall area with all the crap you find anywhere in a America. Why travel miles to see something you have in your own city."], ["Reviewed July 13, 2017", 4.0, "Good Ambience", "This is a good place if you want to stroll along and enjoy the ambiance. It has many restaurants, stores, and gift shops to choose from. The evening is a better time to visit because it often has entertainment and music."], ["Reviewed July 12, 2017", 3.0, "Good place to find eat & little else", "This place has changed over the years - and not for the better...SOOOO much junk being peddled...this is definitely aimed at kids, albeit there is least a Samba's Brazilian Steakhouse here (RECOMMENDED!!!)..."], ["Reviewed July 10, 2017", 4.0, "Fun, food, entertainment", "If you are looking for a fun place to visit with food, entertainment, live street performances and cool things to explore, then City Walk Hollywood might be great place to take a date or the family. Seeing all things in one place makes this a one stop shop or do place to go. It's so much fun to take a day or an evening or spend the entire day and shop, eat, explore or see a movie, dance in the streets or take a selfie with Kong over your head. Whatever you do, it's bound to delight you and the family. The maverick experience\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great time!!", "Great time at universal and city walk! So many entertainment and restaurant options! Great for people watching as well from the numerous outdoor dining seating restaurants!"], ["Reviewed July 10, 2017", 5.0, "Cool place to go for an evening out.", "This place is fun. Lots of restaurants, shops and walking areas. Can rent wheelchairs if needed. Has a really nice area for listening to music and seeing yourself up on the big screen."], ["Reviewed July 10, 2017", 1.0, "Awful.", "How is this place still open? What's the worst here?... The oversized signs that scream \"have fun!\"; the touristy shops selling crappy gifts; the obscenely insane parking structures; or the mid-America collection of sub-par restaurants that offer a sampling or the worst of American mediocrity? All of it.\n\nThis disaster of a place has never connected with Los Angeles its local market. It panders to the lowest of lows and keeps getting worse. The latest entry is a Jimmy Buffet restaurant that is embarrassingly out of place with food that tastes likes is was reheated in a frozen food bag.\n\nI would love this place to succeed, but it seems to get worse with time not better.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Great shops & dining", "We didn't realize how cool this place was and didn't leave enough time to do all the shopping and dining we would have, but I took my 12 year old and her friend after going to Universal Studios for the day and they loved it. They did a little shopping and then got a cinnabon for the ride back to the hotel and we all wished we had planned to spend more time there and eat dinner.\nShow less"], ["Reviewed July 7, 2017", 4.0, "A nice walk at the end of a hectic day", "Nice restaurants and lots of shops, a good place for the whole family to enjoy, they also have activities for kids and candy shops."], ["Reviewed July 7, 2017", 4.0, "Spend the day just people watching", "What a unique place to do some people watching, lots of restaurants, gift shops, music, and a movie theater. If you only have a few hours and want to visit a unique place visit the Universal City walk in Hollywood. Use the valet parking and eat it one of the restaurants and be a little park for only around seven dollars. That's if you time it just right there is no cost to get in but a lot of fun shops that are unique. They just opened a brand-new Voodoo Donuts which is pretty amazing, they also have this huge candy store that you can get just about any kind of candy there. Lot of Hollywood and movie memorabilia also sold their. Many good restaurants to choose from from Johnny Rockets and Buca di Beppo's just to name a few. There is also kind of a outdoor splash park with dancing fountains where kids can play and get wet. You usually have to walk through here to get to Universal Studios well worth it either before going into the park or after the park.\nShow less"], ["Reviewed July 6, 2017", 5.0, "Fun place to visit", "Great place to visit. Doesn't cost to get in but he advised that if you are driving that it does cost $20.00 to park. The walk is filled with tons of super fun shops and restaurants. You could spend the whole day just waking around the city walk and have a fun day out\nShow less"], ["Reviewed July 5, 2017", 4.0, "Take time to check this place out...", "Lots of restuarants, gift shops, music, lights and even an AMC cinema. We came back to check this place out after spending a day at universal studios. We watched a movie at IMAX - a brilliant experience, with recycliners and air con! Lots of souvenir shops, sweets and brand names stores here to explore. A definite visit before/after your universal studio visit. (It reminded me a little like downtown disney)... FREE to enter.\nShow less"], ["Reviewed July 5, 2017", 1.0, "Terrible Experience", "Visited this place last June 25, 2017. Prior to going to the airport, my family wanted to see Universal Citywalk before catching their late night flight back to Manila. After about 2 hours of walking around, we headed back to our car only to find out that our van was broken into and 5 bags (supposed hand-carry) were all gone... including all the passports! This happened in broad daylight... 5-ish PM! After going to the Police Department (inside the citywalk) and reporting the incident... they reviewed their surveillance camera and 2 hours later confirmed that there was a car (black lexus... yup nice, decent car) that parked next to our van and a couple of guys appeared to be carrying some bags coming from our van back in their car. The thieves went back and forth 2x and were probably working on getting the rest of our stuff. Mind you... it's $20 to park! This experience caused us a lot of anxiety, stress and a bitter taste of Universal City.\nShow less"], ["Reviewed July 1, 2017", 5.0, "You have got to see a movie at the AMC Theater", "I've come here to explore a lot of fun things before. One of the things I recommend is going to the main Universal store, and getting the giant simpsons doughnut, for only $5.99! It was actually really good! Addicting! I almost ate the whole thing by myself haha! I also highly recommend watching a movie at the AMC Theater here. They revamped the whole place, and the seats!! My goodness!!! The seats had a side button where you can either stay seated while watching the film, or stretch it out so its basically like watching a movie while laying down, its freakin amazing, and so perfect for cuddling haha!\nShow less"], ["Reviewed June 29, 2017", 4.0, "Raider image", "Had to go Universal city walk Hollywood so I could visit Raider image. Plenty of jerseys,shirts and hats. Helpful staff and grabbed couple shirts and hats. Nice location with lots of shops and places to ear."], ["Reviewed June 27, 2017", 4.0, "A Little Bit of Everything", "There is a little bit for everyone on CityWalk. Excellent restaurants, souvenir shops, shoe and clothing stores and an excellent movie theater. The IMAX theater is pricey. It was $90.00 for four adults and that was without popcorn. CityWalk is larger than you would think."], ["Reviewed June 27, 2017", 5.0, "Great time", "Amazing restaurants and stores. It is free to get in and it was clean and easy to get around. I would recommend"], ["Reviewed June 26, 2017", 5.0, "Fun!!!", "We walked through City Walk on our way to and from Universal Studios and we really enjoyed it! Fun restaurants and shops and a great place to people watch!"], ["Reviewed June 26, 2017", 4.0, "Universal City Walk", "This is the main street of Hollywood and draws a huge number of tourists. There are Museums, Shows Street artists and Restaurants"], ["Reviewed June 25, 2017", 4.0, "Fun to see, crowded", "This was fun to see. Great places to eat and shop. Fun to just go to without going to Universal or a great place to stop after Universal."], ["Reviewed June 24, 2017", 5.0, "I like CityWalk", "It is a nice place to people watch and meet first time visitors from out of town. I like it for their super large candy store (Sugar) and their great movie theater as well. Just outside of Universal Studios, of course it is touristy."], ["Reviewed June 24, 2017", 4.0, "Water World show - WOW!!", "Very enjoyable. Front of the Line Pass is Definitely worth the money. Most attractions had a 50 minute wait, but with our passes, we were able walk right up to the front of the line and get right on the attractions with almost no delay. Although the Front of the Line pass only allows you access one time to bump to the front of the line, it was still worth it. The Water World show was awesome. We got to meet Lucy Ricardo right after walking into the park. We were able to get our pictures made with several movie characters.\nShow less"], ["Reviewed June 24, 2017", 5.0, "better than touristy orlando", "This is the real deal, where Florida is great but built for tourist,this is a real city, so doesn't get as busy, and all the A list celeb come here with kids.we seen Mario lopes making his E show, seen Miley Cyrus and Liam Hemsworth getting coffee.tom cruise in his range Roberta traffic lights on phone.no place like it forme.\nShow less"], ["Reviewed June 24, 2017", 4.0, "A Pleasant Couple Of Hours", "We had no interest in the Universal Studios tour but spent an enjoyable couple of hours at the CityWalk. There are plenty of shops and restaurants to keep you busy and lots of photo opprtunities.\nIt's one stop over from Hollywood on the Metro or a very cheap Uber ride so not much effort required.\nShow less"], ["Reviewed June 23, 2017", 5.0, "There's always something happening here", "Universal City walk is great, parking is $10, with so many Restaurants and shops to browse, you could very easily spend several hours here. There's also movie theatre's and indoor skydiving."], ["Reviewed June 23, 2017", 5.0, "Amazing shopping and eating location!", "The CityWalk is almost as beautiful as the park and offers a wide variety of foods and shopping opportunities. We especially loved the sugar store, offering almost everything in candy form plus A LOT of awesome prank and funny items throughout. 10/10!"], ["Reviewed June 23, 2017", 5.0, "Thumb up", "Suitable for adults. Like the Harry Porter, transformer, King Kong, Jurassic park, Fast and furious rides. We are able to complete all rides. The water selling over there is extremely expensive though"], ["Reviewed June 21, 2017", 5.0, "Super Easy and Plenty of choice.", "So great to have such a vibrant place to have some dinner after an amazing day at Universal Studios. There is plenty of choice."], ["Reviewed June 21, 2017", 4.0, "We love Universal Walk!", "Even if we don't go into universal studios, we like to stop here on way home and hang out while traffic dies down. We usually go to the movies here. It's just a fun place to walk through and have dinner and listen to the music. And now I am so happy that they opened a voodoo donut shop! We waited an hour in line to get in but it was worth it! Got to cross it off my list! Love all the lights and festive atmosphere.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Awesome!", "After spending a full day at Universal we walked through the CityWalk at night and enjoyed it so much! Took lots of pictures too! Hope to return again some day!"], ["Reviewed June 20, 2017", 5.0, "Wow! Great entrance to park.", "Could have spent all day here, wish we had more time. Plan to spend at least two or more days so that you can experience all that it offers. so clean and magical."], ["Reviewed June 18, 2017", 5.0, "Expensive but worth a visit", "Fun place, very vibrant and good end to the day at universal. Lots of places to sit or to eat and drink although very pricey."], ["Reviewed June 18, 2017", 4.0, "Wear your walking shoes.", "Lots of fun stuff to see. Shopping and places to eat. There are lots of people trying to get you to take the bus tours so get ready for that."], ["Reviewed June 18, 2017", 4.0, "Great vibe!", "Vibrant with lots of colour, people, shops and restaurants. The souvenirs shops look exciting with music and bright lights. Great experience. We asked throughout during the day and late at night. The night was more vibrant and alive."], ["Reviewed June 14, 2017", 4.0, "Hang out", "Fun place to hang out after universal studios, plenty shops and restaurants. After some 'souvenir' shopping, we headed to Hard Rock Cafe for a beer. Enjoyed the time here, good end to a great day at the park."], ["Reviewed June 12, 2017", 4.0, "Nice place to do some shopping and eat", "I visited this with my cousin and her kids.\n\nThere are a number of shops like Hot Topic or places to eat like Bubba Gump Shrimp restaurant.\n\nIt's right next door to Universal Studios tour and is a nice place to visit before going into the Studio tour.\n\nIt's free and you could spend 30 mins or so there.\n\nShow less"], ["Reviewed June 12, 2017", 4.0, "Great food, shopping, and atmosphere!", "Big and small restaurants, shopping, water fountain for kids to run and play in, and other things (fly air or something like that). Sometimes we let the kids go to Universal Studios while we play here, or we do half and half."], ["Reviewed June 11, 2017", 4.0, "Fun entrance of Universal Studios", "For those that like to shop, there are plenty of fun choices, along with restaurants. Everything is very eye-catching. We didn't spend much time here except to enjoy the colorful fountain and to stop and take a picture with some fun characters. I would suggest seeing Universal First while it's not as crowded and then stopping here afterwards to shop and eat.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Good", "Perfect end to amazing day. Loads of stores to visit. Food & Merc shops. Open late so can go after the park shuts."], ["Reviewed June 10, 2017", 4.0, "Pricey tourist area", "We visited the area after spending the day at Universal. We were tired and hungry and stopped by one of the restaurants. Shopping and food is expensive in this area. Cool vibe though."]]}}