{"Universal Studios Hollywood": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Universal Studios Hollywood", "url": "/Attraction_Review-g32655-d104417-Reviews-Universal_Studios_Hollywood-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/3a/2f/a3/universal-studios-eingang.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "30181"}, "address": {"@type": "PostalAddress", "streetAddress": "100 Universal City Plaza", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "91608-1002", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed today", 5.0, "VIP Tour was wonderful!", "Matthew was our tour guide and he made us all really feel special. We got to see a lot of things most people don't get to see and we were first on all the rides and attractions, too. Breakfast and lunch were both truly amazing!!! Highly recommend this tour!\nShow less"], ["Reviewed yesterday", 3.0, "NOT FOR TODDLERS", "If you have younger children, do not waste your time and money here. There is nothing for them to do! Our little one was just a tad too short for the rides, and they would not have been appropriate for him anyway. Getting from the Upper area to Lower area with the Stroller was a nightmare. You cannot use the elevator for a stroller, just a wheelchair. You have to fold it up and try to navigate 4 escalators with it.\n\nFor the lot tour, you were allowed to take your stroller on the elevator....but it had a line and would have taken us 30+ minutes to use it. I felt sorry for those in wheelchairs.\n\nWe went on a busy day and the lines were terrible. We couldn't justify another $80 for ticket (on top of the $120 we already paid and the $50 to park) to get \"front of the line\" passes. so we waited. and waited.\n\n50 minute wait at Jurassic Park turned into 70 minutes...for a 2 minute ride. It was cool, but nothing I'd wait more than 20 minutes for.\n\nThe Simpson's ride was fun. The Lot Tour was worth the long, winding queue line.\nMy older son loved the Harry Potter area. The Butter Beer was good.\n\nI enjoyed the Simpson's area. Drinking a Duff at Moe's tavern after eating a Ribwich was something you can't do anywhere else.\n\nWe'd never do this again during a busy time. Maybe when it's quieter and leaving the younger child at home.\nShow less"], ["Reviewed yesterday", 4.0, "Great experience. Not the Universal Studios from way back!", "Let me first start by saying, it ain't cheap. It's $100 just to start. It's $25 to park minimum and if you want a \"Fast Pass\", it's another $70! We did the cheap parking and cheap tickets so we could afford gas to get home (only half kidding) but, the experience was worth it. It was very crowded but we had a blast. The experience was nothing like we had the last time we went here decades ago. Food courts are good (expensive) and all over the place. The rides are good. The star tour was both nostalgic and relevant for today's kids. Great 3D experience. Go...at least once.\nShow less"], ["Reviewed yesterday", 5.0, "Great Place", "Took the family here for a fun day and got just that. I highly recommend this park. The entry fee is on par with the other parks in So Cal. If you go during the week you will probably not need to pay extra for the quick entry, line pass. But any weekend and that is essential. The new Harry Potter ride is a blast but all the old favorites still rock.\nShow less"], ["Reviewed yesterday", 4.0, "Expensive but fun.", "Great day with my little girl who loved every minute. Of course it was too much money but if you don't pay you don't play. $25 for the parking is also a joke. However, the Haryy Potter themed rides and castle are fantastic. All the characters were fantastic as to were the shows and rides.. Easy to do everything in a day. Great views as well of the valley and surrounding area.\nShow less"], ["Reviewed 2 days ago", 3.0, "Expensive and not quite great", "After going to both Disney and Universal, I have to say I was a little disappointed in Universal Studios. There was a lot of construction going on (as with Disney) but there was also a lot closed.\n\nI get that we had off peak tickets but it was really quiet and a lot of restaurants etc were not open. The rides were excellent and the lot tour was fantastic, and it was great having wait times of 15 minutes or less. It just didn’t seem to have the magic I expected and we almost seemed like we were part of a zombie apocalypse with so few people being here.\n\nThe crew were excellent and friendly.\nShow less"], ["Reviewed 2 days ago", 5.0, "Great 3D rides", "It's a theme park based on movies. The Mummy, Spiderman, Simpsons and Transformers are my favorites. Take flash card to cover most of the rides as it saves lot of time."], ["Reviewed 2 days ago", 4.0, "A really good (even if it was 40 degrees with the windchill)day", "Even the unseasonably cold weather could not chill the excitement of our Harry Potter fan. Although the wand attraction can definitely be missed (unless you are the one person selected to participate), the rest is a winner. Do not skip the studio tour or any of the shows - all are outstanding. The food will not impress but it is edible and will hold you over until you make your off-site dinner plans to recap the great day. All ages left with a smile.\nShow less"], ["Reviewed 2 days ago", 5.0, "VIP Tour", "Had a great time on this tour. Kevin our tour guide was very informative and was great at getting us into the rides and attractions first. May seem a bit pricey but breakfast and lunch were exceptional. Dispicable me was very funny as was the Simpsons ride 4d seems to be the way things are going at the moment. My second time there in a year but 1st VIP tour. I will be back. Brett from Hastings Point Australia.\nShow less"], ["Reviewed 2 days ago", 5.0, "Amazing!", "We didn’t quite know what to expect really, we didn’t read to much about it but we had visited Universal Studios in Florida many times so we sort of had a good idea of what it would be like. First of all, the views where absolutely amazing and I mean stunning. You could see for miles so it seemed. I really never knew we where so high up. Water World was amazing, be sure to watch that show and the set tour was incredible. We are defiantly going to visit again!\nShow less"], ["Reviewed 2 days ago", 5.0, "Love Love Love", "One of my favourite places to visit. I absolutely loved it here and everything about it. Much better than the Florida one and more interesting. Next time I'm in L.A. I will see be going again!"], ["Reviewed 2 days ago", 5.0, "A must-see in Los Angeles", "This attraction is a must-see if visiting los Angeles. The park is very clean and modern and offers a large number of rides. The studio tour is highly recommended. If you do any rides, do this. Prices are a little high and line ups can be long. Two days would be required if you were dedicated to doing every ride.\nShow less"], ["Reviewed 3 days ago", 5.0, "VIP Experience All The Way", "If you want to have an enjoyable stress free day at Universal I highly suggest the VIP Experience tour. Peter was our guide and he was just the sweetest most pleasant tour guide ever! We enjoyed everything from the VIP Studio tour to all the rides!!! We can’t thank you enough for such a special day!\nShow less"], ["Reviewed 3 days ago", 4.0, "Steve Harvey Show", "Of all the shows in LA, Steve has one of the best. The wait is not long and you laugh and dance the entire time! Steve is a GREAT hosts, had awesome guests and interacts with the audience between commercials! Class Act!"], ["Reviewed 3 days ago", 5.0, "Family Vacation", "Universal Studio, Family fun day, like always was great, Harry Potter amazing attraction, long wait, but worth to wait, worth to go there,"], ["Reviewed 3 days ago", 5.0, "The best time!", "I loved Universal. The studio tour is amazing and the rides are so fun! A two day ticket was only $20 more and definitely worth it!"], ["Reviewed 4 days ago", 5.0, "Harry Potter!", "Fun day at the park with the cousins! We arrived early and went on the Harry Potter ride. Great. We usually go to Disneyland. We had not been to Universal Studios in ages. It was fun. We had a really nice day. Definitely order the \"great feast\" at Three Broomsticks. We 7 adults could have been full just with that. That and the butter beer is the way to go. The shows were entertaining. All the rides were enjoyable.\nShow less"], ["Reviewed 5 days ago", 4.0, "Studio Tour, a must do!", "Wife and I went here to take advantage of yearly pass. The big attraction is obviously Harry Potter. The ride is very cool. The mummy ride and Transformers 3D is also very cool. The hit of the visit for us was the studio tour. Did it once when I was kid, and wow, has it improved! Well worth the 70 min timeframe and 45 min wait. Will go back to do it all again. Just hope they add a roller coaster to the park soon.\nShow less"], ["Reviewed 5 days ago", 5.0, "Film lover recommend", "It's difference in city tour and film effects show which will let you understand the film produce. Especially,if you are film lover that would recommend to come."], ["Reviewed 5 days ago", 2.0, "No health standards maintained on some occassions", "Overall the experience is ok and something different for the kids.\n\nAll the European standards for health and safety are sadly not maintained.\n\nI complained during our studio tour as I was sat on the front row and realised when the car started that I was sat behind the exhaust. The fumes were coming directly at me and it made me really dizzy to the point I had to ask for the van to stop in order for me to change seats and go further back.\n\nI tried to explain that to the team and the customer service after the incident but no one seemed to care.\n\nHow on earth is it ok to put people to sit exactly behind a track exhaust fume?\n\nUnacceptable\nShow less"], ["Reviewed 5 days ago", 5.0, "Entertainment at its best", "Great experience the studio tour is a must do and the Harry Potter ride was awesome as was Jurassic park"], ["Reviewed 5 days ago", 5.0, "Aussies at Universal", "Had a great tijme at Universal Studios. Initially had the standard 1 day tour access - but on arrival was greeted by an upseller - for VIP Access - best thing I did! You had your ouwn small group tour guide - mine was Daniel who was very engaging, lovely, provided descriptions/what to expect of our rides and kept us safe. With VIP access we skipped the lines even ahead of priority access - as such no long queues! I rode all the rides, whereas if on my own I probably wouldn't have done some of them, plus did I say no waiting! We had a VIP lunch and also a VIP tour of the lots too! Well worth it!!\nAwesome experience for me.\nShow less"], ["Reviewed 5 days ago", 4.0, "One of the best visits", "The Universal Studios are well renowned all over the world and a lot of tourists are seen here loitering around."], ["Reviewed 5 days ago", 4.0, "Short LA visit", "This was a short family vacation (only in the area 5 days) and wanted to do the major areas. Universal Studios was one of them. We went on a Thursday and it wasn’t as crowded. The most we waited for a ride was 15 minuets. A big fan of the Simpsons, we ate at the Krusty Burger. Wow, that food is overpriced! But you are paying for the experience. A $15 burger experience. I noticed that you can go in with food and water to the park, which was new to me but maybe they’ve been doing that for some time now. I don’t know if there is a limit, but we walked in with bags of potato chips and 5/6 bottles of water and they didn’t say anything. Save money and bring your own drinks! Caved in and bought the pictures at the end of some of the rides... yep, those were pricey too. You can’t be frugal in this park. Everything is set up for you to spend a ton of money. But all in all, had a great time!\nShow less"], ["Reviewed 6 days ago", 5.0, "Awesome day!", "Arrived at 10am, extremely well organised even with security checks.\nMaps available.. take one your need it.\nHarry Potter ride very popular do it first! Awesome time.\nThe Simpson’s and transformer rides are great but be warned although children reach the height regulation they may not enjoy as they both throw you around a bit in the cars.\nFood expensive we took sandwiches.\nA fabulous day out had by all.\nShow less"], ["Reviewed 6 days ago", 5.0, "Dreamy!!", "One of the most amazing days out ever and it’s not just for children. I would be here all day if I was to list all the amazing things about Universal Studios. All the props and themes are realistic and have that feel good factor. The rides are brilliant with some amazing features which are well worth queuing up for. Ofcourse you cannot miss the studio tour which was probably my favourite part of the park.\nHarry Potter world is surprisingly realistic and the Jurassic Park ride is a must!! I still get goosebumps when I hear the theme tune.\nAs you’d expect food and snacks are expensive as well as souvenirs etc\nIf you are in LA you have to go to Universal Studios!\nShow less"], ["Reviewed 6 days ago", 3.0, "It's alright", "My hubby and I went because it was a place he had been wanting to go to. I for one was a little disappointed. Most, if not all of the rides were roller coasters. I get motion sickness on them, so I was out. The only thing I really enjoyed was the Springfield part for the Simpsons where I bought a Lard Lad's donut. It was so large that I took it back to the place we stayed at and shared it with everyone. It was enough for 8 people to have large pieces. Other than that, I would have rather spent my money at Disneyland.\nShow less"], ["Reviewed 6 days ago", 4.0, "Universal was awsome but never again!", "I like Universal its just FL Universal is alot bigger and is worth your money more other then that Los Angeles was pretty awsome to visit! This is the clostest hot to Universal and worth staying when going to Los Angeles Universal!"], ["Reviewed 6 days ago", 5.0, "AAD LA 18", "Although I have visited Universal Studios earlier in different areas but the one locatedcin LA is remarkable. Tour of the studio was a very unforgettable experience. A lot of activities were available for children like Harry Potter, Jarrusic Park etc. Highly recommended for visitors."], ["Reviewed 6 days ago", 5.0, "We had the best time", "It is better to go on a week day. We did not have to wait in any lines and enjoyed every ride we were on. We did not meet one staff member that would not be happy doing their job. It was so upbeat and friendly. Very grateful for this experience!\nShow less"], ["Reviewed 1 week ago", 5.0, "Universal Studios VIP Experience", "Me, my 15 year old and 13 year old booked the VIP Tour at Universal Studios Hollywood on February 18, 2018 at 10:15 am. Our tour guide was Mike and he was amazing. The day started out with breakfast and relaxing in the VIP lounge. Mike came over and introduced himself to us and explained our day. It was my son's birthday and when I shared that with Mike, he went and got him a Happy Birthday pin with his name on it.\n\nI had only been expecting a semi private tour of the studio itself, but Mike acted as a private concierge/personal assistant throughout the entire park. He was very engaging and knowledgeable about Universal Studios, it's history and movies. He took the group to every ride and walked us up to the very front of every ride, offering to hold bags, cell phones and any other personal items. He even shared with us the best places to sit on the ride for the type of experience one may desire. (Note that a VIP pass trumps the FastPass and you go immediately to the VERY front of the line and get on the ride).\n\nMike took the group to lunch (included as well) and came back to collect the group once lunch was over. He took us on the Studio Tour and again was extremely knowledgeable about the history of the movies that were filmed by Universal Pictures as well as the sets. With this tour we were able to visit the inside of the actual set of Superstore, and get off the shuttle at various locations throughout the Studio. We also were able to visit the inside of the prop warehouse. Mike was very patient with and kind to all of the children in group, answering all questions that were asked. He even walked the group to the restrooms for bathroom breaks.\n\nThe perks of purchasing the Universal Studios VIP Tour were amazing, but I believe our tour guide made it extra special.\nShow less"], ["Reviewed 1 week ago", 5.0, "Truly Great", "Our family visits this attraction almost twice a year and never gets tired of the rides because there is a lot more to see and do. Have a bunch of photos attached from their Halloween Nights to their regular days at Universal. Go and visit this attraction and you won’t regret it. There could be long lines at the ticket booths, so the earlier you go the better.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great day out", "Excellent day trip we brought the express pass and our longest queue time was no more than 15 mins allowing us to go on all the rides and have a leisurely stroll around the movie tour is 70mins long and a really good and interesting experience.\nShow less"], ["Reviewed 1 week ago", 3.0, "Fun Day", "This is more of an amusement park than what I expected and would have been a lot more fun if we would have gone on some rides. The lines were very long even though we arrived at opening time. We did the back lot tour and also the Water World show. It was a beautiful day and we did enjoy walking through the park, seeing the sights and people watching. If I were to go with grandchildren I would definitely buy the skip-the-line tickets.\nShow less"], ["Reviewed 1 week ago", 5.0, "More than Harry Potter", "We went because our youngest is a huge Harry Potter fan. While we spent about 2 hours inside the Harry Potter experience, we greatly enjoyed the shows and other attractions. I highly recommend the chance to meet the animal stars. What a great treat. The kids loved the special effects show and we all loved the Waterworld show. The most fun-filled/terrorizing experience was definitely The Walking Dead experience. Definitely not for the weak at heart.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very entertaining", "With the addition of Harry Potter world, Universal has a great variety of attractions. I bought the 'gold' annual pass from Costco in December, and my wife and I have been 3 times- along with our grandsons. This pass has very few blackout dates and includes parking before 5 pm (very useful since it costs $25). I would suggest early arrival in order to avoid waiting in long lines at security and for the rides. The pass pays for itself with two visits, and would be very useful for a 2-3 day visit so that you can pace yourself by planning ahead.\nShow less"], ["Reviewed 1 week ago", 5.0, "VIP Experience was FANTASTIC and WORTH EVERY PENNY!", "Universal Studios employees have excellent customer service - whether they knew we were VIP ticket holders or not. From the security guard to a greeter to the VIP experience employees to the VIP tour guide to every single person we interacted with at Universal Studios, they were all amazing at customer service. Two adults were traveling with two teenage girls, and I don't know if this was intentional on the VIP check in employee's part or not, but we were placed in a VIP group with two other families that also had two teenage girls in each family. The six girls quickly became new friends, and our tour was excellent because of the dynamic that we had with similar ages. Tim H. was our VIP guide, and you should request him when you do the VIP tour! He was excellent!! Very attentive to each person's needs, explained each ride before we went on it, and the details and information he gave us throughout the entire trip was so interesting. VIP tickets are great if you want to ride on many rides: while the parents in our group went on the Mummy ride once, the girls ended up going on it six more times in a row together! They did this in less than a hour, as they went to the front of the line each time due to the VIP tickets. For them, the VIP tickets were about how many times they could ride a ride. For the us, it was about the things we learned about movies, the movie / tv making process, not standing in line and fighting for seats at shows, as the VIP tour has reserved seats, and not having to navigate the park map ourselves, and yes, not having to wait in line for rides. Tim was a great guide, and we got to every ride and show during our day! Lunch was surprisingly good as well. Items were labeled vegetarian, but not labeled gluten free. That would be an improvement that they could make. When asked about gluten free items, the server did not know, so those in our group who are gluten free stuck to things that were guaranteed to be gluten free (meat, salad without dressing, seafood, veggies, fruit, etc). The meal was still excellent. Tim had ponchos for us when we rode the Jurassic Park ride, and he had great facts about how they built that ride around a tree that is protected by California that was in the middle of where the ride was going. The Harry Potter land was amazing, and wow, that HP ride is a far cry form the roller coasters we grew up on. Do note that if you are sensitive in any way to motion simulator rides, many of the rides at Universal Studios are just that in some variation. Tim H was great about telling us details of each ride before we went on, so that each person could decide if they were going on it or not. Great day filled with great experiences and an excellent tour guide! I would never go to Universal Studios without a VIP pass! Worth every penny!\nShow less"], ["Reviewed 1 week ago", 5.0, "Do it once, at least....", "I'm not a Disney person, nor a theme park person, but I was in LA and thought I should do it. We had a VIP experience, it was worth every penny!! The price for two was around £520, we had a continental breakfast laid on, then we stopped for lunch. I'm very pleased to say that they catered for Vegans and GF at both sittings. The park itself is vast, we managed to do all of the rides, and a few extra ones only available with the VIP ticket. If you can stretch the budget, please do the VIP, I am not one to be 'sold' something when I can get it cheaper, but for the difference in price, I would actually do this again, when in CA or FL. Queue jumping with a guide is brilliant, you don't feel bad as you have paid for the privilege. The Harry Potter ride is amazing, I did feel a bit faint, but got over it. If you can do 'Tower of Terror' at Orlando you can pretty much do any ride at California's Universal and Parks. Have fun... or if you're like me, have a valium!\nShow less"], ["Reviewed 1 week ago", 2.0, "Not Worth the Money", "Found Universal Studios Hollywood to be way overpriced and disappointing. The way staff rounded people into the security checks yelling, “move along, welcome” was everything other than welcoming. Too much construction going on, too much money for food, drinks and souvenirs coupled with hohum rides and shows adds to a very expensive outing for a family. Charging $25 to park and, if you’re a California resident, $98 per person, is hardly worth it. Suggestion: drive 30 miles south and pay almost the same and go to Disneyland.\nShow less"], ["Reviewed 1 week ago", 4.0, "Is a place to visit once", "The place is very crowded, at all attractions the lines during the day start from 100 minutes wait time. the restaurant are not serving such good food. is a good place for kids and teenagers."], ["Reviewed 1 week ago", 5.0, "Excellent day of family fun", "Interesting presentations, rides, experiences and tasty food. Don't miss the voodoo donuts. Comfortably explored in a day."], ["Reviewed 1 week ago", 5.0, "VIP Experience Exclusive Access ticket (1 day) welll worth the money!", "The VIP Experience Exclusive Access ticket (1 day) may seem expensive, but it is well worth the money. Guided tour and expedited access to major rides*, included gourmet lunch in a great place to rest while dining on great food. Staff are friendly and always helpful; clean environment. Wonderful family (all three adults) activity [option not listed below]; does include significant walking, but *limited waiting in lines. On our next visit (TBD), we will again purchase VIP Experience tickets and Front Gate parking; both well worth the investment/$.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fantastic Day", "Did the VIP tour and had a great time with our guide Lary. Access all areas and priority entry to all rides. Welcome area was great in Guest Relations and then lunch at Jardine de Paris was outstanding. My wife has food allergies and they were so helpful. Thankyou. Absolutely a great way to visit. Would do it again if we ever have the chance.\nShow less"], ["Reviewed 1 week ago", 5.0, "Getaway Trip", "Took the wife for a Valentines weekend getaway. We have annual passes but didn’t stay all day figured we would hangout there for a few hours. They had a few places in the park where they were doing Chinese New Year celebrations which was cool. Might be back one more time before our passes expire\nShow less"], ["Reviewed 1 week ago", 4.0, "Best part- Studio Tour!- Must see", "This park is not really about the rides. Almost every ride is a glorified 3D movie! For $100+ per ticket, I think it's a lot of money.\n\nWe had fun doing the Harry Potter stuff. The wands work here better than in Orlando. I think they fixed the technology. If you are going to do the Owl Post bring your own stamps and postcard. They only sell stamps by the page and postcards by the packet. It was going to be $25+ to just get a letter sent. Definitely do the single rider line for the Harry Potter and the Forbidden Journey. It will save a ton of time.\n\nThe best part is the Studio tour! I love seeing the sets and movie magic.\nShow less"], ["Reviewed 1 week ago", 4.0, "Harry Potter overload", "Visited with my wife and two teenage kids. It was my daughters birthday and guest services gave her a birthday badge with her name on. As a result we skipped all the ride queues as the staff waved us down the fast pass lanes. Lots of 3D rides very well done. Mummy ride and other rollercoasters were fast. the walking dead had actors dressed as Zombies jumping out on you and took my 16 year old son by complete surprise. He leaped two feet in the air! Harry Potter hogmeade and castle done well. Lots of mechandise - wands, owls, robes, scarf, hats, chocolate frogs, snow globes, key rings, mugs etc. A good fun day.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fun family day", "Family of 4, older teenagers, we all had a great fun family day out. We didn't have to wait too long for any of the rides. Found staff friendly. Loved the tour of the studios."], ["Reviewed 1 week ago", 4.0, "Fun, small, terrible food", "This park was a lot of fun, especially Harry Potter. It's very small, easily done in one to two days. Got in as many rides in the first and last hours as we did the rest of the day combined. Food options are terrible. I don't have high expectations for food at a theme park, but they are exceptionally bad here. Good snacks, bad meals.\nShow less"], ["Reviewed 1 week ago", 3.0, "Universal Studios Hollywood 100 Universal City Plaza, Los Angeles, CA 91608-1002", "To see and go on everything I would recommend spending 2 days at the park. The Harry Potter part of the park is the best thing about it. Even though the one in Florida is better. And I am not even a Harry Potter fan. The movie studio tour needs to be updated. Some of the things I saw there were the same things I saw over 20 years ago. As usual everything is very pricey but that is expected at a tourist attraction.\nShow less"], ["Reviewed 1 week ago", 5.0, "VIP Tickets - THE ONLY WAY I WOULD EVER GO TO THIS PARK", "I hate lines and I'm pretty neutral on rides. Therefore the only way I would ever go to a theme park is with a VIP ticket. I went on Saturday Feb 17 (Holiday weekend) with another couple and a 8yr old girl. I have done this at LegoLand and now Universal. For $350 per person it was well worth it. I cant imagine paying $100 per person to stand in line for hours and hours all day long.\n\nDespite others suggesting that you should start your tour early I actually like what we did better. Also Despite others I think this is great for young children if you do rides first and tour later like we did. The last thing a little kid wants to do is get to the park and take a tour for 2 hours. But if you go early and ride rides while its less crowded and you can skip every line then use the tour as your nice break and ride rides after its great.\n\nWe arrived at 8:00am for early entry, Valet parking was easy. Walked right in and checked in with VIP desk. Had some tea and coffee, used the bathrooms and then set out at 8:30am for Harry potter land. The park was really empty. The magic wand making attraction is the only thing with no VIP line but at 8:30 its only a 20 minute wait and I think later in the day its hours long. We had no wait for the roller coaster, then no wait for the harry potter ride. Then we rode Simpsons, Despicable me, walked around a bit and headed back to the lounge for some food and to meet the tour at 11:15am.\n\nThe Tour of the backlot was a nice break from rides. It was awesome to be able to see the stuff up close and get out and walk around. At the end the best part was not having to navigate the long lines to get back into the park. The drive you to the lower lot back entrance and you sneak back in right next to Jurasic park ride and jump right on. we then rode Transformers, a roller coaster and then went to our late lunch from 2:30-3:30.\n\nLunch was really good quality, plenty of Gluten free options etc. Its quite and not crowded, nice private bathrooms and a little escape from the Maddness of the park. After lunch we saw Waterworld, then went to Walking dead. The last part of the tour was going to be harry potter so we left the group and went to Animal Actors instead.\n\nI would not recommend going to park on a busy day without a VIP ticket. This was sooo wroth it and the only way I would ever go. The VIP ticket at Legoland cost $500 (you get some extras that Universal does not do) but this makes $350 look like a great deal and I think it was value for money.\nShow less"], ["Reviewed 1 week ago", 3.0, "Too crowded", "My second time in here and I have to admit that it was better the first time. Make sure to buy the tickets online as it’s cheaper. Lines are endless, especially Harry Potter Line, 2.5 h and if you are not a fan don’t bother, it was kinda boring. Most of the rides are similar, and as I mentioned if you been once leave it at that unless you are visiting with your children, not suited for young ones.\nShow less"], ["Reviewed 1 week ago", 5.0, "Excellent for movie lovers", "The whole tour was excellent, others wrote and we followed their lead to do the lot tour first. That is a must or you will be waiting in line forever. The better food is in Harry potter world so go there. Don't forget the lower lot, that was fun and had the Mummy ride and Transformer ride. Both quite fun.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fun place!", "We enjoyed our visit to Universal Studios. If you plan to go, I would highly recommend paying extra for the front of the line pass. We had limited time and we were just able to zip right up front with hardly any wait time whatsoever. The attractions were fun to go to and everyone enjoyed the day.\nShow less"], ["Reviewed 1 week ago", 1.0, "Affront to foreigners", "My wife and I were hosting friends from China. They are a family of four with little language skills. We purchased tickets for them on universal studios website and printed out the tickets. It clearly shows on the tickets my name, which is of European descent, and their name. They called us from the gate saying that their tickets had been blocked. I called my credit card company and they told me that the charge had been approved and no time was there any issue. After two hours and calls to their customer service, copies of my ID and my credit card; they were allowed to pass in. No explanation was given and I suspect the reason is racist is nature. Not only was this extremely embarrassing and a loss of time, we were forced to expose a credit card. We feel that universals business practices are wrong and we caution others to be careful. There are many attractions in Southern California for vacationers; choose another.\nShow less"], ["Reviewed 1 week ago", 4.0, "improved", "Universal Studios Hollywood has improved. it might not have as much land as Universal Studios Orlando but its still a good park. Lots of the fans flock to the Warner Bros Studio property, Henry Potter and his male witchcraft. Flight of the Hippogriff and Fast Furious wow\nShow less"], ["Reviewed 1 week ago", 5.0, "Universally a must go for all !!!", "Universal studios was the last stop of our 3 day California Park visits (Disneyland and Disney Adventure, Seaworld San Diego) , and it was the best of all! The atmosphere was great , rides, food , people all awesome ! Some tips for this park, pls buy the express lane pass to save waiting time , visit Harry Potter first before other lands , and pls try the Butter Beer ....\nAll in all , an unforgettable and fun experience in the entertainment capital of the world!\nShow less"], ["Reviewed 1 week ago", 5.0, "LOVE", "I will forever love Universal Studios. This place just reminds me of my childhood and all the wonderful memories."], ["Reviewed 1 week ago", 5.0, "2 fun filled days", "We had a 2 day pass and we felt it was the perfect amount of time at Universal Studios.\n\nWe traveled by public transport. The train/shuttle bus was so easy and affordable.\n\n1 day would've been ok, but having 2 days meant we didn't miss anything and could revisit the attractions we loved the most.\n\nThe Harry Potter section was crowded in the morning so we went in the afternoon and found the queues were almost non existent.\n\nWe didn't pay extra for the express tickets and we're glad we didn't as most of the lines move quickly. If we were only there for 1 day during a peak time, it may have been a good option though.\n\nFood and drinks were expensive. But we did enjoy our lunches in the Harry Potter area.\n\nCheck the show times. WaterWorld was a must see. The Special Effects show was also fun, especially given that we ended up in the show.\n\nTwo very happy days had by all. Just remember to wear comfortable shoes.\nShow less"], ["Reviewed 1 week ago", 5.0, "EVE 2017", "We spent the entire day at Universal and had an amazing time. The Harry Potter World light show was awesome!"], ["Reviewed 1 week ago", 4.0, "UStudios was a blast", "I'm a Disney girl through and through and have only been to Universal Studios once in the 1980's. This trip, the Hubs and I did one day @ Disneyland, skipped CA Adventures, and went to UStudios instead. I am so glad we did!\n\nWe bought our tickets online for our convenience, and later realized that gave us entrance to the park for Harry Potter an hour earlier than other guests. For free. We rode 3 rides and explored the main reason we went (Harry Potter) with virtually no wait times. It was magical.\n\nThe free app was amazing, too. You could create an itinerary and have alerts when your shows and rides had short waits. It even had a parking reminder area to direct you back to the car.\n\nIt didn't take long to realize UStudios was every bit as good as Disneyland. The Transformer ride was a total thrill and so was The Fast and the Furious and King Kong and Jurassic Park - although we loved Harry Potter most of all. Employees were super helpful, it was spotlessly clean and just as imaginative as Disneyland, there were interactive parts wherever you looked, and the park moved people very well. All in all a wonderful day!\nShow less"], ["Reviewed 1 week ago", 5.0, "I love Universal Studios!", "Even though I know this place like the palm of my hand now, I still have as much fun as I did the very first time I visited it. I really love this place, The Wizarding World of Harry Potter, Jurassic Park and Springfield are my favorite spots in here! I recommend you snatch a Lard Lad Doughnut while you’re there :)\nShow less"], ["Reviewed 1 week ago", 5.0, "I Enjoy the Rides", "The rides are a little big for most young kids. I love rollercoasters! So this place is great. The Harry Potter area is top notch. The rides are not the Orlando level, but very good."], ["Reviewed 1 week ago", 4.0, "VIP experience worth the cost for us", "Universal Studios Hollywood VIP experience begins with a private lobby once you’ve cleared security. The small group is separate from the general public for breakfast, lunch, a private tram for the backlot, private seats at the live shows, and rides which saves a ton of time and effort if you only have one day at the park.\n\nWe were 7 in our group with a private tour guide. The small size meant all of our needs and questions were addressed.\n\nWe enjoyed the jump the front of line passes and being able to walk around the backlots, sound stages, and prop department.\n\nOur guide, Tori, was great. She kept us entertained, knew which rides were important to the group, and made the entire day flawless. We were able to skip one ride to quickly jump on another without issue. We just made arrangements to meet up with the group afterwards.\n\nIf you are short on time and not on a budget, then check into the VIP experience. We thoroughly enjoyed.\nShow less"], ["Reviewed 1 week ago", 2.0, "A shot and a big miss", "I had to think long and hard on how to review Universal Studios Hollywood. The rides were great, with Harry Potter and the Forbidden Journey one of the best. We, a family of 8 attended Universal on a Tuesday. but at $120.00 a person for a park that was open from 10 am to 5 pm seemed high. Not to mention $13.00 for a glass of beer. Our low point of our visit was at the Special Effects Show. Some of our group is deaf, so we had arranged to sit up front to view the closed captioning of the show.\nHere is where things went very very wrong The area for the closed captioning is up front and to the left of the main stage. While waiting for the show to start, you are showed a Universal promo tape Then previews of upcoming movies, these were not closed captioned, and should have been. Once the main show started, the closed captioning screen was on the floor straight in front of you. This was the first problem, to read the text you have to look straight ahead, but the action is 90 degrees to your left. This set up makes it almost impossible to watch the show and read the text. Then the captioning would stop while clearly there was action and words being spoken on the stage. Then the captioning stopped matching the show. In short the event was not enjoyable at all. The whole set up needs to be reworked. Have an executive from Universal sit in front of the screen wearing ear muffs and see how it works for them, reading and trying to watch the show. The screen should be in the center of the stage so that you can read then move your eyes up a bit to watch the action, the performers should stick to their script so that their actions match the captioning.The other rides should be closed captioned some how so that everyone can enjoy the rides equally. So our time at the park was disappointing and we are rethinking attending again. We have shared our views with the deaf community, so many others will be reconsidering attending Universal Hollywood.\nShow less"], ["Reviewed 1 week ago", 4.0, "Awesome medical staff but Beware of ollivanders", "My sister fell in The Walking Dead and got hurt. The staff in the walking dead and in the first aid were amazing, professional, helpful and friendly! They deserve five stars!! Thank you all!\n\nOn the other hand, even though Ollivanders says, “a wand chooses a wizard” in the description beware of what this means. My daughter was chosen from the audience, they did a cool show of her practicing with different wands, then they found the perfect wand to fit her. When the show was over they asked, in front of her, if we wanted to but the wand which was $50. Then our son wanted one, too. Although you can use it in the park once you leave, it’s just a stick. We did not plan $100 bucks for junk. It is difficult to say no after she was matched up to a wand by a wizard. Had we known we would have skipped that stop.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great Day Out", "Omg. Such a fun day. A must visit. Even if you have to drive to get there. Drove two and a half hours and it was so worth it. Had the butter beer at Harry Potter World. Delicious. The Mummy was an awesome ride. Be prepared for a shock. Lots of cute characters and fun stars to take pictures with too. There is a cart with Shrek and Donkey. Absolutely hilarious. And the Waterworld show was really really good. A must see.\nShow less"], ["Reviewed 1 week ago", 4.0, "Travel", "It was a great place for kids and the whole family. Though theres nothing much changes from the last 5yrs i been there aside from the Grinch which closed due to open only during Xmas even the bus tour for the whole studio. Lucky the line up is not that much coz it was an ordinary day. Entrance fee is ok coz we bought the LA city pack tour. The transformer is great as always though Megatron was still mean till today. Even the universal city walk is the same. But still we had fun to celebrate my sister bday coz it was her and kids first visit plus of course the greatest doughnut ever from the Simpson”s souvenir store..\nShow less"], ["Reviewed 1 week ago", 5.0, "Universal Studios Hollywood", "I have the gold season pass to Universal Studios and I use it consistently every month. I love the atmosphere here, the music always makes me feel good and you can tell the employees love their job. They are always so friendly and welcoming and very helpful. My favorite attraction at the park is by far Hogsmede and everything it has to offer. I come here by myself just to have lunch at the 3 broomsticks on occasion. I love getting into character and wearing my house colors because everyone working is so interactive it truly makes it a special experience. Another great thing about universal is they always have characters walking around and usually with no wait to take a picture or talk with. I also love when everyone lines up at closing time and waves goodbye. Just altogether a great amusement park.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing", "We were blown away by the technology used to make some of the 4D rides. We had such a great experience. The tour was great definitely recommend doing this 1st then u have time to explore the park. Wasn't busy so seems as thought Feb (We went on 13th - uk half term) is a good time to visit. Unforgettable day!\nShow less"], ["Reviewed 1 week ago", 5.0, "Highlight to our first trip to LA...best VIP experience ever", "The VIP experience was probably the best choice we made so far, Chris our tour guide was just brilliant. He was so accommodating and trying to make sure we visited everything in one day. Skipping the queue helped saving a lot of time. The breakfast and buffet lunch were amazing ...great selection of food and drinks....lovely atmosphere and very clean. We met great bunch of people in our group and that just made it more enjoyable. The studio tour was just mind blowing and managed to keep 11&13 years old interested the whole time. We would definitely do it again and will request Chris to be our tour guide too.\nShow less"], ["Reviewed 1 week ago", 5.0, "Amazing Theme Park", "I hadn't been to Universal Studios in 30 years and I was really impressed with the quality of the 3-D rides. I love roller coasters and was worried about going to a theme park with so few actual coasters, thankfully the 3-D rides they have are more exciting than a lot of roller coasters anyway! The Harry Potter ride was like nothing we had ever been on before and the studio tour blew my mind at the quality of the 3-D experience on such a large scale.\n\nWe went to the park on a day they were only open from 10-6:00 and were able to do all 90% of the rides and one show. We did spend a lot of time in Harry Potter World, but 8 hours still really wasn't enough time to enjoy everything the park has to offer. So we will definitely be back to revisit our favorite rides and see the remaining attractions we missed.\nShow less"], ["Reviewed 1 week ago", 4.0, "A must to visit", "When in Los Angeles you must visit the Universal studios for a tour. It is worth the premium and jump the queues"], ["Reviewed 1 week ago", 4.0, "Best Thing is the Studio Tour!", "Universals was a great park but the must must MUST do is the Studio Tour. I highly recommend this. It takes around an hour but was worth it. When we went it was quiet so we didn't have many queues which was great. Nice restaurants that were very reasonably priced. There were some great shows - the special effects was the best one as well as the water show. When we went the Jurassic Park ride was being refurbished so that was unfortunate but still recommend visiting the park.\nShow less"], ["Reviewed 1 week ago", 4.0, "overpriced so long queues", "Fantastic experience if you are coming from Europe. We may not have another chance visiting this place so we were prepared to pay lots of money. USD 100 per person was too much money if you consider that you spend most of your time waiting in the queues. Harry Potter and the tour in the studios were the best amusement. It is best to have a plan and know what to visit and don't lose time stopping in every little\n\"cute\" shop. Every shop means spending money to eat or buy things. Another great tip for couples or friends is to wait in the \"Single riders\" queues. They are much quicker and we happened to get in the same compartment with my friend. If you can afford USD 190 per person get the \"Express ticket\" which is quicker than the basic ticket. But again why spending your valuable money just to save 2 hours in total? Remember that everything is so expensive in there. Even the parking. Costs USD 25.\nShow less"], ["Reviewed 1 week ago", 5.0, "Go for the VIP experience", "With their unique VIP experience, even Fastpass seems so 2017.\n\nDirections: Take metro red line to Universal City Walk station. At the station, exit towards Lankershim Blvd and you’ll see this big black sign directing you to go left and as you exit from the escalators, turn right immediately and you’ll see the Pedestrian Bridge that will bring you across the street to where the free Universal shuttle is.\n\nIt’s an open buggy that brings you right to Universal Studios itself in just about 5 mins, free of charge.\n\nHarry Potter world is of course a highlight and totally worth it. The Butter Beer is a must try, especially the frozen version. If you can afford it, go for the VIP experience which is such a pampering experience that gives you access to back of the house tours, lunch in comfort and style and best seats in the house at shows inside the theme park. Plus unlimited express entry for all rides.\n\nThe best part is everything is planned out for you so you just have to follow your guide and don't have to worry about missing out on the shows. There will still be time at the end of the VIP tour for you to move around on your end and take pictures with characters. I guarantee you it'll be an unforgettable experience!\nShow less"], ["Reviewed 1 week ago", 5.0, "A must in LA", "I was thinking this place is for children only. What a mistake! Me and my spent a day there and couldn’t get enough of this place. We would absolutely recommend this place.\n\nThe Harry Potter stop is the best.\nIt is also very worth it to wait for the water show. Dazzling.\nShow less"], ["Reviewed 1 week ago", 5.0, "Loved it", "Our party of six adults loved it. Some liked it better than Disney. Take the Studio Tour early when other early visitors are heading for Harry Potter. Very informative and entertaining. Took in all three shows, Special Effects, Waterworld, and Animal Actors and would recommend all.\nI can’t really handle much for rides, but I think in hindsight I could have handled the Jurassic Park ride. But if you have any trouble with motion sickness or rough rides, don’t do the Harry Potter ride!! Half of my party wished they hadn’t. REALLY wished they hadn’t!\nYou can take bottled water and snacks, including fruit, with you.\nShow less"], ["Reviewed 1 week ago", 5.0, "Universal studios VIP", "My son an I did the VIP tour, best day of my sons life, everything was fantastic , non queuing , behind the scenes, personal guide, small group, attractions and the lunch and breakfast provided was devine. The Harry Potter section is simply amazing, I’m no HP fan or anything, however the buildings are brilliant. Definitely worth the extra money to do the VIP\nShow less"], ["Reviewed 1 week ago", 3.0, "Good for one trip", "We were in LA for a couple of days,and one day was for Universal. Having said that, one came away a little disappointed.Pros:Wide set of rides, to engage all age groups.If you start very early,plan the activities, and have a VIP ticket, maybe you can enjoy more rides.Cons : Everything is expensive. If you do not have the VIP pass,don't even go.You will spend more time standing in the queues than the rides itself. Avoid holidays..the place is overcrowded,and you are shoulder to shoulder Shudder to think what will happen if there's an emergency.Food is OVER priced,and cannot think of any reason other than rip off of customers who have no other choice.\nShow less"], ["Reviewed 1 week ago", 5.0, "Trip to Universal Studios", "Universal Studios in Hollywood, California is my favorite theme park! Not only is it filled with awesome attractions, but their guest relations department is awesome. They have always accommodated my group and I with a time return pass due to health reasons."], ["Reviewed 1 week ago", 5.0, "Such a great day!", "Not in a million years would I expect it to be as good as it was. The Harry Potter exhibit was easily one of my favourites, along with the studio tour. Would go back over and over!"], ["Reviewed 1 week ago", 5.0, "Splendid day!", "My mother and I had such an AWESOME time at Universal Studios Hollywood. My favourite obviously being The Wizarding World of Harry Potter and almost every single ride! Worth the money we paid and the queues to get into the rides moved fairly quickly, considering they are a world-renowned theme park you have to expect queues but it is totally worth the wait!\nShow less"], ["Reviewed 1 week ago", 3.0, "Enjoyed parts - but the Animal Actors show made us feel uncomfortable", "I visited Universal Studios with my sister on a Friday in February. We paid $109 each by booking our ticket online the evening before, which meant we could get into the park an hour earlier at 9am. When we arrived we headed straight to the Harry Potter section, which was pretty much empty! I’m not a big rides fan but my sister went on both the Forbidden Journey and Flight of the Hippogriff. The Hippogriff ride lasts 30 seconds if that and my sister’s view was that she wouldn’t have queued for longer than 5 minutes for it. But as the day went on, the queue was around 90 minutes - for a very short ride!! And this isn’t even during peak time.\n\nHowever the Forbidden Journey ride was, in my sister’s opinion, good.\n\nWe went to the Studio tour and only waited about 15 mins, as it was still early. We thought the ride was fantastic, especially the King Kong and Fast and the Furious 3D parts! The ride was about an hour long and would be worth waiting in line for an hour for.\n\nWe went to the Waterworld show and we also thought that was fantastic - the effects were brilliant! Be prepared to get wet in the first few rows!\n\nThe studio tour and Waterworld are the reasons I’m giving this a three-star review. Sadly Universal Studios loses stars for being very expensive for what it is - once you’re in the Park be prepared to spend more on food, drinks, souvenirs etc. Even though I wasn’t going on many rides, I was shocked that queues throughout the day for most rides were 90 mins plus. At one point the Forbidden Journey ride wait was three hours!\n\nAnother reason why I’m not giving more stars is because of its Animal Actors show. We are animal-lovers and it made us feel very, very uncomfortable seeing some of the animals which were brought out in front of a loud audience. A raccoon, pig, owls and an arctic fox were brought out for “cameo” roles and it felt very pointless to me to put animals through the stress of going on stage for two seconds. Universal Studios may respond to this by saying the animals are used to this, but I don’t feel it is right to have wild animals on show like this. Especially the arctic fox! At the end loads of people were going up to pet the arctic fox and it looked a bit stressed out.\n\nAlso at one point a parrot was made to fly towards a very strong fan to recreate a “flying” scene and it looked really obvious that the parrot was struggling.\n\nSorry to say that the Animal Actors show didn’t fill me with joy. I really hope all of the animals are treated well behind the scenes, and please Universal, please consider whether it is really worth putting the “wild” animals through any unnecessary stress with these performances.\nShow less"], ["Reviewed 1 week ago", 2.0, "Terrible Experience made no better by complaining to management", "Visited the park today with friends and family. After a very extended wait (see images) the two rides were declared broken. Staff stressed and very snappy at customers when asking for help!\n\nSent a complaint email, and was met by customer relations manager who gave us two tickets and said your family can now attend two attractions as priority. Attended a ride as planned (the Mummy) and staff member turned away the entire family with exception to two people. Then confiscated the ticket! Thanks Customer Relations. Nothing better than a crying child in a theme park!\n\nMost embarrassing and utterly shocking experience from Universal Staff!\n\nWe flew in especially for the experience and left the park early very very disappointed.\n\nWe did email back the customer service rep, but he was clearly too busy to respond again.\n\nShocking and humiliating experience for both me and my family. #SHOCKINGUNIVERSALSTUDIOS\n\nWon’t allow us to share the 3 hour que shots from the mobile app! Need I paint a different picture my friends?\nShow less"], ["Reviewed 1 week ago", 5.0, "Brilliant park", "Enjoy our visit to the park very good services for people with disabilities food good staff very helpful"], ["Reviewed 1 week ago", 5.0, "An amazing day out!", "Loved Universal; the rides were fantastic and really enjoyed the back-lots set tour- it was really interesting and informative; great if you are a film and TV buff. I liked the fact that there weren't too many rides; it made the day less stressful. I recommend the Hogwarts castle ride and if you are a first-timer; head straight for the tour.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Welcome to Universal Santa Monica!", "Walking Tours Crime Scenes of Homes of The Stars Universal Santa Monica 2018. UM and Universal Movement (Dance Troupe) for example is owned and operated by Karen Lynn Hall, that is me."], ["Reviewed 2 weeks ago", 5.0, "Incredible day", "From the Harry Potter World in the upper level to the Transformer ride in the lower lot the experience was enthralling. You need to get your tickets on line not at the park so you can avail yourself of the hour early entrance (well worth it). The Harry Potter Forbidden Journey ride in 3-D was exciting even though you didn't take an actual roller coaster ride (there were no free fall moments or great centrifugal turns), but you thought there was. You went on a ride that travelled within a relatively small area but the visuals and seat rocking up down and sideways made you thing you were truly on that journey with the effects playing tricks with your mind. Because we entered early there was no line to get in which I'm told could be as much as one hour wait (we went twice). The entrance walk to even get to the ride took us about 5 minutes. The Flight of the Hippogriff roller coast ride had no fall (which I'm thankful for) but some exciting turns and only took less than a minute. Definitely go into Ollivanders for a wand show. The other rides in the upper lot were all mind bending in 3-D using the same effect to achieve your participation within the experience. Even the shows were first rate. The Universal tour (one hour) was a must giving you a taste of the goings on of movie making in the back lot. On the lower lot the Trans Formers ride in 3-D was equally exciting. There were two other rides The Jurassic Park Ride (closed that day) and The Mummy ride (open but a real roller coaster 45mph not gone on). We had a great time visiting all the shops and outside entertainment and by 3:30 were exhausted. We are two adults with no children and we had a great time.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great day out", "Very good day out and was good to visit. There is a great atmosphere and overall the shows and different attractions were very interesting and entertaining. The only reason not for a 5* is because there were a few too many virtual rides, like transformers and Simpsons, whereas I prefer actual rollercoasters. There is one very good rollercoaster in the Mummy. The donuts were also fantastic and HUGE so I would highly recommend trying one.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Go for the Jimmy Fallon's studio tour", "If you have been to Orlando, this place is not as big as that one. However, it still has all the essential elements of Universal Studios. Wonderful rides. Great food around the area. I really enjoyed the Harry Potter area. They did a great job in making it so similar to the movies. If you only have time for one ride, go for the studio tour. The queue might be quite long, but it's definitely worth the wait. A nice place to visit together with your family or friends.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Worth the money", "We went in February and the weather was ideal. Queues were not happening, 20 mins was the most we had to wait.loved every minute of this day. My granddaughter loved it and enjoyed all the rides and the studio tour was great. Every part was great fun and we went on every ride. Thought the park shut at 10 pm but rides stopped at 6pm which was a shame.\nFood places were of a high standard and everywhere was clean.\nStaff were happy and helpful.\nDefinitely worth the money.booked online and saved 30 dollars\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing!!", "Just returned from a fabulous two days with our grandsons (ages 9 and 10). After a lot of back and forth we went with the VIP experience and found it to be worth every penny. The breakfast was varied and delicious and Donna, our guide for the day found and greeted us. From that point on we were with Donna through the day. She expertly shepherded us through all the main attractions as well as the extraordinarily well done shows in a timely fashion. Lunch was a gourmet buffet that included all kinds of food for all kinds of eating needs - vegetarian, hot, cold, salads fish (including sushi and king crab claws). Allergy questions gladly answered. After lunch we did the private tour of the backlot which was awesome and included 3 experiences while we stayed in the trolley similar to rides (Fast and Furious, a subway station that has an earthquake, King Kong). These parts of the tour were good for keeping the boys attention. All in all Donna was with us until about 4:00pm and then we were free to explore the rest of the park and go back to redo any rides with unlimited express access and to take in the “do not miss it” Waterworld show. Our family ended up staying until closing time at 7:00. It was a hugely successful and exhausting day. Tip for travelers with elementary school ages kids coming to the park and considering the VIP experience: one day was really not enough time to thoroughly do the park. We ended up coming back for another day to spend time at Minion Mayhem and the Simpson’s which had been bypassed by the VIP tour. It also enabled us to have lunch at Three Broomsticks eat fish and chips and sample the fantastic butter beer. In summary - do not hesitate to visit Universal. We loved it!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "My experimence at this attraction", "It was a wonderful sight for everyone in the family ,there were little kid rides for my little sister ,and gigantic rides that for me ,were awesome!"], ["Reviewed 2 weeks ago", 5.0, "Amazing one day visit", "Amazing Hollywood like atmosphere. Lots of fun. Work of details is impressive. No waiting in line as it was a Tuesday morning. Food is ok with lots of choice and fun theme decor"], ["Reviewed 2 weeks ago", 3.0, "Love amusement parks .... but couldn't do many rides", "Although we loved our experience at Universal .... mainly Wizard World and the backlot tour .... we were disappointed that we couldn't do many rides as most are 3D or virtual reality. Unfortunately, my family suffers from motion sickness so we couldn't do much. I even asked one attendant who was amazing and she took us into the control room to show us how much movement the ride had and when we couldn't ride it, she gave us fastpasses for the rest of the day (Thanks Mary!) she made our day!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun for families", "We have visited the park a few times and you always see something different than the time before. If you appreciate the movie business then this is the place to be! You have to go at least once!"], ["Reviewed 2 weeks ago", 4.0, "Another Universal Studio Trip", "Well all is still well at Universal Studio in Hollywood, but beware the new security lines keep you out away from the Universal Globe, and when you leave the park it is a long way around to get to City Walk, I think an access to the left for City Walk would be nice. The Wizarding World of Harry Potter was ok, but the rides......well not comfortable for one and not well thought out. The Three Broomsticks restaurant was very cool, a bit spendy for the food, but worth doing once for the experience. The frozen butter beer was the best choice (butterscotch).\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun time", "Our family, all above the age of 19, visited especially to see the Harry Potter World. It was fun and the Butterbeer Slushie was great. My DD (20 yr old) was able to use her wand she got from Orlando. I was picked for the wand ceremony at Olivander’s which was fun. The Orlando park has more to offer in regards to Harry Potter, but now we can say we’ve visited both. The other rides, tram tour and the Animal Actors Stage were all wonderful. We met Doc Brown and Dracula as well. The parking rates were high in my opinion and we may have benefited from an Uber ride.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Go for the rides, not the tour", "Oh Universal, how I love to hate thee. On one hand you have what is becoming a mediocre tour and on the other you provide world class themed attractions. I've been visiting Universal since the late 80's and it used to be so good. But ironically now on the tour you'll find yourself like Malcolm from Jurassic Park saying \"Uhm, you do have movie things to see here on your movie tour? Hello? Hello?\" To be fair there is a lot to see however a good chunk of the tour is spent watching videos on the tram as you move around and listening to your host saying \"And here in this sound stage we film <insert popular show name here> and people get all excited to see something and then there's the \"ah\" as you pass by closed studio doors.\n\nIt's fun driving past or through the backlot but on the past few visits we didn't see much due to filming. Of course every now and then you are diverted to one of the attractions on the tour which go from excellent (King Kong and Earthquake) to the abysmally bad and embarrassing (Fast and the Furious). It's so bad it's frankly an insult to the audience and even the cast appears to know that with bland, wooden dialogue delivered with a \"when do I get my paycheck\" sort of enthusiasm. The previous attraction based on the films had you watching dancing Volkswagens on the end of robotic arms and just when you think it can't get worse than that. The thing is that it's just a poor copy of the excellent King Kong attraction you saw moments earlier so the thrill is gone.\n\nThe theme park part of the visit is generally good although the \"background\" music they play everywhere is far too loud. The Mummy coaster is fun but far too short, especially compared to the Florida version. It also has an ending that makes absolutely no sense at all especially now that it has been changed from the original.\n\nThe Transformers ride is absolutely amazing and represents the current state of the art in theme park attractions. The fact that you actually at one point travel up to the second floor on an elevator and don't realize it is one example of how good this ride is.\n\nOh, and despite what you thought of the movie, don't miss the live Waterworld show. Easily the best theme park show around but get there early to get a good seat. I recommend the centre section if you can up high so you can see everything. You WILL get wet (for one reason or another) if you sit in the first few rows anywhere so be warned.\n\nThe Harry Potter land is also really good and the ride is fantastic and this is one ride where you will actually want to wait in line so you can see everything in the detailed queu. Even if you go there as a single rider, do the standby line first since the single riders skips most of things to see.\n\nYou must try the butter beer as well though I have to admit that charging $6.00 for what costs them pennies to make is a bit much. Kudos though for the attention to detail everywhere in Hogsmead. You really do feel like you're visiting a small British Village with small crampt stores and what not.\n\nThe other thing I find really annoying is the hawking of their food deal everywhere. Sure, not a bad price but doesn't cover drinks, the one thing they make a ton of money on so I suppose it makes sense. My advice? Bring a water bottle and refill throughout the day.\n\nFinally, they offer a VIP experience where you can see more on the backlot and some other perks like front of the line passes. Unless you go in the middle of the tourist season, you won't need the front of line pass and instead of paying more to see things there, go on the nearby Warner Brothers Studio Tour instead. It's a fantastic tour of a real working studio.\n\nSo ultimately,\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Amazing place!", "I was skeptical of the prices to go but after two days was very impressed with the quality and variety of the rides, the good service and great job they have done with Harry Potter. Highly recommend coming on a weekday, you can almost do every main ride and activity on a good weekday. Online direct tickets are recommended especially if you’re here for only one day as you can get a 1 hour early start to Harry Potter. The food was obviously pricey but pretty good, the feast at the three broomsticks is a good experience if you’re a Harry fan.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So fun and not overwhelmingly huge!", "We had a blast! Get the fast pass though. Top things: both Harry Potter rides, the Studio Tour, and eating at the Three Broomsticks!"], ["Reviewed 2 weeks ago", 5.0, "VIP Tour!", "We umm and uhh'd about whether to do the VIP tour but I am glad we did! Lary was great! Could not be a better host, he definitely made the tour what it was. We did a 9:15am start for the tour and ended up getting there around 9:05am? I would recommend getting there a little earlier as it includes breakfast and we sat down to eat and then were told we were about to go so we had to scoff our food.\n\nIt starts off with a private tour of the backlot and what makes it different to the normal tour is you stop to take pictures and videos off all the different sets which you cannot do on the normal tour. We also got to go inside a soundstage which was great!\n\nAfter the tour we got to skip the lines do some rides before lunch - which was a buffet of lovely food! Then we watched WaterWorld and went to do more rides. Around 4pm Lary left us and we still had an hour and a half to go on any rides again or see things we didn't see while going around..\n\nThe whole day was great. I feel like you have to do this at least once in your life.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Nice park with interesting facilities, but nothing outstanding", "This attraction has been on the to-do list for our trip quite some time now, expectations were set high.\n\nWe went on Feb 7, 2018. 2 Male travelers age 25.\n\nFor children and youth, we can see why this place is a 5/5. It has different themes and sections that are attractive if you love movies, and does create some nostalgic feeling which is awesome. There was Jurassic park, Simpsons, Harry Potter, Fantastic 4, Kong, and a few other attractions when we went. The rides were cool but nothing intriguing for adults and nothing worth coming back again for. It's nice to see this place once...but we won't be visiting again for the price. about 130 CAD per ticket for one day.\n\nWe didn't eat or play any of the carnival games. Must say there is quite a few selection of games to be played.\n\nIt does take long to get down to the lower level beware. They really need to improve the efficiency of their transport system.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Fun spot for all ages", "Went with a friend, spent a whole day drinking our way across Universal :) Surprisingly fun. Attractions (without lines) only last half a day (im sure in the summer it takes a full day with waits). We got lucky that their wasnt much of wait so got to check out multiple beer carts! Fun times at Universal.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great place for a behind the scenes of Hollywood", "Definitely take the behind the scenes tour it explains Hollywood magic through the experience! Great place to walk around and reminisce in old Hollywood, have fun with the kids in many of the places, and star attraction for me was Wizarding World of Harry Potter. You could spend the day just there.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Universal Studios", "We had a great day at Universal Studios! We had the Express Pass and I highly recommend having it. We were there on what was supposed to be a low crowd day - but there were fairly long lines. We were very happy that we had the pass! It did feel smaller than the Florida Universal but there was plenty to do and see. We enjoyed our day and after we went out to City Walk for some food - we went back in and were able to ride Harry Potter 2 more times with no waiting!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great for a proposal", "All staff was very helpful when we asked. My son proposed to his girlfriend in front of Olivanders- HarryPotter. All was magical and went great. We then proceeded to the rides and shows. Walking dead was the lamest. We loved the waterworks show but really be prepared to get soaked on lower seats. We liked all the rides, the mummy was the wildest. They all really do stop, start fast and jar you around. We all felt a little queasy stomachs. Food and drinks and stuff seemed pretty expensive. We were there on a Thursday and no line was more than 10 minutes. Univ. Studio tour started out slow and boring but then got really good we all thought.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "2 day memorable experience!", "We bought our 3 day pass from Costco intending to spend 2 days at the theme park. It was very easy to follow the instructions and register ahead of time for our passes. Make sure you bring your ID as they could check it when you arrive. We decided to pack Triscuits, snack bars, fruit and water. It was no issue getting in with those items. Saturday was our first day and it seemed busy as it was the first day of Chinese Lunar New Year. We decided to purchase the Express Pass for $49 which guarantees you front of the line for one time for the day of purchase. It was worth it on Saturday as we bypassed the Harry Potter ride line at 125min! We managed to do all the rides and attractions except for the 2 very kiddie ones from 9:30am to 6:45pm because of our passes and careful planning using the app. on our second day, Sunday, we decided to sleep in and did not get in till 10. We moved monitored the app the wait times were very low. We managed to revisit our favorite rides, including the Harry Potter ride. Tip: definitely download their app and set alerts or monitor the wait times. Also, it seems like around lunch time on Sunday the wait times are slower. We waited less than 15min on Sunday day without the Express Pass for the Harry Potter ride.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Universal Studios", "Universal Studios CA. Is so much smaller than Universal FL. If you have the time and funds I highly recommend going to Florida for a better experience. Especially if you are going for the Harry Potter experience. The crew members in CA. are considerably rude also. The only cool thing about CA. is the tram ride through the backlot.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wonderful place for the 6 of us from 6 to 69", "We all enjoyed the rides, the tour and the ease of moving around Universal Studios. We spent a whole day and rode some of the rides several times. Butter beer is a must try. Only the 6 year old couldn't go on the Harry Potter ride, but Granny was happy to sit it out with her. No need for more than one day. Nice and clean.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Went for a Girl Scout Reward Trip...Amazing!", "I got to go here on a reward trip, and it was really fun! A few of the lines were really long, but later in the evening it clears out quite a bit. I went with 7 other girls, aged 12-16, and we all thoroughly enjoyed it. Gift shops were incredible, and some of the places kind of felt like a little town. There was only one ride that was really considered a roller coaster... If you are looking for a place with intense thrill rides, I would recommend something more like Busch Gardens or Six Flags, but for families it really is the ideal vacation!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Horror Nights on a VIP pass", "My kid and I went to Horror Nights for her birthday. It was worth every penny, we had lots of fun, met fun cool people on our group and the guide was super funny and knowledgable. Going again this year becuase it was so much fun. The lines are super long on those days, so if you do not have a front pass or the VIP ticket it will not be fun at all. Get the VIP your dinner is uncluded and you can get to the mazes way faster.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Ho hum", "Not worth going too expensive not personally what I expected . Need to do more with movie taking tours of back lots and movie industry"], ["Reviewed 2 weeks ago", 5.0, "Thrilling & fun of sights", "We spent the day here!The best thing is riding the shuttle, for a grand tour! You see fire, floods, 17 movie cars, a interesting car chase of Fast & Furious, the psycho set is frightening, as killer rushes you, with big, long knife, & Jaws! We attended a great animal show, met minions, had daylights scared out of us, by walking dead,rode the Hairy Potter, viewed a realistic raptor, & LOVED the transformer!!! I cherish the video I have! There’s excellent photographers who take pictures, you can buy! The more, the cheaper!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun Birthday Weekend Outing", "I was very excited to go to Harry Potter World. We are a lot closer to Orlando but have not been since Harry Potter was built. I absolutely loved it and now I cannot wait to go to both sides in Orlando. We tried the frozen Butterbeer. You have to try it at least once. The wand show was cute. The rides were fun.\n\nThe studio tour was good. All the special effects and famous filming locations were great. I loved the King Kong and Fast and Furious parts.\n\nWe ate at the Jurassic Cafe and it cost $75 for a family of 4. We bought a plain burger, pepperoni pizza, bacon cheese burger, chicken platter, and a refillable drink cup. (you can refill it every 10 mins). It was not the best food but it looked really good at first.\n\nWe went on all the rides and had a great time. We paid $35 for preferred parking and ended up very close to the gate. We used the LA Go Card and it was very easy. They scanned them right at the gate.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "OK day out", "Firstly it wasn't as big as what i had imagined & it wasn't that busy so walking around was easy. We did the Studio Tour which was great (wasn't expecting the 3d parts to be like that which freaked my 8 year old out so we didn't go on any of the rides after that) and we also watched the animal actors show which my son loved. Was a good day and easy to find your way around but for the $$$$ it wasn't worth it for us.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "I love this place!", "I really enjoy how interactive the characters are. They truly make the experience memorable. Beetlejuice has always been my favorite to see there. Along with Betty Boop. Unfortunately I did not see Betty Boop this time. The characters from the Mummy were fantastic! The Mummy ride is my favorite. I unfortunately I have say I was disappointed with the Harry Potter rides. They did a great job creating Harry Potter world. The forbidden journey was cool but feel a little short. Flight of the Hippogriff was a complete disappointment. Overall a great place to visit!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "I like everything they’ve added and updated", "We’ve been to Universal in Orlando quite a few times, and while it is far bigger, o do like all of the recent updates and additions to the Hollywood one. The Harry Potter land is great, and a lot of the newer rides are greatly improved. FYI, traffic is absolutely terrible in this area of town.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Entertaining day!", "I decided last minute to go to Universal and it was a lot of fun. The attractions and rides are quite amazing. Harry Potter World being one of the favourites. The Studio Tour was also amazing to see. The lineups were not too long either, which was great. Bought our tickets online, which saved a few dollars. The Special Effects show was also a must see!\nCan definitely spend an entire day at Universal!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "First time at Universal Studios", "It was everything I ever dream of and more. Due to the season we made the visit there was barely a soul in the park. Lines per ride lasted like 15 minutes tops, and we could easily go to all the attractions. We went on a tuesday so they close at 6, which was a shame because if they close later we could have repeat every attraction easily.\nFavorite attraction? The Harry Potter simulator at the castle.\nShow less"], ["Reviewed 2 weeks ago", 3.0, "Good for teenagers and older", "There was limited rides and activities for my 5 year old daughter, and she was disappointed she couldn't go on much due to height restrictions. There is a lot of walking required to cover the massive park. I enjoyed the ride and activities, and think that if you were travelling with teenagers or older, then the day would be a lot more enjoyable.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome Place to visit", "My wife and I spend two days with front load passes and got to experience all the attractions along with the food and lots of gifts to take home. We will enjoy again next year."], ["Reviewed 2 weeks ago", 5.0, "Amazing Experience", "I am Visiting from the Philippines and went solo travelling and experienced Universal Studios. Its a cery good themepark especially of you are traveling alone. Ticket price online you can get $95-$115. You can book ahead or on the day. I suggedt buy ahead or online becuase prices differ over the counter.\n\nI went there early in the morning and the park opens 8am(early bird online). You can either ride an UBER POOL or bus going to the studio and price is just reasonable, also if youre coming from the airport you can take the bus going to Union station (downtown LA) and take a train going to the station. There is a free baggage counter in the entrance if you want yo leave your luggages or backpacks.\n\nYou can join the group tour(free) once inside or do it by yourself. Since i am travelling solo you wont have any problem queuing up becuase there is a single lane which is super fast youre like a VIP. You can pretty cover up everything in a day. There are characters along the studio so you can stop and take pictures with them.\n\nThere are also a lot of restaurants there so you will not have any problem, the citywalk also has a lot of restaurants and shops that you can visit to and by the time you go home you can just rode the train as well or get an UBER\n\nIts a great experience for first timers like me.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Ultimate VIP Experience", "On arriving at Universal Studios, we were directed to the VIP Lounge, where a breakfast of muffins, fresh fruit, yoghurt and pastries, along with tea, coffee and juices was waiting for us.\nWe had a fabulous tour guide in Donna for the day, sharing the bus tour with Cheryl, who was equally fabulous.\nWe had an amazing time exploring this park, along with the front of line access to the rides.\nDonna ensured that we got through to the amazing shows including Waterworld, Special Effects and later Animal Effects.\nAs part of our experience, we also had an amazing lunch in a private restaurant with an amazing buffet of hot foods, salads and seafood. To finish off, an amazing array of desserts.\nIf you can afford it, the Ultimate VIP Experience is definitely the way to go.\nWe had a group of 14, that was ideal.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Loads of fun!", "So many cool things here. Harry Potter ride was so much fun. The line ups weren’t so bad at all. We went on a Thursday off season. The park closed at 6:00 pm. I downloaded the app so we could have an idea of wait times when you aren’t near a particular ride. Worked out perfectly.\nLots of characters walking around the park like Beetlejuice, minions, Gru etc. The 60 minute tour of the lots was very cool. There was filming happening so we had to be quiet for 30 seconds while driving past.\nMost rides are 3D / 4D. If you get motion sickness, you might want to take that into consideration. There are a couple of real roller coasters like Jurassic park and one of the Harry Potter rides. All the rides were super fun!\nFyi: the Mummy ride is very fast! Like super fast and stops suddenly then goes backwards. I may not have ridden this ride had I known that. My stomach wasn’t too happy afterwards but my kids LOVED it!\nWe ate at Krusty Burger in Springfield, super good, but prepare to pay. 80$ for 5 combos which doesn’t include drinks. Combos are fries and burgers only. We added 3 drinks for the kids.\nSomething fun too is you can pack snacks and bring them with you.\nDefinitely would come back again!!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "So much fun", "This place is just too much fun! Definitely less crowded than Disneyland, but it is recomendable to visit it for more than one day if you want to see and ride everything. Don’t miss the studio tour and Springfield’s donuts! In my opinion, there could have been more characters at the Harry Potter World, but it was great anyway!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great Fun", "We went on a Tuesday in the off season (park closes at 6pm), we bought our tickets online from Universal so we were able to enter the World of Harry Potter one hour earlier than the park opening. This is well worth the extra money. We got right on both rides with no waiting. The world of Harry Potter is well done. We walked right on the tram ride and all the other rides and shows there were minimal waits. We were able to see and ride everything even on the short hours the park is open. The restaurant inside the world of Harry Potter has a great breakfast. Tickets have gone up considerably since we were here last (A little pricey at this point). Rides were great, a lot of 3-D virtual reality rides, so take your motion sickness medicine.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Great place for kids and teens. Mildly interesting for Seniors.", "The Studio Tour was the highlight for us. The Harry Potter section had a very good architectural theme. The animal act was well done. (Yea, I know, we're old folks who didn't bring the grandkids...)"], ["Reviewed 3 weeks ago", 4.0, "Great Day for Family Time", "Went here with friends and family during the summer. Don't go during the weekends. Obviously packed but the weekdays are not bad. Food is a little steep in price but selection is great."], ["Reviewed 3 weeks ago", 5.0, "Filled with fun for all", "We visited as a family (1 almost teen and 1 teen, parents, a grandmother) and we all found things we loved. Rides were great, and even waiting in queues was entertaining as there were videos to watch. The place was tidy and well maintained.\nWe got there before opening time, parking was easy, and the wait to do our first rides (the 2 Harry Potter ones) was only 5 mins and 20 mins).\nHighly recommend doing the Studio Tour - it is so much more than a tour, it is a ride I. Itself.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Decent", "This is great fun for all ages . I've been here 3 times and it's always been good but I've learned to get there early and pay an extra $99 a ticket and upgrade to the front of the line pass otherwise you may not have enough time in the day to ride all the rides\nShow less"], ["Reviewed 3 weeks ago", 5.0, "AMAZED", "This place is just awesome! We have spend a whole day here and I would go again if I have the chance!"], ["Reviewed 3 weeks ago", 4.0, "Good visit for teens", "We went on a Saturday and it wasn’t too bad. We did get the fast pass, and got on all rides at least once. It was nice weather in January, and only about half capacity according to the staff. The Harry Potter world was worth the trip. The merchandising is nuts but overall I would recommend this place if you have kids tall enough to ride every ride. Spend the money on the fast pass and buy it from Universal only- not their third party vendors, because if you can’t make it, you cannot refund or resell.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Universal cali 2017", "We had a great trip to Universal . Glad we rented our own car and bought annual passes to save on parking. We went to the park every day and had a great time. Harry Potter !!! Light show was amazing. Really fun time."], ["Reviewed 3 weeks ago", 4.0, "Super fun day in LA", "The park itself is fun, but not very big. The studio tour is what really makes this worth the money! We enjoyed our day here, an as a big Harry Potter nerd I was definitely not disappointed. Try the Butterbeer!"], ["Reviewed 3 weeks ago", 2.0, "NOT WHAT I EXPECTED!", "This place is way below my expectations! First time here and definitely disappointed to have purchased the annual pass. Not even a third of Disneyland! Too many stairs for so little attractions. No attractions for young kids! Would never buy the annual pass again! To top it off, parking is ridiculously EXPENSIVE! $25.00! Are you kidding me! Not even Disneyland's parking is that expensive.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun! Avoid Harry Potter ride if you get motion sickness", "Fun experience. Hadn’t been there since I was a kid. Wizarding World was fun, but almost launched cookies on the main castle ride"], ["Reviewed 3 weeks ago", 5.0, "Fun, Fun, Fun!", "Universal Studios Hollywood is a fantastic fun place for the entire family. If you have teenagers that want to just go with friends for the day, there is a drop off/pickup area where you don't even have to go thru paying for parking. The park is very clean, safe and well organized. The staff is friendly. I recommend buying the 'front of the line' tickets. Great family experience!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Exciting and Enjoyable Experience", "It was our first time in LA and tried the Universal Studios. We took the metro and it was a very smooth and relaxing journey from downtown LA. The harry potter experience and studio tour is one of the most sought after. So my advise is to try them first, before the line gets too long. Minions, Walking Dead and Jurassic Park is my next favorite followed by the Transformers and Mummy. One Day is not enough to enjoy this attraction.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Skip the line", "We had the best time here. I would really recommend getting skip the line tickets. You looking at a minimum wait of 30min for the rides. When we were there some were over an hour. We had skip the line tickets so went straight onto the rides waiting 5min max. It was worth every penny. The Waterworks show is amazing. Do not sit in the splash zone if you don't want to get wet cause they will wet you. They have buckets of water they walk around with, with holes in them. Don't forget to get a giant donut in The Simpson part it's amazing\nShow less"], ["Reviewed 3 weeks ago", 5.0, "VIP . Package", "We decided to slurge for the VIP package and can't recommend it enough! We started early with a breakfast in the lounge after check in.\nOur guide Mary did a wonderful job touring us around the park, taking us to the front of the lines, a small backlot tour group, an amazing VIP lunch in our own air-conditioned restaurant and reserved seats at the shows!\nAfter a full day with Mary, we were free to continue using our Front of the Line access until the park closed!\nGreat day for the whole family\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Prefer over Disneyland", "When we went, on a weekday, it was not overly crowded. The restrooms were clean, staff was friendly, and lines were short. The weather even was nice.. a sunny and 68."], ["Reviewed 3 weeks ago", 5.0, "so much fun!", "It such an amazing place! You can easily spend the whole day there. The studio tour is awesome, it is great to see the sets of your favorite movies and tv shows. For Harry Potter fans there is newly build Hogwarts! Everyone can enjoy this place!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "25th Wedding Anniversary", "When we went on our honeymoon 25 years prior, we went to Universal Studios for a day and we had a blast. So we decided to come back and purchased VIP tickets for our visit this time. Well, we had a blast again. Lots had changed, but this visit was just as enjoyable as the first time we went. Guest Services gave us buttons to wear, so everyone was congratulating us. The staff was very nice everywhere we went. Cannot wait to go back.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Good solid day of fun", "We went to Universal Studios late January - excellent time to go, the park was not very crowded at all. The longest wait we had was about 20mins which was great! I think if we went during a busier time of year, we would have definitely paid extra for the fast passes, but at this time it was not necessary. Jurassic Park was closed which was disappointing, but you can;t win them all - this was the only one that was closed though so that was good.\nIt's true what a lot of the reviews say - the rides make you pretty motion sick - transformers, simpsons, harry potter, the mummy, even the studio tour a little bit - it's a lot of jolting and jerking around and leaves the tummy a bit unsettled but it's not a big deal!\nIf there aren't the lines and things, you can easily get around the park in a day. I'd recommend doing the lower lot first, and doing all the things down there, then you can spend the rest of the day just doing the upper lot - instead of walking back and forth between all the things.\nIt's not something I would go back to any time soon, but it was a a solid, fun day for the hubby and I!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Grandma and 10 year old grandson.", "Was fantastic. Characters going around for photos with customers. Transformers great. Really funny, and engaging. Hogsmeade setup brilliant. Well worth the visit."], ["Reviewed 3 weeks ago", 4.0, "Fun, fun,fun", "My wife and I have enjoyed numerous Universal Studios theme parks. This is one of the best. The attractions and rides are first class. The food is too expensive, but what do you expect from a theme park. This is a theme park done well."], ["Reviewed 3 weeks ago", 3.0, "A lot of fun but very small park and cost like a big one...", "I had a lot of fun, don't get me wrong. I love theme parks and had a great time, I even came during the weekdays so not too many people (still a lot yeah?) so less lines and I got to do some of the stuff I like twice!\nHarry potter (which I never saw) ride is really impressive and you can see they made a lot of investment in it and the whole place looks amazing, also the Simpsons area.\n\nHOWEVER\nThis is a very small park!\nif you consider the fact that a lot of people come just for the kids, or the opposite, without any kids, so suddenly you don't have so many rides to choose from...\n\nI came with my friend, no kids, after taking down the kiddis rides and one ride that was close (jurasik park) we ended up with not so many rides...\n\nAnother thing is, the majority of the rides follows the same shtick! the harry potter, simpsons, robotricks and minions are kinda similar in what they do, they are different but all on the same shtick of setting on a moving thing and watching a screen that gives you the sensation you are moving more than you do (in some you move more and some less)\nnot much to do there if you don't like that or if your belly is already upside down :)\n\n**I would love if they had more rides and more variety **\n\nfood of course expensive as hell and not good. also in that case would want more verity and not just one pasta and pizza place...\n\nall n all I had fun but this price belongs to big theme parks , I don't think it fits this park... sorry.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "One of my favourite place to visit in LA", "I usually go to this entertainment park once a year... I always spend good time as they always renew attractions and amusements. The entrance fee is quite expensive but for me it worth it."], ["Reviewed 3 weeks ago", 3.0, "Limited Openings", "Family visiting from Canada. Been several yrs since I had been. Must be Harry Potter fan to appreciate it. I had no knowledge so really I can't comment. The studio tour had limited changes but was good. Special effects has expanded to seat larger audience. Interesting. I am not a ride person so my opinion is zero. Brother-in-law (retired Senior) loved all the rides. Water World hasn't changed in years so for me boring.\nPark undergoing changes for future shows. Expensive, entrance, parking and food.\nPersonal preference Disney. More expansive, parades; however probably more expensive.\nWas clean and staff were very hospitable. After City Walk was ho hum.\nFamily enjoyed Universal. Me, it will be a few years before a return visit.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great fun. Great rides. Love Harry Potter", "Lived here for years. Finally took the kids to Universal. Easy in and out parking. So much closer than Disneyland. Rides are great. Just a tad to short in duration. Needs to offer fast pass. Everything. Is an up sell which is sad. Would go again spite if it. Got a three time pass at Costco\nShow less"], ["Reviewed 3 weeks ago", 4.0, "I Love this place", "This is the best place to enjoy from the rides to the food everything is amazing jus waiting for all the new rides that will come in the future brought year passes it was worth it"], ["Reviewed 3 weeks ago", 5.0, "How movies are made", "Happened to be in LA for two days for business and couldn’t miss the opportunity to give this place a spin. Even though I was alone on my day here I had so much fun. I think I’ve tried every single attraction this park has to offer and, as a huge Harry Potter fun, I obviously spent most of my time in that part of the park.\n\nDo the studios tour by the way, it’s really worth it!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fun long day out", "Completely different experience to Disneyland so don’t try to pick one over the other they offer a completely different day out.\n\nThe top section is set into different themed areas including Harry Potter world and the universal studios tour. The lower section has the theme park rides such as transformers, the mummy and Jurassic world.\n\nAnd in between all that you have various shows you can see so do make sure you plan your day to what are the set time things and note that many of the rides can have wait times in excess of an hour so plan for it if you are not buying a fast pass.\n\nDining options are pretty standard fare for a theme park but remember there is the shopping mall outside with loads of restaurants if you are looking for an evening meal after visiting the park.\n\nCar parking is plentiful but not cheap and there are various other transport options available. If you know when you want to go get your ticket in advance so you can get early access to Harry Potter world and tick that off so you can get through everything in the day.\n\nIt’s a long day out to see and do everything but if you make the effort then you can do it in a day.\n\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Variations on Theme Rides", "We had a pretty darn good day at Universal. The lines weren't too bad in most cases and despite Water World being closed we still only just fit everything in during a full day visit. It was busy but only Spring, I'd hate to see it in Summer! For the most part where there was a line, they had interesting ways of breaking it up and adding to the experience. The backlot tour and Harry Potter ride were the best worth the wait. Most of the other attractions got a little samey. They were generally variations on \"Sit in moving chair while a movie plays in front of you.\" Don't get me wrong, they were great fun, but the park is missing some variation like a big roller coaster. It's the sort of place you have to visit once but wouldn't head back to quickly, which is probably their aim for the tourist market. We didn't get the 'head of the line pass\" but if you were short on time that could be a good option.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Fun", "We had a fun time here. We had already done the Universal in Florida so many of the rides are the same, but there was enough variety to keep us entertained for a full day. The tram tour especially stood out as being different and really enjoyable. We payed extra for the express passes as we had heard it would be busy (we have never felt the need to do this before), and I am glad we did as several attractions had queue times of over 2.5 hours, which is way longer than my attention span!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great place", "it's worth a visit I'll be back the doughnuts and the butterbeer is not to be missed!! Harry potter line is outrageous I wouldn't bother if your outside because it's over an hour long if not close to a 2 hour wait.."], ["Reviewed 3 weeks ago", 5.0, "A must see LA attraction", "We went on a Monday and used the one time express pass. It was worth it and allowed us to see everything we wanted in just the one day. The behind the scenes show and tour were great"], ["Reviewed 3 weeks ago", 5.0, "Great experience", "We had such a good time! Came here on a Sunday, bright and early and were here for 12 hours! It got busy in the afternoon but the single rider lanes took care of that. Really good time!"], ["Reviewed 3 weeks ago", 5.0, "Very fun for everyone", "My son and I came here for the day after 2 days in Disney and he really enjoyed it. Both our first time. I decided to order the express pass ticket and boy do I wish I didn't. I could have saved so much money buy just buying the regular ticket. It was a Monday when we went and Jurassic park ride was closed but really didn't wait long for rides. Plus I assumed we would ride more than once but I gave up that idea after realizing 80% of rides are 3D stimulated and caused me huge motion sickness and nauseated with headaches for 30 minutes after each ride. The animal actors show and the waterworld show was Fantastic and really worth going. And the studios tour was a huge highlight for him and I as we just did the warner brothers tour the day before. Very interesting stuff we say on both.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Plenty to do", "We are not really ones for rides, so we spent our day wandering around.\nWe enjoyed Harry Potter. The attention to detail in all the shops was fantastic, and we had postcards postmarked at Hogsmead. We went for a walk through Hogwarts, which was a bit of fun, but it is quite dark inside, so I would be a little wary if you are travelling with or are someone unsteady on their feet.\nThe Walking Dead experience made us simultaneously jump and giggle at lunging walkers.\nInteraction with the characters walking around the park was fantastic - I particularly liked Dracula.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Dream come true", "I heard about universal studio from my uncle who visited this park in the 90s. I had the chance to visit the universal studio in Singapore. It was nothing like this. As they say, there is first the studio, then the park. The studio tour is everything I imagined and more. Highly recommend if you have seen the Universal movies! They are great !\nShow less"], ["Reviewed 4 weeks ago", 4.0, "PLan your day and save money", "We paid extra ( a huge amount of money) to get the \"fast pass\" option because we were there on Christmas Eve and thought that it would be too crowded. But because we planned what to hit when etc and went early we found we could have very well done the day on the normal ticket. My teenage kids oiked this better than Disneyland.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "HP world very disappointing", "If you've never been, this is a fun place. If you've been before, there's no need to go back. I was at a trade show in the hotel next door and got a free ticket as part of the event so, why not? I have not been to either of the universal parks in Harry Potter World was built. My 25 year old daughter was excited for me to go- she's still waiting for her owl letter inviting her to Hogwarts- but it was very disappointing.\n\nYounger kids my like it but there are only three attractions- one where you go into Olivander's wand shop in a group of 20 and a youngster is selected at random to pick their wand. After two failed attempts- flowers die instead of being watered, drawers fly open instead of the latter moving- the \"wand finds its witch or wizard\" and the lights glow and everyone is happy and let into the gift shop to buy a want. Meanwhile, Mom and Dad are encouraged to buy the kid that wand. Out in the alleyway the souvenier wands are $43. I don't know how much the ones with the light up tips that activate things in the shop windows of Hogsmead cost.\n\nThere's a flying hippogriff ride- a roller coaster that's small and short but may be fun. I passed. Inside the Hogwarts castle is the flying broomstick ride. You side four people abreast in a car that moves along a rail and tips and turns while the projected image on the screen has you following Harry on a broom stick. It was a non event for an adult but maybe my imagination is gone. I understand that in Florida they have repurposed the old double roller coaster into a dragon ride so maybe that's better.\n\nThe special effects show is good and the backlot tour is worth taking even though one of the attractions on the tour- fast and furious- broke down while we were inside. You are in a tram the whole time so no big deal, the doors opened and we went on.\n\nThe park is fine and worth going to if you haven't been before but the HP world was a bust. Hogsmead is a collection of very expensive gift shops. Robe- $114 and butter beer $7.50 per glass for butterscotch flavored water - frozen or not.\nShow less"], ["Reviewed 4 weeks ago", 1.0, "Rubbish - the one in Florida is the good kne", "This is really old and small and a waste of money, don’t bother visiting this, it’s boring and there’s hardly anything to do there\nShow less"], ["Reviewed 4 weeks ago", 5.0, "best Rides on earth", "i have been there twice although i do live in Washington State, this place is simply amazing, the type of rides is so different than any rides you have ever tried. also the atmosphere is great there, and trust me it is fun for Adults more than kids.\nall the rides are great, but if you have limited time and you need to choose then definetly:\n1- Harry Poter\n2- Transformers\n3-Mummy\n4- water World\n5- studio Tour\n\nthe rest are great.\none problem is that the tickest are so expensice and the parking is 25$ which is ALOT.\nthe fast track pass is too expensive, you can think about it if you are going alone but if you are going with family then it will cost you a fortune.\nlast hint is dont you ever go during holidays without the fast track... also you can check how busy it is using isitpacked.com website.\n\nENJOY\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great time at universal", "Loved this place! Got to view e entertainment being filmed during our visit there. Don't miss the Hollywood tour, fantastic! Enjoyed the 3D experience of Jurassic park scene.\nHarry Porter ride was great! Bought the Disneyland and universal studio ticket through parksaver website as it was cheaper to bundle the purchase.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun for all", "Many age groups can spend a day here. There are many fun rides for a variety of age groups. For my Harry Potter fans, the opportunity to shop for a wand have a butter beer was as close as I have gotten to Hogwarts in some time. Additionally, we were asked to do a survey upon entering in exchange for a free tour which I highly recommend if given the opportunity. Many movies and TV shows have been filmed in this location. Be prepared to do a lot of walking.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Children will love it", "Great for teenagers who will enjoy all the different themes and rides a little pricey for food and drinks as expected and parking is an extra charge if you drive there. Don’t go if you want a cheap day out overall a good experience"], ["Reviewed 4 weeks ago", 4.0, "Enjoyable but pricey", "The studio tour was very interesting and gave a new outlook on the movie industry. The park characters were funny and the shows and rides were a blast. It was expensive, but coupons are available for savings. We forgot ours at the hotel, but park staff still honored discount which was very nice of them. We found the park to be clean and staff helpful. From some of the parking areas, directions to the actual studios tour are limited, so consult the information boards. When you arrive plan your time well (shows are at certain times only) so you can see everything.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great day out", "Absolutely loved Universal Studios. So much to see and do. Some of the rides are so much fun. The water world show was fantastic. The lines to most things are long though even during a week day so a front of line pass is recommended.\n\nI was very impressed with the staff when they seen I was injured so put me and my companions to front of line for all the rides and attractions. I was blown away by their kindness and helpfulness to make me enjoy my day despite my misfortune.\n\nThe food is very expensive there like most theme parks so be prepared. The city walk after being in the park all day was great with a large variety of restaurants and fast-food outlets to chose from. Also lots of stores to purchase from.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Review of universal studios hollywood", "The universal store at the entrance of the park essentially has everything all the other stores have so it’s better just to go there on the way out and buy things. If you do buy things at the stores you can have hem sent to the universal store for pickup.The Harry Potter section is cool and enjoyable if you are a fan but after a bit you have seen it all.\nThere are four areas that are pretty small each with a ride or two. The water works show is pretty cool. The animal show is similar to the one at sea world. The studio tour is actually pretty interesting and we did that both days. The Simpson donuts are surprisingly good.\nAll in all we had a fantastic day and would highly recommend it!.Absolutely amazing day spent on Christmas day at the park. I had no idea that so many people would be at the park on Christmas day but I must say this is one park that planned ahead for the major traffic. I've never been to an amusement park that the process for not only getting through the park upon entry is super fast not to mention how you don't have to wait in long lines anywhere throughout the park whether it be for good or to the restroom. It's as though they have properly trained each of their staff for the overcrowding. Then every restroom has an attendant to keep things cleaned and to have a 0 wait time. Aside from. All the wonderful shows what was even more wonderful was although the entry day passes seemed a bit pricey, Once you're in, the price for good, goodies and souvenirs are extremely reasonable unlike many other parks. I mean it's very affordable for families and I love they aren't trying to charge you an arm and a leg just to buy food for your family. Then on the outskirts of universal studio is Universal city walk with various restaurants, shops and outdoor skydiving and movie theaters. Wonderful time celebrating my 40th birthday and even after just barely mentioning after being in the park many hours later, a manager heard me and asked what ride was I heading to, I told her and surprisingly she came and found me and gave me a universal studios birthday necklace. I thought this was a wonderful gesture to help make my day even more remarkable. Now I definitely have to bring my family back to experience.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Love this place", "My husband and I care on a couples trip and used up our annual pass. A fantastic deal that we picked up at Costco (annual pass with blackout dates). The dates still gave us many dates to visit which made the adventure much less stressful. We never felt like we had to rush. Loved the Harry Potter section, the great souvenirs and the butter beer\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great day out", "We purchased the universal express passes and got one time front of line access to every side attraction and show.\n\nWas well worth it!\n\nWe tossed up between going two days or going one day with front of line passes. One day was more than enough. We did every show and attraction and only missed three rides and that was by choice as my partner felt sick. We had more than enough time to do it all though.\n\nGreat day out for anybody!\n\nThe front of line passes were excellent for Harry potter world rides especially. We got straight on the ride and then walked out and say an 80 minute wait for others.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Just brilliant!", "Last full day in LA and thought we would do something cheesy!\n\nUniversal exceeded our expectations not from a cheesy prospective but for great fun!\n\nWe arrived around 10.30am on a Monday morning. We opted for the express ticket and REALLY pleased we did. Although lines were not crazy I don’t see the point in waiting 30 to 40 mins to get into attractions.\n\nWe managed to see everything - Minions and Harry P twice ( using the express pass even tho it’s one use on each ride - not sure how that happened!)\n\nVERY pleased we had the express as some rides were lame - I would not have been a happy bunny to wait 40 mins for The Mummy.\n\nMake sure you take ID if using a credit card, being British it is not a requirement to carry such a thing and my credit cards were not signed on the back which caused a bit of a problem .... nearly had issues at the entrance but fortunately they back tracked and all was ok!\n\nGreat day out !\nShow less"], ["Reviewed 4 weeks ago", 5.0, "What a FANTASTIC DAY", "This was my favourite attraction. There was so much to see and do. We did the studio tour which is well worth it. Heads up get into cart 3 for the best views and experience. We went on every ride, some two or three times. We did the shows that were offered and liked the Special Effects show so much. I must say that the Harry Potter ride would have to be up there with a ride thrill, however make sure you go on as many as you can. Jurassic Park ride is really good, especially at the end. Also the places to eat are plentyful and clean.\n\nThe park is very well layed out and there are plenty of stores to purchase items. The park was not overcrowded and was just a fantastic trip. Once you ahve finished in the park, you can leave and walk through the outdoor shop walk. There are some great sotres to go into on the walk as well.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "This place is great!", "You can spend an entire day here if not two days, I love the wizarding world rides but also the older rides and attractions"], ["Reviewed 4 weeks ago", 5.0, "Fantastic!", "Had a wonderful time. The water show was very entertaining, the tram ride was interesting and fun. Beautiful grounds and buildings. Will go again!"], ["Reviewed 4 weeks ago", 5.0, "Great fun", "Went here with friends , had a great time , loved the universal tour , and bus through the film sets , definitely would go back next time in LA 😃"], ["Reviewed 4 weeks ago", 5.0, "So great!!", "I came here with my best friend in October 2017. We got the unlimited front of the line pass after spending all day at Disney waiting in lines the day before.\n\nThis was the last activity my bestie and I had planned for our four week USA adventure. WHAT A WAY TO FINISH! I am a huge Harry Potter fan, so my ultimate goal was to go to Harry Potter world, but I was so pleasantly surprised by the rest of it!! The trolley ride was INSANE - so, so, so good. I highly recommend it. The King Kong and Fast and Furious parts of it was so great - there are also old favourites like the Jaws and Psycho part. The history and film/TV locations was super interesting and I feel like there was a lot of information I didn't absorb because I was too busy gawking like a fool.\n\nWe did the Jurassic Park ride twice (we got so wet the second time, we had to dry off in the sun!) We did the Mummy ride twice as well.\n\nHarry Potter world was amazing - I've done the one in Orlando and this one isn't that different, but still special. The only issue we had is that my friend is lactose intolerant and the cream head the servers put on the 'butterbeer' means she can't have it - she asked whether they could just make it without it, but they said no (adamantly) and indicated they would get reprimanded (or fired) if they altered the recipe at all. We found that very strange as I am sure my friend is not the only person who visits Harry Potter world with a lactose allergy. Despite this, we had a brilliant time and did the Harry Potter ride twice and the rollercoaster once (it was over very quickly and would not be worth an hour wait!) I spent way too much money in the gift shop (seriously, $16USD for a keyring is a little excessive....I still bought two!)\n\nI would come here again in a heartbeat - and would spend money on the unlimited front of the line pass (and harry potter merchandise) again too.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "I love it", "I love Universal Studios but I had been only to Orlando. In Hollywood is exactly the same. The only thing is that I had the impression that it closes earlier."], ["Reviewed 4 weeks ago", 5.0, "Fun for all ages", "So many fun things to do... Harry Potter was my fav, the Butterbeer is a must try, including the ample things to buy.\nAlso the Studio tour gives an amazing insight into the sets and a glimpse of the movies and shows shot out there.\nThe Animal Show was incredible.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fun for everyone", "Great location to spend time with family no matter the age. Parking is ridiculously expensive, so try to take the subway if possible. There is a free shuttle that can take you right to the front of the Studios entrance from the Metro/Subway station exit."], ["Reviewed 4 weeks ago", 4.0, "Great but could have been better", "Ive been to Singapore's universal studios and was disappointed here as there are fewer Street shows (there was just two varieties that repeated the whole day and I thought the performers were good but not outstanding). I went on a weekday and so that can't have been their peak amount of people but lines were still massive - like thirty minutes on a weekday... It got less as the day got late though.\n\nI didn't get to go into one show because it was full and it was the last show. This was on a weekday, in winter, it should be off peak. So I can imagine it must be terrible in summer.\n\nFlight of the hippogriff was the lamest roller coaster ever and Jurassic Park ride was closed which was a bummer.\n\nGoods though were the beautiful Hogwarts, and the Harry Potter ride in the castle was amazing. Just walking though the lines were beautiful as well.\n\nThe studio tour is the highlight in this universal studios, you literally go through an earthquake, flood, dinosaur attack (they change it sometimes though).\n\nAnd you see some sets which is cool.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Good but not great", "Our family went to Universal Studios on a Sunday in Jan 2018. Before going, we were contemplating whether to buy the basic tickets or express tickets. I'm glad that we went with the basic tickets, because the lines for rides were generally reasonable, and there really weren't that many rides to go on anyway. The only long queue was for the Harry Potter ride, but we did this early to avoid the crowds. Then the ride broke down while we were on it and some of the effects didn't work properly.\n\nMost of the rides use visual effects instead of the real thing. I was disappointed by the lack of variety, although what was there was pretty good.\n\nShows were a must to see. We liked the Waterworld stunt show most. I would have loved to see more in the special effects show.\n\nThe backstage tour was okay, mainly for the King Kong section. I found a lot of it pretty boring though, where they talked about tv shows I've never seen.\n\nOver all, it was good, but I felt it was overpriced. So glad we didn't pay more!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Mid winter vacation", "Universal Studios is a fabulous place to spend a day while in LA.\nAs a matter of fact, it should be at the top of your list.\nThe place is really beautiful, with tons of unique and wonderful stores in all the characters.\nThe simulator rides are simply fantastic. The 3D effects make each ride more exciting than the next. The imagination shown in these rides are surpassed by none. Transformers, Minion, Harry Potter and just a few of the rides here. As an adult, I had the same fun as my grandchildren. One of the staff even comped us a go to the front of the line ticket. It saved us hours on line.\nThe tours were informative as well.\nWe were lucky as we went in off season so the place wasn’t too crowded, waiting time was at a minimum.\nWe spent the whole day in the park and enjoyed our time there.\nI highly recommend this park to all families with children, no matter the ages.\nHave fun at the Park!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Be treated like a VIP for a day....", "At first, I was not receptive to this tour at all mostly due to the price...but after experiencing it, I am definitely a convert...the day starts off with leaving you car with the valet, then you report to the main gate where you get a great breakfast and meet your tour guide...they have a full day planned. Once you eat, you get on a tour trolley and go through all of the behind the scenes locations such as prop rooms, sound stages, and film locations....this time flies by and water was provided as there is some walking around. The park is huge and getting around takes time, lunch was on the upper level and it's buffet style. The view from the restaurant is amazing, make sure to eat outside! The buffet has lots of choices and the desserts are amazing! Lotsa seafood, and chicken, steak, etc...you will not be hungry..only drawback us one washroom but there are more nearby...the afternoon is all about the park, you do a really cool Waterworld\" live show right after lunch to digest your food and then you get to visit all of the rides...you get direct to the front and the wait was minutes at most...you finish at the Harry Potter world...and that's around 16:00, the last two hours are for you to do whatever you want with your VIP pass....our guide was awesome and he slipped away without asking for any kind of tip, if you enjoyed it, give them a tip...they really do a first rate job...overall, this is a very enjoyable experience\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Universal VIP experience", "Great buffet for brekkie & lunch. Fantastic tour guide, but overall not really worth the price, express just as good value"], ["Reviewed 4 weeks ago", 5.0, "We had a great time!", "I came here with my husband, Mom, and Stepdad to get away from our winter weather for a weekend. My Stepdad had knee surgery a few months ago and needed to be in a wheelchair and the staff working there on 1/27 were so friendly and very helpful. We had a great time and were able to do everything we wanted to do. The best part was Jurassic Park opening early when it wasn’t suppose to re-open until the next day. It really made our trip!!\nShow less"], ["Reviewed 4 weeks ago", 1.0, "Early check in was BS", "We are here. 8:10. 20 people working inside no one is opening the doors. Dragged the kids out of bed at 6:00 for this. Thank you Universal"], ["Reviewed 4 weeks ago", 1.0, "STAY AWAY", "Our son really was so excited to go here. SO while on vacation we went. Price is very high! 25.00 to park, and 120.00 per person to get in. 1 Of the biggest rides was closed for updating Jurassic park. Besides that if your child is 14+ you really are looking at the most 5 maybe 6 rides that last 3 to 5 minutes. Really save your money the park is NOT worth it!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The absolute best", "Before visiting Universal, I wasn't too excited. I thought it was way too expensive for just a theme park. I couldn't be more wrong. Yes, it is expensive. But is it worth it? YES. I can't wait to go again. When i visited there was a Harry Potter theme. I'm not the biggest Harry Potter fan, so we just spent the entire day on the other attractions; there were plenty. The attractions were so great & there is something for everyone. The two things I didn't like were first, the (lack off) vegetarian food options. Secondly, as we were leaving, an employee of Universal asked us to participate in a questionnaire about the experience. We agreed, but the questionnaire took HALF AN HOUR. And we didn't even get something in return, as you would normally expect from these kind of companies.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "A very fun day out", "Universal Studios Hollywood was a lot of fun! We came during the school term which meant it wasn't too busy and we got to try everything more than once.\n\nI especially enjoyed the Wizarding World of Harry Potter, being a big fan - got to sample butterbeer, chat to a Hogwarts Express porter and enjoy the rides a few times.\n\nThe studio tour was really cool, seeing the different sets for famous movies throughout the years. The Waterworld show was also a must-see.\n\nThe downside was that a lot of the rides are of the virtual-reality type instead of your classic roller-coaster, so that by the end of the day complete with carnival food etc your head starts to swim a little bit. In this regard, our favourite rides were easily The Mummy and Jurassic Park, which we rode a combined total of over 10 times! The Simpsons ride was probably the biggest let-down - the longest wait of the day, for the most unexciting VR-style ride.\n\nThe City Walk offers a good browse at the end of the day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Day Of Highlights", "As a solo traveller, the photographers at many iconic points helped capture a day full of wonderful memories, and the ‘single rider’ line sped the waits us enabling me to squeeze so much more in! The Jurassic Park ride and Special Effects show (commentsry by Russell) were total highlights. Be sure to sit toward the front for saturating fun at the clever Waterworld Stunt Show. ABSOLUTELY JUST GO!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great experience", "This is a great place to visit. And it’s nice that the whole family can experience the rides together instead of sitting in separate cars."], ["Reviewed 4 weeks ago", 5.0, "Wow wow wow", "This is my 2nd universal studios the other in Singapore. This one is a little bigger as it is actually set I. The studios itself. The studio tour was great, jaws, fast and furious & King king all great surprises along the way.\nHarry Potter world was the diamond of the day. The most well presented magical experience my 15 year old could wish for. Rides are amazeballs, wicked and intense. The atmosphere of the world perfect and movie accurate. Characters so perfect in there abilities. Wanda, owls, trains, shops and MAGIC. We where move than impressed with the entire Harry Potter Experiance.\nThe other worlds where also very good, a few places close for renovations, which made it easier to do universal in one day. Overall a worth while visit with hours of family enjoyment. We had a 8, 12, 15 year olds and it catered for all of them. Take some water with you and maybe pack lunch as every theme park food can be expensive. Parking costs $25 + for the day. Take notice of the floor and location. Also take note of where you came out of the parking lot. We where a few floors off when we went to the car.\nMy family would give this theme park a 9/10. So much detail it was amazing.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "We did the VIP tour", "Given we were here at a very busy time we booked the vip experience. Definitely worth it. We didn’t have a car so cannot comment on the valet. The buffet breakfast was very nice. We started off with the backlot tour which was really interesting as well as the prop dept. having front of line was definitely worth it. The buffet lunch was stunning!!! Had good seats at the shows. From memory there were only a couple of rides that we didn’t get to in the tour but you can use your passes for rest of day front of line. We stayed from opening til closing and had a fantastic day.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Great family day", "Spent the day at Universal had a wonderful time great shows Harry Potter world is amazing. We were there for the last night of the Christmas show on the castle and I have to say it was breathtaking. It was a very crowded day but there were plenty of restrooms food and places to sit.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Universal Studios", "Enjoyed seeing the TV show “Extra” filmmakers on-site with Mario Lopez. Most food was fast food and pricey. Enjoyed the Hollywood Studios tour. Admission Definitely to expensive for seniors."], ["Reviewed 4 weeks ago", 4.0, "Rides are all the same venue", "Very crowded for a winter day. The autobot ride was not working and yet they let us stand for 30 minutes before actually closing it. It's worth the wait you you get to ride as we did later. The staff on the ride were very apologetic and we feel it was a park management decision not to officially close the ride until it could be repaired.\n\nWe have been here several times and noticed the attractions have been updated where in the past (5 or more years ago) they were tired looking.\nShow less"]]}}