{"USS Midway Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "USS Midway Museum", "url": "/Attraction_Review-g60750-d531819-Reviews-USS_Midway_Museum-San_Diego_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/77/50/9a/uss-midway-museum.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "20330"}, "address": {"@type": "PostalAddress", "streetAddress": "910 N Harbor Drive", "addressLocality": "", "addressRegion": "California", "postalCode": "92101-5811", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Best of San Diego", "The USS Midway is fascinating for military history buffs (me) and those who have never been very interested (my wife). The veterans/docents on board are the best part of the experience and can’t be thanked enough for their service and dedication to this museum. Spending time with them on this beautiful ship and seeing the views of the harbor and downtown skyline are well worth your time and admission fee.\nShow less"], ["Reviewed yesterday", 4.0, "Experience this Marvel", "Very impressed with the magnitude of the carrier. Volunteers were somewhat helpful. Main deck was way over materialized with rides ets."], ["Reviewed yesterday", 5.0, "Mesmerising", "Again thank you Macy for half price entry. Surprising I really enjoyed this for 2 reasons. All the docents were charming and very helpful. The audio with real people telling real stories was at times overwhelming but airways fascinating."], ["Reviewed yesterday", 5.0, "Really interesting", "It is simply hard for me to imagine being on this ship when it was a working aircraft carrier. It's really an experience climbing up and down very tight stairs and thinking about living in this floating city."], ["Reviewed 2 days ago", 5.0, "Wonderful visit", "What an amazing place to visit. The size of this carrier was impressive. All the planes on display were interesting. The best part was the participation of retired airmen as docents. It was heartwarming to, listen to the stories of people who actually served in the carrier. The story of how the carrier became a museum was a further testament to how these airmen loved their careers and their ship and wanted to create a museum to honour the carrier really impressed us\nShow less"], ["Reviewed 2 days ago", 5.0, "This is so worth seeing!", "We visited this not expecting to see the fabulous museum that it is. There are so many aspects to this wonder that it would be hard to highlight any one detail. The collection of different fighter jets and helicopters on the deck alone are amazing. There is also numerous veterans on board to help explain things to you. A must see! Please allow a minimum of 3 hours for this tour.\nShow less"], ["Reviewed 2 days ago", 5.0, "Fantastic museum, an afternoon well spent.", "We visited the Midway this afternoon with our nearly three year old and our eight month old. We didn't take the pushchair (stroller) on advice we'd miss a lot so instead opted to put the youngest in the sling - he slept most of the time we were at the museum. Our two year old loved seeing the aircraft and been able to get in to some of the flight decks. We all enjoyed out afternoon and would highly recommend a trip here, very interesting. The head pieces were excellent too, made visiting with a toddler easier as you didn't have to stand and read for ages.\nShow less"], ["Reviewed 2 days ago", 5.0, "USS Midway Museum", "Well worth an extended visit of about three hours. Recorded commentaries and talks by veterans greatly enhance the understanding of the history and the technical details. It is necessary to visit the ship to comprehend its incredible size and complexity. The Flight Deck also offers outstanding views of San Diego Harbor and skyline.\nShow less"], ["Reviewed 2 days ago", 4.0, "Interesting", "The USS Midway is very interesting to your. However, I toured the USS Yorktown in SC and it was very similar. We came to the conclusion that you really don't need to tour more than one of these."], ["Reviewed 2 days ago", 3.0, "Interesting but big groups in tight quarters", "Decided to go the end of last year while it was still warm. It was a pretty interesting trip but the line was long and groups large to squeeze up and down narrow stairwells."], ["Reviewed 3 days ago", 5.0, "Fantastic attraction", "Spent 3 hours at the museum wandering through a very interesting tour.. Family friendly with wheelchair accessibility too. Staff and volunteers were all very friendly. A very enjoyable experience"], ["Reviewed 3 days ago", 4.0, "Visit with Grandson", "Had a great time with our grandson. He loved all that there was to do. All the staff was so friendly. Really enjoyed it."], ["Reviewed 3 days ago", 5.0, "A great way to spend a few hours", "Not our normal type of activity, but we were more than pleasantly surprised. Visitors are allowed to view almost all of the internal ship and with the provided headset we enjoyed the entire experience. The volunteer guides onboard are super friendly and attempt to answer every question they get.\nShow less"], ["Reviewed 3 days ago", 5.0, "A \"have to \" when visiting San Diego", "Anybody interested at all in the Navy, history, flying or ships will enjoy the visit. Be sure and arrive early and plan on staying 4+ hours. Lots of former sailors and officers volunteering their time to speak and explain and answer questions. Be sure and attend talks on flight deck operations.\nShow less"], ["Reviewed 3 days ago", 5.0, "Fun with teens!", "Went with family. Our teenagers are 13 and 14, a boy and a girl. We arrived at 11:00 and stayed until 5:00pm. We had an educational and fun day. Not once did the kids ask when we were leaving. I was a little nervous about that but it really held everybody's interest. The free audio tour was a must in order to learn about what we were looking at.\nShow less"], ["Reviewed 4 days ago", 5.0, "A great place to spend the day meeting ex servicemen", "This was a delightful experience . I got to share the day with my friend and his kids. got to meet ex servicemen and got to hear their experience . From the moment we arrived and were greeted at the ticket window by a charming and cheerful ticket agent. I do not have military experience but my friend served in Australia and it was great to see the two welcome each other and have a brief but enthusiastic conversation. Alone or with company this is a truly wonderful time spent touring the vessel. Value for money. Food and gift shop also available.\nShow less"], ["Reviewed 4 days ago", 5.0, "Great historical information", "The Midway museum is a must see in San Diego. The audio tour and the ship tour are narrated by military with first hand experience. The location offers a promanard along the harbor. There is a large statue depicting the famous sailor kissing the nurse to celebrate the end of the war and sculptures honoring Bob Hope. Altogether a must see in San Diego.\nShow less"], ["Reviewed 4 days ago", 5.0, "Excellent", "Just in case you guys read your reviews you are an example to all in how to run a good attraction in marked contrast to some of the National Park Service which seems to work very hard to stop you doing just about anything.\nWe particularly liked the tour of the bridge and the audio tour. Thank you.\nShow less"], ["Reviewed 4 days ago", 5.0, "Every American Must See", "An amazing tour. A definite must see. Be sure to catch the film on the Battle of Midway. Also pick up the device for the free audio tour."], ["Reviewed 4 days ago", 5.0, "great history lesson", "They did a great job of making the aircraft carrier into a museum. You tour at your own speed and there are retired folks to tell you more information."], ["Reviewed 5 days ago", 5.0, "So much to see!", "There's a phenomenal amount to see and do here. We were here for about 3 hours, and could have spent another 2 to read and see everything. Very informative."], ["Reviewed 5 days ago", 5.0, "Wonderful slice of history", "Well done true history living museum. Well worth a few hours. Walk around and feel the history. Nice place to have a snack outside."], ["Reviewed 6 days ago", 5.0, "Stepping into history", "Great way to spend 4 hours, there are many areas and each has a volunteer guide. The flight deck is massive and the ship give you the feeling of power. The visit to the bridge is a must as it give you both great views and the sense of how the Captain would have felt.\nThere are a variety of aircraft from different eras on the flight deck.\nShow less"], ["Reviewed 6 days ago", 5.0, "Military Gem!!!", "This is an amazing spot to spend a few hours. The narrated tour info along with the helpful volunteers make this is must see spot in San Diego."], ["Reviewed 6 days ago", 4.0, "A chance to see a aircraft carrier", "The us midway is now retired but it is no slouch. It’s rich history coupled with broad access to many areas of the carrier make it a great tourist stop."], ["Reviewed 6 days ago", 5.0, "Awesome Visit", "A great look at the important role the Midway played in WWII and Desert Storm. Highly recommend taking the “Island” tour. The volunteer docents are excellent. Allow plenty of time to see the ship and don’t miss seeing the movie “Battle of Midway”."], ["Reviewed 1 week ago", 5.0, "Love The Midway", "We had an awesome visit on the Midway! I love the volunteers who are very knowledgeable about the ship. Brings back memories of when my husband was active duty military."], ["Reviewed 1 week ago", 5.0, "A must see attraction in SD", "We were very impressed with this tour and the knowledge and passion of the Staff who were ex military. We were 4 hours in total taking time to watch the videos, listen to the lectures and read exhibits - also sat in a simulated jet ! Was so reasonably priced and gave an excellent insight into life on board - on site cafe, shop and toilets.\nShow less"], ["Reviewed 1 week ago", 5.0, "Reviews speak for themselves", "What more can be said. It was a great experience. We spent 4.5 hours touring the ship and could have spent more if we had planned better. We went in mid February and a volunteer told us they average 1700 people per day this time of year. In prime season they average about 7000 visitors per day. He said that to see 'the bridge\" during prime season you have to get their early as this involves a tour, the lines get long and only a limited number of people are allowed on each tour due to close quarters....just a word of caution.\nShow less"], ["Reviewed 1 week ago", 5.0, "A definite place to go if you're in San Diego. Various aircraft adorn the flight deck plus a fabulous bay view.", "A definite place to go if you're in San Diego. Various aircraft adorn the flight deck plus a fabulous bay view. You can see some of the internal of the ship and there is a restaurant at the stern of the ship. Met a WWII veteran volunteer who thanked me for my Vietnam service. Imagine. For most people, I believe the Midway is a must see in San Diego.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating!", "We all truly enjoyed several hours touring around the USS Midway, what an eye opening experience. If you go, make sure to catch the movie if you don't know the story behind Midway."], ["Reviewed 1 week ago", 4.0, "More of an Army guy but this was cool.", "Even though I my favorite military museum is the 1st Cav museum at Fort Hood, it was interesting for me to roam around the Midway and see how my brothers on the water live and work.\n\nWhen you visit the USS Midway, keep in mind the battle it is named for and the brave men that sacrificed all for victory at the Battle of Midway. If you don't know the story of what happened there, you owe it to them to do some research and understand what those guys did. Very humbling to contemplate the decisions they made knowing they would not survive.\n\nKudos to all the people that put their hard work into restoring and maintaining this museum. You can see it was a huge effort and the love that went into it is obvious.\n\nThanks Navy.\nShow less"], ["Reviewed 1 week ago", 5.0, "'Murica!!", "This was my first time touring an aircraft carrier. My husband was the reason I went and I am glad he convinced me. It turned out to be very informative. I think we spent about three hours on the USS Midway. Discounted admission for law enforcement and active military. Even though it was not posted, retired military also received a discounted admission.\nShow less"], ["Reviewed 1 week ago", 5.0, "Well worth a visit", "Amazing experience,recommend to any one visiting San Diego . Much impressed with personal audio commentary."], ["Reviewed 1 week ago", 5.0, "Super Informative!", "I have lived in San Diego my entire life and never visited the Midway until recently. I am so glad that I did. This historic ship was awesome. It was so informative and fun to walk through the ship and listen to the old timer veterans speak.\n\nIt is pretty crowded so if you can get there early it's better because it can get pretty hot and annoying down below with so many people walking through, but it's still worth it!\n\nI highly recommend the Midway Museum but be prepared to get into some pretty tight spaces and do a lot of walking.\nShow less"], ["Reviewed 1 week ago", 5.0, "Worth the Walking", "I have to admit, I was not overly excited about the Midway Museum; I wanted to go shopping. My husband was interested in it, so I gave in; have to tell I was very impressed, lots of walking but worth everything we saw. Extremely glad we did it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Go here when in San Diego", "Awesome place to visit. You can feel the history as you enter the aircraft carrier. Great tours given by retired Navy personal. Plan on taking lots of pictures as they have many planes and helicopters to view on board."], ["Reviewed 1 week ago", 5.0, "Highlight of the vacation", "This was absolutely the best part of the vacation. The experience is amazing and truly a great group of volunteers who help provide such a wonderful opportunity. A true labor of love.\n\nWe started on the top deck and worked our way down all levels. We easily spent five hours and didn’t even read or listen to all the audio opportunities. A well organized exhibit and a must see!\n\nWe can’t thank our military service folks enough for all they do. Thank you!\nShow less"], ["Reviewed 1 week ago", 5.0, "Great experience!", "What a great experience!! I was there with my husband, daughter and mother in law. My father in law had served on the Midway in the 50's so it was so moving for my mother to be able to walk around and talk to the volunteers. We were also able to talk to Robin in the 'library' who was able to find my father in laws name in the records.\nAlso, if you like old military planes and helicopters they have them all. Enjoy!\nTake the time to see this beautiful piece of history...you won't regret it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Awesome", "What a great place to take the family. So much history and things to see. I love all the history and seeing the kids faces. I am here on business but will be bringing my family on a trip."], ["Reviewed 1 week ago", 5.0, "If you love aircraft, large ships or history this should be first on the list", "This is a great place to visit to experience part of American history. The self guided tour is very well done plus there are tour guides when you visit the bridge. If you are a veteran and 55+ it is the best deal in town."], ["Reviewed 1 week ago", 5.0, "Worth a visit, takes a few hours to see", "Good museum, lots to see on the ship and lots of walking. Spent 3.5 hours there but definitely could have spent more time there."], ["Reviewed 1 week ago", 5.0, "Great", "Have been here in past before kids and still have same feelings about. Proud, in awe and excited are fair descriptions of carrier and aircrafts. Thankful for all that have, do and will serve for others. An easy reminder of profound selflessness and greater good."], ["Reviewed 1 week ago", 5.0, "Top Gun viewing on the deck!", "Great ship, great museum, convenient parking. If you like planes, this is a no brainer. As a female pilot, I was in heaven!"], ["Reviewed 1 week ago", 5.0, "A Must See Experience", "Having served on this historic naval vessel, I was proud to bring two friends onboard for their first experience. Since my last trip over two years ago, the museum has open up so much more of 5he carrier. It is an exceptional education experience for all ages. Where comfortable . No flip flops or . Give yourself 4-5 hours for a great time\nShow less"], ["Reviewed 1 week ago", 5.0, "Well worth it!!", "I didn't think I would enjoy visiting the Midway as much as I did! It's a great experience! The people who run the tours and give information are all veterans - some of whom worked on the Midway when she was in service. Take at least half a day to wander around the ship!\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating and great value", "Had a lovely tour round the mighty USS Midway, audio tour was excellent and educational . Plenty too see and do could spend all day here ."], ["Reviewed 1 week ago", 5.0, "Amazing History", "$23 entry for an adult and very good value. The best thing is there is a large carpark right next to it and you can park all day for $10. We spent many hours walking all over the ship and attending many of the attended tours/presentations that take place in various areas. All the guides were veterans and could add first hand experience to their tours/presentations. It was like taking a step back in history, helped by all the various planes they had below and up on deck.\nAll in all a very rewarding visit that makes you realise the sacrifices people make to keep the peace and make a better world. There is a lift and cafes and toilet facilities.\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting!", "I didn't think I would enjoy it but it was actually very interesting and fun. Learning new things and understanding what goes on in the military was eye opening. I recommend this for people who love history, the military, and anyone who just likes learning new things.\nShow less"], ["Reviewed 1 week ago", 4.0, "Interesting. Tour", "Did the tour today on the Midway. Very crowded, toured the Constellation in Charleston, SC and this carrier seemed a bit more commercialized."], ["Reviewed 1 week ago", 5.0, "men and women who worked on it are there guiding visitors.", "It is an atraction in San Diego that you cannot miss. As an aviation enthusiast, i can tell you that the Midway is an experience to visit. It is very well kept and you will find explanations to every thing you can see and touch."], ["Reviewed 1 week ago", 5.0, "Amazing history! Must see!", "My husband and I thought this tour was AMAZING! So much to see! LOVE that there are docents present to educate and talk with the guests and the docents actually served on the ship! It’s so interesting and full of history. We had an audio tour that we enjoyed throughout our visit that was wonderful... apparently the audio tour is fairly new? The audio tour is included and we highly recommend it. Make sure you don’t miss the guided tour of the bridge on the island/superstructure. It is a must see. Make this museum a part of your stay in San Diego. Take your time and try to see as much as possible.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fascinating view of life on a carrier!", "This is well worth your time. Be sure to view the touching movie that tells about the Battle of Midway for which the carrier is named. Knowledgeable docents are scattered all over the ship to answer questions. On our Bridge tour we were honored to have a retired Captain of the Navy lead us. One tip: buy your tickets online and skip the line.\nShow less"], ["Reviewed 1 week ago", 5.0, "Fabulous opportunity for history and knowledge", "This was one of the best things we did while visiting San Diego. I had never been on (or near) an aircraft carrier before and the sheer size blew me away. We started with the presentation on the Battle of Midway, which the ship was named after, which was very informational and good background The tour shows you the bunk area for enlisted men as well as quarters for higher-ups and much more - mess hall, infirmary, all the things that had to be in place for a ship carrying a crew of 4,500. The vintage planes on the flight deck are a great representation of air power over the years. The Midway first sailed in 1945 and its entire life has been very well represented. The docents on board add a great deal to the tour; everyone I talked to had served on the Midway and had personal recollections that really deepened the experience. It is a great opportunity to learn more about our country - a must-see!\nShow less"], ["Reviewed 1 week ago", 5.0, "Awe Inspiring", "Anyone who ever visits San Diego should take the time to experience the USS Midway Museum. It's sobering and is a stark reminder and recognition of the many who gave so much to ensure that we can continue to enjoy the freedoms that so many take for granted.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great for everyone.", "We arrived when open and it was already busy. This will take you at least four hours if not more. Wear comfortable shoes and if you can not do stairs, it may not be worth your money. Lots of veterans on board to answer all your questions. Thought the gift shop was way over priced. They do have a small café on board. If you are a history buff, this is worth it.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great to see", "Really enjoyed looking over this fabulous aircraft carrier. Amazing to see how the sailors lived & worked. The size of te ship is huge. A real eye opener. Well worth a visit."], ["Reviewed 1 week ago", 5.0, "Flying visit", "This was an incredible visit with lots to see and plenty of history that you can immerse yourself in. The internals of Midway are a sensory overload and provide a valuable insight into life in the Navy."], ["Reviewed 1 week ago", 5.0, "Why'd we wait so long to do this...?", "After living in So CA for, well, decades, my wife and I finally took a day to discover the USS MIDWAY. Could not say enough of the docents, who had knowledge and were, for the most part, great storytellers. It gave us both a much greater understanding of what our servicemen went through to protect and serve our nation. Lots of walking but absolutely all at your own pace. Take a day and be amazed.\nShow less"], ["Reviewed 1 week ago", 5.0, "Carrier Group / Fixed Wing!", "Took a half day, needed more time and will go again. Let me give you the rundown for some of the great things to see and do on the USS Midway.\n1. Flight Simulators, they have 4 of them now, and yes it's cost $8, but well worth it. You really do get the sense of flying in these ultra modern sims.\n2. The 15 minute movie a the theater that talks about the fighting at Midway Islands. The movie can bring a tear to your eye, but it's not full of blood and guts, just a true story of how America fought an enemy that had it outnumbered.\n3. The planes on the flight deck, so many aircraft including helicopters and a catapult that launched these aircraft.\nThere is so much to see and do, for the kids and for adults. When you walk in they have a self guided tour with an audio player that you point at the way points to hear the story. If you have your ear buds/ earphones you can plug in for a total immersion or you can simply hold the device to your ear and listen to the story. They have three levels, Flight Deck, with Capt's bridge tour, it's included in the price of admission, and the hangar deck along with the crew quarters on the third level below. Also there's your gift shop and cafe right off the rear of the ship. Food is a little expensive but for the convenience and selection it's not bad. They have wraps, salads and other fare...sorry kiddo's no french fries, but they serve starbucks so give it a go. Tip... get there early for parking, that parking lot fills up fast, and it's only $10 for the whole day, street parking is $2.50/ hr 3 hr max.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great visit", "One of the best carrier tours around. Docents explain the ship's workings. Lots of passages to explore. Head for the bridge first thing. Lots of stairs. Great history of the carrier and the men who sailed it"], ["Reviewed 1 week ago", 5.0, "Well worth it", "This was much more my husbands treat, but I still found stuff to interest me. Fair price to get in and there is so much to see. I particularly enjoyed the talks from the guys who had worked on the carriers, very enlightening."], ["Reviewed 1 week ago", 4.0, "Historially interesting", "Nice tour. Lots of tight spaces gives you the feel of what it was like in real time. Upper deck with the planes was very interesting. Nice that there where volunteers all around to answer questions."], ["Reviewed 1 week ago", 5.0, "Fascinating Information and Experience", "This is a must-see for anyone who appreciates our military personnel, aircraft or ships. Information is provided through audio, visual and written forms. You can see a variety of planes and helicopters up close and hear descriptions of how and when they were used and stories from pilots, etc. I enjoyed open presentations by a couple of pilots about how they landed planes on the flight deck every 45 seconds during war time and how planes took off after attaining 700 pounds of pressure to break their holding pins. Incredible! My only regret is that we only allowed for an afternoon to see the Midway Museum. I would have enjoyed spending the whole day there and seeing everything. We went on a Saturday and it was very busy. Weekdays looked less busy when we were in the Harbor area again.\nShow less"], ["Reviewed 1 week ago", 5.0, "Midway Aircraft Carrier Museum", "This ship and it's aircraft are a wonderful experience for anyone interested in understanding Naval Aviation and life aboard ship. The staff are outstanding and it's a great experience in a convenient place in downtown San Diego. Great views of the entire bay! Highly recommended."], ["Reviewed 2 weeks ago", 5.0, "Great activity", "I loved visiting the Midway. Take e time to take the docent tour of the top of the ship. The area on the lower levels - kitchen, laundry, bunks, etc. is also fascinating."], ["Reviewed 2 weeks ago", 5.0, "Volunteers are magnificent", "We had a tremendously meaningful and highly impactful visit to the USS Midway. The carrier, aircraft, technology, facilities, planning, history, information etc are all of the highest order. But what takes this to a completely different level are the magnificent volunteers who provide tours and are happy to chat / answer questions in the most engaging way.\n\nThey really were all remarkable. We had wonderful conversations with Bill, Art amongst many others and learned so much. A really incredible experience.\n\nThe volunteers are outstanding. For what they did and what they do.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Navy Air craft Carrier Museum", "Wow! Wonderful! A must see! Demonstrations of how planes land and take off! Many different air craft on display as well as narration! Educational and very awe inspiring!"], ["Reviewed 2 weeks ago", 5.0, "Great dont miss", "Great visit , all day , dont missthe original pilots on landing / takeoffs great stuff . All the personell are original navy personell , dont forget to thank em all"], ["Reviewed 2 weeks ago", 5.0, "Wasn't sure what to expect; got much more than I ever hoped for!", "I'm typically not into tourist attractions. So i wasn't thrilled about visiting the Midway, but went along for the ride just to be nice. Three hours later, they pulled me kicking and screaming from the flight deck, as we had to get going. I could easily have spent another 2 hours there. It was an outstanding experience, enhanced by docents who aren't just well-educated - they are the people who actually served on the ship. Ad they tell their educational stories in the first person. Truly fascinating. I expect to go back int he next couple of weeks - but this time I'll spend the whole day taking in the whole experience. Needless to say: highly recommended!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Party on the Midway", "We were invited to a party on the Midway with a wonderful bunch of Naval Aviators (Retired) One of the most memorable nights of our lives. The museum staff are the best and really know their business. It's also a moving experience."], ["Reviewed 2 weeks ago", 5.0, "Wonderful!", "This is the second time we’ve been here and we learn something new every time. You can not believe it until you see it!"], ["Reviewed 2 weeks ago", 5.0, "Absolutely Must Do", "I tagged along to the USS Midway because everyone else was interested, but WOW - I was blown away. This is an absolutely must do in San Diego. Purchase tickets online in advance so you don't have to wait in the long line on-site. Also, if you are planning on parking there, then go first thing in the morning to find a spot in their pay lot. My favorite spot on-board was the \"ready rooms.\" They would be easy to miss, but be sure you check them out!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent attraction", "If you're young or old, this is an excellent attraction for everyone. We had a great time visiting the ship,"], ["Reviewed 2 weeks ago", 5.0, "So BIG", "This is an amazing aircraft carrier. It is huge. We really enjoyed walking around and listening to the audio tour and the many docents who shared the history of the ship. Many of the docents had actually served on this ship"], ["Reviewed 2 weeks ago", 4.0, "totallt awesome", "Viewing this ship and planes, was so cool, we had a wonderful time out there, beautiful day ,viewed a lot of Navy Ships, this was a really nice experience."], ["Reviewed 2 weeks ago", 5.0, "Simply fascinating", "Loved the USS Intrepid in Manhattan, but this was even better! Spent 5 hours there and still did not get to see all parts. The veteran talks were great."], ["Reviewed 2 weeks ago", 5.0, "Must See", "USS Midway Museum was a wonderful piece of history to visit. The self audio tour is a must and enjoyed the numerous volunteers stationed around the ship."], ["Reviewed 2 weeks ago", 5.0, "Lots to See!!!", "We did the Midway Museum after our Hop On/Hop Off Tour. We were there about two hours. We were told you should allow 3-4 hours. You get a wireless audio speaker and you can listen to short presentations about the planes, etc. We listened to a talk about catapulting the planes. It was very interesting. All the guides/docents are veterans. The Midway deck is huge (as you can imagine) and then we did a below decks walk through with the wireless audio. We found 2 hours was great for us. For someone really into the navy and ships, you can spend as long as you want.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An Amazing Piece of War History", "Be sure to wear good walking shoes! This ship is HUGE! It's such a spectacular site to see and worth every minute spent viewing it! Take your time and take in all the amazement and wonder this ship holds!"], ["Reviewed 2 weeks ago", 5.0, "Lots to see", "An aircraft carrier is BIG and the and first and foremost the museum let's you take that in and experience it. There's more to this museum than cast off military equipment. They do a nice job of emphasizing the human side amidst all the hardware. The many mannequins are well done. Sometimes I was startled when I realized they weren't real people.\n\nI was in San Diego for a conference and I'm glad I took the time to visit the museum.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome day in San Diego!", "Excellent place to spend multiple hours. It gets fairly crowded, but there is plenty of space! Make sure to take advantage of the self-guided audio tour. It is a wealth of knowledge. Check groupon for discounted entry tickets."], ["Reviewed 2 weeks ago", 5.0, "Could spend all day here", "The midway is a great place to visit. We parked right in front of the midway for $10 and even walked over to the nearby restaurant for lunch leaving our car their without having to find a new parking spot so that was a deal. My group consisted of 3 kids under 5 as well as their grandparents so we only spent 2 hours here. We explored the main floor and then the flight deck, unfortunately never making it below. I think the flight deck was a great place for the kids (bring hats as it’s sunny and little shade), but we liked going in the open plane on the deck as well as exploring the pilots cabin which was quite large and I feel gave us a bit of the underneath experience. I would love to come back here someday to check everything out more.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Must see while in San Diego!", "An up close and personal view of a piece of American history. Immerse yourself in naval history aboard a city on the sea. Great location, immaculately preserved, tribute to all who served."], ["Reviewed 2 weeks ago", 5.0, "Very informative visit", "The self guided audio tour was very good and the docents added their personal experience of serving on such an iconic warship. I particularly enjoyed the visit to the flight deck with its collection of warplanes and the explanations of launching and retrieving the aircraft."], ["Reviewed 2 weeks ago", 5.0, "So much to see!!", "There is a lot to do and so much to see! The kids loved it! It's very clean and it's a great experience to be near so much history!"], ["Reviewed 2 weeks ago", 5.0, "Great History Lesson", "The yellow-hat veterans are a great source of information that made the tour incredibly interesting. A must see for all ages."], ["Reviewed 2 weeks ago", 4.0, "A Lot of History in One Place", "Had the honor and opportunity to visit this historical carrier - plenty of exhibits to read and view. From the underside of the ships quarters to the top deck to view the history of aircraft that used the Midway to win wars, you'll learn a lot. Plan to spend a few hours with all there is to do.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Very Interesting and interactive.", "This retired aircraft carrier has displays throughout it's hull of the planes, people and technology used. It was eye-opening to see how they lived and how our technology has changed since this ship was launched and updated through it's 30-yr career. Even my wife found it interesting.\n\nThere are flight simulators that you can ride, exhibits in the mess halls, manikins sleeping in berths. You get a great idea of how the crew lived and worked.\n\nIf you book online you save 10%. If you can't see it all in one day, they will give you a pass to return the next day for no charge.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great volunteers", "So I'm not sure I would rank this place over the zoo, but we really enjoyed our visit. The \"yellow hats\" who are volunteers, many of whom served on the Midway or another carrier, were incredibly knowledgeable and interesting. As with any docent core, they ranged from helpful and funny to more than vaguely misogynistic, but the sheer number of them meant that anywhere on the ship that you had a question, it could be answered. The audio tour was also very good - kept you moving along while being informative and engaging the visitor in real stories that were funny or poignant or sad but kept you interested. Allow for a lot of time there, as it takes quite a while to see the whole ship.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Wow", "I am proud to be an American and humbled and grateful that men and women protect us night and day in this amazing ship."], ["Reviewed 2 weeks ago", 5.0, "Impressive!!!", "Not a lover of military museums, but this one impressed me deeply. The guides (\"the yellow hats\") know what they are talking about from the first hand! Take a free audio guide and enjoy the stories of a life on a ship! Awesome experience!"], ["Reviewed 2 weeks ago", 5.0, "Amazing", "Once you get on board you get a little box with a speaker and you hold it to you ear for an explanation of each of the areas. You place the little box where you see the sign and listen for an explanation. The little boxes come in various languages. The audio tour is self guided. My recommendation is go early for the best experience. Allow for at least 1.5 - 2 hours. Some of the steps going down to the lower decks are a bit steep. On the flight deck are 2 areas where they are covered and a gentleman gives a brief explanation such as launching and landing. A person can also visit the island on the top of the ship.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Midway Don't Miss", "Get discounted tickets online. Make sure to do the island tour and both of the narrated presentations on the deck. The veteran volunteers are so awesome I would give a 6 star rating. Overall spend half a day. Very informative. In addition there is free audio\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Outstanding military museum!", "This has got to be among the top three military museums in the USA. I’ve visited plenty of military museums since I retired from active duty and I am easily impressed. However, the Midway museum is a must see if you are San Diego. The self guided tour takes through the entire ship, not just the topside areas that most floating museums relegate you too. The first hand accounts by retired veterans really brings the tour to life and gives you a different perspective than otherwise would be achieved. The ship is in extraordinary condition with plenty of displays throughout.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Huge ship", "Wish the weather was better as we would have loved to spend more time on the ship. Great guides, great talk about landing on a carrier."], ["Reviewed 2 weeks ago", 5.0, "Worth every penny and then some", "Expert guides and explore as your please atmosphere. Come early before it get crowded to do the simulation flying activities."], ["Reviewed 2 weeks ago", 5.0, "Our large business mtg group had dinner on the midway! Excellent!", "As a museum you can’t beat the Midway. Depending on how much time you have, it’s an incredible opportunity to learn about this air craft carrier and life aboard. I could spend all day...by the time you go below deck etc.....the day is gone.\n\nOur group had a dinner event in the evening. Plenty of room for our very large group. Multiple food stations with a great variety of items....from Pasta, Tacos and Carvery setups. Also had a couple bars open for us with beers and wine. The food was great. For a catered dinner... I was really pleased.\n\nThen there were plenty of docents available for tours on the flight deck. Incredible hearing how things worked, the history and stories of this carrier are amazing.\n\nSo whether your on your own, with your family or doing a business gathering, the Midway is a wonderful option.\n\nDon’t hesitate!\n\nEnjoy!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Don’t Miss This! Leave Enough Time!", "Go yourself or take the family. Do not miss this opportunity to get on a real aircraft carrier.\nThe docents are very knowledgeable and helpful.\n\nSee how the troops lived. Explore the planes and walk the runway. There are elevators to move you from deck to deck if you cannot take the stairs.\n\nYou need to be there at least a few hours if not more. It is too interesting and too much a part of modern history not to give the visit the time it deserves!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must see.", "A piece of history you can walk through. A lot of the volunteers even served on the Midway so talk to them and ask questions they’re very knowledgeable. Take the time to really enjoy your tour. I could have spent the whole day there if we didn’t have other plans, we will definitely go back again.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Not just for the Boys!", "It was a fabulous opportunity to explore an aircraft carrier and get a glimpse into what life would be like out at sea in peace times. I found the kitchen and catering facts particularly fascinating. Something for everyone."], ["Reviewed 2 weeks ago", 5.0, "Very interesting museum. Highly recommend!", "Ok so I admit my husband and I enjoy museums. My husband especially enjoys museums with historical significance and this is one of those. Although we’ve toured a couple of battleships, this was our first tour on an aircraft carrier. Let me just say it was fascinating. Excellent display of aircraft. Exhibits are very well done with audio commentary on displays and stories told by servicemen that were aboard. Allow at least 4 hours if you want to take advantage of all that’s offered.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Interesting Museum", "Very educational, easily spend an afternoon. Kids and adults have a lot to see and do. Highly recommended."], ["Reviewed 2 weeks ago", 5.0, "Every visit to San Diego we come back here", "Even if you love airplanes (like me), or not, you and all your family will enjoy their visit here, the USS MIdway Museum is located in downtown San Diego, in a Navy pier, this is a aircraft carrier, with real airplanes park in the top, incluide my favorite F-14 Tomcat (yes, the same from the movie Top Gun), as well as other ones, helicopters, etc., you name it,from kids to old ones, will enjoy this place, they give you audio guided incluided in the price, so you walk at yout own pace and learn about many things, they have also, restrooms, and a cafe, and several things to do, ike flight simulators (extra charge), plan around 3h here, at least.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "The floating city", "We went to the USS Midway with our PME Legend group while visiting San Diego. It was awesome to see this USA war vetereran and learn it’s history. You really have to take the time to see it all. Beautiful exhibition in total. All the planes ; cabins ; corridors ; the bridge ; flightdeck ; the view ; etc. Hours to spend here. All the staff are really awesome and answer all of your questions with passion and proudness. Ever want to know about life on a flightdeck carrier, this is the place to go.\nFelt honoured to be here.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Real Surprise", "I must admit it wasn't something I thought I'd be interested. I was surprised. It is very well done. The staff and volunteers were really helpful but the real star is the USS Midway. Great access on board from the dental surgery to the jail. Plane simulators and entry to helicopters. A good four hours plus - very good value for money.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "An experience to remember.", "Recommend visiting the USS Midway to anyone. Fascinating to see such a huge ship with all the advanced technology from 70 years ago."], ["Reviewed 2 weeks ago", 4.0, "Great historical site", "This is a cool place to visit for anyone interested in naval history, or if u want to see planes and an aircraft carrier up close & personal. Definitely walk through the lower areas to see the galleys, laundry and get a sense of what life was like aboard the carrier. Docents on board have great stories / knowledge to share.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "a must see", "was here before a cruise and was it worth it. When you think of the men (women) that serve and the conditions they deal with it is humbling. It was nice to meet some of the men that served on the Midway as well. Just go and experience this floating museum.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Awesome museum and very interactive!", "This place is great, you really get a good feel for what it’s like to be on an aircraft carrier and the thing is massive. There’s tons of history on the ship including several historical fighter jets and helicopters. Really fun to see and it’s located right in the harbor so the views of the ocean and the city are great!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A must-see in San Diego!", "If you're debating whether or not to go to the USS Midway, just do it! You will not be disappointed. I realize it's not for everyone, but if you even think you'd be interested, you'll enjoy it. They have an F-14, like the on in Top Gun! You don't have to see everything, so you can basically take as much or as little time as you want. We also did the flight simulator, which was a lot of fun. Tip: Empty your pockets if you do the flight simulator!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Best $20 worth in years!", "Fantastic tour. Really interesting with so much to see and great volunteer staff. Everything about the ship is really good. Highly recommended and great value for money."], ["Reviewed 3 weeks ago", 5.0, "What a great day aboard the USS Midway!", "What can I say... we had first thought that we would spend a couple of hours touring the USS Midway, but after five and a half hours we still wanted more. We went online on the museums website prior to visiting the Midway and got $2 off per person for the Museum tickets online. We arrived at 10 a.m. and were there until 3:30 p.m. and we even missed part of the ship including the Laundry, Hospital and Chapel. It was so interesting talking to all of the former Seamen who were scattered throughout the ship and all wearing Yellow or Red Hats to identify them to the General Public.\n\nIt was fascinating to see the workings of a decommissioned aircraft carrier and the technology that was involved even after 20 years of being decommissioned. It was impressive to say the least. I can't even imagine what a current nuclear-powered aircraft carrier would be like today... it would probably be overwhelming!\n\nI would go back in a heartbeat, but next time I would plan to spend at least seven or eight hours touring the ship to see everything. It was well worth the $42.00 for my wife and I to tour the USS Midway.\n\nI can't thank the Volunteer Seamen enough for giving us information about the ship and what daily life was like aboard the ship while at sea.\n\nNext time I am back in San Diego I will be going again to the museum of the USS Midway.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Outstanding Museum", "A must see in San Diego. Beautiful aircraft carrier. The staff goes out of their way to please you. Many aircraft on deck and below. You get to see everything."], ["Reviewed 3 weeks ago", 5.0, "A little piece of history!", "I think this is a must do in San Diego. There is so much history there, from such an important time in the history of the world. The museum is very well done."], ["Reviewed 3 weeks ago", 5.0, "USS Midway a brilliant museum to visit", "I visited the Midway on Australia Day this year, it was the best warship museum I have ever visited very well presented with examples of all naval aircraft showing the history of naval aviation."], ["Reviewed 3 weeks ago", 5.0, "Great experience", "I've spent 5 hours on the USS Midway and wasn't bored for a single second. Highly recommended! You can talk with any of the former sailors all over the ship and they will tell you more details and their own stories."], ["Reviewed 3 weeks ago", 4.0, "Pleasantly surprised", "This was something my husband wanted to see and I was happy to go along even though I expected dry and boring. There was plenty for both of us. My husband got to see all the technical stuff and I enjoyed the more human aspect of things. We both enjoyed the personal stories of those who served on the ship and I enjoyed seeing things like the mess, the laundry and just generally how they lived. We spent about 3 1/2 hours and that included lunch and some time trying to find each other. The price was reasonable. Would highly recommend this museum.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A moving experience", "It was a privilege to go aboard and tour the Midway. It’s a well maintained and well staffed museum with much to see. Photo ops are everywhere and when you’re finished with your tour you definitely feel a sense of pride and patriotism. Our son served in the Navy and it was great to get a sense of how he had served on the Lincoln in the ‘90s\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Become a member!", "This is an extraordinary SD attraction. We became members immediately upon our first visit. The ship is fascinating as are the docents. The special events are numerous and all worthwhile. Don't miss it!"], ["Reviewed 3 weeks ago", 5.0, "Great way to show my kids what life was like on an Aircraft Carrier", "Great trip to live the past. The men who served on Midway give great stories of their time on the ship. Also had a chance for my kids to see what life is like on an Aircraft Carrier when I served. Also overlooks Coronado which is a great view.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must do tour in San Diego", "All of the docents are veterans and they make the tour so interesting. I thank them for their service.\nThere were so many aircraft that had served were there. The best part were the recordings you listened to made by pilots who flew them telling interesting stories of their harrowing tales.\nThe tour of the bridge, the island structure, gave you the experience of running all the facets of a Carrier and the flight line.\n\nThe absolute best tour I have ever taken. Period!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Midway Museum", "To tour the entire museum, which we did, you need 3-4 hours. It’s very interesting, especially if you had never toured a ship before. We toured the ships at Pearl Harbour so I found a lot of it the same. Midway, is , of course, much bigger The landing strip and different planes was unique. Worth a visit.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Excellent education opportunity.", "This was our second time aboard the Midway and we still learned things. This time we took our 9 yr. old granddaughter even though it was not a glitzy fun entertaining event she still enjoyed it and learned lots. She had a hard time imagining planes taking off and landing on a ship.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Perfect for a day out with the family", "The Midway was a great way to enjoy the day with our grandkids. It is a self guided tour so you can take your time and enjoy each step of the way. Easily negotiable for those handicapped or tired little feet. Pictures taken while on board make nice mementos. There are snack bars and other areas to eat on board but you are so close to Seaport Village shops and restaurants they are worth the short walk. Parking can be a hassle and expensive but if you arrive early it's not a problem.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "What a great tour on an aircraft carrier", "Awsome tour !! All the planes and exhibits had narrations of one kind or another and the ones with veterans who served on the carrier during Vietnam and flew the differn't planes was special. They were very prowd of their service to our great country and their service aboard the midway. We live in San Diego and got hometown passes and took our out of state visitors and paid their fee only so it saved us some money also. Come early, we spent 6 hours and still didn't see all of the carrier\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Awesome Museum", "We hit a day when it wasn't terribly crowded. They provide a listening device that hangs around your neck that activates at each exhibit. I took my own headphones to cut the ambient noise.\n\nI found the tour of the island tower the most interesting. Be prepared, though, for steep stairways and low overheads.\n\nAll the docents we met loved talking about the ship. Just be friendly and interested, and they will give you background information and draw from their personal experiences.\n\nBe sure to view the \"kissing statue\" down the harbor from the Midway.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Very interesting tour", "It was a lot larger than I had expected. My husband really enjoyed it, there is a lot to see on the ship."], ["Reviewed 3 weeks ago", 5.0, "The guides really make it. Must see in San Diego", "We really enjoyed our visit to the USS Midway. Absolutely amazing museum. I went thinking it was going to be a floating aircraft museum, which would have been fine. But it was quite a bit more. The exhibits were set up to give a glimpse into life aboard a carrier like the Midway.\nThe audio tour was excellent. The audio program was narrated by former servicemen who had actual stories to tell about the exhibits. For instance, each airplane had a short interview with a pilot who flew one of those planes.\nThe docents, the guides in yellow hats, were truly the highlight, though. Their enthusiastic stories really made presentations come alive. My favorite was the presentation from Mr Jim about how the planes were launched by the steam catapult. Hopefully when you visit, he will be there.\nDefinitely budget plenty of time for your visit. 5 hours is not quite enough if you go at a leisurely pace and talk to the docents.\nThoroughly enjoyed it and would definitely visit again.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow! Information and interesting", "Great displays and well curated walking tours. Must see! Behind the scenes operations of an aircraft carrier. The logistics are incredible to keep this type of operation, ship and naval family operational. We learnt so much. The yellow hat presenters - retired navy - were so willing to share their knowledge and ensure all questions were answered. They made the day even better!\nBe prepared- this is a walking tour that may include tight spaces with many stairs. Some elevators are available.\nGreat interactive family activities are available.\nVery enjoyable learning experience.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A really informative day", "We went abourd early morning and spent all day. Previous experience told me go right to 'the Island' early and do that tour because it gets a line later on. The Audio guides are new now and seemed to work okay but in the sun the scan was a bit tricky to get to work. On the deck there are many different airplanes - some you can go in and several veterans giving amazing talks about take offs and landings. These guys are really great. Below deck you can wander about in the open areas and see the living areas, medical part and where the flight crews were givin final instruction. There is an expensive cafe at the back of the boat. In the main hall there are many seemingly popular simulators. We wandered about all day. Parking is easy at the dock where the boat is tied upto and the ticket counter is right there. A great day - bring you camera!!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Well organized attraction", "The tour is very efficient and orderly. You where a device around your neck which when you touch to displays a recording tells you about what you're seeing. There are lots of retired volunteers who give you more information and do mini talks. They were very informative and helpful. There is lots of parking downtown on either side of the ship. We parked a few blocks away and paid $6 for the day. There is nice walking at the harbor and you get too see lots of boats, ships and yachts.\nThe ship has 3 levels to see and don't miss the lowest level with the mess hall and engine rooms. It was all very informative even for someone not very interested in that sort of thing.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Four hours is not enough time", "A group of us went the day after a Marine Graduation. For those of us who were truly interested and wanting to participate in tours and lectures by the docents, four hours was not enough. Some in our party had breezed through and were ready to leave. However, in four hours, a few of us only managed to check out the hanger deck, flight deck and bridge. We never made it to the engine rooms or mess deck, and we probably would have liked to do another cruise through of the hanger and flight decks as well. Most of the docents were either once stationed aboard the Midway or served time in the Navy aboard another carrier. If you're a true history buff, Maritime or Aviation buff, you should plan to spend every moment they're open aboard. Unfortunately, we had to head out for a 4+ hour drive home. Many of us plan to return to see the lower half at some point. They also have simulators you can pay additional for to ride in, as well as a lot of aircraft you can walk through and/or sit in. The kids really seemed to enjoy getting in all the seats of various aircraft.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Historical musuem on Naval ship", "Lots of planes and interactive planned for young children The docents are former naval pilots and we're very informative and helpful. Lots of walking and stairs(called ladders by navy), but there are elevators for handicap accessible."], ["Reviewed 3 weeks ago", 5.0, "Great museum!", "Visited the museum during a flying visit to San Diego. Great knowledgeable staff, some of which served on the carrier! Being military myself, we got in for free and was a great experience! 5 stars."], ["Reviewed 3 weeks ago", 4.0, "Learn about Nay History", "It was my second time here, and I 've discovered that in the first time some place inside the Midway was missing .."], ["Reviewed 3 weeks ago", 5.0, "Cool Place, You Have To Experience", "Really interesting and unusual tour. You get to taste the experience of what a Navy sailors living conditions are.\n\nThere is some authentic equipment that's tailored for kids to sit in, get their pictures taken etc.\n\nThe landing deck is phenomenal... Huge and vast, rather intimidating to imagine being there as planes land and depart.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A Must Do", "Was in San Diego for the weekend and spent the best part of a day here, so much to see, was an amazing insight. Well worth it !"], ["Reviewed 3 weeks ago", 5.0, "Amazing visit", "I went with 2 daughter with 8 and 11 and both enjoyed a lot. The ship is so big that we get lot and the placed parked was so huge that they could play there."], ["Reviewed 3 weeks ago", 4.0, "Awesome Aircraft", "We enjoyed spending the time wandering the deck. The free audio tour is neat and you can go at your own pace. We zipped through some areas, but found it enjoyable overall."], ["Reviewed 3 weeks ago", 5.0, "Close up history", "Def a must in SD, you will see and feel how it was living in a large boat like this, you will.also learn the basics of how it operates! It is amazing to learn how planes are able to airborn and taxi on a small area like a boat\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great First Stop After Landing", "We landed about 9:30am, picked up the rental car, got some lunch, and purchased our tickets through Trip Advisor. Arrived about noon-stayed about 4 hours.\n\nExplored the lower level which has a movie, some \"hands-on\" planes that you can sit in, a huge model, gift shop, and the location that you pick up the audio device for the tour. You can select which displays that you would like to hear more information.\n\nThe flight deck has breathtaking views of the city and island.\n\nThere are also more planes, stories, videos, and docents.\n\nWe also toured the control center.\n\nGreat experience\n\nOn the\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A must see", "Great for history. Multimedia options let you learn however you choose - reading, listening, video. So many planes to see and great photo opps with the city skyline in the background. Spend a little time or a lot of time."], ["Reviewed 3 weeks ago", 5.0, "Fantastic", "This is a great museum for the men & women of the United States Navy. Coming from Oz and being a pilot just amazing these guys could land and take off on a little bit of metal\n\nIf you come to San Diego make sure you visit this\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Could Have Spent Hours Upon Hours There!", "I was a bit hesitant about boarding the USS Midway with two young children, but they enjoyed it as much as we did! You could spend several hours aboard this ship. The free audio tour is excellent and gives you so much interesting information about the ship and naval life aboard the ship. The kids had a chance to earn their ‘wings’ which made the trip more interesting to theme. All of the guides aboard the ship were extremely knowledgeable and helpful! We hadn’t had a chance to eat lunch yet and were excited to see a small cafe aboard. The turkey panini was much better than I expected and the kids enjoyed their meals. It’s a must see if you’re in San Diego!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Leisure", "Stunning sight located at San Diego shores right off airport exit .. easy parking., plenty around to explore. Highly recommended"], ["Reviewed 3 weeks ago", 5.0, "Very interesting, fascinating, and educational", "Very big, will take lots of time to do everything, most of the day really. If you just want to wander and hit the highlights then its a great 2-3 hour activity. I did this with kids and did the shorter version, they loved it. If you can get the audio tour that is a big help.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Awesome Up Close Naval Museum Experience", "The whole experience was awesome from the knowledgeable Museum staff to the fantastic San Diego weather. The experience gave us an up close look at life on the the Midway. The Museum staff were very informative and interesting to talk and listen to. I highly recommend this Museum.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fantastic", "Great place to see and experience life on real aircraft carrier. Actual retired Navy personnel who served on the USS Midway guiding and answering questions. Very well done. One of the best displays of aircraft I have ever seen. Would love to see and do it again.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Excellent", "Don't miss this attraction. The docents are so friendly and knowledgeable to answer all your questions. The presentation is really interesting. Many are ex pilots or ships crewman so they know what they are talking about. I've visited other carriers but never one with so much to see and do. The new recorder devices really enhances the tours. Don't miss this if you can get there go\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Nice nautical history lesson", "Glad we went!! Not for someone who is not able to use steep stairs or doesn’t care to walk. Very informative docents, clean and plenty of bathrooms."], ["Reviewed 3 weeks ago", 4.0, "Very interesting for all ages.", "We are holidaying from Australia and both really enjoyed this museum. So much to see and the size of the Midway was surprising. It is not just for adults but great for kids. Very good movie to start off about the history of Pearl Harbour and Midway Island. A most enjoyable time spent there.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great tour with super Dosents", "Plan on spending the day! The USS Midway is huge, and there is a lot to see. We spent a good four hours and could have spent far more, and it is not just military interests. I was impressed by the technical challenges faced, and the number of kitchens.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Well Done!", "We spent about 90 minutes touring the Midway and some people could probably spend hours on this aircraft carrier. They provided a device to listen to information at various stops along the tour. Very easy to use and very informative.\nThey had retired military people available to answer questions and put on detailed explanations about life on the Midway. We listened to a fighter pilot explain how they catapulted planes from the deck and he did a really good job.\nTake the tour and I doubt you will be disappointed!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A must-see in San Diego!", "I’d been to SD twice before but had never visited the Midway. When I took my three teen boys on a weeklong whirlwind tour of Cali hot spots in SF, LA and SD over Christmas break, several folks recommended the Midway tour and I’m so glad we went. Even the self-guided audio tour kept the boys’ attention and the son who’s most fascinated with military planes was in heaven, of course.\nAs a 45-y.o. woman who has been able to recite Top Gun line-by-line for ever, I loved seeing the past and present Top Gun planes.\nThe most poignant moments of the day, however, which I will cherish forever, were (1) meeting a veteran (now volunteer tour guide on ship) who’d been at Normandy on D-Day as a young serviceman, and (2) another who’d actually been part of the Manhattan project. I couldn’t begin to comprehend the experiences of either of these great men, and found myself crying just thinking of it. It was such a humbling gift to meet them and get even the tiniest peek into their roles in our WORLD’S history.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "So Interesting!", "This was a very well executed museum with so much to see and do - we needed more than the three hours we allotted it. We are not American, so it was very interesting to learn not only about the planes and the ship but also about the American military culture. The volunteers who did the talks and manned the different station were so personable and full of good stories. The audio tour was helpful and easy to follow. The restaurant is little more than a snack shop, but it got us through to supper time.\nLoved the whole experience!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very interesting and the volunteers are amazing", "Great thing to see and wander around on the ship. Very informative and was surprised as to how much I liked it. Volunteers and their first hand experiences was amazing to hear. Highly recommended!"], ["Reviewed 4 weeks ago", 5.0, "Great Experiance", "The tour of the Midway Aircraft Carrier was great. The staff there are very knowledgeable about the history of the ship. They also had memorabilia and gift items to buy. They do have drinks and small eats but not a restaurant. I got in on my Government Service ID. They also cater to military and law enforcement personnel. There are also world war II planes and historic military jets on the ship.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "USS Midway Tour", "If you are excited about the history of our Navy and want to see a real Aircraft Carrier and planes, this is a must see. Plan on spending the entire day there as they have much to show and talk about. Many different types of aircraft to look at and you can sit in a couple of them for pictures. You will learn what it was like to serve and perform a job on the USS Midway. A lot of the tour is self guided and the equipment for that worked great.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Australian Family had a fantastic time on the USS Midway", "From the grandparents (64 and 63) to our 7 and 10 year old, each of us enjoyed going on the USS Midway. We spent 5 hours on board but we could have spent another 5 hours exploring the boat. There are heaps of steps, but there is a lift if you require it. The kids had so much fun getting to go into the planes, equipment, meeting the \"crew\" and saluting, and the rest of us enjoyed listening to the \"history\". Would completely recommend you visit..\nShow less"], ["Reviewed 4 weeks ago", 5.0, "very interesting", "The guys in the yellow hats are wonderful story tellers that enhance this visit. It is quite an amazing ship with lots of history."], ["Reviewed 4 weeks ago", 5.0, "Worth Seeing", "I have been on the Midway a few times. Every time you go you see something you didn't see the time before. Great place for pictures and you can take your time with no one rushing you through a tour with a guide. You can take as long as you want to see the things that you want to see.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Interesting", "What a great ship to see, if you've been in the service you only pay 10$, the guys in the yellow hats are a great bunch of veterans who can tell you about the ship. It was really interesting to hear how they land planes on this great aircraft carrier. We spent about 2.5 hours there. You can spend as much time as you want. There are elevators if you can't do many stairs. It was my first time on a aircraft carrier and I was glad I did.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Highlight of our trip", "Spent a good 5 hours on the ship with our 11yr old. We did the self guided tour. It was amazing. Up and down, in and out. going through hatch after hatch. Seeing bunks rooms, and offices stuck in every nook and cranny. Toured the kitchen and medical offices. Labs, engine room, tower. Flight deck had a lot of planes and helicopters. Flight simulators were very worth it. It was frankly astonishing. I'd go back for sure.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Fascinating", "A fascinating insight into this enormous war machine. Great tours given by the veterans who are very passionate about this ship. Give yourself several hours; there is a lot to see."], ["Reviewed 4 weeks ago", 5.0, "Phenomenal experience - even with toddlers", "What a great tour! The yellow hats (docents) are so knowledgeable and friendly and it is truly a unique experience. Unbelievable history and very interactive. My 2.5 year old loved it!!"], ["Reviewed 4 weeks ago", 4.0, "Great audio tour", "I am not a military buff at all but thoroughly enjoyed our visit. The docent guided tours/talks were exceptional. The audio tour was very well done with personal stories of staff who had worked on the Midway. They really did make history come alive and provided human interest that engaged the listener.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "very intersting", "very interesting and not very expensive unless you buy food or gifts, but welcome to tourist traps lol. my brother and i are 6'7\" and 6'9\" so for all of you that height beware of the below deck tours.... also the vets that worked or volunteered there were very good hosts\nShow less"], ["Reviewed 4 weeks ago", 5.0, "This attraction is an absolute if you are ever in San Diego!", "Tour a decommissioned aircraft carrier and see up close a wide variety of aircraft from WWII era through Desert Storm. Wander throughout the ship and talk with Navy personnel who manned and flew from her decks. Tour the Admirals quarters where actual battle maps are still on display. A world class experience!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A full day", "This is a very interesting \"museum\" If you like airplanes or boats, you will love this place. You get see how sailors at see live, and you see the difference between officers and enlisted men's quarters"], ["Reviewed 4 weeks ago", 5.0, "Superb Navy Museum", "For the Nautical Ned in the group or the grandpa who served in the Navy, this is the place of dreams. Finely done and well maintained by the many retired Navy men of the town, you'll enjoy seeing the planes on the flight deck, and the living and working spaces for the 4,000 men who made this their home for 6 months at a time. Touring the ship will give an interesting and informative look at what life was like in the U.S. Navy.\n\nThere are several places to eat and refresh yourself on board this floating museum .Want to try your hand at flying a plane in a flight simulator? It's there for you. This is the finest Navy museum I have visited- and I have visited quite a few and also served aboard Navy ships. This is the real deal.\n\nAnchor's Aweigh!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Visit of a lifetime", "The USS Midway Museum is a must for military enthusiasts.\nShe last served in the Vietnam war before being decommissioned.\nThankfully it was preserved as a museum for all to visit.\nFrom WW II era planes to the jets of the 50s to the 80s, you can catch them all first hand and up close.\nRunning commentaries about flight deck operations done by volunteers add to the treat.\nTours inside the bridge, engine room and the innards of the carrier run regularly.\nFor the more adventurous try the flight simulators.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "History Abounds", "Love the way it is setup with the aircraft on the decks and the retired service members telling their stories. Great trip!"], ["Reviewed 4 weeks ago", 5.0, "Amazing", "This is a must, even if not a military enthusiast. We spent 4 hours here and had a great look at the museum. Very friendly staff and great exhibits. Easy to get to and good value for money."], ["Reviewed 4 weeks ago", 5.0, "Lots of History", "We had only seen good reviews of this tour and since history is our thing, we were excited to visit. We were not disappointed. Lots of docents who are former military sharing lots of great information. Suggest that you set aside at least 3 hours for your tour. We made great use of the audio tour. Do not forget to get in line for the bridge tour. That was amazing as was getting into the planes sitting on deck. Having a brother-in-law who had served on the Midway and told us about it, made it even more impressive.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "An Enlightening Visit.........", "I enjoyed seeing how day-to-day life carried out on the ship. The tour was comprehensive about the ship and the times when she was commissioned. I am still in awe of how the pilots managed to take off and land on such a short runway on a ship that was not stationery.\nPatrick Deehan\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Interesting museum on a floating navy ship", "Didn't expect a navy museum to be so interesting - it basically shows how life is on a navy ship. The deck has many fighter planes and some may recognise the ones used in Top Gun.\n\nWe queued for the bridge to get into the Captain's area and quarters, but the tour was too technical for me to fully enjoy what was being conveyed. I would skip it if I knew in advance.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Historic and fun", "Being on a ship this big you would think I wouldn’t get claustrophobic. But I did. I don’t know how the men and women in the navy do it. The ship was amazing and the way they mark areas so you know where you are made sense once it was explained to me. I was turned around and lost most of the time. Luckily they mark the way out well. The food in the cafe isn’t great and I’d eat before you get there. Also make sure you have enough time to see everything because we were there 3 hours and still didn’t manage to see it all.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing, wish we had more time for the tours..", "If you are remotely interested in aviation or nautical type stuff, then this is a must do.. The guides are wonderful and experienced navy veterans a true pleasure to meet and talk with... Suitable for all ages but set aside half a day and not just a couple of hours like we did... also come with lots of questions, very informative...\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Epic", "The USS Midway is a must see in San Diego. I spent 4 hours wondering around this awesome ship and bought one too many things from the gift shop. They have volunteers throughout the ship to explain the history of the vessel and make her come alive.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great museum, must see!", "Had a good time touring this well known aircraft carrier! Must see for first timers to SD. Tour guides are knowledgeable, nice gift shop. Kids would love this!"], ["Reviewed 4 weeks ago", 4.0, "Amazing piece of history", "Really great museum. Well set up and allows you to tour at your own pace. There is a head set for everyone and plackards to scan throughout the ship, seperate for adults and children. They have a scavenger hunt for junior flyers to earn wings, however geared towards bigger kids as it takes a long time. There is a flight simulator pay ride that is nice but a little expensive at $16 for a 3 minute experience. Totally recommend doing and experience the majesty of an air craft carrier.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Great visit", "It’s a great way to spend a couple of hours. There is an audio guide that is included in the price what is probably not common knowledge is that if you go late in the afternoon on one day you can get your ticket validated to go for free the next day!! Awesome.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Very nice and interesting Museum", "I was hesitant to visit then my interest in history made me visit it. For me it was worth.\nI was moved by the history of the aircraft carrier and the marines, war pilots, airplanes.\nIt is very interesting to know how it saw action in the Vietnam War.\nI recommend this tour to everyone, especially for families.\nI visited during a rainy day which it was a good option for this kind of weather.\nThere are a small fast food restaurant and a Starbucks station and also a large gift shop for souvenirs. There are bathrooms in different levels inside which are very convenient.\nI recommend to include the audio device with your ticket, it is very helpful and informative.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Worth it!", "Definitely worth every dollar! Guided and self guided tours with audio players available. Plan for 5-6 hours to see exhibits and listen to the interesting/ educational talks. Food, gift shop, and flight simulators are available for extra $. Entry deck (hangar) and flight deck are easily accessible, however, visitors should be aware there are some steep stairs, ladders with chain railing, bulk head (door) have low head clearance and high step overs, and some tight spaces.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Great and interesting Museum", "We found USS Midway Museum very interesting, a lot of information to take in. The Flight Simulator is a must to try if you have no medical conditions. It is central located and very convenient to get to. You can also go to nearby afterwards for a delicious meal.\nShow less"], ["Reviewed 5 weeks ago", 4.0, "Great", "This place is great! Even my wife really liked it and she thought she would get bored! The only thing is make sure you park in the area for the uss midway. The parking in front of the restaurant only gives you a few hours to park. Got a fat parking ticket! So park in front of where you enter the ship.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "So Much to See and Learn!", "The volunteer guides were incredible, they were very knowledgeable! The audio option was very helpful. It was so cool to know I was in the same ship as so many heroes before me!"], ["Reviewed 5 weeks ago", 5.0, "The Midway", "Good place to visit. Learned so much about our navy on this tour. Has guided and unguided tours both are pretty good."], ["Reviewed 5 weeks ago", 4.0, "Educational", "So very cool to see up close and wander the ship. The audio tour is very helpful and all the veterans that volunteer are very friendly!"], ["Reviewed 5 weeks ago", 5.0, "Enjoyable family experience", "Family enjoyed seeing the ship, planes and helicopters. They have a program for kids to earn wings which helped to keep kids engaged in learning more."], ["Reviewed January 24, 2018", 5.0, "Well done and worth every cent", "Spent 6 hours going through the exhibits..Interesting and educational. Get the audio gear for the tour it makes it more interactive and the information you receive is great"], ["Reviewed January 24, 2018", 5.0, "Great History", "Lots to see if your into history and planes Takes a few hours and lines are long. Kids will love it!"], ["Reviewed January 24, 2018", 5.0, "Spend half the day here!", "This museum is so large it takes at least five hours to do and experience everything. Not only are there opportunities to get inside the cockpit of some pretty amazing jets, but there are docents available with interesting facts and stories about the ship and their own experiences in the military. The guided island tour was free with admission and a definite must do (fyi, you'll need to be able to climb ladder-stairs)! My children loved the flight simulators (extra charge). There is also a gift store with fun souveniers. We went during our winter break just before Christmas in the middle of the week, and it wasn't that crowded ;-)\nShow less"], ["Reviewed January 24, 2018", 5.0, "Midway tour", "If you are interested in navy stuff you will love this tour on the USS Midway. Its a look into the world of navy life on a carrier. The displays are excellent and the flight deck simulator is very true to life. Landing on a carrier at sea is an awesome experience even it is only in a simulator.\nShow less"], ["Reviewed January 24, 2018", 4.0, "Save a few hours for this visit but definitely worth it", "The Midway is amazing. It takes several hours to do the entire tour through it, but at any point you can cut it short as there are a few exits. They have it set up very true to life. I was quite impressed. The first time we went I didn’t realize how long we needed to go through and only saw half of it. The second time we devoted a full afternoon.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great way to spend a day!", "The USS Midway Museum is amazing and I highly recommend to put it on your list of Things To Do when in San Diego. You can spend a couple hours to all day walking above and below decks of the Midway. Take time to catch a talk or two by the Docents and enjoy this massive floating city.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Awesome tour!", "One of the coolest things I have seen. Kids are 16, 18, and 19 and loved it. It was 4-5 hours on a good pace to get through it. Also, get the earphones. Make sure not to miss a section."], ["Reviewed January 23, 2018", 5.0, "A most unique museum experience!", "Perfect tour for people of all ages. Couldn't believe how small the quarters were and how much cargo is needs to take care of this \"floating town.\" Young boys will love touring all the aircraft on the flight deck. Docents are extremely knowledgeable with many actually having served on the Midway or another carrier.\nShow less"], ["Reviewed January 23, 2018", 5.0, "Very Informative! Well worth the price of admission.", "Great museum with nice set-up. You can use the walking headset recorders to learn about exhibits at your own pace, and/or talk to the numerous \"yellow cap\" tour guides who are vets that served on the Midway. I took this tour mostly for my dad, who is retired Air National Guard, and did not expect to enjoy myself as much as I did. I was really impressed how much I learned, and came away with even reater respect for those who serve our country. Well worth the price of admission.\nShow less"]]}}