{"V. Sattui Winery": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "V. Sattui Winery", "url": "/Attraction_Review-g33000-d116687-Reviews-V_Sattui_Winery-St_Helena_Napa_Valley_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/b3/81/dd/v-sattui-winery.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1670"}, "address": {"@type": "PostalAddress", "streetAddress": "1111 White Ln", "addressLocality": "St. Helena", "addressRegion": "Napa Valley", "postalCode": "94574-1551", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "Getting your money's worth in Napa", "This was my favorite winery in Napa because not only is it affordable, but you can cater the tasting with the exact wines you like. The $20 tasting offers a selection of 10-12 reds, 10-12 whites, and 5 dessert wines. (You pick your 5)\n\nI also loved the ambiance inside. Their gift shop is great and if you don't have a reservation, they work you in on a first come, first serve basis.\nShow less"], ["Reviewed 1 week ago", 5.0, "A real slice", "Have been to this winery/deli a number of times over the last 45 years. It is a real slice. Good wines, friendly staff and a nice deli. Great cheese selection."], ["Reviewed 1 week ago", 3.0, "Don’t fight the crowds.", "Was our first vineyard stop as a recommendation from our hotel. It’s a lovely operation and we enjoy a great little picnic. IMO, just far too busy bit of a tourist trap. But nice wine, yummy picnic."], ["Reviewed 1 week ago", 4.0, "Great wine", "A great place with good wine. Large selection of red, white, rose and dessert wines. The people working here gives great service and have a very good knowledge of wine! And are super friendly! Recommend this place if you’re in Napa valley"], ["Reviewed 2 weeks ago", 5.0, "The wine train last stop", "Out of all the wine train vineyards this was the best. Angela was the best tour guide of the day. This is a premium vineyard. That have one of the only food establishments in NAPA valley wineries. The wine tasting was fantastic. Angela took time to visit with each guest in the group. We bought a case of mixed wines. We have been wine club members three years. First formal visit to NAPA Valley. We used Uber to get around after the wine train. Me and my wife can highly recommend this winery to taste at.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Make sure you stop here for lunch!!", "We had a group of eight, no lunch reservations, and a short time window before a tasting to squeeze in lunch, when our hotel suggested this place. Best lunch experience of our Napa trip!! There was something for everyone. We shared olives, roasted peppers, cheeses, gourmet meats and sandwiches from the deli, and of course a little wine. We ate picnic style under the trees and they even had plates and napkins for us. Don't miss this place. We loved it so much we went back a second time so we could shop and take goodies home with us. We will be back.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Crazy busy so we just went to the deli", "We stopped at the V. Sattui winery and it was extremely busy and chaotic so we decided just to select some picnic food from the deli that's part of the winery complex. The choices were extensive with a lot of local and regional meats, cheeses, and other products. I asked the girl at the counter if it was unusually crowded because it was the Christmas holidays, but she said it was always like this and even busier in the summer. I already felt overwhelmed just in the deli so I'm glad we had not booked a tour here. I recommend the deli and it's wonderful selection, but be prepared if you come for a winery tour.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Excellent winery in St. Helena", "You can only get their wine at the winery or shipped via the monthly club. It’s a great place to grab some wine and go outside to enjoy a picnic. Been going here for years and would recommend to visitors."], ["Reviewed 4 weeks ago", 5.0, "Great wines and a beautiful terrace", "We stopped here by coincidence and it was one of the best choice, excellent wine market and ambiance the place is beautiful the welcoming is very nice. A must winery to visit"], ["Reviewed January 22, 2018", 3.0, "Zooey", "Just when you're enjoying the beauty and tranquility of Napa, you wander into one of the few wineries that allows you to picnic and sells not just wine, but cheese and charcuterie. Good idea, if it wasn't for everyone else doing the same thing. We just stopped by there after several enjoyable winery tours and tastings. And found it overrun, on an otherwise sleepy Sunday in January. Tons of tourists, bunches of kids drinking too much. Lines, lack of class, too much. It was nice to buy cheese, but I'd go to Oakville Grocery for that. And the wine is average. This place is just too popular for its own good.\nShow less"], ["Reviewed January 17, 2018", 5.0, "Excellent Deli and the tasting room was a hoot!", "We stopped here before our tasting appointment at Mondavi. We were interested because the Castello di Amorosa was so good the day before that we thought it would be interesting to see the owner's first winery. It did not disappoint. We bought some things from the deli and they were excellent. The tasting room for members was a hoot. The two guys there had a great time interacting with all of the patrons tasting wine. I would recommend to my friends.\nShow less"], ["Reviewed January 14, 2018", 4.0, "Good place to eat", "The winery is nice to walk around and they offer, besides the tasting, a food market where you can buy some food and eat in the outside. We decided to escape the tasting and just bought a bottle of wine and some food to eat at the garden outside. It ended up being cheaper than the tasting itself. The people working there are very helpful.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Amazing Food", "I do realize that this is a winery, but I must say that the food selection is just as extensive as the wine. It can get a bit busy so try and go on an off day but make sure that you get the truffle mac!\nShow less"], ["Reviewed January 2, 2018", 5.0, "Winery tour, even for kids !", "Did the winery tour recently in my first visit to SF and certainly Napa Valley. The adults enjoyed it and so do the kids. While we sample the wines, the kids were provided grape juices. The cheeses and sandwiches at the shop were very good. Buy some, Grab a bottle and have a good picnic !!! Simply fabulous.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Terrace tasting", "Full disclosure: we booked a terrace tasting a few days ago for 11 am. We didn’t book a private tasting and we don’t know how we managed to have an almost private terrace tasting with Danica but we did!\n\nWith that, we highly recommend reserving a terrace tasting with the charcuterie upgrade (good for two people). Even if there were going to be more people out on the terrace it still would have been great. We thought it was lovely and relaxing.\n\nAlso Danica happens to be the great great granddaughter of V. Sattui and we immensely enjoyed sitting in the sun overlooking her great great grandfather Vittorio’s vineyard and learning about this wonderful family owned winery.\n\nWhen we stepped out from the terrace we were met with a very different winery than the one we were experiencing on the terrace and the one that most people experience. The hustle and bustle of the deli and the main tasting room made us very glad we booked the terrace. Kid friendly and dog friendly so it was lively and loud.\n\nGreat wines! So. If you’re looking for something a bit more relaxed check out their various options for tastings (terrace, tower, etc.).\nShow less"], ["Reviewed December 30, 2017", 5.0, "First class", "This is a great Napa stop! Everything from wine tasting, local cheese sampling, deli sandwiches,etc. It’s a beautiful location with many things to see/do/eat for couples or even a young family touring the area.\n\nWe sampled many wines at the back bar—the guys behind the bar were very enthusiastic, friendly and extremely knowledgeable. Our experience was incredible! We ended up with wines we did not think we would ever try or care for; we thought we were true pinot noir or Malbec drinkers...walked out with 2 bottles of red Zinfandel.\n\nBeautiful property and yummy stop in Napa!\nShow less"], ["Reviewed December 28, 2017", 3.0, "Leaving much to be desired", "This place is like a flea market for wine tasting. It has good for sale deli style so overcrowded and lots of swag for sale that also adds to the clutter. I prefer a much more intimate setting for wine tasting."], ["Reviewed December 25, 2017", 5.0, "Best Winery in Napa Valley", "Visited V. Sattui Winery the Sat. before Christmas and was pleasantly surprised that it was not crowded. We browsed through the Deli and bought some cheese and bread. I was a little disappointed that the BBQ wasn’t going but I guess that a summer thing. We then had a very good time sampling the wines. The server was extremely helpful and fun to chat with. All the employees were nice and wished us a Merry Christmas. After the sampling we bought a very bottles to go which were delicious with dinner that night. If your in the Napa Valley stop at V. Sattui and have some lunch and wine, eat on the grounds, you won’t regret it. It does get very crowded though!\nShow less"], ["Reviewed December 20, 2017", 5.0, "Good Deli and Wine Tasting at V. Sattui - Pretty Christmas Trees", "We went to V. Sattui for lunch on a Monday. We shopped at the deli and also ordred lunch; we were happy that it was not very busy.\n\nWe both ordered a turkey and cranberry panini We had it HOT. We took it outside and enjoyed the views of Napa Valley. It was so GOOD.\n\nWe then did wine tasting. They have very nice wines. The Christmas trees in the winery were also very ince.\n\nStaff is great!\nShow less"], ["Reviewed December 18, 2017", 5.0, "Delicious food with Wine", "Experience was amazing. We came starving and was easy to select from all sorts of salads, entrees, pasta, and cheese. Lots of them. All very tasty. Wine tasting and a bottle later to the picnic area made this a great experience"], ["Reviewed December 10, 2017", 3.0, "Crowded", "Stopped by after reading an article about it. Granted it was Harvest, but it was crazy crowded with people pushing you out of the way to grab a free sample of cheese. And they charge an outrageous amount for a plate and plastic forks for your salad. We left and bought some meats and cheese for our picnic across the street at Dean and Deluca. (The plates and silverware are free over there). Didn’t have the energy to fight the crowds for a tasting.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Great Wine experience", "Great Winery experience for the process and the quality of wines produced. A real eye opener. Friendly staff."], ["Reviewed December 1, 2017", 5.0, "Napa Vacation", "This place was awesome. They had such a wonderful variety of food and wine and a great picnic area. We went one day too late for the wine tasting so we grabbed some food at the deli area, they had such a wide variety of awesome food we went back several times for the food and ate at the picnic tables it was that good. We also did a tasting and my niece shipped a case of wine home There were families there with children I think it’s a very popular spot\nShow less"], ["Reviewed November 28, 2017", 5.0, "Wonderful wine food and gift selections .", "We often make this our first stop on the journey. The selection of gourmet sauces, cheeses, and breads are perfect for wine paring. The gift shop always has something new and unusual . Award winning wine selections top off the experience."], ["Reviewed November 27, 2017", 5.0, "Quench your thirst, hunger and quest for beauty", "A wonderful history for wine and cheese making. The wines paired perfectly with both food and atmosphere. The staff was very friendly and helpful. The variety of food options to create a picnic or evening sunset can match any budget. Don't miss this stop on your tour.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Excellent food, wine and picnic grounds. Winery of the year.", "This place is still awesome. The road to get there has definitely been widened which took me by surprise as it encroached upon the grounds. There is ample parking. Access is through the grounds and you enter into the gift shop area where you can purchase cheese, wine snacks, novelty wine items etc. The prices were very reasonable and cheaper than the Ox bow market. Choices abound for cheese. Buy what you want and have a picnic on the grounds, which are fantastic. There are plenty of picnic areas and tables.\nThe wine sampling is done in the same area and they have public and private tasting areas. Make you way to the bar and sample up. Menu choices apparently change. Attached are pictures. If you go there and do the tastings, ask for Preston Garcia. He was great, informative and fun to listen too. He is also protective of his clients. Look for him when you go. His picture is attached.\nAll in all this is my favorite winery and one i have not seen seen the 80's. Still great. Plan to stay a while,\nShow less"], ["Reviewed November 21, 2017", 5.0, "Super awesome wine tasting", "The winery was very busy , they have a little cute section where you can buy cheese ,wine,meat , and sandwiches . The parking lot was kind of crazy. But there are parking spots. I recommend going on a weekday not on a Saturday that was super busy . Our wine Steward was very friendly, very knowledgeable. The wine was very tasty good price. You can do five tastings of different kinds of wine for $15 which is cheaper than most of the wineries. I would definitely recommend sattui.\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful Grounds & Great Food", "This was a perfect lunch spot. The marketplace was busy but we got some delicious food, bought a bottle of wine, and sat at a picnic table outside for lunch. The building and grounds are GORGEOUS and the food was great too. Highly recommend adding this winery to your day even if just for lunch.\nShow less"], ["Reviewed November 9, 2017", 4.0, "A little wine, cheese and bread in the garden", "Our group of four couples made a day trip up the Valley and stopped at V Sattui on our travels around to Sonoma. V Sattui has a very nice deli at their tasting room with a great choice of cheeses, breads, sandwiches, and other foods. Along with tasting an purchasing some wine, we purchased several things to create a mid-afternoon wine and cheese lunch. The tasting room had knowledgeable people helping with wine selections and tasting. Needless to say there were some wine purchases. Just a delightful place to stop for a lunch out in a wooded garden area while on a trip up the valley.\nShow less"], ["Reviewed November 3, 2017", 4.0, "Great wine, huge crowds, excellent picnic grounds!", "V. Sattui is NOT the laid-back, quiet-respite-for-a-glass-of-wine experience offered by many smaller vineyards. The wine and comestibles are excellent, although waiting in line for each tasting is a bit wearying. We also had to wander the grounds, wait, and then pounce to find a picnic spot with a seat, which one of our party required due to ADA issues precluding being on the ground. Bring a small folding chair, or convertible sit-upon cane. The staff was very nice, but the noise inside deafening. Pick a mid weekday to avoid the largest crowds~\nShow less"], ["Reviewed November 2, 2017", 4.0, "Incredible venue", "Very large grounds for indoor and outdoor tasting-beautiful setting. Very busy and a little bit commercialized, but a great visit. Would recommend to friends and family. Will be back next time in Napa."], ["Reviewed October 29, 2017", 5.0, "California wine tasting", "V Sattui winery is a must stop when in wine country. The wines are fantastic and the people exceptional. The personal touches are top notch. I've got everyone i know drinking Sattui wines. My only regret is living across country and only getting by twice yearly. Although it is very easy to order online. SPECIAL thanks to Bob for being so awesome during our last visit 10/21. Taught a lot about food pairings. He would be an asset to any business. Thanks also to Tom and Janet. You guys ROCK!!!!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Excellent picnic stop", "Stopped for lunch during our Napa tour. The deli and cheese selections are extensive and very tasty. We made a few purchases then were assisted with selecting a wine that would pair well with our food. Staff was knowledgeable and helpful. Ate outside at the picnic tables. The weather was perfect. Will be back!\nShow less"], ["Reviewed October 26, 2017", 5.0, "Great winery", "Great tasting led by Marija. Great wine, the grounds are beautiful, and we had a picnic lunch on the property."], ["Reviewed October 26, 2017", 4.0, "Delicious Food, Copious Wines", "I came here with friends after we decided to take a trip to Callistoga. If you are looking for a trip through a vineyard, this is not the place for you. However, if you are looking for a farmer's market style experience, where you can get artisan breads and cheeses, sample delicious wines, then this is the place for you. Purchase some amazing food, buy a yummy bottle of wine (or 2) and relax out in their garden area.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Tasting room experience... delightful", "The tasting room has an old world feel with rough hewn decor, and numerous wine tasting stations and options. The wines they offer for sale range from $15 and up, so this is not a get a cheap bottle option. The servers were engaging and informative. There are so many wineries to choose from. We found this an excellent choice, but would need to visit 20 or 30 others to get a real sense of how to compare.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Best place in Napa for a picnic or just a pit stop", "Whenever we visit the wine country we always stop at V Sattui for lunch. They have a big lawn with tables and chairs and a huge store selling hundreds of varieties of cheeses, breads, salads, sodas, drinks etc. Please note that parking can be a challenge on weekends and holidays even though they have parking for over a hundred cars! There are two sets of restrooms.\n\nOutside food is NOT allowed and is stated explicitly by signs placed near the entrance. Food in the store is not cheap. A can of Diet Coke was $2.50. Not sure why a 1000% markup is levied on basic items like water and soda. But in spite of this the throngs of people milling around would seem to indicate they are handing away food for free. Budget between $15-$30 per person for lunch with drinks and wine not included.\n\nIt is ok to ask another guest to share their table if there is room to spare. Each table can seat between 6-8 adults. Or bring a spread from home as back up and sit on the grass. On weekends they also open up a BBQ and pizza kitchen outside the store. There is an area on the side which can be reserved for small private parties of 10-50 people at additional cost.\nShow less"], ["Reviewed October 16, 2017", 5.0, "The indomitable Californian spirit", "Sadly our trip to Napa coincided with the devastating fires across Northern California , but the people at V. Sattui were not going to let those sad events stop them - they welcomed us with open arms and were the perfect hosts, they expertly took us through the wine making process and helped us to enjoy their wonderful product! Thank you for your warm welcome and for sharing your beautiful winery - we wish the region and it’s people a speedy recovery\nShow less"], ["Reviewed October 11, 2017", 5.0, "Napa Relaxation", "Visiting V Sattui Winery has always been on the top of our list. We pray the devastating fires haven't effected these folks and pray for the many who lost everything."], ["Reviewed October 11, 2017", 5.0, "What a fun visit in Napa.", "We recently visited Napa Valley and made our way to V. Sattui. We had heard it was busy, but fun. After visiting many smaller, quieter wineries, we made our way to V. Sattui. We are so glad we went. It WAS fun and there was lots of activity. We especially enjoyed the retail where you could purchase picnic items and sit outside. Watching the Napa Wine Train go by was fun as well. The staff at V. Sattui was great, we really enjoyed the wines and thought the whole experience really added to our trip.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Great Family Experience", "This winery has a lot of extras making it a nice destination. Plan to arrive around lunch to enjoy the wines and also an on-site picnic. Great option for families."], ["Reviewed October 3, 2017", 5.0, "Has been my favorite spot for years", "We are members... Have been for 2 years now. I will note that it is becoming over priced, and SO busy. Good for them... Not as good for me...\n\nFood is so good. It's super fun. Very family friendly. BBQ has been about 80% great for us. Wines have a huge variety for everyone. They are getting strict on outside food. Some people were very angry about this. But, I am very appreciative they are.\n\nI hope they can add an additional restroom soon though.\nShow less"], ["Reviewed October 3, 2017", 4.0, "Nice winery", "Last stop on our wine train tour. Very knowledgeable guides. Good wines and nice gift shop with great cheese selection and offers freshly baked baguettes."], ["Reviewed October 2, 2017", 1.0, "Unwelcoming!", "Walked to this winery in the heat of the sun to find them \"too busy\" for a tasting. The reception was staffed and there were no other people there! In my book that's pretty rude and unfriendly - there's a thousand wineries in Napa so give this one a miss.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Awesome Winery", "Our party of four started our morning at V. Sattui and we wish we had spent the entire day there. We had reservations at other wineries but non of them compared to V. Sattui. Our service from Virginia and Danica was impeccable and top notch. They didn't try to rush us out as some wineries do at tastings; just the opposite. We felt welcome and they were very informative about the wines we were tasting. We found wines that met each of our taste desires and the grounds of the winery were beautiful. We will definitely visit V. Sattui again on our next trip to Napa and will allow for more time to spend there.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Pretty, and good nibbles", "This place is very pretty, and the food is yummy. We did not do a wine tasting, but we ordered some food and enjoyed the grounds."], ["Reviewed September 28, 2017", 4.0, "A \"must-stop\" on any Napa trip !", "Yes, it does get crowded. I've stopped on weekdays and weekdays and it's always been crowded, but don't let that deter you from a nice experience. The winery itself is not a really big draw...it's the retail center, deli and picnic areas that are the most fun. Browse the retail area for wonderful mustards, cheeses, etc., the get a sandwich from the deli or a loaf of bread and a hunk of cheese and go outside under the trees and have a great, relaxing lunch !\nShow less"], ["Reviewed September 27, 2017", 5.0, "Dario Sattui Knows How To Make A Great Wine", "As neophyte wine aficionados, our luck continued to hold in choosing our second winery to visit in the beautiful country around St. Helena, CA. We popped over to Hwy 29 on Zinfandel Lane while driving North on Silverado Trail and upon turning right on St. Helena Hwy/29 we quickly came upon the V. Sattui Winery on an early Sunday afternoon that was packed with people. It turns out that this winery often offers barbecue cookouts on the weekends and draws a big crowd.\n\nWe walked the grounds for a bit and shopped their store which, I believe, may be the only winery that also has a deli which sells fine cheeses, meats, salads and sandwiches.\n\nWe chose a wonderful woman to be our wine guide and walk us each through a tasting of five different wines. We enjoyed all that we sampled; Carsi Chardonnay, Dancing Egg Riesling, Los Carneras Pinot Noir, Ancient Vine Crow Ridge Zinfandel, Napa Valley Merlot and GSM Entanglement. We were so impressed with her choices for us that we not only purchased two bottles of wine, but also decided to join their wine club. You only live once, right? And by joining their wine club, they waived the $30.00 cost of the tasting.\n\nHaving our chosen wine for lunch, we strolled outside and ordered two Tri-Tip sandwiches and broccoli salad from the barbecue station within their large, shaded picnic area where over 100 people had congregated enjoying both wine and food. We opened our bottle of Los Carneras Pinot Noir and enjoyed our sandwiches which proved so large we were both unable to finish them.\n\nIt was so relaxing sitting at a picnic table and enjoying our food and wine surrounded by so many others with the same passion for both the wine and the food. It was such a wonderful afternoon with my wife.\n\nIf you find that you enjoy this winery with it's dazzling variety of fine wines, imported cheeses, salads, crackers and olive oils then you should certainly consider visiting Dario Sattui's other winery called Castillo de Amorosa located just south of Calistoga, CA immediately off Hwy 29 North. They don't have all the food to choose from that V. Sattui has to offer, but the castle and grounds will blow you away. And don't expect to have the same wines to sample here as Dario produces only Italian varietals at the castle while V. Sattui produces wines more in the Napa Valley tradition of wine making. Both of Dario's wineries really should be on your \"must stop\" list. I would also recommend taking the tour of Castillo De Amorosa for $40 which also includes a personalized wine tasting by your tout guide. You won't regret it!!\nShow less"], ["Reviewed September 26, 2017", 4.0, "Great Lunch Picnic", "This worked perfectly for us, as we reached Napa Valley hungry but not in the mood to sit at a restaurant.\nThe grounds are relatively big and are beautiful, although on the highway.\nThe deli and cheese shop provided us with everything we needed for a great lunch - that wasn't at all expensive - about $20 a person including wine!\nDon't come here for the wine (in our opinion, at least not for the white) but for the option to picnic in a laid back setting.\nShow less"], ["Reviewed September 26, 2017", 5.0, "Wines are amazing & beautiful grounds (Go on a week day)", "TIP!!!: GO ON A WEEKDAY! Most reviews you are going to see are going to tell you its busy, over crowded etc. There were 20 people on premise when I was leaving.... because I followed the simple rule every local and person will tell you who is a regular. You have to go on a week day as early as you can. Then you will avoid all crowds, we had the tasting bar practically to ourselves, just us and another couple for the first hour we were there. We went on a Tuesday at 9:30am right when they opened & no problems.\n\nAlso you are going to hear it is over priced, it is normally $20 a person do tastings, but if you are willing to tag yourself on social media, Tweet, Facebook, etc they will charge you $20 bucks for both, or at least that's what our guy did/offered to us. Our wine tasting guy and he was a delight to talk too, was very knowledgeable on the wines and local spots. Gave us tips for around the area and other wineries, and a few extra free samples, he was great.\n\nWe left with a few laugh, and a case of wine & brandy. They have an 1885 Brandy it is delicious highly recommend a sample of that, as well as the 2013 Cabernet it was delicious. I highly recommend a visit, especially if it's your first time in Napa, just make sure you go early and on a weekday.\nShow less"], ["Reviewed September 25, 2017", 4.0, "Great place to stop for a picnic lunch", "We stopped for a tasting but decided to have lunch first. The only downside is they don't sell just a glass of wine. The tasting was good but very busy. We almost felt rushed"], ["Reviewed September 25, 2017", 4.0, "4 nights in NAPA valley", "Great place to visit while touring the wine country. The wine guide was very well informed and quite interesting. The retail store out front was fantastic as we ate lunch there 2 days in a row. Great selection of meat and cheese along with sandwiches to eat out on the front lawn. Can't wait to go back.\nShow less"], ["Reviewed September 24, 2017", 2.0, "Becoming overpriced + too crowded -- no longer worth it", "One word: Fustercluck.\n\nSomehow, becoming overpriced STILL doesn't deter the hordes and masses from congregating here, especially on weekends. (Maybe, MAYBE, you will fare better on a weekday or during the off-season ie. dead of winter)\n\nWe are locals, and V. Sattui was the final stop on my very first visit to Napa, some 15 years ago... and on many visits since. Partly because I am a local, and partly because they have some unique offerings of fortified wines and decent (and more reasonably priced) whites, we have bought a few cases here over the last few years, and became wine members... but that's about to change:\n\n1) Way, way too busy. Just too many people (including throngs of little children running all over the place -- NOT what I want when I want to go relax at a winery)\n\n2) Prices are going up too much. When I first started coming here 15 years ago, tastings were FREE. Then, as times went on, they added a tasting fee (fair enough), but it was more reasonable than most of the Valley, at (I think) $10. Now it is $20 per person, on par with just about anywhere else...\n\nAnd the wines themselves are often overpriced for what they are. Some of the whites are lesser-known Alsace/German varietals we enjoy (Riesling, Gewurztraminer), and those are somewhat reasonable in price (currently $25-$30... not a bargain, but affordable)... but none of the reds are anything special, especially not for the pricetag (usually $40+)\n\nWe also like some of their fortified/dessert wines, BUT...\n\n3) They are sold out of their good Port (the 1998 Port) -- this was a full-size (750 mL) bottle of excellent aged ruby port for $55. They have replaced it with a much lower-grade (more oxidized/tawny) 15-year port, while also (deceptively) raising the pricetag to $66/bottle (It is deceptive, because it is $44/bottle, but the bottle size is now only 500 mL.)\n\nMaybe I'd pop back in again, on a Wednesday, on a rainy day in January, HOPING not to deal with the herds of people and the sub-par-but-overpriced-wines... but maybe not, since their prices are rapidly skyrocketing (looks like they are increasing about 20% per year these days...)\n\nNot worth it.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Great !", "Really nice day out here. Friendly, knowledgeable staff and great tasting session with top notch wines. Added benefit of an on site deli and picnic area too, so you can have your wine and eat with it!"], ["Reviewed September 19, 2017", 5.0, "Great Place to Stop, Have \"Large\" Deli with many selections, also Picnic Grounds ....", "Very nice Winery to stop at, they are usually crowded in the Wine Tasting room, they have a few really good wines. However they have a awesome \"Deli\" with a very large selection of fresh Meats, Cheese, Bread, etc .... They also have a large outside picnic and grass area to enjoy the Wine and Deli. You can also get Sandwiches in the deli as well as dessert, and many different types of condiments to take with you. Many times on weekends they also do BBQ's outdoors during the summer. Overall one of the better wineries for the overall experience, maybe not the best if you are strictly looking for fine wines, but one of the best for ambiance and overall amenities. Is a bit difficult to see / find, and there is only one entrance.\nShow less"], ["Reviewed September 18, 2017", 4.0, "Definitely worth a visit!", "I visited 9 wineries on my trip to Napa, this was the only one the tour guide adamantly said to NOT eat a grape! In fact, every other place wanted you to try one! Other than that, this winery was great. The wines were good and the grounds beautiful. Try to get a tasting in the cellar - very nice. The gift shop has lots of food to try as well as more wines to taste. Wish I had more time at this winery to do an inside tasting that consisted of more wines that I was interested in.\nShow less"], ["Reviewed September 15, 2017", 3.0, "A $ a minute tour", "We made the mistake of booking a tour and tasting. The tour was ten minutes and definitely not worth the extra ten dollars a person. The draw at this winery is the food it is fresh and delicious. If I had a redo I would just buy a bottle, a set up and lunch and enjoy it on their grounds\nI had a 2 for 1 coupon from our b&b but because I had booked the tour they would not honor it. My mistake ....\nShow less"], ["Reviewed September 14, 2017", 3.0, "I would skip this winery", "There was a group of six of us, and none of us were impressed with the wine. They do have a nice deli and picnic area. My husband and I split a roast beef sandwich which was very good."], ["Reviewed September 10, 2017", 3.0, "Corked wine but a good spot for a casual lunch", "Tried their 5 wine tasting flight but sent 3 wines back because they were corked. Our server forgot the wines we asked for and had very little knowledge of the wines. We stopped for lunch here and enjoyed a casual BBQ ribs and sandwich under the trees on the lawn.\nShow less"], ["Reviewed September 9, 2017", 2.0, "Mildly disappointing experience", "Great location and building/atmosphere so that was great. Wine tasting was with Marija. She was so inattentive and apathetic I think she would have rather been counting blades of grass."], ["Reviewed September 7, 2017", 4.0, "Five stars for the deli, 4 for the tasting bar", "We stopped at V. Sattui and ordered delicious gourmet sandwiches at the deli counter which we ate outside in the nice picnic area. There were also many other gourmet food items to sample and purchase in the market.\nAfter our meal, we decided to do the tasting. At only $20 for 5 wines, it was a pretty good deal. Our friendly server threw in a few extra, and even mixed a cocktail of a moscato and another super sweet wine which were both too sweet on their own, but not bad as a mixed drink. None of the wines really wowed us...and the sweet ones at 15% alcohol really kicked our butts. We probably just didn't choose the right ones for our tastes.\nShow less"], ["Reviewed September 6, 2017", 5.0, "A MUST BE ON YOUR LIST!!", "I truly love this pleace.It si busy but that because its worth it.Once you go there you will then remember I told you so.Make sure you go and have lunch while there.The smoked food is perfect!! The cheeze bar is out of this world>and the store has all the gifts you need for all your wine friends.I went to the til/cashier 6 times!! Carzy I know.But when yo go you will know why.\nShow less"], ["Reviewed September 5, 2017", 5.0, "Awesome staff and fun atmosphere!", "This place was a hit! As soon as we walked in on a random Wednesday afternoon, the tasting bar was packed with people. The staff was exceptional and the atmosphere was fun. The winery itself was incredibly beautiful! The wines were tasty and the prices were great. Highly recommend a tasting here! It is $20 per person for the standard tasting package which includes 5ish wines to try.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Charming and best wine", "This is a charming winery and my favorite wines that I tasted were here. You cannot purchase these wines outside of the winery but you can ship them anywhere."], ["Reviewed September 2, 2017", 3.0, "Wine not available in stores", "For reasons that might make sense to others, Sattui sells no wine via restaurants or stores, which must account for the volume of customers packing the place. The offer a good variety of wine at the mid- to upper end of the Napa price range. Staff are friendly despite sometimes being spread too thin. The deli makes a good tri-tip sandwich! The picnic area provides a nice place for customers of the winery, not for other guests.\nShow less"], ["Reviewed August 30, 2017", 5.0, "Cute!", "This place is always a good stop in between tasting for a picnic lunch. They have tons of different cheese options and different small bites."], ["Reviewed August 28, 2017", 3.0, "Nice picnic area...", "This would not be my first choice for wineries to visit in Napa. Although the grounds are welcoming and it's a great place to picnic, it's very comericalized and the wine was only so-so! We visited on a week day and the place was busy- especially the deli. So, busy in fact, we almost decided it wasn't worth fighting the crowds. However, we ploughed through and enjoyed a very expensive picnic on a beautiful day. If you want something touristy- this is the place for you. If you are looking for a great wine tasting- look someplace else.\nShow less"], ["Reviewed August 27, 2017", 4.0, "Crowded - nice for picknick.", "The winery has a large very crowded tasting room. Too busy for enjoyable wine tasting. But the food you can buy to have a picknick is quite good.\nWe had a good time here sitting outside, eating pretty good food and having a glass of wine.\nKids could roam around the winery.\nShow less"], ["Reviewed August 27, 2017", 5.0, "Relaxed terrace tasting", "It was an extremely hot day and the BBQ area and grounds were extremely busy but all was serene and relaxed on the terrace where we had a tasting of five excellent wines at a good price. Danica looked after us with wit and warmth, happily sharing her knowledge and Sattui family stories.\nShow less"], ["Reviewed August 27, 2017", 1.0, "I felt unwelcomed as a guest at this winery", "I recently went to a wedding at this winery. It was pretty and the view was nice. As a guest I felt as though the staff treated us like cattle. There were multiple check points and the way the place was sectioned/roped off was confusing. I would definitely describe the ceremony area as intimate. The pictures online make it look bigger than it actually is. After the ceremony we were herded into a \"T\" shaped area for appetizers and drinks. It was really cramped. The catering staff that was dressed in all black were nice. But there was a lady working the event that was dressed in lighter clothing that was very condescending which made me uncomfortable and made me feel unwelcomed as a quest. You could tell that the other staff were uncomfortable around her as well. It was weird. My husband and I also had a strange experience in the tasting room before the wedding. We were told by the staff in the tasting room that we could purchase a bottle of wine and drink it outside while we were waiting for the wedding to start. So we purchased a bottle. Then we tried to leave the tasting room. The door was now blocked by a stack of metal grocery baskets. I asked two different staff members in the tasting room how to exit the room since the door was now blocked. One told me to move the the baskets and the other told me that someone would move them for me. The stack of metal baskets was about chest high on me and the door was now latched shut at this point. I didn't know what to do. We finally found a door to exit with our bottle of wine and two glasses. Things only became further confusing after that. Now that we finally escaped the tasting room, we headed for some picnic benches to have our wine before the wedding. There was a security guard waiting at the entrance and we asked her if it was okay that we sat and had some wine. She said yes, no problem. We said thank you and proceeded on. Another thirty feet beyond that there was a group of staff members congregating and some lady asked us if we were going to the wedding. We said yes and then she took our glasses and told us that we could not drink the wine that we had purchased. I had my husband put the wine in the car were it sat for the next four hours because I wasn't going to carry a bottle around with me during the wedding. We never would have purchased a cold bottle of wine if we going to have to put it in the car where it was going to sit and come up in temperature. And those bottles aren't cheap. My husband and I felt very misinformed. We were disappointed in the inconsistency with the staff. This only leads me to believe that this place may be run under poor management. I'm giving this experience a one.\nShow less"], ["Reviewed August 25, 2017", 5.0, "Go visit!", "They've got an incredible deli with many amazing things, specially from Italy. Also a huge picnic area and a great staff."], ["Reviewed August 25, 2017", 5.0, "Great place for a relaxing picnic and bottle of wine", "My wife and I had a quick period of time between winery tours and wanted a nice place to grab a quick bite to eat. We were super happy that we took the advice of hte Yountville Visitor center and stopped at V. Sattui for a picnic lunch.\n\nWe both enjoyed our sandwiches. My prosciutto and cheese panini was delicious and my wife also loved her Chicken pesto panini . A very helpful person in tasting room allowed us to try a couple of potential choices before we selected a bottle of 2014 La Merica. They opened the wine for us and gave us plastic cups to enjoy it in.\n\nWe found a peaceful table outside, and had a relaxing picnic lunch. Next time we will leave ourselves some more time and tour the winery as well. It was definitely a simple pleasure and a highlight of our trip\nShow less"], ["Reviewed August 25, 2017", 5.0, "A must see! Deli food under oak trees", "Loved it- very casual. Somewhat crowded and large. We got great deli-style food to go with wine and ate it outside at the picnic tables under the oak trees. Very enjoyable."], ["Reviewed August 24, 2017", 5.0, "Great spot to relax", "My husband and I stopped at V. Sattui after a few other wine tastings. It was a great change of pace to grab a sandwich and bottle of wine and sit in the shade to relax and people watch.\n\nThe deli supplied us with plastic silverware and plastic cups for our picnic. It was such a fun experience.\n\nThe deli was packed, so bring your patience. Also, if you want to purchase a bottle of wine, you do get two free samples to help you choose your bottle of wine. This was a little confusing, so don't pay $20 for a tasting if you just want to sit and share a bottle.\n\nA must stop for your visit in wine country!\nShow less"], ["Reviewed August 23, 2017", 5.0, "Beautiful Winery-Great Tour-Delicious Deli", "I am lucky to be on an extended vacation in beautiful Napa Valley. I have visited V Sattui on previous vacations and have always enjoyed this winery.\n\nI took the tour and learned even more this time about the making of fine wine found in Napa Valley. Our guide greeted us all and helped us to experience the uniqueness of V Sattui Winery.\nThe tour was fun, informative, and allowed us to taste many of the delicious V Sattui wines.\n\nI also visited the deli on more than one occasion. I have eaten in many places in Napa Valley and the food at V Sattui is among the best. On this trip I also tasted the gelato - which is amazing!\n\nI cannot say enough about V Sattui Winery -- from the first step onto the beautiful grounds of the winery - always greeted by one of the friendly people who work here -- to the enthusiastic tour guide -- the deli workers -- and the helpful person serving the gelato.\n\nThanks to all for making V Sattui a special place to experience the best of Napa Valley!\nShow less"], ["Reviewed August 22, 2017", 5.0, "Reserve tasting", "We did a reserve tasting on a Friday afternoon, and we highly recommend that over the regular tasting. We had a great experience in a secluded room with Marc, who took care of us. He was extremely knowledgeable and patient with us as we asked for a couple of revisits before deciding what wines we would ultimately purchase. It was some of the best wine we tried on our whole trip. We went to the market area where they do their regular tastings, which would have been a little too busy for our liking. Great experience.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Nice tasting but not my favorite", "Decided to do a tasting here because this winery came up on a top 10 wineries to visit in Napa County. The market place was great with all the samples and huge selection of meats and cheeses to purchase and nice grounds to picnic on. No outside food is allowed at all. We tried to order sandwiches and there were only 3 people taking orders and we waited in line for about 10 minutes and gave up because we knew by the ticket number we had we would be waiting another 30 minutes. We did do the tasting in the main room and found the wines to be very nice but the marketplace atmosphere around us was distracting. I believe they have another tasting room which I would suggest looking into.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Best Sampling in Sonoma, Napa, or Paso Robles", "We took the \"reserve\" tasting package in the Tower. It's well worth every penny. Wines are super fabulous. If you get Marc as your ho st. Your in for a great time. We compared wines side by side!!! We also tasted 1883 vintage port. Im 58 and dont use crap like \"omg\". Bug i gotta tell ya folks, this place is badazz!!!\n\nWe just were in Tusccany in June. This place is as good as any we went to there and im a Brunello fan.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Great winery with fabulous deli!", "We stopped here for a wine tasting and to have a light lunch. The deli has prepared food to buy or if you prefer, buy some cheese, baguette and salami for a bite. Bring picnic ware or buy paper plates there. They don't supply wine glasses for a picnic, so be prepared. This perhaps one of the best cheese delis I've visited and that's coming from a Wisconsin girl. Wine was fabulous. A great wine stop!!!\nShow less"], ["Reviewed August 15, 2017", 4.0, "Great Italian marketplace", "Even if you are not into the whole wine experience, this is a good stop, especially for lunch. The wine sales area has an Italian market with all sorts of cheeses, meats, prepared foods, and, of course, wine. We selected several things: a Loaf of bread, truffle cheese, truffled mac and cheese, a salad and some wine. We ate al fresco on the picnic table outside under a canopy of trees. The wine train passed by a couple of times and that was nice to see. Very interesting buildings and grounds.\nShow less"], ["Reviewed August 14, 2017", 4.0, "First stop in Napa", "Direct from SFO for deli lunch/tasting/ and snacks for our visit. Must place to stop. Definitely a fun place."], ["Reviewed August 14, 2017", 4.0, "Great Lunch stop", "Very busy, this place draws a large crowd. The deli is fantastic with a large selection of items. If it is too crowded grab your lunch and enjoy elsewhere. The food was excellent. We also did the wine tasting. The wines were good but not great.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Visit with Marc !", "A go to for us every time we are in Napa! Great Cabernet and Merlot! Marc was awesome in taking us through some of the new and older red selections! Will be nice to have waiting for us when we get home!"], ["Reviewed August 9, 2017", 5.0, "Lunch Stop", "We stopped here to pick up some bread, cheese and meats to sit under the trees after an afternoon of wine tasting. We also got a bottle of the Pinot Noir - which was superb.\n\nBeautiful setting under the trees, nice grounds, quite crowded on a mid summer Saturday afternoon as expected - service was excellent in spite of the crowds and we found a nice table with no trouble.\n\nHighly recommend this stop.\nShow less"], ["Reviewed August 6, 2017", 3.0, "Overly crowded", "Wet stopped in, everyone was very friendly, but it seemed to draw a large crowd. We preferred a more intimate setting to this. The grounds were beautiful, I can't say I wouldn't go back, but we preferred other wineries for sure."], ["Reviewed August 3, 2017", 5.0, "Great deli", "Great spot for lunch in Napa. Great deli with a large selection of sandwiches, cheeses, wines and breads. You can picnic on the grounds as long as you purchase the food from the deli. It is by no means cheap but it is a cheaper option than dining in the restaurants of St Helena for lunch.\n\nThe one drawback was the ticket system to order food. They could have done with more than 2 staff behind the counter. We waited 20 minutes to get served. It was worth the wait but the service could be quicker.\nShow less"], ["Reviewed August 2, 2017", 4.0, "The wine is the star here! Go on a non busy day!", "Had no choice on my visit date but if I did I would never ever go on a weekend again! Traffic is horrible, parking is scarce, store is filled with people, most are rude and the prices are high! However, we went for the high end sampling, 5 for $25 and the wines were phenomenal! Marc was knowledgeable and professional! Sattui fan for life now! Thanks Marc!\nShow less"], ["Reviewed July 30, 2017", 3.0, "Pricey deli, uninterested staff.", "Visiting SF from the UK, we thought it would be nice to visit Napa and do some wine tasting.\nA quick check threw up the V Sattui Winery as a good place to picnic from the deli, or the weekend barbecue.\nMy son had Salmon and a side from the barbecue. My wife daughter and I had a sandwich and salads with some olives from the deli. 80 bucks later we are in the crowded garden area, the most expensive picnic I've ever had!\nWell I thought I'd give the $15 wine tasting a go, the young lady who served me seemed distracted but was serving other people as well. She imparted very little knowledge of the wines to me but in fairness did let me try a sixth glass of wine as my wife, who was having surreptitious slurps of my glass, had missed the vintage port and wanted to try it.\nGiven what we'd spent I would have thought that the $15 would have been discounted against the price of a purchase.\nThe weather was good though and the visit was nice.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Lovely Experience", "We booked a 30 minute tour followed by wine tasting.\n'Meet by the Stone Fountain' our instructions said. Whilst we were waiting we examined the vintage wine presses on display.\nThe tour started outside with the vines themselves, then inside for a talk on the actual making and storing with some of the history, dating back over 125 years.\nThe tasting was enjoyable, especially their Madeira.\nThe highlight of our visit was that you can picnic in the grounds, they have an Italian deli and at weekends also hold a BBQ. So wander round the deli, picking up your picnic items and enjoy them seated outside under the trees.\nShow less"], ["Reviewed July 28, 2017", 4.0, "A Winery Offering Something for Everyone", "This Napa Valley winery offers something for everyone--oenophiles, picnickers, gardeners, photographers, and shoppers. Their wines are available only from the winery, so you must buy them on site or order them on line and have them shipped to your home. I have trouble finding domestic Rieslings that are not sweet, and I discovered V. Sattui's Dry Riesling on my first visit there several years ago. I remembered it so fondly that on this recent visit, I bought a case. In addition, the winery's flower gardens are lovely, its wine tastings are reasonably priced, its store tempts visitors with all sorts of wine-related goodies and gifts, its deli choices are delicious, and its shaded picnic area is comfortable and inviting. Time your visit for lunch, so you can take advantage of the deli and the picnic grounds as well as all the other pleasures this winery offers. It's on the main highway at the south end of St. Helena, so it's not hidden but it's definitely a gem.\nShow less"], ["Reviewed July 26, 2017", 2.0, "Wine Club Member Giving up Membership", "I have reviewed this place before - about having to PAY for napkins when you buy something from the deli. So this town you got those free! And the tri tip sandwich is to die for! But......we were made to feel very unwelcome there. Drove in for the deli while on our way to a campground with our travel trailer. The first person told us to go to the back parking lot where the buses park. When we got back there - large lot with 1 bus and 1 shuttle style bus in the lot - the person back there told us oh no....we couldnt park there, we were too big (we are shorter than the bus that was there). So he wanted to direct us down a rode to another lot near a house in the distance....and we would have to walk back to the deli. He finally gave in and let us park along a fence on condition that we would be in there only 30 minutes or less. (luckily we had beat the lunch crowd there and were able to do that). Of course he was not there when we came back so we could prove to him we followed his orders. Altho I like the wines I think this is 2 strikes and we are done.....time to find another wine club and cross this place off our list.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Incredible market", "Not only does this winery have tastings by appointment, they have an amazing marketplace with an extensive deli and cheese shop, wines, household goods, etc. They also have an outdoor grill station and picnic tables set up all around the grounds, so grab some food and wine and enjoy this beautiful property!\nShow less"], ["Reviewed July 25, 2017", 3.0, "Lunch", "This was a great place to stop and have lunch. We did not do the wine tasting but bought a bottle with our lunch. We sat outside and drank and had a relaxing lunc"], ["Reviewed July 24, 2017", 5.0, "LOVE", "Such a nice place for a tasting and picnic! The tasting was an enjoyable and informative experience. The market was lovely as well. There was a great selection of cheese, oils, and everything else you can want for an outdoor picnic! It's little touristy but worth it!\nShow less"], ["Reviewed July 23, 2017", 5.0, "V. Sattui Winery", "If there is only one winery you can visit and don't know enough about which ones to go to, then go here-it will not disappoint. It is one of the 10 best wineries in Napa Valley according to a writer for Wine Spectator based in the Town of Napa. The grounds are gorgeous, lots of parking and tasting options. We went to the cellar area and paid a fee to taste their products and be guided through them. Wound up buying a case that we shipped home. They have a nice gift shop where most visitors go for trinkets and wine tasting. It was very crowded when we were. I would pay the $25.00 and go to the cellar tasting room.\nThey sell food and you can have a picnic on their lawn. Didn't buy food so can't comment on it. Very mellow for us.\nShow less"], ["Reviewed July 23, 2017", 4.0, "Fun lively place but very crowded.", "Winery is Italian in style with s nice setting with plenty of seating and picnic area under trees making it pleasant place to get food. Tasting room very large with more than 60 different wine choices and 200 different cheeses. Was very crowded which made service a little slow. One reason to go is they make an excellent Madeira and some nice ports which is different than most other wineries.\nShow less"], ["Reviewed July 21, 2017", 5.0, "Amazing winery and deli", "First time I visited V Sattui was by luck. Took a wine tour out of San Francisco. V Sattui was one of the stops. Was so amazed I visit at least 2 times a year. The fabulous wines, delicious cheeses, and amazing deli keep me coming back. In addition the Lobster Fest in April is such an exciting event. For Christmas gifts I give V Sattui wines. Everyone wants to know how they can buy the wine. Direct from the winery is the only way. My contact is Stacey, the best representative.\nShow less"], ["Reviewed July 20, 2017", 2.0, "Skip this tasting but enjoy the food", "The man who poured our wine clearly wanted to be ANYWHERE but there. He didn't tell us a thing about the wine; I have been here before, so I shared more information about the wine with my family than he did. It was frustrating. He also wasn't keeping track and shorted one of us by one of our tastings. I can say that Luis was really helpful; he helped us get a spot at the bar for our tasting. I just wish we had a more enthusiastic pourer. It was a waste of time. I bought wine here when I was here last year, but not this time. That said, we got food and sat outside and enjoyed the food. The margherita panini was excellent. Get the food and skip the tasting.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Enjoyable experience", "It was crowded when our group took the tour and had the wine tasting but I enjoyed it so much that I bought some wine to ship home!"], ["Reviewed July 18, 2017", 4.0, "Beautiful Picnic Areas", "My husband and I stopped at this winery after a recommendation. We ended up visiting the deli and having a wonderful picnic on the grounds. If we had brought a cooler with us we would have brought home an array of meats and cheeses. The deli had a fantastic selection!\n\nI wish we'd had a chance to taste some of their wines, but the wine bar was too crowded to enjoy a tasting. In the end, we enjoyed a relaxing picnic on their beautiful grounds. Next time we're in Napa we're going to be sure to sample some of their wines.\nShow less"], ["Reviewed July 18, 2017", 4.0, "Tasting room OK. Deli and picnic area a Gem", "The tasting room and wines were nothing spectacular. However the cheeses and meats and accessories make for a great pcinicn and they provide a beautiful picnic area. Pair that with the wines and its a great addition to a fun day"], ["Reviewed July 17, 2017", 3.0, "Overrun with tourist", "Very crowded and not very pretty. Too many guests trying to get a table for the BBQ. BBQ ribs were good but the pizza was very poor. Long wait to order and then get food. The deli has a great selection.\nWould suggest not eating at this venue but to stop at a grocery store in the way in and do a picnic. Wine - Sauvignon Blanc was very sweet and not enjoyable.\nShow less"], ["Reviewed July 15, 2017", 5.0, "Must do mayhem!", "This is probably the only vineyard in Napa that has a very elaborate delicatessen, curio shop and a large garden with benches and tables set up for customers to use..\n\nFabulous atmosphere and ideal to consume a bottle of wine or two with some cheese and charcuterie platter. Don't forget to try the homemade gelatos and sorbettos.\n\nIt is very busy and full of visitors so if crowds are not your thing stay away!\nShow less"], ["Reviewed July 13, 2017", 5.0, "A great place for a picnic or to get wine snacks", "We visited V. Sattui as part of our Napa Valley Wine Train experience and loved it! We had a brief tour and a wonderful seated wine tasting experience in the cellar. Afterwards we visited their gift shop and purchased some delicious sourdough bread for our picnic the next day. Their wines are delicious, we bought two bottles, and they have a large picnic area in front of the winery. Be sure to visit it their gift shop and deli early, it gets crowded but it is so worth it!\nShow less"], ["Reviewed July 11, 2017", 5.0, "Lots of hustle and bustle but worth it!", "We timed our trip to V. Sattui to coincide with having a late lunch and it was perfect. The tasting bar was crowded but we hovered for a few minutes before a spot opened up and we were tasting within minutes! We enjoyed each of the wines we tried and it was convenient to select our bottles right with our server before paying. We were able to purchase a delicious lunch from the deli and enjoyed on the picnic tables outside which were full but turned quickly around. Some delicious selections of both food and wine, a great one stop shop on an afternoon of tastings!\nShow less"], ["Reviewed July 10, 2017", 4.0, "Greg&Kip", "Super stopover with great views and super lunchtime deli style menu. Great to sit outside in the fresh air having a light deli lunch and glass of nectar of the Gods"], ["Reviewed July 9, 2017", 4.0, "Great winery for all to enjoy", "We did three days in Napa and Sonoma, trying a number of vineyards and restaurants. Looking back, our group found this vineyard to be one of the most fun and relaxing. After our sampling, we bought some bottles, wine, and cheese and ate on their grounds. It was just a great place to unwind, enjoy yourself, and not take things too seriously. Stop in and take a load off.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Excellent wine-tasting, deli and picnic spot", "Great place to stop for a picnic lunch -- not with your own food of course (they don't allow it) but with bread, cheese, olive oil, and nice bottle of cool white wine. Probably to best deli market in Napa Valley."], ["Reviewed July 7, 2017", 4.0, "Great picnic area for families", "Wine tasting a little rushed... they were busy, like a little slower pace. They have a great market to pick up meats and cheeses and lunch. The wines are great!"], ["Reviewed July 5, 2017", 4.0, "Just Go Early in the Day", "We had stopped at V. Sattui ten years ago when they used to offer free tastings. The place was utter chaos, so we turned around and left. Over the past few years, we have received a few bottles of their wine and Madeira from a relative who is a wine club member and we have really liked the wines. So, when we had a 2 for 1 from our inn, we decided to give them a try again. This time at 10:45 a.m.\n\nGood decision! Although there were plenty of people there, it was not crowded at all. We had a very pleasant young woman serve us and it was nice for my husband and me to be able to choose different items from their large tasting menu. We enjoyed everything we tried, but the port and Angelica were really quite special.\n\nAfterwards, when we were walking around outdoors, an employee approached us and asked if we wanted her to take our photo. So kind! We were very happy with the entire experience this time around.\nShow less"], ["Reviewed July 2, 2017", 5.0, "something for everyone", "We visited V Sattui after reading about it on a TA blog for first timers in Napa. We were blown away by our experience there. We did the winery tour with tasting (30$), and our guide was adorable and her passion for the place came through. She was very knowledgeable and made the day enjoyable. We then had a picnic with food from the deli and relaxed on the picnic grounds. Beautiful space, wonderful welcoming staff, and you can experience this place at any price point. If you just want to picnic and see the beautiful grounds (very affordable) to private tastings (pricier), I would highly recommend V Sattui.\nShow less"], ["Reviewed July 1, 2017", 5.0, "So great", "We arrived here a little late for tastings, but they let us taste 2 wines a piece and they recommended a Zinfandel and a Cabernet Sauvignon that were wonderful. We ended up buying them and wished we had arrived earlier and could have enjoyed the grounds more.\nShow less"], ["Reviewed June 30, 2017", 2.0, "We were ready to go when we arrived...", "I am not into touristy types of places. And it's way too hot in Napa to have to stand in line to eat and have no shady place to sit and eat. And they didn't have enough seating for guests. We ordered from the outdoor tent which was underwhelming bbq and pizza. We ate and never even went inside for a tasting or tour.\n\nThis is a place for those who like to do the touristy thing... hundreds of people and lots of waiting.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Napa must do", "This was our fourth Napa trip and we haven't missed V. Sattui once. Quaint winery, true to their history. They aren't going for the flash and glitz, but rather, good wines and a comfortable environment.\n\nAn added benefit is this is one of very few wineries that offer picnic seating, along with deli foods for lunch. They also open at 9AM for those that want to get an early start!\nShow less"], ["Reviewed June 29, 2017", 5.0, "A Wonderful Picnic", "If you're hungry and want to have a memorable picnic, come to V. Sattui Vineyards. The market has a fantastic assortment of sandwiches, cheeses, wines and accessories for a wonderful picnic. Tables are available, in the shade or the sun. Buildings and gardens are gorgeous. We did not take a wine tour but enjoyed the facilities instead.\nShow less"], ["Reviewed June 27, 2017", 3.0, "Commercial Vinyard visit", "Large facility with lots of choices of cheese and other edibles. The wine tasting was a major push to join the wine club. When they realized we were not interested in joining, it was obvious we were not of a concern to them. The grounds and architecture were pretty and receptive to picnic crowd.\nShow less"], ["Reviewed June 25, 2017", 3.0, "Crowded", "Although the wine was nice, it was incredibly crowded. Attracts a much younger demographic. The architecture and grounds are beautiful, but make sure you use the bathroom Before you come because the lines are LONG. Tends to have lots of inexpensive wine tasting deals."], ["Reviewed June 23, 2017", 3.0, "Tourist trap", "The overall facility was ok but very crowded and overrated in my view. The area for lunch was nice but again too crowded with too few tables and places to actually have lunch. The wine tasting was ok but again very crowded and not air conditioned.\nShow less"], ["Reviewed June 22, 2017", 4.0, "Great wedding and wine", "I was able to go to a wedding this June at the winery. It was beautiful and the wine was great. Be sure to check out the barrel room in the cellar."], ["Reviewed June 21, 2017", 5.0, "Disney world of wineries", "We went for an afternoon tasting on a Tuesday and the place was packed. They have a big bar and the bartenders work hard trying to get to everyone. We were able to split a tasting and never felt rushed. Staff very friendly and accommodating. The deli is attached and had many food options for a picnic. Outside there were many places to picnic near the vineyard.\nShow less"], ["Reviewed June 16, 2017", 4.0, "huge deli and picnic area, supposedly great wines", "i have been here twice now, and continue to feel guilty that i never get the wines. i do enjoy sitting outside on the picnic tables enjoying the bounty from their market. i reccomend you get some fresh bread and have them slice some bresaola (quarter pound minimum is like $8) but oh so good.\n\ncrazy large cheese selection.\n\nThey have lots of wine options (including chilled), not just their own, which apparently have been winning awards.\n\nyou do have to buy plates, cups, forks, etc. for like $2 - just fyi, it probably will annoy someone in your group :)\n\ni promise to try the wine next time\nShow less"], ["Reviewed June 13, 2017", 5.0, "Picnic Spot and Wine Tasting", "There is a nice deli in the gift shop with wonderful selections for lunch. The seating outside is fine. You are not in the vineyard, but it is shaded and quaint.\n\nThe wine tasting is 2 for 1 with the Napa Wine App. Cell reception is generally poor in the valley but seems to be fine here.\nShow less"], ["Reviewed June 13, 2017", 5.0, "Great food, wine, & hangout spot", "Busy marketplace with many lunch options and cheeses. The tasting is very inexpensive but the wine was great. Outside there are picnic tables to enjoy your food and wine. Beautiful area to spend a few hours at."], ["Reviewed June 13, 2017", 3.0, "Spend your time elsewhere", "If you are looking for a quiet wine tasting with a nice ambiance, skip V. Sattui. The tasting room is like a large general store. Buses stop here for tasting. It was very loud and crowded. Good points are that they have a variety of wines so if some of your party like sweet and others like reds you'd be in luck. Also, they were efficient with the tastings. But it was a bit rushed and service was not personal. We tasted here on a Tuesday, can't imagine what a weekend would be like!\nShow less"], ["Reviewed June 12, 2017", 4.0, "If you can survive the zoo, it's worth it", "The place is a perpetual zoo. A lot of people pack through the facility, and the store has meats and cheeses and other picnic fare, as well as there being something in the courtyard (it was BBQ, pizza, and gelato when I was there). Oh, and there's wine. I managed to find an empty spot at a tasting bar and was there to sample dessert wines. The woman was a little harried, given the crowds, but she was friendly and helpful. The normal deal is you get 5 tastes for $15. The way Napa is going these days, that's pretty darn good. Their dessert wines have something for every palate. They also have a large number of conventional wines for you to choose. If you can stand the chaos, it's worth a visit.\nShow less"], ["Reviewed June 12, 2017", 2.0, "Crowded and below average winery", "Huge crowds gather for free tasting but the wine is below quality of many other wineries in the area. They offer food and picnic area which is nice but very crowded.and very few wineries have this. They do not allow bringing in any outside food or wine and they check carefully. There are far better wineries in the area to visit.\nShow less"], ["Reviewed June 9, 2017", 3.0, "Crazy fun and pushy sales force..", "We enjoyed the whole experience with the exception we made the mistake of going to the testing area... Wow these guys are retired insurance salesman! Other than that it really is a great place with awesome picnic area and diversity of foods and wine are class..\nShow less"], ["Reviewed June 9, 2017", 4.0, "Incredible Spot!", "It's no wonder why V. Sattui is such a popular destination, they have delicious wines, over 60 to choose from. Their deli offers a wide variety of cheeses, cured meats and olives, baguettes too. Or order a sandwich. The grounds are beautiful. What an incredible spot!\nShow less"], ["Reviewed June 8, 2017", 5.0, "Picnic in Wine Country", "When in Napa/ St Helena just bring your self,V Sattui has gourmet takeout that can be enjoyed in their picnic tables."], ["Reviewed June 8, 2017", 5.0, "Best place to start", "I call this winery Napa 101. Super accessible - literally right smack in the middle, and figuratively, with very easy to drink wines and friendly wine tasting guides. But the best part is the deli where you can order some cheese, bread, meat, and side dishes like hummus and eat right outside on the pleasant picnic grounds - of course with your bottle of wine you just tasted and bought!\nShow less"], ["Reviewed June 6, 2017", 5.0, "What I imagined", "First time vising Napa, this is what I was envisioning. Sattui had beautiful grounds. Ample places to sit and enjoy. The wine tasting was great and the server was very helpful. I liked that you could choose whichever wines you wanted to taste from the menu. The cheese shop was incredible giving I'm a cheese lover. I purchased a full block of cheese that one of the workers brought out from the back. Highly recommend a visit on your wine tours\nShow less"], ["Reviewed June 3, 2017", 4.0, "Visit to Napa", "A mixed bag type of winery. The grounds are beautiful but crowded with picnic tables full of folks, food vendors, etc.. Wine tasting as offered by most other wineries in this area seems to take a backseat. There is a \"store\" that offers cheeses, breads and other wine accompaniments - to taste and to purchase. Samples are freely given which encourage people to buy the products - and maybe a bottle of wine to go with them. We were 2 couples who left with 7 different kinds of cheeses, 2 artisan breads and a cold bottle of wine!! Along with others, we ate our purchases on the winery grounds - which was an enjoyable experience. Maybe the wines offered at this winery (and not available for purchase anywhere else) are not as sophisticated as some may like, but after an entire day of wine tasting at $25-50 each, it was a fun way to end the day.\nShow less"], ["Reviewed June 1, 2017", 2.0, "Too commercialized", "This place is a zoo. If you want cheap wine tasting than this is a good place for you. If you want a quiet experience, quality wine, with a nice view you need to go someplace else. We would not go back."], ["Reviewed May 30, 2017", 2.0, "Great cheese terrible wine", "stop for grounds and cheese only. Very cute deli, nice host but the wine itself was pretty bad not for a sophisticated wine drinker. We didn't really like any. Found one cab tolerable out of the basic wine tasting. They do have lovely grounds and food market which you can take outside to picnic.\nShow less"], ["Reviewed May 28, 2017", 3.0, "Nice for food", "This place is a mix of many things. It's very well thought out as a place to have a nice quick bite of quality products, enjoying the outdoor picnic area on a nice sunny day. The service is very good. Unfortunately it's very busy (at least, when I was there, it was) and the wine is not up to par with the place itself.\nShow less"], ["Reviewed May 28, 2017", 5.0, "Perfect for a picnic", "Four of us came here as we'd heard that it was a great place for a picnic. The place had barbecue food for sale, an excellent deli including vegetarian and vegan options plus a good selection of wine."], ["Reviewed May 28, 2017", 4.0, "Nice to Stop At", "Very pretty stop on any Napa tour. Beautiful facility. Great picnic area and very good deli with many selections. Delicious. Only drawback is the wines are a touch mediocre for my taste. However, don't let that stop you as it is a great lunch stop spot.\nShow less"], ["Reviewed May 27, 2017", 5.0, "Beautiful Winery", "Very nice wines. They have a very nice artisan deli where you can buy sandwiches, cheeses, and their wines, and have a picnic lunch outside. They have picnic tables, and it's a very beautiful setting. Their homemade mozzarella cheese is delicious. This is a great winery to plan to have lunch at.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Returned Visit", "It had been five years since our first trip and we weren't disappointed. Other than the area growing Sarttui Winery hasn't. Friendly staff, beautiful grounds, great variety of food and best wines. Enjoy❤️👍"], ["Reviewed May 26, 2017", 5.0, "Wonderful!", "Amazing tasting, the tour was incredible and our guide Angela was wonderful. The whole experience was surreal. I highly recommend visiting this winery and spending hours with tasting and lunch."], ["Reviewed May 26, 2017", 5.0, "Bring a picnic blanket!", "This place is wonderful. Stop by their deli and grab your picnic items, then head to their wine dept and get a bottle ( or more) to share while you picnic."], ["Reviewed May 26, 2017", 5.0, "Best winery!!!", "The most amazing winery! The food was amazing and the staff was just as great. So much history here. Highly recommend this place to couples, $35 terrace package especially."], ["Reviewed May 24, 2017", 4.0, "Came early", "I have booked in Advance the daily Tour for $30/per adult( this is your basic wine 101 class). We took the first tour in a Saturday morning with a 90+ degree weather. It wasn't pack with people yet at 11:06 am when we arrived, no crowds yet in the picnic grounds but can see them preparing already for the BBQ.Parking was easy at this time of the day. The drive from San Jose to Napa valley took us 2 hours ( left at 9 am), hit some traffic at Oakland but the biggest traffic was when we entered the main road headed to St. Helena were most of the wineries were located, it was bumper to bumper. If you could skip Napa Valley in a weekend,skip it and go on a weekday you would like it more with less crowds. We were like 6-7 min late for the tour.I called 3x to the number enlisted at the reservation email to notify we were late due to traffic, but no one was picking up the phone instead a VM was the only option. Left 2 VM. I got No return call but at 11 am,our tour guide called and asked our whereabouts with no idea that I tried calling. Anyway,he handled it very well and very cordial.We made it almost on time because the group didn't yet start.There were 3 couples in our group( there was a large group who came late and missed the tour to the vineyard).I had some winery tours in the past but not in Napa Valley. The tour would talk about the wineries production of wine,the history of the winery, a quick education regarding wines and the Napa region. We walked through the other tasting rooms towards the back of the winery where the vineyards are. The walking tour does not allow you to walk far and will just show how the grapes are formed etc.Take a lot of pictures since you won't be allowed back outside once the tour is over. The tour guide didn't mentioned that nor offered a few minutes if the group wants to take a couple of pictures since the area was one of the picturesque area in the winery. The best area to have your wine tasting, in my opinion, is Tasting in the Terrace ( 1st came 1st serve basis) since you can sit down , relax and have the actual view of the vineyard and the the fountain and can take pictures /sip wine of an actual \"winery\"feel.The best part of the tour is the complimentary tasting in the cellar. We had 3 wines to taste in the actual menu and then had +2 other complimentary wine because one in the group is celebrating his birthday and 1 complimentary from the winery total of 5. It was great, not feel rushed, the tour guide was attentive to questions and needs this time.Bring your own Bottled water during the tasting, they don't give you one. By the time the tour was over, crowds have poured in and bathroom lines were long,and parking was crazy. I got a little tipsy and so stayed in the winery and ate lunch. Good thing a lot of seating areas aside from the picnic area to rest. Staff are very friendly and helpful. You won't be able to visit more than 2 wineries ( wineries open at 9 am,but who wants to go at 9 am, I started at 11 am) and have a good time ,plan to visit your top 2 and call it a day. It's fun but tiring in a very hot day and in crowds of tourists like yourself. SUMMARY: Visit 1-2 wineries with a tour or a sit down tour, enjoy the winery and call it a day, don't drive around. For the V.Sattui winery,take the Terrace Tasting or the discover tour\nShow less"], ["Reviewed May 23, 2017", 5.0, "California trip", "Have been going to Sattui's for years. I'm a wine club member and visit as often as possible. Love everything about this place, the people, wines, deli, and grounds. I always feel like family when visiting. Never feel rushed when wine tasting or pressured to buy. I've met so many fantastic people at the winery throughout the years. Have definitely introduced everyone I know to the amazing wines. Haven't found a bad wine choice yet, something for every palate and something at the deli to pair with for a brilliant relaxed experience. Special thanks for the personalized experiences from Tom, Bob, Janet, Christine, and Jay. Can't wait to visit in October!\nShow less"], ["Reviewed May 23, 2017", 5.0, "Wine tasting and picnic", "Couldn't have been better. Great food, great wine, great venue and great weather. Will definitely visit again"], ["Reviewed May 22, 2017", 4.0, "Nice property", "Nice deli and tasting room! A huge selection of fine cheeses Great option to buy food and have a picnic outside."], ["Reviewed May 22, 2017", 4.0, "Napa Visit", "Very crowded a touristy but still managed to buy and experience a lovely picnic on the grounds. Great deli and some delicious wine only available on premises. Inexpensive VIP experience is available should you wish to avoid crowd."], ["Reviewed May 22, 2017", 5.0, "Fabulously met all our needs for the day.", "Glad the visitors center recommended V. Sattui. They have a Deli/Market, and picnic benches outside to eat at that are fully shaded by large trees. It was perfect for our needs. The food was fantastic. They even had some of the sweeter wines we like. The tasting room was very busy for a weekday so we were not the only ones that really enjoyed or hours at the winery.\nShow less"], ["Reviewed May 21, 2017", 5.0, "Always fun and great wine", "We've been members for several years now and enjoy all they have to offer. Annual events from their wine crush party to a lobster fest, all fun things to do while enjoying some of the best wine ever made."], ["Reviewed May 20, 2017", 4.0, "One of the better wineries - it has food too!", "We visited V Sattui two days in a row. On the first occasion it was as part of a wine tasting train tour and on the second day to experience their deli. We had a range of salads - especially the kale and tomato ones were good as well as olives. Their baked egg plant was a bit of a disaster - more stuffing than egg plant. Be aware you can't bring your own food and eat there.\nShow less"], ["Reviewed May 19, 2017", 4.0, "Great place to do a picnic lunch", "During our recent Napa valley tour we stopped here one day for lunch - purchased sandwiches, cheese, crackers, dips, wine, and NA drinks, and found a bench out on the lawn to have a very pleasant lunch. Be prepared to wait -be certain to get a number as soon as you enter if you are going to want to order sandwiches and sides from the deli area. They have a really good selection of cheeses and related, and of course many many wines. We did not do a wine tasting here. I simply purchased a bottle of a red blend which was a great picnic wine.\nShow less"], ["Reviewed May 18, 2017", 5.0, "The Best of the Best Winery in Napa", "In my humble opinion, this is the best wine tour and wine testing event. Our tour guide was excellent and we actually got to taste 5 separate wines of our choosing verses the winery giving you what they want you to drink. Everyone needs to do the wine tasting here.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Lovely spot for a picnic", "Amazing grounds where you can just grab a bench and have a picnic with friends on a lovely summers day. Management doesn't allow external food but you can always sneak some stuff in. definitely worth a visit even if you are just passing through."], ["Reviewed May 12, 2017", 5.0, "When you think of going to Napa - this is what you think of", "Fabulous grounds, great wines that aren't overly expensive by Napa standards, and likely the best deli counter in the valley. A must stop for first timers!"], ["Reviewed May 11, 2017", 5.0, "Beautiful winery, great food to eat with your wine.", "We love this winery. The buildings give you the feel of years gone by. They have wonderful food available to eat with your wine on the lovely grounds"], ["Reviewed May 4, 2017", 4.0, "Fun Lunch Spot", "Deli has lots of choices and then go outside in the shade and open a bottle and have lunch, what could be more fun."], ["Reviewed May 3, 2017", 4.0, "Wine tasting", "Great wines! Nice tasting opportunity. It's also possible to buy wine, bread and cheese to take outside and have a garden picnic"], ["Reviewed May 3, 2017", 2.0, "This place is only as good as your server", "My boyfriend and I went here two years ago and had such a lovely time that we made it a point to come back even though there are plenty of other choices in the area. Well, we were very disappointed. It was crowded, the ladies serving wine were incredibly rude and acted as though they could not be bothered to serve us. I could understand if we were being drunk and obnoxious, but this was our first winery of the day and we had high hopes that were soon dashed to the ground. Sadly, I will not ever go back here. The wine was ok, but I've had much better from my local winery in Temecula, Ca. The property is beautiful, and it seems like it would be a great place to hang out, but the service left a bad taste in our mouth.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Excellent Winery- great service, excellent marketplace, and even better wine!", "We have gone to Napa several times, but always make it a point to visit V Sattui. The attention is excellent, I love trying their future wines. We ended up becoming members, as you cannot find any of their wines in local wine retailers (Total Wine, etc). They have an amazing marketplace where you can purchase delicious food and eat right outside in one of their picnic tables!\nBe sure to try their Napa Dipping Oil, and Crushed Pepper- excellent! Truly one of a kind!\nShow less"], ["Reviewed April 30, 2017", 4.0, "Great venue for event", "Went for family wedding. Great Venue with beautiful gardens and views. Magazine like reception area."], ["Reviewed April 30, 2017", 5.0, "Nice Stop in Napa", "Great place to spend the day. Great Winery Fantastic deli and they have BBQ and oven fired Pizza on the weekend. They even had gelato. Because it's so popular it can get crowded and noisy next to the highway."], ["Reviewed April 29, 2017", 5.0, "Best place ever to picnic with kids", "If you are in Napa/Sonoma and you want to visit a Winery with your kids: this is the place!\n\nFirst, they won \"2017 winery of the year\", so you will enjoy excellent wines.\n\nSecond, the museum is a great example that hard work and faith pays off.\n\nThird, for $15 you could try 5 wines (any red/white of a almost 20 options). This is a great tasting opportunity to later choose a bottle or two of the wine that you loved most.\n\nFourth, they have riesling no alcohol for the kids that is the grape juice more delicious!!!\n\nFifth, they sell all kinds of bread, cheese, ham, salads, to join the bottles of wine outside, in the garden, where there are big picnic tables. Also there are plenty souvenirs (shirts, cups, magnets, and many other wine things).\n\nIt was wonderful!! A day with my family to always remember.\n\nI want to thank Julie, she helps us in the tasting, she is very kind, helpful, outstanding!!\n\nShow less"], ["Reviewed April 28, 2017", 5.0, "Go for the Wine, Stay for Ed!", "I just left V. Sattuu Winery after visiting for Tia Rosa's Birthday. The wine was awesome but what really made our visit was a knowledgeable fellow named Ed. He made awesome recommendations and even got Grandma to try some dessert wines. In the end we bought 3 bottles of his recommedations! We talled to a manager on our way end to tell him how pleased we were with Ed but we wanted to reiterate how personable he was! If you have a chance to go, be sure to stand at hia end of the bar!!!!\nShow less"], ["Reviewed April 28, 2017", 5.0, "Delightful Picnic Lunch with Great Wine!", "Be thankful that they don't allow you to bring outside food into the winery. Even if you weren't planning on having lunch there, you really need to try a couple of their items from the marketplace deli. While I wanted to try everything, I settled on a panini, a rice ball, eggplant croquet and mozzarella/olive salad. Each one was better than the next and, amazingly, their prices were very reasonable. All that was only $24 for two people.\nWe also got a bottle of Pinot Noir (also reasonably priced). Then we headed outside to one of many picnic tables and enjoyed a great lunch.\nThis place is a \"must do\" while in or near Napa.\nShow less"], ["Reviewed April 25, 2017", 5.0, "Wine and food", "It was nice to be able to grab a sandwich and sit on their lawn to enjoy it. My husband and I split a tasting. The people pouring weren't very attentive or patient (maybe they assumed we wouldn't be buying much.)"], ["Reviewed April 25, 2017", 5.0, "Wine & Cheese Sampling and More", "My grandma and I heard that this 1885 winery would be a great place to visit, and we couldn't be more pleased that this was our first winery visit!!! We were impressed upon our arrival at the incredible architecture and beautiful, but comfortable setting. The staff was knowledgeable and helpful from every venue: food service, cheese sampling, wine tasting and purchasing of wine and gifts. I am thinking of ordering a case of some of the best wine I have every tasted from V. Sattui this summer.\nShow less"], ["Reviewed April 24, 2017", 4.0, "Wonderful for picnic lunch", "Sattui has a good deli and wine bar but the highlight is the ability to take your lunch outside and picnic under the trees on the spacious lawn. We visited on a sunny day and love the spot. I had a seafood salad and he had a prawn salad with an unusual sauce. Strangely you couldn't get a glass of wine to take it outside. It gets very crowded but there is a lot of parking and enough space to picnic\nShow less"], ["Reviewed April 23, 2017", 5.0, "Best red wine", "Best red wine I've ever had. We did the 25 dollar tasting that not in the market. If you have been to a few wineries this place has a shop with food ( free samples as well) if you wanted to take a break from wine.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Great stop for picnic lunch or carryout dinner; good wine too!", "We have been stopping at Sattui Winery every time we visit the Napa Valley since 1983. I have lost count of how many picnic lunches and cases of wine we have bought there over the years. During our most recent stay we had two picnics and got two carryout dinners there, as well as buying wine. Their Egg very dry Riesling is the only really dry Riesling we have found outside of Germany. Prima!\nShow less"], ["Reviewed April 23, 2017", 5.0, "Wonderful Picnic Lunch", "The private picnic area has lots of casual seating in shady and sunny spots. The day we were there, a band was playing swing tunes. There are food stations where you can get pizza, barbequed sandwiches and salads. You can put your order in and then roam around. We went into the shop and bought a nice bottle of white wine which they opened for us. When we got back to the barbeque, our food was done. A lovely way to enjoy lunch - and a break - between wineries.\nShow less"], ["Reviewed April 23, 2017", 3.0, "Beautiful grounds", "This is a wonderful spot to have a picnic on the grounds. They have a wonderful deli and wine shop, it's a very picturesque property."], ["Reviewed April 22, 2017", 4.0, "A great stop for lunch", "One of the very few places you can both taste wine and buy a deli lunch in Napa Valley. The tasting room was packed when we arrived, but there are three rooms total, and lots of staff, so there was no wait. The folks who handle tasting are knowledgeable about their wines, but also very patient and helpful with newcomers. It's a great spot to bring family or friends who are wine noobs to help them learn the basics. $15 for tasting (5) and they're happy to do split tastings for a couple, too.\n\nLunch was good (they have a selection of just made sandwiches and salad, as well as a huge cheese counter, and they'll open any wine you've bought and provide cups), and we had it out on the lawn at one of their picnic tables. While we were there, the Napa Wine Train pulled up and the folks were herded off for their tasting. We remarked how much money we'd saved by not being on the train...\nShow less"], ["Reviewed April 22, 2017", 5.0, "Love Sattui Wines😍", "I love love love Sattui wines for creating my moscato wines.\nI am not a wine drinker but I fell in love with the Moscato wines, a forced taste test from my beautiful wine love Aunt in Cali turned out to be such a beautiful experience.\nOh and great thing about it is that they ship around the world.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Great winery, amazing wine and food", "Would highly recommend this winery. Very generous tastings of great wines for a very reasonable price. No need to book which was a bonus. Great deli where you can buy lunch to enjoy in the gardens with your wine."], ["Reviewed April 19, 2017", 4.0, "Perfect for lunch", "What a nice place we stopped here for a tasting and stayed for lunch the food was great the staff was great and the wine well we bought a few bottles for home"], ["Reviewed April 17, 2017", 5.0, "Wine tasting and purchase", "First, very reasonable charge for wine tasting: 5 wines for $15's. We tasted some amazing wines and purchased two dessert wines and their most expensive Zin. Yum! We got some sandwiches from their deli and had a picnic lunch with my staff. Def. one of my favorite wineries.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Fabulous Winery!", "While celebrating our 50th wedding anniversary, and enjoying the famed Castello di Amorosa, we were encouraged to visit their \"sister winery, V. Sattui...and it did not disappoint! As others have indicated, the deli is incredible...not only in selections of deli food, salads, sandwiches(all delish), but memorable gifts, chocolates, and of course, wonderful wines. We had hands down, our best wine tasting here with Demetrius who helped us celebrate the occasion and we walked away with wines to take home and share (well ..some of them!). He was informative, kind and helpful amidst a very busy bar of wine tasters. While visiting Napa, make sure your include this beautiful, family friendly winery and ask for Demetrius!\nShow less"], ["Reviewed April 16, 2017", 5.0, "Loved It!", "Plan to spend some time here!! Great great wine! Fabulous market for all kinds of foods! Picnic areas outside offering everything you need for a snack and There is hot food available as well!\n\nWe loved the tasting we had and the ability to wander around and see the grounds! You can buy a bottle and they'll uncork it for you! Take it outside and enjoy! One of my favorite bottles on the trip!\n\nIt gets pretty crowded, but not so much that we couldn't enjoy the experience!\n\nAmazing time and we highly recommend it!\nShow less"], ["Reviewed April 12, 2017", 4.0, "We only did the Deli", "We enjoyed a very nice sandwich and cheese from the Deli. The tasting area was very busy as is most days. They have very large selection of cheese which we enjoyed. They let you taste five on our visit. You can taste dipping oils. Of course you can taste the wine. They have a large outdoor picnic area for their customers.\nShow less"], ["Reviewed April 11, 2017", 4.0, "Great place great tasting price", "The deli is great, lots of choices with pastas, salads and sandwiches. Also opportunity to purchase gifts and food goods. The oil tasting area put me off, people were double dipping (ie biting bread then dipping again using the same bread), surely thats a health and safety issue there.\n\nThe wine tasting was the best value we'd seen in Napa and highly recommend.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Wine tasting", "V Sattui had a great tasting experience and wonderful wines! We arrived right after opening so had the place practically to ourselves. Enjoyed the wines so much that we went back later in the day (was packed at that time) to get a few more bottles.\nShow less"], ["Reviewed April 10, 2017", 3.0, "Fun if you are new to Napa...", "V. Sattui has some decent wines but nothing to write home about. If your looking for a great place to get a salad or sandwich and some wine to picnic with on their grounds then you should definitely stop in! They do have a killer deli! They have lots of wine themed knick knacks too. This year they were just too crowded to be worth it. I did a quick run in to buy a bottle of Madeira which I love to use to make sauteed mushrooms!\nShow less"], ["Reviewed April 10, 2017", 5.0, "An unusual winery experience, but fun", "All of our other winery experiences while in Napa tended to be quaint and quiet. This place is the opposite. Lots and lots of people visiting. The tasting area is loud because of the crowds. However, their wine is very good. Lots of variety including dessert wines. I fell in love with the Madeira- not for everyone, but you should try it!\n\nThey have a big picnic area and sell food. Great place to have lunch and some wine. Many things to buy in addition to wine. Very \"touristy\" but we still had fun.\n\nDon't let the crowds scare you away, give it a try.\nShow less"], ["Reviewed April 9, 2017", 5.0, "A Great Story", "5 of us visited on a rainy Friday afternoon -- a perfect day to taste some of the best wines in the region and renew the bond between family & friends. V. has 3 wine-tasting rooms and the smaller ones are for serious wine enthusiasts who want to taste the reserve & higher quality (& pricier) wines. I prefer the larger noisier main room because the atmosphere is boisterous, its in the gift shop where you can buy cheeses, olive oil, local jams & chutney, crackers & bread, etc., and also because I'm not that serious about wines. The grounds are extensive & beautiful, and the buildings are like medieval castles. Please stop by -- you won't regret it\nShow less"], ["Reviewed April 8, 2017", 5.0, "Lives up to its billing", "Great wine tasting, $15 for a wine tasting fee is nothing in Napa, and this place is worth it, no reservations, show up during hours.\nWe loved EVERY wine we tasted here, which was not the case with some wineries.\nWe thought their Zins and their Cabs were stronger and better wines.\nEnded up buying a Vittorio's Vineyard 2012 Cab, really great wine, but if money was no object, I would have bought much more. They have a store with a lot of gifts and gadgets and a picnic area. A MUST visit if in Napa.\nShow less"], ["Reviewed April 6, 2017", 5.0, "The best of the best for wine & food", "V Sattui has forever been my favorite go to winery in Napa. I'm a New Yorker by birth, Texan by choice. What I miss most about NY is the food. ITS ALL THERE! V Sattui has a NY Style Deli on property!!!! Plan your day for a stop there for lunch or an early dinner, you will be so happy that you did! Oh yeah, the wine, sensational! I highly recommend the tour. If you're lucky your tour guide will be Danica, a 4th generation Sattaui. Lastly, join the club, benefits pay for themselves over and over again! Cheers!\nShow less"], ["Reviewed April 5, 2017", 5.0, "Great imported cheese and wonderful wine and lunch", "It was very crowded but they had great cheese tasting, olive tasting, mustard tasting and olive oil and vinegar tasting and of course wi ne tasting. Of all the places I visited I loved their wine called red wine. It was not as expensive as some but it was my favorite. The lunches are very reasonable and everyone could go up and order whatever they wanted. There was a wide selection to choose from.\nShow less"], ["Reviewed April 3, 2017", 2.0, "ripped me off", "I visited last week. The cashier charged me for a bottle of wine that I did not buy. When I said something, he called the manager who gave me a credit receipt for $50. That credit has not showed up on my credit card, although the erroneous wine purchase has been charged to my card. Has anyone else been overcharged like this by the winery?\nShow less"], ["Reviewed March 31, 2017", 4.0, "DELI! MARKET! PICNIC TABLES! SUNSHINE!!!", "Charming place that we stopped off at twice. Wine tasting was good but what we went for was the market place! They had a great deli with cheeses, meats, sandwiches, drinks and a lovely outdoor area to sit and recover from all the wine tasting. Clean bathrooms, Beautiful setting. For those of us that hunger for outdoor sunshine this was perfect! Oh, and a coffee place is two doors down so some folks walked to the coffee shop and brought that back so we could linger even longer.\nShow less"], ["Reviewed March 29, 2017", 1.0, "Disappointing", "We stopped by this winery today, it was rated very well on a site rating the best 10 wineries to visit in Napa. We stepped up to the tasting bar and stood there a few minutes, no one greeted us. A few minutes later the server who was there put up a \"wine bar closed\" sign. We moved to the left to the next station. That server didn't greet us either. After a few more minutes he came back and said he needed to finish with another customer. He then left, after 5 more minutes of standing and waiting we left. This was not a busy day and appeared there was plenty of help. Wouldn't want to visit on a busy day!\nShow less"], ["Reviewed March 26, 2017", 5.0, "Great Spot For Picnic lunch", "We visited this spot in between tasting tours and it was the perfect spot to do it! We did a wine tasting here as well, and though our person was a little grumpy when we first started, he warmed up to us. They have a wide variety of choices for food. I chose a platter with cheese and fruit, a hunk of goat cheese, as well as a tiramisu for dessert. It was a great lunch and great spot to rest!\nShow less"], ["Reviewed March 25, 2017", 5.0, "Beautiful Winery for a Picnic", "We enjoyed the wine tasting and bought several varieties. I loved the gourmet grocery, unique gift shop and friendly staff. We tried desserts and talked to people throughout the picnic area. Lovely winery. All the local guests said it was their go to winery for a day trip\nShow less"], ["Reviewed March 22, 2017", 5.0, "Picnic love", "I love V. Sattui. I always make it a point to go here when I go to Napa. A great place to go on a picnic. Food is good and the wine is just heaven. There is one cheese that I fell in love with. It's called Havarti. We don't have it in the Philippines so I've been craving for it.\n\nBest to go to on weekday to avoid too much people. Weekends can get really crowded. Although they have BBQ on weekends so it's your choice. But if you want to relax and avoid the chaos then weekdays are better.\n\nThere are picnic tables available outside but you can also bring your own picnic blanket if you want to sit on the grass.\n\nI did not go on the tour but I'm sure that would be an experience too but I was happy to go to their store. Do some wine tasting and go on a picnic outside. You can also see the wine train passing by.\n\nHighly recommended. One of the best wines I've tried in napa.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Top of My List", "Very good tour. Picnic in progress smelled wonderful coming off the wood fired grill. Our tasting was top notch and worth the $$."], ["Reviewed March 14, 2017", 5.0, "Love this winery", "I don't remember how many times I've been to this winery but I have been here many times. This winery is great. Picnic tables where you can eat lunch and drink wine. They also have a deli where you can buy bread, different kinds of cheeses and sandwiches. you can buy a bottle of wine and they will open it and let you borrow glasses if you wish to have a picnic outside.\n\nAbout the wine: I feel like this place is perfect for sweet wine lovers. They have a lot of good sweet wines. from moscato to california madeira (my personal favorite). I was a bit disappointed with their red wines. I prefer red vs sweet and I didn't really find anything think that caught my tastebuds.\n\nThe tasting is pretty reasonable at $15 per person. For 2 for 1 specials (check yelp). Customer service is always good and friendly. This place does get crowded during lunch time so I suggest to visit early or avoid weekends.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Excellent place for lunch with a bottle of wine!", "My husband and I came here yesterday for wine tastings and a picnic lunch. We enjoyed the wines here as well as the grounds for a picnic. Beautiful grounds. Great experience!! Highly recommend"], ["Reviewed March 11, 2017", 5.0, "Beautiful Grounds", "Amazing location and Very charming. If your in the area it's a must stop. Enjoy wine and a romantic dinner."], ["Reviewed March 9, 2017", 5.0, "Great visit for lunch and tasting", "My family and I came here on Friday for lunch. It was not very busy so we didn't have to wait long inside their deli and were able to find a picnic table easily. After lunch we had time for a tasting and walked up to the reserve tasting room where we were greeted by Marc. We had a great time chatting and tasting the wine and my husband and I joined their club! We are super excited to get our first shipment of V Sattui wines!\nShow less"], ["Reviewed March 5, 2017", 4.0, "Busy", "This place can get quite busy so we went there first thing in the morning. You can buy sandwiches, soups, cheeses and then grab a wine and take it downstairs after deciding from a cheap tasting. Laid back place and reasonable prices. Got to have a tasting with Sattui's 5th great granddaughter.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Second time her and still one of the bedt", "This is her second time coming here. We had such a great visit last time that we brought more folks back this time. They all had a great experience just like we did. The wines were simply great. So great that it's one of the few places we bought from. The guides were friendly and helpful and were awesome at keeping things lively. Do you have a series always busy and lightly and the courtyard is a great place to hang out when the weather cooperates. This location is one of the few places you can eat and drink at the same time due to its age and being grandfathered in from these regulations.\nThis was only one of three places that we \"repeated\" for my last trip. I think we're gonna keep it on every trip that we come here for. Definitely one ofthe best for consistency and wines and variety of wines.\nShow less"]]}}