{"Venice Beach": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Venice Beach", "url": "/Attraction_Review-g32655-d104591-Reviews-Venice_Beach-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/09/1c/d2/caption.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "8689"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90291", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 2.0, "Pretty Honky-Tonk", "The beach itself is OK and the pier makes for a good walk, but the adjacent walkways and boardwalk are a jumble of low-end t-shirt, tattoo and trinket shops. Things improve as you get closer to Santa Monica, northwards up the beach."], ["Reviewed yesterday", 5.0, "Neat beach", "This is a very neat and very well maintained beach. Just sit down near the beach and enjoy the beauty. Is often very less crowded."], ["Reviewed 2 days ago", 4.0, "Interesting beach", "What an interesting beach!! From Muscle Beach (weight lifting open air area) to the carnival themed boardwalk. You will see it all on this beach. The beach was clean. A few surfers were out."], ["Reviewed 2 days ago", 3.0, "\"Don't Need to Go Back\"", "This beach basically has a little bit of everything. Flea market style stores to the people playing basketball on the boardwalk. Don't use the bathrooms if you can resist the urge. They are DIRTY. Beach was standard beach. This particular day it was really windy, which made the sand kick up something serious. Also, there were a lot of people asking for money on boardwalk. The world-famous Muscle Beach is here, if you're looking for hallowed ground. I prefer beach at Santa Monica Pier, as the whole area is just way cleaner.\nShow less"], ["Reviewed 2 days ago", 1.0, "Just don't", "There's no other way to say it. Venice Beach is yucky. I wanted to shower after we left there. I realize the place is free-spirited and everything goes there, but it was too much for us. Between the smell of pot, homeless people everywhere and general sense of disgust all around us, we couldn't wait to get out of there. The beach is lovely, but we won't go back. Too much ick to get through to even see the beach.\nShow less"], ["Reviewed 2 days ago", 4.0, "Great during the Day. Be careful at night", "Great walk along Venice Beach to Santa Monica during the day. Plenty going off and lots to do, however not a place to be with families at night or after dark. The backroads (Speedway) are very dodgy with drunks and druggies everywhere. Unfortunately there are a lot of rough sleepers who may scare young families.\nDefinitely visit by day\nShow less"], ["Reviewed 3 days ago", 5.0, "Interesting", "It was a fun afternoon visiting iconic Venice Beach. It was a beautiful sunny LA winter's day and there was people everywhere. Loved the little boardwalk shops. Interesting people everywhere. Didn't realise how big it actually is."], ["Reviewed 4 days ago", 3.0, "Boardwalk scene", "Took a long walk along the Venice Boardwalk...Everything from the sublime to the ridiculous. The weather was fine, sunny with nice ocean breezes as we walked the length of the pedestrian walkway. Street performers, swap meet type booths hawking sunglasses, tee-shirts, souvenirs, etc. Sidewalk cafes and artisans selling posters and original art work. An excellent independent bookstore, Small Worlk Books, hidden behind a sidewalk cafe, 1400 block. Beware the public on-beach restrooms... they are hideous.\nShow less"], ["Reviewed 4 days ago", 5.0, "Oceanfront walk quite grubby for a family ; try Abbot Kinney Blvd", "did a full walk up & down oceanfront walk . Its sad how overrun it is with druggies and homeless beggars . Would NOT want to be there at night or on weekends with family .\n\nSlightly inland , Abbot Kinney Blvd much nicer with lots of shops and restaurants to check out\nShow less"], ["Reviewed 4 days ago", 4.0, "Wild Beach, Fun times", "We just came for the people watching! And there was a ton of it! Fun place to go for a stroll, and if you need a tshirt, this place has millions! Worth a stop for a few hours. Worst part is trying to find somewhere to park.\nShow less"], ["Reviewed 5 days ago", 5.0, "Insane", "One of the crowed places where you can do serfing, find good restaurants , night clubs! Very beautiful beach and pier!!"], ["Reviewed 5 days ago", 4.0, "Not as lively as it used to be", "I like Venice Beach but it seems to have lost it's buzz. Although the skate park was quite busy, muscle beach was almost empty. I thought it might have been the time of the day but it was the same later. Perhaps, it's better when the weather's warmer\nShow less"], ["Reviewed 6 days ago", 5.0, "Walk on the beach", "I truly enjoyed it, I would go every day if I can, it's never old or boring, ppl are friendly and helpful"], ["Reviewed 6 days ago", 1.0, "Do Something About Venice Beach!", "Each year we visit and each year it gets more and more frightening. When you can't even walk a step without a frightening sight, you know you aren't doing enough. Honestly, I would rather go someone different all together at this point."], ["Reviewed 6 days ago", 5.0, "California beaches are the best in the world", "...and this is no exception. The sand, the people, the view. This is the best entertainment for free in the city. Take your shoes off and enjoy!"], ["Reviewed 1 week ago", 5.0, "excelent", "top beach in the world, its a unique expirience juat being there everybody should go at least once :)"], ["Reviewed 1 week ago", 4.0, "just like grand theft auto", "my son raved that it was just like his game, grand theft auto and he recognised all the streets and buildings. I thought it was very diverse with lots of hippy style shops and a few people a little stoned. Muscle beach was fun and we had cycled there from Santa Monica pier. plenty of buskers and local life. beach was perfect and sandy. Lots of cheap souvenirs, Very chilled out place.\nShow less"], ["Reviewed 1 week ago", 4.0, "Good time", "I had a good time visiting Venice Beach even though it is long way from Hollywood. Lots of shops, characters, skateboarders around. Best way to explore the beach is by renting a bike ( I suggest rent a LA Metro Bike). Stunning view of palm trees.\nShow less"], ["Reviewed 1 week ago", 3.0, "Must-see in LA", "People probably go here for the boardwalk, street performers, skatepark, and other outdoor type activities. If I have to choose, I would choose to go here over Santa Monica beach."], ["Reviewed 1 week ago", 4.0, "Awesome experience", "This was our first time at Venice beach. I was hesitant after a visit to Santa Monica in the past, however, I instantly fell in love with the vibe at Venice beach. Parking was simple (we got lucky and were able to park on the street for free). We had a 6 month old in a stroller but it was no issue maneuvering with her. The boardwalk allows for easy access to everything Venice has to offer...minus the water of course. There was lots of souvenir shops and street vendors. A lot of truly unique artwork and talent was offered. Lots of street performers with some being better than others. There was literally something for everyone. They had dancing roller skaters, skateboarding, bodybuilding, instrumental groups, basketball and tennis, and more. I would go there for the experience itself. We had never been in an atmosphere so welcoming to each individual. Public restrooms were decent but can have long lines. Also didn’t see any baby changing stations. Great authentic food and overall great experience.\nShow less"], ["Reviewed 1 week ago", 5.0, "The new breed meets the old breed", "I'm a native Angeleno and there are three things every native Angeleno must experience before they die. One is going to Disneyland or Knott's Berry Farm (depending on your budget). Two, gong to a Dodger or Lakers game. Three, hang out at Venice Beach.\n\nWhy do you ask is that third one important? it's the people. They come from all walks of life and with different ways of thinking and beliefs. The people who sell the little aluminum cans they make into airplanes are as important as the girl walking around with a snake to give it some air. You'll see shops and restaurant and bodies of all types, shapes, sizes and personalities. The nightlife has improved also; if you go along Abbot Kinney Road (Ave.) you'll see millennials moving along, enjoying each others company and eating in both fine dining and the next \"big\" restaurant in town. Go along Windward Ave. towards the beach, and in that two block stretch, there's no shortage of a bar or lounge where you can just chill or go party.\n\nThe beach itself; what can you say? It is clean, swimmable, and produces enough swells for body boarding and surfing. At first glance you don't expect it to be, but It's very casual and subdued. The beach is also well patrolled and, in a few places, they don't mind toplessness (side boob please, still not Euro-beach)\n\nIn short, there is no shortage of thing to do, whether a local or a tourist, this accessible piece of land is the place to be. And it's bike and walking -friendy.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful with mountains", "Beautiful beach with mountains in the backdrop. People watching is great although a little touristy. Lots to do here. Parking was easy and it costed $15 to park all day."], ["Reviewed 1 week ago", 4.0, "Good!", "The place is really good during the day, very lively, colorful and full of strange and funny people. It doesn't feel very safe at night and I won't definitely go there during that time. I had a great view of the sunset on the last day i've been in LA.\nShow less"], ["Reviewed 1 week ago", 3.0, "Venice beach", "Stayed right on Venice Beach for 3 nights, cool place , very eccentric with all types of characters floating around, in saying that a half day visit does the trick, wether it be walking or riding a bike from Venice beach to Santa Monica pier that’s about all the time you need to take it in. Some of the stalls are cool others are just full of crap, hanging around to sunset is worth the wait as each night has great sunsets . Glad we went but once was enough.\nShow less"], ["Reviewed 1 week ago", 5.0, "Great location", "Venice Beach is a must see for anyone traveling past. Loads of great places to eat and a huge diverse atmosphere around! A place not to be missed."], ["Reviewed 1 week ago", 5.0, "Aloha Brothers", "Surfing school was epic! I’m very excited I went to Aloha Brothers. Dave really took great care of me & showed me the ropes. This is definitely the best deal in Venice. Thanks again Dave is was amazing!"], ["Reviewed 2 weeks ago", 4.0, "Beautiful beach and nice atmosphere", "Great beach with bikes for rent. Also the famous outdoor gym where Arnold Schwarzenegger used to workout. Easy going atmosphere and good vibe!"], ["Reviewed 2 weeks ago", 5.0, "Calm, serene.", "A good place to spend some time chilling in the sun. Lots to see in shops and views. Next time I’ll go for a hike too."], ["Reviewed 2 weeks ago", 3.0, "Beautiful beach", "The beach itself is beautiful and we saw dolphins swimming among the surfers which was great. The rest is very tacky and a little run down the toilets are disgusting."], ["Reviewed 2 weeks ago", 1.0, "Gross", "Heard many positive things about the beach. It was very dirty. a lot of homeless people. We went earlier in the morning on a Sunday. and it was still full of homeless people. It smelled of urine/ marijuana."], ["Reviewed 2 weeks ago", 5.0, "Just love it", "From bike rides at a very reasonable price to all the cool and neat things to look at or even purchase. It is like a whole big inexpensive boardwalk area but way cooler and less expensive things to purchase. The jam sessions and music everywhere to Muscle beach where folks are training keeping fit to aggressive games of hand ball and much more. There is something for everyone. Oh yeah did I forget to tell you the beach is right there. Very clean I found a sand dollar still in tact. I always enjoy checking out whats for sale too. You find some really neat things here weather it is mass produced but my fav's are the homemade stuff from jewelry to art to lawn ornaments and much much more. Definitely check it out, this was my first time here BUT i will be back before end of year and I will certainly squeeze in a day or two here!!!\nShow less"], ["Reviewed 2 weeks ago", 4.0, "A visit is a must", "Full of character and also full of characters, this place is buzzing and interesting. Lots of good palces to eat and drink"], ["Reviewed 2 weeks ago", 5.0, "Great place to bring visitors", "The boardwalk is fun to stroll along. You can see muscle men working out, someone always playing an instrument, maybe even signing. Painters and all sorts of colorful folks hang out along here. It's a great place to bring family who are visiting from another state. My brother and his wife fell in love with Venice Beach and always want to go back when they visit me.\nShow less"], ["Reviewed 2 weeks ago", 1.0, "Vagrants and thiefs trying to rip you off and it is all called romantic Venice Beach.", "Going to LA: Never stay at the Venice Beach. It is full of drifters of all kinds who constantly beg you for money and bother your children. My son got forced to buy a CD he did not want when he left us for 15 min...The drifters get drunk at night and fight non-stop screaming...police often comes with sirens to bring peace...Stay at Santa Monica or Manhattan Beach but avoid Venice Beach - it is not as romantic as it sounds\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful!", "Water was cold..aparently is winter now! But it was sunny almost every day and temperatures of 23c min during day, just amazing."], ["Reviewed 2 weeks ago", 3.0, "Mixed emotions", "No doubt the sight is very attractive\nAs a tourist you will notice quiet shockingly guys not having an easy life so kind of aggressiveness can appear especially early in the morning-\nOtherwise it is a window to the ocean and so many nice houses to enjoy and to dream off on the promenade... walk run bike skate roller everything you want to chill out or to practice on a sweating mode\nShow less"], ["Reviewed 2 weeks ago", 5.0, "This please is so historical", "I love the history of this place and the attractions there’s allot of things being sold here you can buy it’s a beautiful beach and they have some shows there people song and dance on the side"], ["Reviewed 3 weeks ago", 3.0, "You can see just about anything here", "Be prepared to see almost any and everything under the sun. This place is vibriant and full with lots of energy and if the weather is nice the walk on the boardwalk is great exercise."], ["Reviewed 3 weeks ago", 2.0, "Beatiful decadent place full of homeless and drunks", "The pictore of my 1 year old playing on the park in front of the sea with two drunk people fighting on the parking lot behind was not the memory I was expecting from Venice beach.\nThe place is beatifull with a pedestrian road by the sea. There is a kids park by the sea that my kid really enjoyed and gave the families there an option to the beach.\nThere is a restroom area crowded with Homeless and drunks that literally live there. I would not recomend to use this place as it is really dirty.\nWe had a hard time finding a place on the rest area near the beach that was not used by a homeless to sleep or hang around. You have a police station, but police officers will only act upon violent events, dont expect them to ask the sleeping drunk to leave for you to enjoy the place with your family.\nWe also saw a lot of drug use near place where kids play, something that made me limit my visits to this place. I am not sure what the deal with the place is, but drug use and alcohol abuse should not be allowed where young people or families go.\nAs stated on the title, the place must have seen better times, but know it is in bad shape and with a decadent look.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "a must do when in LA", "we went on a sightseeing hop-on hop-off bus tour and decided to jump off at Venice beach and so glad we did, its a fantastic place with a bohemian vibe, loads of varied nationalities and styles, I felt very safe and found prices to be cheap in the stalls on the beach front\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Decent", "I visited from NJ. I have heard about the famous Venice Beach. I did expect more. Please don't let this come off wrong but I need to mention it because I did not expect this and it may be helpful to others. I expected this beach to be like NJ Ocean Grove (clean and family friendly environment), but instead it was like Atlantic City (a place where the homeless seek shelter on the board walk). Next visit to Cali I will consider a different beach.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "A sure first tourist stop.", "Venice Beach is a must-see for those stopping in or new to LA. There is an exercise area with equipment, beach walk shops/restaurants, volleyball nets, plenty of sand to relax (with some shaded areas) and a killer skatepark. Insider tip: the skatepark is famous for being in the Tony Hawk video games and garners a huge crowd. Since this is a tourist hot spot it is crowded with vendors, tourists, and locals alike. Vendors range from tattoo shops, food, tee shirts, local artists, snacks - you name it, its there.\n\nTips: park a little down from the beach and walk up Abbot Kinney Blvd to check out the cool shops and restaurants. Total beach vibes here but major finds like Adidas Originals and local boutiques.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "the 80’s called, they want their beach back", "Quaint but I loved it. No project developers turning this in a money machine, yet.\n\nVenice beach stopped going forward since the 80’s. It’s a curious blend of hobo’s, artists, locals, tourists, and beach / sports enthusiasts alike.\n\nShoddy little souvenir shops, Venice Beach gym with totally rusted equipment, hobo’s and tattood people with dogs all around form a unique blend of everything society has to offer, coexisting in a dated but lively place. Sun and beautiful beach make it complete.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "BEACH DREAMS", "Diverse beach experiences. South of Washington Blvd. tends to be quiet while north has myriad activities. Besides sitting on the sand, there's plenty of things to do with sports, bikes and rollerblades. Easy to get in a beach volleyball game or a little b-ball. While winter months are usually cool and breezy, there are surprising number of warm days which will always draw a crowd. Be careful about parking. Lots of parking lots, and best to avoid tickets or towing. Have a great time in the sun!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Best beach ever", "First trip to a beach on the west coast and I was pleasantly surprised. Great atmosphere , beautiful views. New favorite beach !"], ["Reviewed 3 weeks ago", 3.0, "Kinda ghetto", "The title really says it all. Some interesting people watching but way too many people selling drugs and trying to force random cds into your hand. Pretty sketchy."], ["Reviewed 3 weeks ago", 5.0, "people are strange", "I hung out here loads when I was on my Doors pilgrimage.\nIt's as notorious for homelessness as it is for everything else - I never felt threatened by that or anyone there. In fact, I spent hours playing instruments on the beach one night with a bunch of them and bought a load of beers for them. It was an amazing experience.\nThe boardwalk itself is packed with characters, people selling art, mad shops, craziness... it is what it is and doesn't pretend to be anything else. There's food, drinks, everything you need.\nIt;s in the heart of Doors Land - a must if you're a fan and so many nearby places that are equally as cool (Abott Kinney just a kick in the pants away).\nFor some, a couple of hours may suffice - I hung out there for a few days, hit the beach and boardwalk at night and saw no trouble - all friendly, all happy, all totally Venice.\n\nWhere's your will to be weird?\nShow less"], ["Reviewed 3 weeks ago", 5.0, "So different!", "The drive to Venice Beach is well worth it between the restaurants shops muscle Beach restaurants and bars you can spend a full day there"], ["Reviewed 3 weeks ago", 5.0, "Must see!", "Tons of little shops to look around in! Not going to lie, some people can be pushy and there is quite a bit of homeless, but not unusual for the LA area. I would recommend renting some bikes and riding on the paths, it's fairly cheap and fun! The skatepark is cool and it's fun to see all the talent everyone brings. Don't forget to stop by muscle beach and the juice bar shop they have is really good. Overpriced, but good.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Changes,,,the good old days", "I remembered at least 20 years ago I lived on the beach, and being young ,it was such a beautiful time for me....felt the freedom. Visited last August and the changes were incredible shopping restaurants so much more activity live performances people of all walks of life doing their own thing..the unity felt great for me like old times...love Venice beach.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "People Watching, Dining Al Fresco, and a Beautiful Beach", "Venice retains its title as the best place to watch all the different characters that make Hollywood fascinating spend a beautiful day at the beach. Roller blading, dog walking, eating as you walk, and then of course the weightlifting \"show\" at Gold's Gym on the beach, which is an institution. The beach itself is beautiful. No tourist should leave a trip to California without a day at Venice Beach. And the surrounding neighborhood is filled with fantastic and unique boutiques of every type.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A world's famous people zoo", "Great diversity, you have humans, animals weird folks, Martians, and on and on. If you are into people watching this is your place. $10 To park....not bad for LA"], ["Reviewed 3 weeks ago", 1.0, "Terrible experience", "Try to definitely avoid the boardwalk... I took 2 friends that were visiting from Chile and they had the most “Ghetto”, most horrible experience ever! They went into a T-Shirt shop to see if they wanted to buy something. While talking with one of the sales person, she told them that if they got 2 shirts they would get a discount... Well, so they did and when they went to the cashier (who by the way was the owner, middle eastern man) to pay, they paid with a big bill and the owner shortened them with 12 bucks... so they told the owner that the sales person had said that if they took 2 shirts they were going to issue them a discount. So the owner called the sales person and she denied all. Then we told them that we didn’t want the shirts anymore and to give us back the money because we felt scammed they both started shouting at all 3 of us and said that there where no refunds and to just leave...!!! So I’m definitely not going back to that place again!! They worn me before about the boardwalk but honestly I never had any problems... But I definitely don’t want any friends or myself to go through something like that again....\nPs: if you look closer into this picture right in the entrance left from the red lifeguard hoodies... you can see the “lady” giving us the middle finger....\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Large beach", "The beach is very large and long for several kilometres. In the beach there are usually a lot of activities and so it is almost exclusively frequented by young people."], ["Reviewed 3 weeks ago", 3.0, "Lovely beach with tacky surroundings!", "The beach here is vast with winding, well used cycleways. The promenade which runs along side is reminiscent of a fairground: lots to entertain but sadly scruffy and expensive. Car parking is expensive, but there are spots a few hundred metres away, if you are prepared to walk. We stopped for a drink in a side street cafe on our way back to the car. In no way smart! My husband is still recovering from paying $20 for two very small bottles of orange juice, the listed price. Interesting to see this beach, but no way would I recommend!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Mid day trip", "Had a good time! Different things to see and do and little shops and food walking along the way. Was a little cool out but the view was beautiful."], ["Reviewed 3 weeks ago", 5.0, "Lots to see", "Lots to see, even in winter we had amazing weather, Lots of people doing some weird things, checked out muscle beach, well worth a visit."], ["Reviewed 4 weeks ago", 2.0, "Like danger?", "Are you looking to hang with the homeless, skate board in a scary environment, score drugs? Come to Venice! Rode bikes down to Venice from Santa Monica. My friend was asked by no less than 6 guys near the skateboard park whether he wanted to buy drugs. On our walk to get food, saw a homeless community. One of which had been using an old pizza box as a toilet on the side walk. Also plenty of homeless and hippy types living on the beach. And by living on the beach, I mean have moved couches, beds, tables, chairs, etc. to the beach. Several homeless people were passed out on futniture on or near the beach. Did not feel safe at all.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Lovely beach", "Lots of soft sand, beautiful water, and clear blue skies. It was the perfect spot for a few hours of relaxation in the sun. And it had a great skating park with lots of people using it. Go - and enjoy."], ["Reviewed 4 weeks ago", 5.0, "CLEAN and NICE", "lovely beach and super clean sand, it is well maintained, good for those relaxing days under the sun where you have nothing to do just read your book or swim or go there with your lovely ones"], ["Reviewed 4 weeks ago", 4.0, "Beautiful Beach, strip outdated", "The beaches of Venice and Santa Monica are beautiful, really nice to spend som time there. The boulevard unfortunately needs a fierce renovation. It is all outdated and soem buildings are wrecked and dirty. A lot of shops and a lot of rubbish they sell. Many homeless people, that is no problem but they make a mess sometimes and does not improve the image of the boulevard. There is 100 times more potential for this beach but stiil nice to spend some time and hire a bike.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Venice beach golden sunset", "I love this beach, the atmosphere is always unreal. Although, some know of it as being just a beach it has everything.. rollerskaters, street entertainment, outside gym, dancers, a funfair, shops, music, restaurants.. have I missed something? Probably, but this is a cool place to hang, even to sunbathe the people watching is always interesting, the place looks as realistic as the gta version..\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Busy but fun", "We were there on a very busy weekend and the crowds on the bike path were a lot to deal with; people were running off the path or into each other so you have to be careful. It is a fun path and goes for a long way; there are so many people doing so many things in that area...sunbathing, watching, picnic-ing, eating, walking, shopping, skateboarding, scootering, biking, running, swimming, showing off their muscles...typical beach stuff but with that CA flair...fun to see and experience after hearing about it for so long. The muscle-y guy lifting weights seemed a little like a caged spectacle in a zoo but people were trying to get their picture taken with him and that was all good. I kinda felt for the guy though he was an eyeful!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Always Fun!", "Don't blink because you will miss something else! There are a million things to look at down at Venice Beach! There is Muscle Beach where bodybuilders work out outside and you can watch. There is a skateboarding area with deep drops. There are many vendors and sidewalk shows. Lots to eat and look at.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "It’s Venice obviously it’s amazing", "I am originally from Cali, but I moved to the south. Going back to Venice was simply amazing ! I loved it and had an amazing time , experience, and workout .\nOur truly a most . The t shift shops are fantastic ! I want to move back to SoCal\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Love this beach", "We stayed here in January and it was amazing waking up to the ocean everyday. Clean beach and beautiful!"], ["Reviewed 4 weeks ago", 4.0, "A sunny day on a famous beach", "Always fun to see what is going on at Venice beach. Watching the weight lifters, the skaters or just people watching, there are always fun sights."], ["Reviewed 4 weeks ago", 4.0, "Anniversary vacation", "Loved the beach my favourite place to be. we walked the beach and had lunch that was very delicious."], ["Reviewed 4 weeks ago", 1.0, "Venice Beach", "Junky area with lots of homeless people and people with mental health issues. Would not recommend this area after dark. We couldn’t wait to get out of there. I know California has legalized marijuana now, but we were definitely sick of smelling it everywhere."], ["Reviewed 4 weeks ago", 3.0, "Enjoy it, but...", "We went in the evening and we could see a beautiful sunset. It's true that you can smell weed everywhere and there are lots of homeless and people ask you some money. Even a guy offered us to buy weed!!! We just walked...trying to ignore those things because we wanted to enjoy the beautiful sunset. We're from Chile and it called our attention that there are lots of public restroom and their are clean!!! Without graffities or draws inside...and the most important..they all have toilet paper!!! You can buy memorabilias...but they are expensive. If you like ride bike or skate or just walk along the beach...do it early, after 18hrs I don't recommend you do it.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Nice beach with some interesting shops", "Venice Beach is a beautiful beach with some interesting shops and has a fair amount of character. That said there is nothing overly overly special so could be missed if you're in LA."], ["Reviewed 5 weeks ago", 1.0, "Don’t go - rude and abusive", "How things have changed.... Venice beach used to have a fun / alternative vibe to it which was great. I took my family there and was shocked by how bad this area has become. Rude people pushing crap cds at you, overwhelming smell of weed and homeless people everywhere. So... what you to be cool is now dangerous and unpleasant. Take your tourist $$$ elsewhere.\nShow less"], ["Reviewed January 24, 2018", 3.0, "We named it \"marijuana beach\"", "If you like people watching and laughing\nThis is a place where there al\nLeast one of each type of crazy kinds of people. The smell of marijuana is everywhere, there are skateboarding, painters everywhere, homeless people, restaurants, etc\nEvery other painter has a sign that says \"no\nPictures and if you take them F$:)*^{€ you\"\nIt's different, so you decide if you laugh at this or if you would be uncomfortable\nWe chose to laugh\nShow less"], ["Reviewed January 24, 2018", 4.0, "Venice Beach Boardwalk", "If you like to \"people watch\" this is the place for you. One of the most interesting places you can visit in the Los Angeles area to see people from all different aspects of life. There is no charge to visit Venice Beach except for parking and we paid $10 to park for as long as we want (we went during the afternoon so I don't know if it cost more at night or not). The shops along Venice Beach are your normal gift stores you come to expect along a famous beach. The gift shops are more expensive than most gift shops I visit along other beaches in America.\n\nThe restaurants along the boardwalk were disappointing. There weren't as many as we were expecting. The best part of Venice Beach other than the \"people watching\" are the activities you can do there such as biking, roller blading, skate boarding (they have a skate board park), basketball, volleyball, handball & weight lifting. We saw numerous street entertainers who perform for tips and they like to drag out the performance to draw more of a crowd and pull out \"volunteers\" to be part of the show. Don't be surprised if you see some type of film crew taping some kind of show. Don't forget to get a picture of the iconic \"Venice\" sign that hangs over the street. It hangs at the intersection of Windward Ave & Pacific.\n\nIf you visit it appeared that the crowd kept getting larger as the day went along (we left around 5pm) so I don't know how crowded it is at night. Venice Beach offers a lot of great photo opportunities so if you're into photography you will enjoy spending time here.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Great Beach we some real Characters", "Venice Beach is worth a look but with caution there are a lot of homeless & some strange characters along the walk at Venice Beach with some trying to sell you some rubbish stuff but then there are some great little places along the way also. We bought some beautiful wooden crafts which were really reasonable and fantastic. If you are going to Santa Monica it’s certainly worth a look and walk we walked from Venice Beach back to Santa Monica Pier which was only about 30 Minutes.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Eclectic", "This area is very different but so cool, there is great food and drinks and shopping and just interesting people and things all around"], ["Reviewed January 23, 2018", 4.0, "Venice beach CA", "Had a lovely lunch on the pier. Weather was perfect. Can’t wait to go back! Love being on the beach and people were so friendly."], ["Reviewed January 23, 2018", 4.0, "Lovely White Sandy Beach", "Besides the Boardwalk there is actually a lovely wide beach and white sand, dotted with Baywatch little houses for the Life Guards, it was a windy day when we visited so not many people using the beach, the Grandchildren had a play on the gymnastic type park adjoining, and there are palm trees along the esplanade.\nShow less"], ["Reviewed January 23, 2018", 3.0, "A Place of Extremes", "Venice Beach ranges from the sublime to the ridiculous, from cheap to expensive, from clean to filthy, from quiet to loud, from depressing to enlightening, from ugly to beautiful, and so on and so on...\n\nPretty much about people watching - walk to Santa Monica Pier and watch people; fascinating. Don't buy anything! Watch the sunset.\n\nMake sure you take the opportunity to wander through the canals a couple of blocks inland.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Beautiful beach - goes for miles! (Sunday visit January 2018)", "We wanted to include Venice Beach in our 2 week road trip!\n\nIt was amazing - beautiful views, amazing weather and so much to do and loads of places to eat.\n\nThere are so many different types of people, I loved that everyone had their own unique style.\n\nYou can download an app called Bird as you will notice lots of people on scooters - the app shows you all of the unused and ready to use scooters near you on a map and tells you how much battery they have left! You walk up to a scooter with your app - scan the QR code and you can use this and leave it wherever when you have finished so that someone else can have a turn! This was such good fun and saved our legs on the walk back to Santa Monica Pier which is about 2km! There was a small fee straight to your card depending on the distance and time travelled.\n\nI would definitely recommend a trip to Venice Beach.\nShow less"], ["Reviewed January 22, 2018", 1.0, "Don’t bother", "Surrounded by people smoking weed and trying to sell you their crap! Not a nice place to visit, don’t bother!"], ["Reviewed January 22, 2018", 5.0, "Always fun", "The vibe is cool and friendly. The only adviso I have. If your a person from a small town. Don't allow yourself to get talked into signing up or listening to a sad tale ending with you giving some stranger money. They know who you are and who to work. Just have fun and keep it moving.\nShow less"], ["Reviewed January 22, 2018", 4.0, "A Must!.. no one should miss it !", "Thiz is an amazing place, theres the beach, many restaurants of all kind of food, bars, souvenir stores, clothing shops, smoke shops.. but the most intetesting thing is that if you walk trough there you will see the most wide range of people dressed in different styles, you can see the strong men getting fitt and taking the sun as in the movies, skaters, painters , artists, dancers, and all kind of eclectic persons walking or working there .. showing a performance, selling their music, wow ... as no other place .. its original and its the best way of feeling California ! . Dont miss it ;)\nShow less"], ["Reviewed January 22, 2018", 5.0, "Very fun and entertaining", "Lots to see and do. Stroll along the Venice Beach boardwalk, take in the sites. There are so many activities and shops, you can spend several hours taking it all in."], ["Reviewed January 22, 2018", 5.0, "Best way to spend an afternoon.", "We rented bikes and rode around for 2 hours. Had little stops on the pier and near souvenir shops. The weather was absolutely perfect and people were happy around us. January is a slow season, so not a lot of people there. Perfect 😍"], ["Reviewed January 22, 2018", 4.0, "A must see...", "Venice Beach is a must see when visiting LA! This is such a mecca for the strange and crazy, and makes for fantastic people watching. Muscle Beach, street vendors, etc."], ["Reviewed January 22, 2018", 5.0, "Judgment free zone", "This is such a fun place. This is where all levels of weird are welcome. There are body builders pumping weights, teens playing basketball, and other sports. But the coolest is the skateboard rink! This is so typical LA. Love it!"], ["Reviewed January 21, 2018", 4.0, "Venice Beach boardwalk", "Really interesting area for tourist walk around and just check stuff out. The beach itself is impressive and looked very inviting. A lot of vendors pushing sales and some cheap souvenir products here for sure. It was a pretty cool experience and recommend if you have not done if before.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Love it", "Went for a stroll & an ice cream - This was amazing on a warm day. Can recommend it for families & solo travelers alike"], ["Reviewed January 21, 2018", 4.0, "Much to see", "Even in January, which I assume is off season here, there is so much going on at Venice Beach. There are people everywhere and interesting stores. It seems to just blend in with Santa Monica Beach, although maybe I noticed a change in shops between the two. We rode our bikes though the area and seemed to notice a lot of people living in tents and such, or maybe they were just there for the day. Eclectic is the word I'd use here.\nShow less"], ["Reviewed January 20, 2018", 5.0, "Ahhh Venice Beach...non stop entertainment!", "We stayed right on the beach, and we literally spent a day just watching the world parade by...joggers, bike riders, roller skaters, dog walkers, tourists, families, street entertainers, local market stalls...even saw a movie being shot on the beach!\nLots of cafes and restaurants, very colourful, the beach is beautiful though there are a lot of homeless locals around during the day. At night the beach and boardwalk were cleared and constantly patrolled by security.\nWe loved it!\nShow less"], ["Reviewed January 20, 2018", 5.0, "Beautiful View", "This is a very clean beach. Enjoyable views. Very serene and peaceful. There is metered parking, but it is hard to find."], ["Reviewed January 20, 2018", 4.0, "Relaxing day at the beach :)", "Venice isn’t glamorous so if your after fine dining etc this isn’t the place for you but it’s amazing !! Hired a bike and rode around Venice they have so many little shops and fresh food to eat , fruit ice cream !! Tattoo parlours etc .\nProb my fav part of my whole trip was sitting on the beach soaking in LA !!\nI did see a lot of homeless people but they didn’t come near me ,\nShow less"], ["Reviewed January 19, 2018", 1.0, "Ripped off / Do not buy!!!", "Bought some gym T shirts with logos.. told by front man that the T shirts were $20 .. inclusive of print!!\nAnd .. on a special price ...you could buy 2 get one free just pay for the print.\n\nNo!!!!! Don’t believe it.. !! It’s a scam..\n\nThey will charge you $20 for the T shirt( more if it’s a premium shirt!! ..and who the hell knows which is which! ) AND $25 for the print..\n\nThe 4 poor quality T shirts cost us\n$194 and when questioning the cost the guy taking the money said “Sorry mate nothing I can do! “\n\nWell we can.. !!! DO NOT BUY from these vendors! If you do? Make sure of price before they print!!\n\nThey will rip you off!!\nShow less"], ["Reviewed January 19, 2018", 3.0, "Depends on what you're looking for", "Venice Beach is, in a word, unusual. This can be a good thing or a bad thing depending on what you're looking for. The Strand bike and walk path follows along the shore with beach on one side and shops on the other. Skate parks, ninja warrior obstacles, and playgrounds pop up periodically along this path.\n\nIf you want a quirky people-watching experience, you'll definitely find that here. Knickknacks and \"art\" are sold from tables lining the pathway. (Some of it is actually pretty impressive while others are just...unusual.) There is an abundant amount of weed among the people who frequent this beach. There is also a large number of homeless communities that form along this beach.\n\nBut if you want an upscale beach neighborhood/dining experience or if you want a family day at the beach that resembles a postcard Californian experience, I would recommend visiting Santa Monica or Manhattan Beach instead.\n\nSide note: there is a large parking lot at the end of Washington Blvd. It's expensive but convenient for the beach.\nShow less"], ["Reviewed January 19, 2018", 2.0, "Not so Glamorous", "Good to see, there are a couple of good cafe's for lunch, i recommend hiring a bike to get there. The souvenir shops are cheap and nasty but its good to have a look."], ["Reviewed January 17, 2018", 5.0, "Loveeeee", "It’s such a fun place! Great board walk- amazing sun set views and bars! Bring a sweater and long pants in Jan. It got cold. The water was so so cold. Could not swim in it but did put my foot in there. Fried Oreo was great from board walk. Great souvenir shops too!\nShow less"], ["Reviewed January 17, 2018", 1.0, "Don’t waste your time!", "This place has changed a lot in the last couple years. Tons of homeless everywhere and weed. Little mini camps in several places. Homeless and bums trying to sell “art work” and paintings from their residences for cash. Want to be rappers and musicians trying to push their CD’s on you.\nDirty as he!! too, the homeless don’t throw anything away. My daughter asked why we are even in this area. So disappointing, you’d think Venice Beach would do something to clean it up.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Love this place", "Nothing like strolling along Venice Beach. Love it. Highly recommend spending a few hours people watching."], ["Reviewed January 15, 2018", 3.0, "Over rated", "I agree with Zalgariath, \"this place is kind of nuts.\" I think our whole family got a bit buzzed on second-hand smoke and for that reason, I would not suggest if for young families unless that your thing.\n\nIt was very touristy and lots of people looking for handouts. The beach was clean and nice to walk on in the morning. Walking out on the pier was fun, but wear shoes and watch out for fish hooks and dog poop.\nShow less"], ["Reviewed January 15, 2018", 5.0, "A little paradise", "It was an awesome experience! The endless beach, the sun, that ocean, oh and there is even an outdoor gym and skate parks!! What could be better! It is even more beautiful during sunsets! So much locals and tourists but nice atmosphere overall! ¡Lo amarás!"], ["Reviewed January 13, 2018", 3.0, "Lots to see!!", "We came to Venice beach for a stroll up to Santa Monica pier and having been to Miami south beach I would say it's very similar although there is a lot to see here there's also a lot you don't want to see!\nIt's very clean and has a cool vibe although a lot of homeless people flock here in the day so you can get bombarded with people begging - quite common around LA.\nThere's a few coffee shops around but I'd wait until your nearer the pier to eat as there's much better choices. Parking is fairly easy and there's lots of car parks that are fairly priced- be careful with the one man band signs charging you $15 dollars for the day as this is a lot more expensive than pay and display.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Venice Beach", "A must! Venice Beach is great by day and also we enjoyed walking up it during the sunset. Fun lively for tourists and nice coffee bars and great people"], ["Reviewed January 13, 2018", 4.0, "Everything you'd expect", "This place is kind of nuts, popular with locals and tourists alike. It is a massive tourist trap but you kind of have to expect that. Oddly the cheapest parking was right on the beach at the official car park. Avoid all the spruikers holding up signs to private car parks on the approach. (At least in March, summer may be different!) Weed, freaks, muscle-bound roid heads, bikes, bladers and a lot of sand. Oddly as a 'beach' by Australian standards for surfing and swimming is is very average, but as a spectacle and place to hang out with heaps of activities, it is a place to be. There was some sort of bike day going on when we visited with cyclists everywhere, great to see. Be aware you are in a tourist trap and enjoy the atmosphere. Definitely worth a visit but won't be everyone's cup of tea.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Lovely", "Great tourist beach in LA. So close to LA it’s a must. Plenty of famous sites such as the basket ball pitch, the muscle gym and the skate board park. Lots of beach shops and ‘hip’ shops along the stretch. Lots of local entertainment and people selling cds! Sand was lovely, didn’t go into the water but was great for surfing. For a dip it would be great but wouldn’t say it’s a beach for sun beds as such. Still it’s a must visit and it gets a full 5 stars from me\nShow less"], ["Reviewed January 13, 2018", 2.0, "Yuk!", "This was a stop on an all day tour. I was really disgusted by the area, the smell of pot everywhere. I definitly would not hang out at the beach here for sure."], ["Reviewed January 13, 2018", 5.0, "Run, Forrest, run!", "Or, pretty much do any sport you like in the morning. Breathe the air, hear the ocean, take in the good vibe!"], ["Reviewed January 12, 2018", 4.0, "I love this place but", "We did our usual visit to Venice beach and all enjoyed the atmosphere and different sights however, I can’t help thinking that so much more could be made of the great setting and weather with so many tourists- it’s seems to be a lost opportunity- facilities are run down and good quality eating options limited\nLoved the outdoor vibe with so many different activities happening - gym, basketball skateboarding etc\nShow less"], ["Reviewed January 12, 2018", 4.0, "Get caught in the crazy", "Venice beach (last visted 25years ago) still holds the vibe. Street performers, muscle beach, gype joints, bike rentals music... the list goes on and on. They were doing some filming the day we visited which was an added bonus."], ["Reviewed January 12, 2018", 5.0, "Fun, interesting place.", "My family and I visited LA from SC the week of Christmas 2017. It was a fun place with some interesting sights. There were several \"beachy\" shops we enjoyed and performers on the beach. We walked from there to the downtown area for lunch and more shops. I loved seeing so many restaurants and shops within walking distance. We walked further down to the Promenade and adjoining mall and made a day of it.\nShow less"], ["Reviewed January 12, 2018", 4.0, "A haze of Weed and Roller skating", "An interesting place to sit and people watch, it’s a visual symphony! But the smell of weed everywhere won’t be to everyone’s liking."], ["Reviewed January 11, 2018", 3.0, "Funny place to see different kind of people", "This is the most funny place in LA. You can see different funny people walking by. The smell of grass all around."], ["Reviewed January 10, 2018", 4.0, "Beautiful sunset.", "Very good sunset view from this beach. Dont follow the signs for parking held by people which lead into commerical parking place. If you can find any free public parking space, park your car there for $2/hr. But remember the time limit is 2hours.\nWhile at this place, if you have some time try to go to venice canals which is around 1.5mile from there.\nI dont recommend staying in the beach till night though. Better to return after sunset.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Quirky, fun place!", "I went here in March 2017 with my boyfriend and another couple. The shopping was amazing. Everything is so unique and specific to that area. The Ice cream we had was to die for. The boardwalk is crazy. Its definitely congested and there are a lot of tourists but if you can ignore all the crazy tourists and take this place in for what it is, its a pretty good time! It is most definitely a place you can people watch. Muscle Beach.....its something to see, although I did have my fair share of laughs at these guys and it made us feel a little uncomfortable how into themselves they were. LOL\nShow less"], ["Reviewed January 9, 2018", 5.0, "Majestic ocean and perfect sand before you. Tacky shops behind you. Watch out for bikes.", "Huge clean beach and beautiful (cold) ocean. You can wade or you can surf. Sand is perfect for sand castles. Lots of stores with moderate quality fast/junk/snack food right behind the beach. Also wire enclosed sport courts and weight lifting areas. There is convenient bike rental right there which explains in part why there is constant traffic of bicycles along a path parallel to the shoreline but 50 yards back. But be careful because the bicyclist may not always see you as your cross back from the beach to the shops.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Very clean beach", "The beach is quite some distance from Hollywood if you are coming from that area. It is a very great tourist attraction with a lot of companies in the area. The likes of Google, Snapchat and some incubators. A must place to visit if you are a techie person\nShow less"], ["Reviewed January 9, 2018", 3.0, "Venice Beach", "Whilst the water & sand are beautiful, the pathway and everywhere else is filthy. Muscle beach is pretty cool to see."], ["Reviewed January 8, 2018", 4.0, "A Walk on the Beach", "If you’re looking for a beach that offers the ocean, sand, street/beach performances, bike rentals, unique sights and plenty of souvenir shops then Venice Beach is the place for you."], ["Reviewed January 8, 2018", 5.0, "Clean beach", "It's a must see,clean beach that have lots of shops with clothes or shoes also places to eat, the only one thing that i found gross is tje toilets better go to restaurant."], ["Reviewed January 8, 2018", 3.0, "Edgy Vibe, colourful beach and beach life", "All walks of life here! Small stalls, beach souvenirs, skate park, basketball courts, bikes, skaters, muscle beach. You’ll get hassled to buy some random stuff but ignore that and enjoy the vibe here!"], ["Reviewed January 7, 2018", 1.0, "Filthy, street people everywhere.", "Sorry I took my family to Venice beach. Street creatures everywhere. Washrooms on the beach were filthy, in disrepair, and simple gross, smelly and dirty. Tattoo parlours all along the board walk along with weed stores, peddles and undesirables. The best part was parking was only $1.00 for an hour. That was plenty time to spend there. The skateboard parks were cool to watch. Muscle beach also had a few guys working out while we were there. Very nice men. The equipment is in bad need of repair. Skip Venice beach until the clean it up.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Good for a quick visit", "Venice beach is full of mostly harmless homeless and 'artsy' folk completely outnumbered by tourists.\n\nIt's a great place for people watching and second hand smoking of hash. Lot's of tourist shops and average looking fast food.\n\nFelt like it was not a place to be after dark with kids. It's well worth a visit though and was great to watch the skaters at the park, missed the posers at muscle beach though.\nShow less"], ["Reviewed January 7, 2018", 4.0, "Quintessential southern California beach scene", "Pay the fee to park in the lot, and then get out and walk along the Strand, to see the 'Muscle Beach' workout areas, beach volleyball, interesting beachfront apartments, and then have a meal at one of the many restaurants. Pure southern California!"], ["Reviewed January 6, 2018", 5.0, "Iconic Boardwalk", "If you are not into different, don't go. Very Arts and Crafty, Street entertainment everywhere. There are shops on one side of Boardwalk and Individual vendors on the other side. Very talented people. But also different. Great people watching area."], ["Reviewed January 6, 2018", 1.0, "Disgusting", "Not a place to be when sun sets! The smell of urine and pot doesn't mix well. Trash all over, human/dog crap on sidewalks. Very disappointed"], ["Reviewed January 6, 2018", 5.0, "Fabulous beach", "We went to this beach a few times there is always a great atmosphere and lots of weird people and great buskers to see. A must do when in the area."], ["Reviewed January 6, 2018", 1.0, "Venice Beach, no thanks", "This place is filthy and full full full of street people and I witnessed drug deals right in front of me. I would not waste my time driving there. Sorry"], ["Reviewed January 6, 2018", 2.0, "Wow what a disappointment!!!", "My whole life I’ve seen LA advertised in such an amazing manner that perhaps my expectations were just too high.\n\nFirst it was blown by the “walk of stars” which is not so glamorous.. then by other sights and then the stop to the famous Venice beach.\n\nWalking down the strip we get stopped by people giving free CDs. We were hesitant but they were forced on us and the person said to listen and review on Facebook. I said we would do so... then he tried to scam us for money/donation... I said all I have is a $50 and he was like “oh that’s fine”. We ran fast.\n\nMuscle beach is yuk. Kept walking past that. There was just rubbish everywhere, dodgy encounters and I just felt super unsafe at all times.\n\nFood was bad, made me sick (Gyro place)\n\nOne star given for the flags on the beach which we found cool. That was about it.\n\nShow less"], ["Reviewed January 6, 2018", 5.0, "Best beach in the world", "Full of graffiti and art, this beach is unlike any other in the world. It as a character. There are houses behind which are lakes (to replicate the Venetian canals). A market selling quirky stuff, swimwear to tattoo stores, you can expect everything here. Lot of dining options in the vicinity. An open air gymnasium is a perfect place to work out. Expect to see fashion shoots here. But a bit tricky and homeless people are sleeping right outside expensive homes. Not safe after sunset as I was told by friends. Even if you're parking the car, park it really far.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Absolutely LOVE This Beach", "We were able to visit \"Venice Beach\" while on a tour of Los Angeles several summers ago. I grew up on North Carolina beaches as a kid & I lived on Mississippi Beaches in my early 20s (+Fla Beaches) & then most of my adult life on a Long Island, NY Beach Town & now back on a NC Barrier Island Beach. Venice Beach is one of the most overall exciting & complete beaches I have ever been to, it combines all of the best of all the beaches into one. Everything from the water & sand to it's Famous Boardwalk, shops vendors, street entertainers was so very much fun. I use to say South Beach, Florida was the overall best until I saw Venice Beach.\nAnyone visiting the LA area must go to Venice Beach.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Venice Beach", "We recently visited this location in Dec 17. It was very quite, as it was winter but still people around working out. We rode bikes from Santa Monica Pier to Venice Beach and back. Plenty of shopping (souvenir shops). A beautiful spot, would be great to go there in the summer, beach was beautiful.\nShow less"], ["Reviewed January 4, 2018", 5.0, "Beach Vacation", "From street artist to tourists to Angelenos to homeless Venice does not disappoint- rent a bike for $20/day @ the gingerbread court & head out to see the canals for which the town is famous."], ["Reviewed January 4, 2018", 1.0, "The nastiest beach I have ever been on!!!", "This was by far the nastiest beach I have ever been around. The restrooms are unusable. Doors and locks broken, they have not been cleaned ever!!!!! People started just squatting on the floor in one. Unless you live like that how can you expect families to come down and enjoy themselves??? The muscle beach area was gross and smelled like urine. The boardwalk along there had trouble written all over it. People blaring music the kids really don't need to hear. I had a guy run his skateboard right into my ankle then giggle about it. I guess if your a local and that's your thing, hats of to you. I will head back to the Florida beaches.\nShow less"], ["Reviewed January 4, 2018", 4.0, "A must", "Venice Beach is an interesting place, a trip to the 60s. The energy brought by the people and artist make it for a cool experience. The beach is clean & fun for the family! Watching the locals surf and skate board is fun."], ["Reviewed January 3, 2018", 4.0, "Whoa!!!! Pretty wild 😜", "Definitely not for the faint of heart... all kinds of walk of life here to entertain you. It's a cross of an Artistic cannabis culture meets washed up has been meets buskers ... and by 4 in the afternoon it's pretty wild!!!"], ["Reviewed January 3, 2018", 1.0, "Dirty dirty dirty", "I was actually in shock by this beach area. It was disgusting. Filled with homeless people, filled with trash, and people selling cheap things out of tents. It felt like an unsafe area. Just smelled bad. I would not recommend this beach/area at all."], ["Reviewed January 3, 2018", 5.0, "Great fun seaside resort", "We actually stayed in at the beach for one night - typical seaside resort with Muscle Beach a main attraction for some. You can hire electric scooters by the trip. Pick one up sign in via your smart phone - ride to your destination and leave the scooter on the pavement. Total convenience.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Sand or sidewalk?", "Venice Beach is an astounding beach. It is huge! So much sand and room. Gentle slope into the water, well patrolled, ranks well for clean water, very good beach.\nVenice Beach boardwalk is beach adjacent, full of people especially on the weekend. An absolute tourist place. Many nice shops, even if a little repetitive (t-shirts, sunglasses, tattoos mostly), and restaurants appropriate to a beach atmosphere.\nThe two locations are worlds apart in terms of feel. The beach is natural, relaxed, easy going, the commercial area is built for business, and requires your monetary participation.\nShow less"], ["Reviewed January 3, 2018", 4.0, "Great tourist attraction", "Venice beach is one of the ultimate experiences of Los Angeles. It’s theme of surfer America is at an all time high where you can experience the best of people watching. Grab some great food to go from some of Los Angeles’s great restaurants on abbot Kinney, or grab some quick poke at a shop along the beach and sit on the concrete wall and observe! Great surfing, souvenirs shops, inexpensive Mexican made blankets, Kenyan wares, tennis courts, outdoor gyms, long walks or rent a bike and head down the coast! There lots to offer anyone whether you’re a couple looking for a sunset bike ride and dinner or a walk through the canals, or a family planning a surfing/paddle boarding beach day or friends getting together there’s shopping galore on abbot Kinney! Even if you’re solo and want to just go for a walk there’s lots to do here and the place comes alive at night as well. Only downsides: sometimes it can get quite crowded in the summertime and parking is difficult.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Crowded place", "The Venice Beach is a very crowded beach with a ton of mini stores selling all type of products. There is a skating bowl between the sidewalk and the sea."], ["Reviewed January 3, 2018", 1.0, "Venice Beach, CA", "Venice Beach California sucked! It reminded me how blessed I am to be from the SE United States! No reason to ever go back!"], ["Reviewed January 3, 2018", 3.0, "Awesome Views", "We walked down to Venice Beach from the Santa Monica Pier, Awesome view of the mountains and ocean. The muscle beach gym was a bit of a let down as it is very dirty and beat up. Also as others have mentioned there is a very large homeless population in the area as well as the constant smell of marijuana\nShow less"], ["Reviewed January 3, 2018", 5.0, "Crazy Spot!", "Excellent for people watching, strolling the sidewalks, looking for junky souvenirs and enjoying just another sunny day in southern California!"], ["Reviewed January 2, 2018", 3.0, "Hmmmm", "Something needs to be done to fix the huge amount of homeless people about. The beach itself is gorgeous and the sunset is impeccable but the number of homeless people there and the stench of weed was over powering."], ["Reviewed January 1, 2018", 4.0, "Fresh breeze on yhe board walk", "Stayed at Su Casa and was able to walk right on the beach, lots entertainment, restaurant and fresh breeze. Plenty of parking but i recommend coming early."], ["Reviewed January 1, 2018", 3.0, "very crowded", "I've never seen so many people on such a narrow street. I mean it was ok, but I was probably at the busiest time of the day there. wow"], ["Reviewed December 31, 2017", 4.0, "Local council need to get their s**t together", "This place is something unique. spoilt by a lackadaisical local council. the local council need to up their game. Clean the footpaths Empty the bins. Everything else is as expected."], ["Reviewed December 31, 2017", 3.0, "Tired and cheap", "I’ve been here a number of times before, over the past 20 Years. I’ve enjoyed the stroll down the boardwalk. But this time it seemed cheap and tacky. More strange people than ever before and the smell of dope was throughout the air.\n\nMy sons really didn’t enjoy it and we walked back on the beach, so to avoid the strange people.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Entertaining walk", "Although we were suckers in a ‘free’ reggae CD sales job, the rest of our 2 and 1/2 hour walk was a pleasant stroll beside the massive beach of the Pacific Ocean.\n\nIn our 1st mile or so we passed a mostly vacant muscle beach - the low 70 degrees Fahrenheit was a little too cool I guess?\n\nAlong the east side of the sometimes spilt walk/bike path, T shirt and Knick knack hawkers were sprinkled amongst pricey condominiums.\n\nReally enjoyed watching the tight rope gymnasts just before our 3 mile turn around mark at Santa Monica Pier.\nShow less"], ["Reviewed December 29, 2017", 3.0, "Interesting but not amazing...", "This is a unique beach with lots of people watching and art. It's worth a visit but it's not a place I'd frequent. There are much nicer beaches nearby that aren't so busy or dirty."], ["Reviewed December 29, 2017", 4.0, "An Essential Part Of The California Experience But Be Careful", "Go at the weekend and you will be assured of seeing the good, the bad and the weird aspects of humanity. You will see men with muscles especially at Muscle Beach which is where Schwarzenegger used to hang out. (Try Gold's gym in Santa Monica or look for a big man riding a bike if you want to see him today) You will see girls in bikini's some who should be in them and some who shouldn't. You may see a man juggling chain saws or playing an electronic guitar on a skateboard.\n\nYou will also see myriad stalls selling T-shirts and various other souvenirs. The better shops are back from the beach which you'll see later on. Do visit the pier and your kids will thank you and maybe even visit the aquarium which is underneath the pier. Ask as you'll probably never find it on your own.\n\nI wish I could tell you where to park but I can't. Get there for 9:30am and you'll have more options. Not a place to hang out in the evening. A lot of drugs in the area and users come out at night. This is a spot to enjoy in the daytime before going for a nice brunch somewhere. A lot of good places to eat in Santa Monica and don't be afraid to ask someone for a recommendation for whatever type of food you fancy eating. Closed mouths don't get fed:-) Take water, wear sunscreen, ladies zip up or close your bags and have fun.\nShow less"], ["Reviewed December 29, 2017", 4.0, "Good day out to the beach", "Venice Beach is alive with loads of activities, Street entertainment etc. Its a good day out to spend on the beach, grab a bite (lots of food options) and have a relaxing time."], ["Reviewed December 28, 2017", 4.0, "Venice", "Spent the day here it's a lovely place to relax as long as your on the beach it's busy near the stores and lots of people begging but that's what I expected but don't let hat put you off loads of toilets but not very clean but still worth a visit\nShow less"], ["Reviewed December 28, 2017", 3.0, "Large beach with plenty people.", "Beach was crowded and plenty of shops and activities along the boardwalk and park.\n\nToilet and shower facilities easy to find, but inadequate and not well maintained.\n\nBustling, carnival atmosphere even on weekday afternoon, plenty working out on Muscle Beach.\n\nOverall good beach but need to be better maintained.\nShow less"], ["Reviewed December 28, 2017", 3.0, "Don’t breathe too deep", "My husband & I visited so he could see Muscle Beach. That is a dump. I guess I’m not sure what I was expecting but honestly, it looks dumpy.\n\nVenice Beach is quite large & clean from what we saw but everywhere we walked, people were smoking weed. It got quite smelly & tiring. You of course have to pay to park. A lot of lots charge $10/2hours but we found a lot that was $8 until 10 pm. We arrived around 5 pm. There was a sign that said $15 all day. That lot was very close to the muscle beach area. So if you don’t take the first offer you see, you might get a better value.\n\nThere are places to eat around there but all seemed pretty touristy so we opted to leave & find something away from that area.\nShow less"], ["Reviewed December 28, 2017", 1.0, "Will never return!", "Somewhere I’d always wanted to go and I’ve ticked it off my bucket list and will never return. I get that it’s bohemian but it’s full of homeless people, it’s full of litter and witnessed someone getting their handbag snatched. Just didn’t have a nice vibe.\nShow less"], ["Reviewed December 28, 2017", 2.0, "Trashy and sad", "I was expecting trashy and loud but was surprised at how seedy and sad Venice Beach was. We walked about a kilometre along the boardwalk but there wasn’t much to recommend other than it was a lovely sunny winters day for a walk. It’s a very wide beach so quite a long walk across sand to get to the ocean. Lots of much nicer beaches to visit.\nShow less"], ["Reviewed December 28, 2017", 5.0, "what a place :)", "a place that you always to visit. such fun and what an atmosphere...WOW...love this place, the beach, the action, the options you have"], ["Reviewed December 28, 2017", 5.0, "Great fun.", "This is a great place to go with family. It's a long beachfront sidewalk with lots of shops. There are very many places to eat and a good selection of tourist items. The best thing is the people watching."], ["Reviewed December 27, 2017", 2.0, "Gone down hill", "My 15 year old daughter, her friend and I visited last spring break for a late afternoon. I was disappointed. The place was always seedy but with an eclectic feel. I had visited a half dozen times in the nineties. Sure has gone down hill toward the tacky and trashy side of the spectrum.\nShow less"], ["Reviewed December 27, 2017", 1.0, "Mostly set-up for vendors selling", "First and foremost, be very careful of shady people offering things such as cd's for free. Visited with my daughter (early 20's). Two guys approached both of us and used a typical set-up to create a crime of theft. First, one approached my daughter complimenting on her beauty and immediately mentioning a free cd as they are a new group from Jamaica and 2nd guy went in between us separating my daughter and me with easy access to my daughter's purse. As a tried to go around the guy to get to my daughter, he tried to block me. I managed to get around him and protect my daughter. He didn't like it by asking me, \"what is wrong with you?\". There should be undercover police - better not only for tourists but vendors especially because after this experience my daughter and I felt the vendors could be scamming as well. On another note, beach is huge! There is an outside gym as well.\nShow less"], ["Reviewed December 25, 2017", 1.0, "Marajuna Destination", "Nothing exciting. A bunch of gift shops ALL selling the same junk. A marajuna destination. Not exactly a family tourist destination."], ["Reviewed December 24, 2017", 2.0, "Not what I expected", "I showed up first thing in the morning (like 9-11am) on a Saturday and there wasn't much open and a lot of \"local clientele.\" Tons of garbage, sleeping bags, people talking to themselves, and police officers managing these people. All of the shops here were kitschy. Not my cup of tea, but hey, I can say I did it once.\nShow less"], ["Reviewed December 24, 2017", 5.0, "One of the best places in LA", "Venice is one of the best places to visit when you are in LA. Sports, shopping, food and, of course, a wonderful beach to go."], ["Reviewed December 23, 2017", 4.0, "Great beach!", "Beautiful beach and a great place to shop. Not so far from the airport. Restaurants have decent food options. Bike paths are nice."], ["Reviewed December 23, 2017", 4.0, "Beautiful", "Wow what a view. This is where the sky meets the earth. Luckily the weather wasn't too hot. Got a chance to walk a great length is the beach. Great place to visit."], ["Reviewed December 23, 2017", 4.0, "Surfing and sand dollars", "Beautiful place to collect sand dollars and watch surfing also bike the boardwalk in the sun and see an array of people."], ["Reviewed December 22, 2017", 2.0, "Bucket list but it stops there", "Very interesting experience. Lots of homeless. Some of them fighting, yelling. Some of them smoking drugs. Was not the Venice Beach I was expecting. Nice stroll along the beach front from the SM Pier to here though. I wouldn’t recommend bringing kids or going at night.\nShow less"], ["Reviewed December 22, 2017", 4.0, "Venice Beach Has Something for Everyone", "Over the years I have come here to play competitive beach volleyball on the sand courts (Note: you may have to bring your own cords/lines). In high school I used to come to buy incense and inexpensive ethnic jewelry, which you can still do. Most recently, I come here for walks with my boyfriend and then, to get food nearby on Abbott Kinney. Abbott Kinney can be crowded with hipsters if you go at the wrong time on weekend nights or Fridays, but going to the beach here to walk the old Boardwalk and take in the strange people and knick knacks being sold is still fun. You can walk far down into the Marina and visit tasty establishments like Mercede's Grill, or you can go to James' Beach Restaurant in Venice right of the Boardwalk. If you can head to Venice Beach midday and then go for a happy hour to one of the nearby restaurants, it's an enjoyable way to spend the day.\nShow less"], ["Reviewed December 21, 2017", 2.0, "Stay away if you bring your kids along", "Arrived to the beach to watch the sunset and take a stroll with the family, but was scared away by the smell of weeds, the homeless people and the unpleasant atmosphere around the promenade. Stay away after dark."], ["Reviewed December 21, 2017", 5.0, "Cool walk", "Great wall to see all the crazy performer's. I enjoyed muscle beach and golds gym where Arnold used to work out."], ["Reviewed December 21, 2017", 3.0, "Oh my!! not how it looks in the movies", "Made a flying visit just to see what it was all about, quirky people and characters but place needs some serious upgrading and maintenance, could be a top tourist destination with the right level of improvement. Oh and the homeless shanty town... will leave you to decide what you think.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Hippy Dippy", "Well worth a visit. Lots of little stall on the beach front. Sadly, lots of homeless but nevertheless a community of love. 733 from LA goes right there."], ["Reviewed December 21, 2017", 4.0, "Early on a weekday", "We were able to visit with small children early in a weekday. Happy we did because there were enough \"characters \" there to give me a feel for what to expect as the day progressed. This was not the same beach I remembered as a child . No street performers , no muscle men . Not much of anything really but a very dirty entrance. My kiddos enjoyed watching the skate boarders , there were several younger kiddos out and of course they saw a teenager rip his pants that thought that was cool as well . I would take a few things as possible to keep up with.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Nice little Venice", "Did a nice leisurely walk.along the beach in the morning and it was very relaxing. Went across the road to check out the \"Little Venice\" area, which has little canals and nice houses.\nAlso did a cycle all the way to Santa Monica beach and back. Good walk in the morning before the weed smoking and homeless people spoil the day.\nShow less"], ["Reviewed December 16, 2017", 3.0, "Nice Beach, Run Down Area", "Venice beach itself is pretty nice though very crowded. We had a feally pleasant day there.\nHoever the area around the beach is a little dingy and seedy we felt. It's not that anything bad happened to us, nor did we feel threatened in any way, it's just a little run down and not particularly nice to wander around.\nAs I said though the beach is nice with lots of activity. Music blares, vendors sell and there are loads of people exercising and working out on the boardwalk.\nA nice beach to spend some time in and nice waters to swim in.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Awesome beachy", "We struck a beautiful morning at Venice Beach and it was awesome. We walked from the pier down to the muscle beach and back. If driving try the meter parks as it is $1 USD per hour - good price. Worth a visit."], ["Reviewed December 15, 2017", 5.0, "Great artsy urban beach city", "Really fun place to ride bikes and people watch !!! Some beautiful homes !! Lots to do, walk to Santa Monica, rent bikes or sit on really huge beaches! Nice sunsets!!"], ["Reviewed December 12, 2017", 5.0, "Love this beach", "Beautiful beach and love the atmosphere here. There are lots of things to see here muscle beach is a must. I love the energy here everyone is so laid back. There are lots of cheap places to shop here and vendors to get souvenirs. Beach is beautiful and big too. W\nShow less"], ["Reviewed December 12, 2017", 3.0, "Won't be returning", "I've seen and heard of Venice beach in tons of movies. The arena itself seemed very run down, unkempt. The beach was beautiful, however garbages were overflowing. The beach seems to house many \"beach bums\", for a lack of better word. Many interesting characters in this area. Not sure I'd bring kids here. We also checked out muscle beach which was neat. There's also tons of really cute shops nestled in between streets. Overall, this area was much dirtier than I was expecting.\nShow less"], ["Reviewed December 11, 2017", 2.0, "Homeless city", "Didn't enjoy our stay at all. Was hassled a couple of times asking for donations, slice Of pizza for sexual favours. Not at all my idea of a \"family\" type place or vacation area for anyone."], ["Reviewed December 10, 2017", 5.0, "Relaxing morning at the beach", "My family went on a Friday morning. It was very relaxing and quiet. I would recommend going on a weekday rather than a weekend as I've heard it gets really crowded on weekends."], ["Reviewed December 10, 2017", 2.0, "Sketchy Place! Neat, but I didnt feel safe!", "This was a neat place to visit, but there were TONS of homeless people begging as you walked by! It is definitely a different world! People were fussing and arguing with each other! Lots of homeless and mentally unstable people! I did not enjoy my time here!\nShow less"], ["Reviewed December 10, 2017", 5.0, "Love Venice Beach!!", "I grew up nearby and have always loved Venice Beach. Now I live in San Diego and still try to come up a few times a year to get my “fix” of Venice. So much to take in if you like to people watch. Also great bicycle path that goes for miles up and down the beaches. Love checking out the graffiti artists and seeing all the talented performers up and down the boardwalk. This place never gets old for me. Also fun to walk along the canals and the shops.\nShow less"], ["Reviewed December 9, 2017", 5.0, "awesome venice beach", "we have been here a few times it is so fun people watching.going for a swim and our bike rides we has so much fun.the lemonade freshly made you got to try.we will be back miss it"], ["Reviewed December 8, 2017", 5.0, "Hip town, cool beach", "Venice is a charming town with many shops, cafes and restaurants. Unfortunately, the homeless population is pretty bad. The canals are worth seeing. The beach is nice also."], ["Reviewed December 8, 2017", 4.0, "Enjoyable visit", "I visited here on a bright sunny day, and everything was how I expected it too be. There’s quite a large skate area that’s particularly popular with skateboarders, and people watching them, muscle beach is a short distance away, is very much an outdoor gym!\n\nWorth a visit\nShow less"], ["Reviewed December 6, 2017", 5.0, "A day at sunny venice beach with Eskcon group having a rathyatra and food stalls", "A beautiful beach straight out of baywatch series with lifeguards in same attire like show. A brilliant place to enjoy with kids."], ["Reviewed December 6, 2017", 4.0, "Pretty Beach - lots of Activity", "Basketball courts, bikers, joggers and skateboarders. This is a people watching beach. Little shops along the way and the \"Bay Watch\" life guard stations."], ["Reviewed December 6, 2017", 4.0, "Funky", "I love spending the day in Venice at the boardwalk near the water. It's great for people watching, grabbing lunch or a beer, and just taking a day to unwind."], ["Reviewed December 5, 2017", 4.0, "Just a Visit", "We walked after getting a parking place not crowded cause we went on a Tuesday in the morning it was a nice day to get out and walk along the beach....They have shops you can go too but we didn’t do any of that just wanted to see the beach.....\nShow less"], ["Reviewed December 5, 2017", 4.0, "Relaxing and Affordable", "I visited Venice beach on a Friday night. After my flight to LAX arrived and I picked up my rental car, Venice was the first place in California that I visited. While the sign was not lit, the culture was great. Visitors were all around, and the parking was reasonable at $5.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Straight out of the movies", "It is just as imagined, street vendors, performers, bikes, skateboards, volleyball. ......straight out of the many movies and TV shows in which it features."], ["Reviewed December 3, 2017", 5.0, "Beautiful", "Very busy to get to. You can drive right up to the beach and park for $7.00 in the lot that is touching the beach. Large safe parking area. A must see if in the area!!"], ["Reviewed December 3, 2017", 5.0, "Walk The Beach & Pier", "This is a perfect place to walk, snack, and watch the sunset. Go in the evening for the best experience."], ["Reviewed December 3, 2017", 4.0, "Sunshine, Surf, and Surprises", "I had been to Venice Beach before but it still held at least one surprise for me. We enjoyed strolling the walk as usual, browsing the somewhat overpriced shops, observing the surfers and skateboarders, appreciating the artisans ad their wares, watching paddleball matches, all the usual. My surprise was being able to observe and listen to the denizens of the beach. One offered to sell marijuana, even in the shadow of the medicinal marijuana dispensaries. Some chatted as they searched the garbage for sellable recycleables. Then I heard several discussing some conflicts with some local young people. It was fascinating. It was a contrasted backdrop to the often affluent tourists who frequent the beach. Overall, Venice Beach is a (free) must see L.A. attraction. Prepare to spend almost a day, and prepare for surprises even if you've been there before. There is always something new!\nShow less"], ["Reviewed December 3, 2017", 5.0, "Very disappointed", "The only site i enjoyed was the skate boarders. The smell was hortible. Thete are tents as if apartments that house homeless people. Not a place to bring children. Besides the sad site of homeless there is the smell of pot ."], ["Reviewed December 2, 2017", 5.0, "Always a great place to visit", "Venice beach is always a great place to visit. I would suggest that you take some blankets and just sit on one of the many grassy areas and just watch the world go by. Lots of food options. I would suggest you bring a light jacket as it does cool down when the sun goes down.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Cool environment", "Great beach, awesome to ride a long board, meet new people, work out outdoor and also enter in the sea, even though the water from Pacific Ocean is colder than another ocean."], ["Reviewed December 1, 2017", 2.0, "Once was enough", "It was slightly interesting walking down this carnival corridor, but I wouldn't want to do it again. Too many bums. Too many aggressive street hustlers trying to hawk their dismal demo tapes.\n\nI just want to buy a t-shirt, and maybe a funnel cake. Is that too much to ask without getting constantly harassed?\n\nThe most interesting aspect is looking at all of the funky houses bordering the beach. It is an interesting lifestyle: many of the people were already partying, drinking beers at 10AM...though it was Friday. Salud!\nShow less"]]}}