{"Venice Beach Boardwalk": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Venice Beach Boardwalk", "url": "/Attraction_Review-g32655-d142853-Reviews-Venice_Beach_Boardwalk-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/dd/fd/31/photo3jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2618"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90291", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 2.0, "Pick another beach", "Unfortunately a beautiful beach has become a sad tent city for the homeless. My wife and I had numerous people trying to hand us cds, which thankfully we declined after hearing from others how they then try to swindle money from you. We were approached by a homeless man asking for a few dollars and when we declined he proceeded to harass us and follow us muttering to himself how we were rich f**ks and couldn’t help out someone who has nothing. His following us made us both feel as though we were in danger.\nShow less"], ["Reviewed 1 week ago", 4.0, "Beautiful, unique crowd", "Lots to do here, bike, skate, etc. people watching is great. It's a bit touristy. And don't take anything anyone tries to hand you. They will expect you to pay for it even though it seems they are handing it to you free (cds are common). Beautiful beach with mountains as the backdrop!\nShow less"], ["Reviewed 2 weeks ago", 5.0, "A Fantastic People Watching Extravaganza!", "By far one of the best parts of my trip to LA. The people are energetic and interesting. From the body builders to the skaters, everyone is doing their own thing and it's incredible to see. Take your time to look at the artist who are set up and the musicians who are playing their instruments or singng. Don't be afraid to talk to people - everyone has their story and they are usually quite interesting. Don't be deterred by the smell of Marijuana. People are smoking and stoned faced, but no one is a hassle and everyone is just trying to chill and go about their lives. Would definitely go back in a heartbeat.\nShow less"], ["Reviewed 2 weeks ago", 2.0, "Venice beach -muscle beach no more - people are strange", "We had the unfortunate experience of walking to Venice beach from Santa Monica beach. Oh my, what did we stumble across? As we were walking from Santa Monica you cross the border to Venice Beach, gone are the beautiful kept pathways and facilities, hello third world country, dirty boardwalk, homeless people everywhere and shops trying to sell anything to the gulliable. Shady characters seem to be part of the landscape and muscle beach is a rundown building that hasn’t seen improvements in decades. What a shame. Strange people, no need to watch the movies, you can come here and experience it for yourself, just make sure you leave before the sun goes down or you may become a statistic/victim. Dope smells everywhere, did I feel unsafe - you bet I did. The sad reality is that they have beautiful beaches, unmanned with homeless people living in the lifeguard shacks. Junkies and paraphernalia galore. Do I recommend this place - only if you have a Death wish. Stay in Santa Monica and head up to Malibu, don’t waste your time here.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Unique!", "I have always thought that strange things move west, and this is as far west as you can get. Lots of interesting people and businesses and buskers. This is part of what defines Los Angeles and a trip here would not be complete without a visit.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Cool shops and art but nothing truely stunning", "If you come to Venice beach you will struggle to avoid the Boardwalk, although there is nothing truly amazing here there is some good art work and interesting tourist focused shops. It's not bad for a nice stroll but is not a must visit."], ["Reviewed 3 weeks ago", 3.0, "Certainly different", "It is a great place to get away from the hustle and bustle of LA itself. You have an eclectic mix of old and new.\n\nThere's lots of shonky souvenir shops if you need to get some last minute gifts for those back home.\n\nThe beach is nice, and you do get nice sunset shots.\n\nBut its nothing spectacular, and if you don't have time, you're not missing much.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "If you like to swim in the pool which is in the ocean and kind of shallow, it’s here", "Food is nice, clean, driving from Cancun takes about 2 hours. Nice for the ones which are ready to be in ocean but do not really love to swim in the waves and deep"], ["Reviewed 3 weeks ago", 3.0, "Long promenade but not really interesting", "Some strange people to see around and some kitsch shops but nothing of really interesting to see around. The beach anyway is not bad."], ["Reviewed 3 weeks ago", 5.0, "Visiting from Brisbane", "One of my favourite places on the west coast, a stroll along the boardwalk, people watchingis always the best to clear the mind away from the hustle and bustle of Los Angeles"], ["Reviewed 3 weeks ago", 3.0, "Mixed thoughts", "Our first time here; went because friends said don’t miss it. It IS interesting but also sad. Lots of homeless people living alongside the boardwalk, together with people setting up tables of things to sell. Lots of t-shirt shops, a few restaurants and a variety of other shops along the way. Several of the buildings are colorfully painted with murals and interesting designs. Skaters whizzing by, singers sitting in beach chairs singer their favorite tunes and LOTS of people walking, checking out the scene. Interesting, but I left feeling sad for the overall plight of many that I saw.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "COOL", "ne of my favorite beach walks in USA, it is all the time crowded and full of funny people who are doing funny stuff to get paid, however it is not clean because many homeless people literaly live there.\nso many shops selling funny shirts with funny slang.\n\nparking 6 $ a day\nShow less"], ["Reviewed 4 weeks ago", 5.0, "the freak show. you have to see it.", "It was a great day walking at the Venice Beach boardwalk. The sun was out and all the designated areas for sporting were being used. Beach is just right there and the amazing freak show where you can watch everything beyond imaginable."], ["Reviewed 4 weeks ago", 4.0, "Place to chill", "This Iconic Boardwalk is bustling with people chilling... street performers, skateboarders & others... also has outlets to eat and shop."], ["Reviewed January 24, 2018", 5.0, "Freak show", "A nice sunset. Other than that, a nice walk to people watch. Many tee shirt shops. The feel is that of a carnival. Make sure you walk up to the skateboard park. And watch the people working out as well."], ["Reviewed January 24, 2018", 5.0, "Very Interesting Place", "We walked along the Boardwalk from Venice Beach back to Santa Monica Pier which was only about 20 Minutes but a nice wall with great views.\n\nVenice Beach has some real characters and has a lot of homeless living along the boardwalk but don’t be put off there are great shops and market stuff to buy. We found a man selling great wooden souvenirs which we bought.\nTher is some fantastic artwork on buildings which make for some beautiful photos. Just have fun and go with it!\nShow less"], ["Reviewed January 23, 2018", 4.0, "Absolutely An Experience", "This was an experience, along one side of the boardwalk are mostly Tee Shirt, Souvenir Shops, Food Places, and then a Green Doctor something I did not know about, then for the people the ones that obviously spend lots of time here, a guy on home made Roller Skates playing a Guitar and selling Tee Shirts as well, a young lady came up to us and spoke about her wish to travel, obviously homeless but harmless enough, people thrusting CDs at you but make sure you don't take them just keep walking, we saw Muscle Beach with very athletic guys flexing and working out, very pleased we visited.\nShow less"], ["Reviewed January 22, 2018", 1.0, "Don’t bother", "Surrounded by people smoking weed and trying to sell you their crap! Not a nice place to visit, don’t bother!"], ["Reviewed January 21, 2018", 4.0, "Quintessential and quirky California beach/boardwalk scene", "Lots of parking for a few bucks makes this a very accessible beach/boardwalk area. And the shops and 'Muscle Beach' areas are a quirky yet quintessential California scene. A wide variety of people watching makes for a fun time just walking along the boardwalk. Touristy? Heck yeah. But fun to do for a couple of hours. Definitely recommend.\nShow less"], ["Reviewed January 21, 2018", 3.0, "great place to snag sunglasses and people watch", "tourist attraction for sure but also nice to walk near the beach. just be on the lookout for pick pockets!"], ["Reviewed January 18, 2018", 4.0, "Uniquely California", "This is a must visit place if you have not been here. It's hard to find a parking spot if you arrive after 10:00 AM. It's definitely one of the busiest beach areas in Los Angeles. It was cool to see the unique and weird scene on the colorful boardwalk. Much of the area is a little run down. Many strange and unique people to watch, depending on your interest. To me, it's a been there done that experience, but many people enjoy coming back again and again .\nShow less"], ["Reviewed January 14, 2018", 3.0, "Unique experience - Both good and bad", "Visited there many times as our hostel was located in close proximity of the boardwalk. The beach is very beautiful. The boardwalk in itself is quite amazing with all the palms, ocean and everything. But on the boardwalk there also are ALL SORTS of weird stuff going on. Didn't feel dangerous there though. But if you want to enjoy a walk by the beach without seeing guys doing their weird performances - go somewhere else or walk on the actual beach instead of the boardwalk. I would STAY AWAY by night but at the daytime it is quite safe.\nShow less"], ["Reviewed January 14, 2018", 3.0, "Alternative and a bit scruffy but fun", "Venice Beach still attracts a colorful mix of residents and visitors. The boardwalk is a pleasant place to stroll and people watch, but I wouldn't recommend walking alone or late at night because it seems occupied by skate boarders and groups of barely dressed beach bums.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Classic California Beach scene", "A \"must\" experience for tourists and locals. Color, characters, Muscle Beach, sun, surf and fun, fun fun."], ["Reviewed January 8, 2018", 5.0, "Fun Historical Place", "There is a lot to see at Venice Beach. It is a fun & lively place. A lot of history here! If you want to people watch, play basketball, hand ball, skate or skateboarding, paint graffiti, workout, shop, eat or just lay on the beach it's all here! We found the people to be really friendly & we enjoyed our time here!\nShow less"], ["Reviewed January 6, 2018", 4.0, "Fun way to spend a sunny afternoon", "Parking was quite a challenge, but once we were out on the boardwalk, it was truly a fun afternoon. (We took an Uber, but one of our local relatives drove, and it took him over half an hour to find parking). There's so much going on, in kind of a festival atmosphere. There's great people-watching, tons of souvenir shops, a weightlifting area, and the basketball courts. There are also places that prescribe medical marijuana. The beach is pretty, the pier is nice, and there are numeous places to eat.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Craziest Beach", "Full of graffiti and art, this beach is unlike any other in the world. There are houses behind which are lakes (to replicate the Venetian canals). A market selling quirky stuff, swimwear to tattoo stores, you can expect everything here. Lot of dining options in the vicinity. An open air gymnasium is a perfect place to work out. Expect to see fashion shoots here.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Awesome & Very Cool", "We were on a tour of LA several summers ago & went to Venice Beach for the day. Along the boardwalk there so many storefronts & street vendors that you can buy almost anything imaginable. As you stroll along be sure to stay off the bike & rollerblade path so as not to get run over. Enjoy a stop at \"Muscle Beach\" to watch the weight lifters show off their bodies. This 1 1/2 mile long boardwalk is one of the coolest places I have ever seen & this was a truly magnificent day.\nShow less"], ["Reviewed January 5, 2018", 1.0, "Not the Venice Beach of the movies.", "I would take note and not even bother to visit here. There are street people everywhere. Beautiful expensive beachfront homes with homeless camped right in front. I did not feel safe and the entire experience made me feel sad. What a shame."], ["Reviewed January 4, 2018", 3.0, "Freedom of expression", "Free to walk, free speech, free park...\n\nBring your skateboard. Bring a bike. Or simply use your walking shoes to explore this place.\n\nOccasionally you can smell marijuana here. No drinking alcohol though.\n\nMany talented people around waiting to be discovered.\n\nSeveral places to eat burgers and fries.\n\nYou can buy souvenirs..Or have a massage for 5 dollars, you can play basketball... go to gym outdoors....\n\nA lot of people... not a place to relax for me ..A bit crowded....\n\nShow less"], ["Reviewed January 3, 2018", 5.0, "So much to see!", "One of my favourite spots. Great for people watching. Be sure to check out the roller skaters and the skateboarders. If the weather was better, I would have spent the entire day there."], ["Reviewed January 3, 2018", 5.0, "Fun walk", "Typical seaside shops selling custom printed tea-shirts, funny hats, anything you can think of buying. Many rough sleepers which is very sad and slightly unsettling. Never refuse a \"doggy bag\" - take what you haven't touched and give it to one of the needy."], ["Reviewed January 1, 2018", 3.0, "Tourist tat unchanged in 30 years", "I'll keep this short: Venice is a poor relation to Camden in London, but with a beach.\n\nIn the 30 years I've been visiting it has become busier and busier with tourists but simply hasn't reinvented itself. Same old tat, a more industrial Muscle Beach, and still trying to rip off visitors (once again they tried to shortchange me at a place I went to). The world has moved on but Venice and its Boardwalk hasn't.\nShow less"], ["Reviewed December 30, 2017", 4.0, "......interesting place to hang out in California....", "Venice Beach has redefined Beach commerce for me.\n\nThis beach for me is themed around fitness and freedom of expression that is enshrined in the US constitution.\n\nLots of street performers, actors and merchants of all manner of services from palm reading to medicinal marijuana!\n\nThe ally is quite crowded with cyclists, pets walking, skate boarding. Lots of things happening.\n\nNice place to chill out when the weather is allowing.\n\nMinus for me, the public loos need better supervision.\nShow less"], ["Reviewed December 28, 2017", 4.0, "Boardwalk", "Went to Venice boardwalk in November really hot day which made the place a bit smelly there's loads of vagrants down there and people trying to sell you cd\"s or other things which puts you off a bit visiting but once your there it is ok .it's one of those places you've got to see while visiting la\nShow less"], ["Reviewed December 25, 2017", 5.0, "Unique", "Definitely worth a visit when in LA area. Unlike any beach you will ever see. Not because of the beach itself, although that is pretty. But just a unique group of diverse people and quite a few street groups that are actually extremely entertaining."], ["Reviewed December 20, 2017", 4.0, "Great Place to People Watch", "If you have a couple of hours to kill in the LA stop on by and see some interesting characters. The local artist and residence give the area a unique flare."], ["Reviewed December 16, 2017", 4.0, "A Hive of Human Energy", "Venice beach is a busy spot, that's for sure! As well as all the bodies bronzing on the beach, the boardwalk is full of walkers anxious to look their best.\nLoads of joggers and dudes lifting weights competing in their own musclefests! Everyone is beautiful here and waste no time or shame in showing it off! As a tourist it's a nice place to go for a wander but don't stray too far from the boardwalk as the area inland away from the beach is dingy enough.\nShow less"], ["Reviewed December 15, 2017", 4.0, "Entertaining walk", "We walked for about 5km along the Ocean Front Walk from Venice to Santa Monica Pier. An interesting cast of characters along the way with lively music and sites. The piers, palms and ocean make nice photo ops."], ["Reviewed December 10, 2017", 5.0, "Nice leisure stroll before 5pm", "Full of activities and the infamous muscle beach. Full of stretch performance until 5pm while it suddenly shuts down and remommend to proceed to Santa Moniaive pier for more dining and activities."], ["Reviewed December 10, 2017", 3.0, "Not what I expected!", "This was a sketchy place! I took my family here on a tour, but it was not as expected! There are lots of sketchy people here - homeless and mentally unstable people! I did not feel safe!"], ["Reviewed December 10, 2017", 4.0, "Hip, Happening.....and Homeless", "We stopped in the Cadillac Hotel, which sits on Venice Boardwalk, for 2 nights during the Summer. We both found the area to be very hip, and full of people living a bohemian lifestyle. Artwork is everywhere, and creative people can be found 'doing their thing'. Especially loved the bike parade that came riding past the hotel, all lite up and with their own sound systems....very cool indeed.\n\nWhat we did notice was the area in general had a feel of being run-down, both in the buildings and general ambiance. There is also a lot of homeless in the area; so don't be surprised if you have to step over someone sleeping on a mattress on your morning walk.\n\nParking's a nightmare too.\nShow less"], ["Reviewed December 9, 2017", 3.0, "Such a Contrast", "As a visitor i nearly felt compelled to go. Overall, it's one of those iconic places that you must visit when in LA. But, dont go looking for nice places to eat and drink. The boardwalk is for watching eclectic people go about their show business. It is a mixture of craziness and seediness. Go for an hour or two, watch the street performers, watch the skate boarders and then leave before you catch something unwanted.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Maybe touristy, but nevertheless entertaining", "Any trip to LA has to have a stop in Venice. The area has featured in so many movies it’s hard not to feel like you’re in a familiar environment. All walks of life go about their days here and there’s some pretty cool humans showing off their talent or skill. The skatepark is an absolute must!\nShow less"], ["Reviewed December 8, 2017", 4.0, "Cool place to visit", "If you are in Venice, go see the boardwalk. It is entertaining and amusing. It is full of tourists and local kooks so don’t expect much."], ["Reviewed December 8, 2017", 3.0, "Not the greatest in LA", "LA has a lot to offer, but I would not recommend putting Venice Beach Boardwalk at the top of your list. If you like people watching and don't mind crowds or seedy beach stands selling cheap sunglasses, then check it out. If you're looking for a real beach, I'd head to Manhattan Beach or the Strand instead.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Another Tourist Attraction - Lots of Unique People", "Lots of people to see with different hair, clothes and music. T shirt shops, souvenir shops and little snack shops and restaurants. Colorful people and music. Skateboarders and bicyclists all over so keep your eyes open. Marijuana and headshops every block. Not for Me. Muscle Beach was interesting. Some really ripped guys and gals.\nShow less"], ["Reviewed December 4, 2017", 5.0, "it's an experience", "A bit of a different experience for most. A collection of unique individuals and stores. muscle beach!!!"], ["Reviewed December 4, 2017", 4.0, "This is where all the crazy people are...", "Come and feast your eyes on the very interesting people of Venice Beach. In all of the times I have been here it has always been very safe. Lots of police presence encourage people to behave themselves and there is plenty to see if you are into people-watching. In saying that, as in all places, keep your valuables hidden and be careful of pickpockets\nShow less"], ["Reviewed December 3, 2017", 5.0, "Can get crowded but worth it", "Great to experience the boardwalk, great sights, sounds and smells...worth it. Plenty of food outlets along the way."], ["Reviewed December 2, 2017", 5.0, "Very important location to see if you are in Los Angeles", "All is magic and unique here ... walk on the boardwalk is for turist and local I do everyday I love . The sunset is super here , the best pic ! During winter time 450pm don t miss"], ["Reviewed December 2, 2017", 4.0, "Fun drop in", "We came and spent an hour here. Fun sights and shops. Muscle beach was a hoot. It's a touristy-spot but everyone should try it once - just not after dark from what I've heard."], ["Reviewed November 30, 2017", 3.0, "Messy, dodgy, sketchy", "Venice beach is a little run down and dirty along the boardwalk but the beach is really nice and the skate park is a great place to hang out and watch the skaters."], ["Reviewed November 28, 2017", 2.0, "Strangely depressing", "Yikes. Look to one side and you see an extensive wide beach fronting the ocean. Look to the other side and you see seedy beach shops and many, many homeless encampments. I guess it has its own quirky character but it wasn't a place I would go back to. We visited in November, so the beach was quiet. Perhaps in the summertime it is more lively and the character is different?\nShow less"], ["Reviewed November 27, 2017", 5.0, "wonderful colourful", "always a good place to strawl along the beach - watch all the activies, people, have a drink, go to the beach etc."], ["Reviewed November 26, 2017", 4.0, "A Different World....", "I suppose everyplace is different from the next but I have never been on a strip quite like this one...I'd dare say it's one of a kind. Lots of touristy stores...the street performers are fun to watch, there are panhandlers but they seem to be creative and practice decent etiquette, the outdoor gym of course, the painted graffiti, a lot of pets (some riding skate boards or dressed up), a wide variety of people too...then there is the cool skate park with talented skaters (fun to watch)....it's a pretty beach (not sure how clean parts of it are since we saw someone taking a pee in the sand)...it's a must do at least once, it's entertaining. Gave it a 4 only because it can be a bit over whelming with kids...your not sure what to expect.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Lots to see", "Always heard about this place so I was excited to see and expeirence it! Blocks and blocks of shopping and restaurant along the beach with tons of characters to come across with selling paintings and eveything else along the beach! I would highly recommed coming here while visiting LA\nShow less"], ["Reviewed November 20, 2017", 3.0, "Tourist Trap, just go to Santa Monica", "It was dirty and full of people trying to sell things to gullible tourists. The beach was nice but the shops along the board walk were all dirty and selling cheap knockoffs. Next time, I'd just stay in Santa Monica."], ["Reviewed November 20, 2017", 5.0, "Great Boardwalk", "We loved visiting all the great little shops and different things they had available to see here, weightlifting, skateboarding and of course the beach. Worth a quick visit here."], ["Reviewed November 19, 2017", 3.0, "Keep your children close!!", "Shaddy people begging for money all over. Some entertainment. Lot of shops and yes, GREAT food! Bums EVERYWHERE. Lack of police enforcement."], ["Reviewed November 18, 2017", 4.0, "One of a kind", "Everything here from bikinis to bums and in between anything you can imagine. Lots of genuine physical activities like weight lifters, a form of tennis, skate boarders, etc. The biggest change I have seen since my last visit a couple of years ago is the homeless camps along the boardwalk. I'd suggest not taking this route after dark.\nParking: the city lot at N. Venice and Pacific was $10. The city lots at the beach was $9 but I think that is subject to the seasons. No concerns about how you are dressed, trust me you will fit in.\nShow less"], ["Reviewed November 17, 2017", 5.0, "a piece of future", "great culture mix all kinds of eatery places, and not strictly tourist driven prices. great vibe and safe"], ["Reviewed November 17, 2017", 2.0, "Visit to Venice Beach", "My wife and I recently visited Venice Beach with another couple while in LA preceding a cruise. We rented a car and drove to this boardwalk area. We wanted to see this famous attraction. We were pretty disappointed as it was really underwhelming. The area was dirty and smelled. The place was full of homeless and the public restrooms were pathetic. We’re glad we checked it out, but would definitely not return.\nShow less"], ["Reviewed November 17, 2017", 5.0, "A good tourist spot", "The boardwalk is fun hip area to walk, shop and see the sights. There are lots of vendors and performers. It can be crowded, but it is worth it."], ["Reviewed November 15, 2017", 3.0, "Not a bad spot, beware of the homeless.", "Lots of homeless people around and little junk and t shirt shops. If you are going to have a feed at one of the boardwalk cafes beware of the slightly unhinged people who may or may not scream at you while you are eating."], ["Reviewed November 14, 2017", 4.0, "Aka Muscle Beach", "Don't show up with huge expectations and you'll love it. If you like to people watch and check out the bizarre, this is the place to take a stroll. Lots of gift stores and restaurant along with boardwalk venders. Nice beach with outdoor beach restrooms which are always crowded, sandy and wet. Some boardwalk entertainment brought to you via the locals. They also have an outdoor gym-weight lifting area on the boardwalk. Sometimes that can be entertaining in itself. The one draw back is parking. It can be expensive and hard to find! My kids love this place and always want to visit Venice Beach when we go to Los Angeles.\nShow less"], ["Reviewed November 14, 2017", 4.0, "must see for visitors", "great place to stroll, people watch, be surprised and amazed by some of the strange get ups and street acts, good place to have a quick bite and a drink, the beach is beautiful too"], ["Reviewed November 13, 2017", 5.0, "Lots to see and do", "There are many unique shops and restaurants. Great place to rent a bike since the boardwalk is extensive."], ["Reviewed November 12, 2017", 5.0, "Great atmosphere and good people watching", "A great place to chill out, go for a walk, people watch, go for a swim or eat and drink.\nThis is a very busy place but don't let that put you off as it is a big area and everyone spreads out. Great for the whole family. I found it easier to get to via public transport as parking is expensive and difficult. This is not just a tourist spot, great for locals also. Heaps of shops, street performers, sports to be played also\nShow less"], ["Reviewed November 12, 2017", 5.0, "Nice stroll", "If you have a few hours to kill take a stroll down Venice Beach. The water is cold but clean. Great place to buy souvenirs at reasonable prices."], ["Reviewed November 9, 2017", 4.0, "Interesting stop!", "Great area to people watch! Lots of great eateries and shops. LOTS of people. Every time I've gone it's been packed, so be prepared for clusters of people and difficulty finding parking unless you park in the city beach lots (which I was and it was worth it)! Make sure the check out the pier as well!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Always a Suprise.", "Struggling to find parking in the summertime, you wonder if a visit to Venice Beach Boardwalk is worth it. But once you are on the boardwalk, you know it was. You can go a dozen times and never fail to see new things each and every time. In the winter, the boardwalk is ever better (in my opinion) and local street parking is much easier. Not \"easy\" but easier. My usual walk goes from Navy Street as a northern end and West Washington Boulevard as a southern end. Take is slow and enjoy all the strange and often delightful things going on both in the shops and along the boardwalk itself.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Good for a stroll, but not necessarily for lots of entertainment.", "Travel Tip: This is a good place to come hang out or relax on the sand while the sun sets. If you are looking for purely entertainment with a beach vibe, then I would recommend heading to Santa Monica, Long Beach (Pine Street), Manhattan, Hermosa, Huntington or elsewhere.\n\nI'm a fellow traveler so I appreciate when other people have given me tips. If this tip was helpful, please let me know by hitting that like button. Even if this review helps one traveler then it's worth it to me. Safe Travels!\nShow less"], ["Reviewed November 8, 2017", 3.0, "Interesting place!", "My impression of the area as a tourist is that it's a place to walk through but not hang out. It's not clean however the City staff are there every day to clean it. The area is home for many homeless people and you may get high on the smell of pot just walking through. However I felt safe as people keep to themselves.\nShow less"], ["Reviewed November 5, 2017", 4.0, "Enjoyable afternoon", "My sister in law brought me here when I was in town working and had a few hrs. to kill. There were a ton of shops and vendors to browse thru. We ate our lunch out by the water. There were a few homeless people around the area but they did not bother us. Overall it was an enjoyable afternoon.\nShow less"], ["Reviewed November 4, 2017", 3.0, "Birthplace of the Zombie Apocalypse?", "My wife, 16 year old daughter and I visited here in August of 2017. I had heard many things about it over the years and wanted to get a first hand glimpse, We left feeling uneasy about the future of mankind...To me ,it looked like a non stop ,morally decadent freak show ,I like having fun,but this place seemed way out there,made Las Vegas seem like a family friendly place for sure. I can see why it inspired the Doors song \"people are strange\" which they wrote after Jim Morrison met Ray Manzarek here in the 60\"s , fast forward to today and it's like people are strange on steroids.I felt uncomfortable having my daughter here so we left after a little over an hour of should I say \"strange scenes\".\nShow less"], ["Reviewed November 1, 2017", 2.0, "Venice Beach Boardwalk - much over-rated", "Given its natural setting it is a pity the Boardwalk is such a disappointment. The day we visited it was crowded and noisy with people hanging out of bars and cafes, street vendors with dirty and poor quality looking goods and generally the whole area having the appearance of being run down and tired.\nShow less"], ["Reviewed October 31, 2017", 4.0, "A special place and very unique", "Last time I was here, there were more people and more characters out and about. I think there were less out this time because the temperature was going to be around 100 degrees. Even the guys at Muscle Beach weren't out and I was here around 9:30am...it was just too hot. Always a fascinating place with street performers, souvenir shops, and people who have tables set up along the boardwalk selling their crafts/items. My personal favorite this trip was that there is now the \"Green Doctors\" on the boardwalk...a place to get a prescription for weed. Just always have to visit when I'm in town, just because you never know what you will see. Definitely a great place to people watch.\nShow less"], ["Reviewed October 29, 2017", 4.0, "Full of old hippies", "Fascinating but lots of poor street entertainers ,shops full of souvenirs ,homeless and tramps, packed cafes ,show off skate boarders and drug inspired art ...? Colourful and lively ,with muscle beach as an added bonus"], ["Reviewed October 28, 2017", 3.0, "Meh", "It's by the ocean. What's not to like? But the hype for this beach is over the top. If you're nearby, stop in and see what's up, but don't make a special trip just for this. Personally, I prefer a beach that has more natural interest (rocks, geology, plants, sea life - something to see besides just open sand). If people watching is your thing, this is a good place.\nShow less"], ["Reviewed October 25, 2017", 4.0, "A special part of LA", "Always love it here, it still has a romance to it although some parts are slightly seedy - there is nothing superficial here, what you see is what you get and it has a special magic and mystique. Love having breakfast or a coffee here and listening to the buskers or watching the crowds.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Colorful Characters", "The Venice Beach Boardwalk is filled with colorful characters, muscle beach and lots of medical marijuana dispensaries."], ["Reviewed October 24, 2017", 3.0, "Cool Place!", "This is our second time coming to Venice Beach. The concrete boardwalk has lots of shop and vendors where you can buy clothes and souvenirs. We even saw a contortionist who twisted himself up like a pretzel. You can visit the famous muscle beach (which was kind of a letdown for us because nobody was there at the time of our visit), where all of the body builders go to work out.\n\nThe public washrooms were disgusting. There was no toilet paper in most and there was piss all over the floor.\n\nOverall, it’s a neat place to visit, but just don’t stay too long!\nShow less"], ["Reviewed October 22, 2017", 4.0, "Remnants of the past", "The buildings here which are occupied with restaurants and hostel used to be other types (such as bank) in the past. Walking around here provided us with reminder on what they were before. It is good that the olden days sign still being preserved."], ["Reviewed October 16, 2017", 3.0, "Both worlds", "You see the good with the bad with the weird here. If people watching is fun for you, this is your place. I wouldn’t say there is a ton to do here though. Cheap stores with a bunch of crap. Great sand and beaches. Good waves.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Fun", "I’m a New Yorker, so most things don’t surprise me. I really dig this place. Fun for people watching. Awesome knick-knacks. Great beach 🏖. All this and a free contact high. Loved it."], ["Reviewed October 12, 2017", 5.0, "A Must Visit", "The Venice Beach Boardwalk is a place I know fairly well. I lived a 15 minute walk from the Venice pier for one year (2015-16). It's fair to say that we spent a good amount of time here taking long walks, sometimes even up to Santa Monica.\n\nIf you are visiting LA for the first time and love beaches, you have to come visit Venice and nearby Santa Monica. SM has more of a family friendly vibe with a smaller side of grit, Venice Beach is the reverse. Venice is an interesting cultural experience and I haven't been to any other place like it. Both cities still have some of that quintessential California surf vibe to them.\n\nYou will find homeless people camped out on the sides of the boardwalk and $3 million+ homes nearby. I recently read an article about how Venice is one of the most expensive neighborhoods in LA. The controversial Venice Stakeholders Association would love to change Venice and \"clean\" it up. Tech multi-millionaires (ahem, Google employees) are also changing the dynamic of this neighborhood and driving up real estate prices. Venice is part of what LA likes to call \"Silicon Beach\" which is their attempt to emulate Silicon Valley.\n\nOne of the best parts of coming to Venice is the people watching. You will see so many characters here. There are legends like Harry Perry (in his turban) who has been skating the boardwalk and rocking out on his guitar since the 1970's. It's always entertaining to stop by Muscle Beach and see what's cracking.\n\nBe sure to check out the skate park, it's not far from the Venice \"V.\" It's fun to watch the skaters in the park perform stunts with the ocean as a backdrop.\n\nThere is shopping here, but a lot of touristy and junky shops. As you walk down the boardwalk you will see tables set up with vendors, this was a great place to pick up a piece of wall art. The shops on the other side sell a lot of t-shirts and other touristy goods. It is fun to read the offensive captions on the t-shirts and booty shorts.\n\nIf you like to bike, you could rent one and hit the nearby bike path, it provides a lengthy ride by the beach. Please don't ride your bike in the area with the shops, there is a separate area for you closer to the ocean for biking!\n\nI recommend staying for the sunsets if you can, they are amazing, but it might be a good time to cut out right after that. You do need to keep your wits about you on the Venice Boardwalk. It's probably not the best place to be after dark. There have been issues with homeless people attacking people on the boardwalk. I remember the story of one woman swinging a vacuum cleaner at tourists.\n\nThere aren't many great places to eat on the boardwalk, but you can wander over to nearby Abbott Kinney for hipster eateries galore.\n\nYou can access the start of the Venice Boardwalk from Santa Monica, it's about a 2-2.5 mile walk. Parking is tricky in Venice. If you don't mind a small walk, I would recommend parking by Mother's Beach in adjacent Marina del Rey.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Easy walking along back of beach", "We enjoyed several long strolls along the boardwalk which runs along the back of the beach. There are lots of things to see including the skateboard park and there are plenty of restrooms and places to eat and drink."], ["Reviewed October 11, 2017", 3.0, "Tacky and more tacky", "Beautiful beach ideal for surfers but very tacky and dirty. Lots of homeless people sleeping on the beach some with heavy drug habits or mental health issues. Very sad 😭"], ["Reviewed October 9, 2017", 4.0, "Spend the Day !!", "Reminds me of Manly NSW in the 70's.....Lots of atmosphere and character,Beware of the touts and selling scams thou and wear Sunscreen !! Lots of stalls,street cred and performers &Eccentrics....Never a Dull Moment !!"], ["Reviewed October 8, 2017", 1.0, "Dirty", "Even knowing that Venice beach is described as quirky/cultural/hippy doesn't actually reflect that this place is an overrated dump. Tacky tourist shops selling the same stuff line the front along with \"quirky\" street sellers. The place is very dirty and attracts a lot of homeless people. The police and sanitation department were cleaning up areas of the street whilst we were there (I guess they were trying to do something but I think it's an ongoing problem). The skatepark was fun to watch but the muscle beach was awful! Rusty gym equipment, padding split open and cling filmed up. It was laughable! We walked there from santa monica... And then turned round and walked back! I really don't know what the fuss is about!\nShow less"], ["Reviewed October 5, 2017", 2.0, "Shady but historic", "Provided you know the background of this area, and are aware safety never takes a holiday, you should visit briefly."], ["Reviewed October 2, 2017", 4.0, "Kind of Like a Circus Freak Show", "Interesting for people from other states. Definitely check it out for a few pix and to see some real characters. It's not the best beach however because there are a lot of homeless and thieves there so tourists beware. Just go to see the freak show on the boardwalk, then go down to the Marina del Rey Penninsula or Malibu to actually go out on the beach. Don't have your wallet in your back pocket, hang on to your purse and just watch your back. Don't be there past sunset, but definitely worth checking out for a few laughs.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Best hidden secret", "Truly a great place to visit, filled with eclectic creatives ranging from crafters , cartoonists, psychics, artists, and precious stone stands. I highly recommend you stop by Frank B. Gentile's spot and admire his beautiful renditions of day to day life. I also recommend stopping by Miracle Vibrations. It is a gemstone stand that carries numerous precious stones. The owner of the shop also hand makes many of the jewelry he sells. The boardwalk also houses some great restaurants that offer a variety of different fares.\nShow less"], ["Reviewed October 2, 2017", 3.0, "Lost its Appeal", "Now it is hard to say if places like Venice Beach have lost their appeal or if they are just simply trying too hard to be what they once were in a changing world. You will see this also in places like Haight Ashbury. However in the case of Venice Beach it has been overrun with cheap tourist souvenir shops and restaurants. The type shops where you buy shorts and tshirts with cute and often tacky sayings. The booty shorts were even worse. Somehow it has lost its appeal of its poetic and beat generation past. Even the Muscle Beach now seems packaged and ready for sale. I could not help feeling that it has lost the aspects which made it famous and loved. Now it is just too normal and too cheap. The beach itself is still amazing with plenty of area to get a tan but the rest is just too tacky even for LA.\nShow less"], ["Reviewed October 2, 2017", 4.0, "People Watching at a New Level", "If you like to people watch, then this is a place to checkout. My teenage son and I rented some bikes and rode up and down the area. We enjoyed watching the street performers and skateboarders, and even saw a shooting for a TV show. It is one of those places you have to checkout once in your life.\nShow less"], ["Reviewed September 30, 2017", 2.0, "Waste of a journey", "Took hours to get there on hop on hop off bus on a Saturday to see muscle beach, not one muscle man about!!! Tatty area with lots of homeless lots of shops/ stalls selling cheap rubbish. Not worth the trouble."], ["Reviewed September 30, 2017", 5.0, "The place to be!", "This is the greatest place in the world and I would happily give everything up to come and live here."], ["Reviewed September 26, 2017", 1.0, "Very average", "No-one mentioned the large number of vagrants hanging out on the boardwalk mixed with medical marijuana shops and terrible t-shirt shops. Not sure wha anyone sees in one of the biggest dives in LA. Santa Monica Beach is far superior to wander around and soak in the Pacific Ocean\nShow less"], ["Reviewed September 25, 2017", 4.0, "Need to see at least once", "Great people watching! Interesting shops - normal beach and tourist chechka along with medical smoke paraphernalia. The muscle men really put on a show with their weights routine. There are all types of transportation - bikes, skateboards, rollerblades, unicycles... Some nice sandwich shops closer to Santa Monica.\nShow less"], ["Reviewed September 22, 2017", 3.0, "It's okay, parking can be difficult, a must see attraction.", "It's okay to visit the Boardwalk once, great place to do some peoples watching that about it. It can be very crowded and parking is a pain. Be prepared to pay $10 just to park. Not sure I will be back. But it is a must see attraction.\nShow less"], ["Reviewed September 19, 2017", 3.0, "maybe worth a visit if you like wierdos,,lol", "bit disappointing really,,, lots of strange people and wierdos here, and the area looks run down,,and with the smell of cannabis in the air,, the beach itself is very nice,,though id stick to Santa Monica,,unless you smoke dope and are a wierdo,,,lol"], ["Reviewed September 19, 2017", 4.0, "This Attraction Is A Must See!", "Each time I am in LA I enjoy stopping by Venice Beach to \"people watch\" and peruse the shops and restaurants along the boardwalk. Typically there are street performers all along the boardwalk but on the particular Wednesday that I visited there were none (perhaps because it was a weekday). It is still a wonderful stop as one works their way from Marina Del Rey up the coastline to Santa Monica, Malibu etc.\nShow less"], ["Reviewed September 19, 2017", 5.0, "Make Sure to Visit!", "The Venice Beach Boardwalk is such an eclectic place to visit! Whether you want to visit the tourist shops, people watch, work out on muscle beach, ride your bike, dine in one of the many restaurants, the Boardwalk is a must see! Enjoy!"], ["Reviewed September 19, 2017", 2.0, "OK", "Pretty beach but the boardwalk is very shabby. Far too many homeless and drug addicts hanging around which spoils the area."], ["Reviewed September 19, 2017", 4.0, "take the walk!", "Great people watching and something for everyone. Very gritty and homelessness but safe. Medical marijuana shops, check. bongs and glassware check."], ["Reviewed September 18, 2017", 4.0, "Quick visit to Venice Beach", "Nice beach area to visit and lots of people watching to do! We enjoyed watching the skaters at the park and taking in a meal."], ["Reviewed September 18, 2017", 1.0, "Sad, dirty, and not worth it", "40 year old couple, we went to check out Santa Monica/pier, and thought we could walk down to Venice Beach/boardwalk/muscle beach and see the sights. Although we can 'tick' this off our list, it really was not that enjoyable of a day. The whole Venice Boardwalk is a long row of terrible shops that have cheap, bad food and souvenir shops (we didn't go in the shops). The beach side of the boardwalk had an array of terrible art, very rough looking homeless/addicted/mental illness suffering folks. We were able to witness a man deficating against a building, a different man throwing up on himself on a park bench, a clearly deranged woman YELLING at a passer by whilst swinging a large metal bar...just to name a few sights. These poor people need not be celebrated, just need help. Muscle beach gym....nothing to see. No where to sit as all benches were disgusting or littered with the belongings of the local homeless.\n\nThe beach....beautiful. If you are going to just use the beach, then you may remain blissfully ignorant, unless you need to use the public toilets (smeared in feces with drug paraphernalia littering the floor).\n\nSo, I just hope that the local city has some sort of plan to try and sort the poor people of Venice Beach out\nShow less"], ["Reviewed September 15, 2017", 4.0, "Left Coast Boardwalk", "Really fun place for people-watching. Tons of opportunities to eat, drink, listen to live music, take in a free show by a contortionist/fire-juggler/stand-up-comedian. Walkable and bike-rideable."], ["Reviewed September 13, 2017", 5.0, "Must do!", "Venice Beach, although not as unique as it once was, is a place you cannot skip. The culture is raw and alive and the entertainment fresh and weird. Best place to people wAtch. Can find all foods from slices of pizza to fine dining. Sidewalk Cafe for breakfast!\nShow less"], ["Reviewed September 13, 2017", 1.0, "Beggers and Scammers", "On one side of the street you have beggers all the way, and on the other side where the shops are you have only scammers, they present to you an adult hoodie for 30$, but when you get inside they tell you no worries they add your name, and just for that the bill goes up to 130$ and threaten to call the cops if you don't pay up.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Kinky, crazy and outlandish", "Kinky, crazy and outlandish are but a few of the words for the indescribable Venice Board Walk. Great daytime activity. I would avoid it after dark. Even though the area is gentrifying. Find a bench or table in one of the restaurants that line the board walk and watch the show, you are definitely not in Kansas anymore.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Lively and full of character!", "Very busy and beautiful at the same time. Lots of character and a really cosmopolitan atmosphere. Beach, boardwalk, canals, shops, bars and restaurants! Nice time to visit is late afternoon, and enjoy the sunset!"], ["Reviewed September 8, 2017", 5.0, "Labour day people watching and soaking up the atmosphere!", "Arrived from the UK and headed straight out for a walk along the beech. It was Labour day so really busy but in a great way! Skating, bikes, beach volleyball, street performers and street sellers. Really fun atmosphere! Walked very slowly down to Santa Monica and just the tonic after a 15 hour journey!\nShow less"], ["Reviewed September 7, 2017", 5.0, "This is a Must Do", "The people watching is like no other place in the world. There's muscle beach, basketball, handball, skatepark, bike rentals, surf board rentals, shops, flea market, street performers, food, drinks. It's truly an all day event."], ["Reviewed September 7, 2017", 5.0, "A Venice Beach Walk", "called hear as a stop off and it is a real eye opener with all the posers posing and walking up and down well worth the visit just to say you been there."], ["Reviewed September 7, 2017", 3.0, "Venice Beach Boardwalk", "If you like people watching, this is the place. Saw some great street performers, some great performers and a lot of homeless people. Some of the street performers were the homeless folks. Some very good, some not so much. It's worth checking out. Be prepared to pay $15 to park anywhere nearby. You can also get your medical marijuana card here if needed but I would advise against it based on the horror stories I've heard about jacking up the price to do so. The entire area could use a good cleaning.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Gotta see it once in your life...but just once", "The boardwalk is full of fast food stands and bad bars. An incredible number of homeless people scattered all over the place...I mean hundreds and hundreds. You can see the infamous muscle beach (not much there) just some equiptment. Entertainers and people selling their \"crafts\" It's dirty and if you have kids don't bother. Save the craziness and go to the Santa Monica boardwalk - much more kid friendly.\nShow less"], ["Reviewed September 2, 2017", 3.0, "A weirdly interesting place...", "This place is like the county fair sets up shop every day with a mixture of homeless guys and beach goers. Great for people watching!"], ["Reviewed August 31, 2017", 5.0, "must do", "You have to take this walk along this board walk in order to take in the atmosphere of tha artists, musicians and funny shops. Venice is acutally a bit dirty but the atmosphere is great!"], ["Reviewed August 30, 2017", 3.0, "Worth a stroll through", "Venice boardwalk is worth a stroll through, but don't stay. Many squatters on the boardwalk. They do not bother you, but may scare some children. Some of the street performers are incredible. We saw a woman who sings while playing guitar and her voice was so amazing it made me cry. You also have to check out muscle beach. As few of the muscleheads offer to bench press you(for a few $$). Funny photo op!\nShow less"], ["Reviewed August 29, 2017", 4.0, "Under 40? Ya gotta go . . .", "This one of the iconic big tourist strips - but with huge t-shirt, sunglasses, weed, and beach shops along their boardwalk.\nAnd then there's that muscle beach concession. See it to believe it - and it's free . . . great for the under 30 set. Check the pictures.\nAfter you're worn out by the retail, head out onto the wide, dry sand and large surf that's safe for the kids.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Good for people watching", "A good place to go for people watching. Take in the Muscle Beach Gym, and Skate park then walk the line of shops and take in all the street vendors. Only ever done during the day time, not sure if I would feel comfortable doing this at night.\nShow less"], ["Reviewed August 28, 2017", 4.0, "Must see", "Every time I get to LA I try to stop here. There is so much to see while you people watch and walk. Be ready for a nice long but enjoyable walk. Give yourself some time so you are not in a rush."], ["Reviewed August 24, 2017", 4.0, "The artist, mermaid and angel was a highlight", "Not a great place to take kids. Two highlights included, \"the artist, mermaid and angel\" and lunch at Venice Ale House. You never know who might see there. Parking is not cheap; public restrooms are available for free."], ["Reviewed August 21, 2017", 1.0, "Complete SCAM", "This place is a completely SCAM. They have a sign out front that says $40 but they won't let you leave threatening to call the cops and withholding your i.d. until you pay either $60 to cancel or $200+ to get a fake medical card. On top of that the $200 card only works at one store that is associated with this scam. AVOID THIS PLACE AT ALL COSTS\nShow less"], ["Reviewed August 21, 2017", 4.0, "Street shows", "It was a pleasant walk with family and friends. The street dance and singing shows made it more pleasant for us. It was entertaining."], ["Reviewed August 20, 2017", 4.0, "Artists and Shops", "Although there are a lot of the same touristy shops and merchandise, there are also some gems where I bought the most comfortable sandals made of yoga mats and t-shirt type cotton material. I also bought a beautiful and inexpensive painting from a street artist. Just under the Venice sign, check out the Bank of Venice, a comfortable organic gastropub for good food and drink.\nShow less"], ["Reviewed August 20, 2017", 4.0, "Lots there", "There are no shortage of things to buy along the boardwalk and plenty of places to eat. The downside, IMO, are the beggars in the area looking for money, etc."], ["Reviewed August 19, 2017", 3.0, "Busy beach area with interesting flavor!", "This boardwalk is famous. It has \"Muscle Beach\" with guys working out and the usual shops catering to visitors, particularly adults and young adults. An interesting place to visit, but perhaps not the best for young children based on the displays at the stores."], ["Reviewed August 18, 2017", 4.0, "Good to walk around", "We were on a tour so only had about 45 minutes Seemed to be quite interesting lots of fit people .Quite busy.There was a few groups of guys and girls doing kind of slow dancing ,all doing the same moves.There were also lots of tourist shops.\nShow less"], ["Reviewed August 18, 2017", 4.0, "Venice Boardwalk is Vivid", "We visited Venice Beach Boardwalk with \"A Day in LA\" tours and very much enjoyed it. It is a lively place with much to offer. (although the smell of urine was not pleasant in some areas of the boardwalk)"], ["Reviewed August 16, 2017", 3.0, "The Belly of the Beast for LA Weirdness", "If you want to see a lot of Tourist Trap Stores and a lot of trash. Then by all means come here. This place also has more than its share of shall we say characters around here.\n\nNow the beach view is nice. But The City needs to pick up the pace on keeping the trash and litter around this area.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Great place", "I love to walk in Venice Beach..the boardwalk or Main St. There are lots of people to see (and be seen) and good restaurants and shopping in general."], ["Reviewed August 16, 2017", 4.0, "Counter-culture", "This is a place to be and to be seen at. It is alternative. It is cosmopolitean. Muscle beach, busking, street entertainers, weird & whacko shops, huge beach (damned hot in summer), skateboarders who know all the moves. It has it all plus more. The street art and murals are stunning. Heaps of places to eat at prices that will not break the bank. Parking can be a challenge - I parked just on Speedway near Washington & the guys were awesome.\nShow less"], ["Reviewed August 15, 2017", 3.0, "The craziest place ever", "I was shocked by how much rubbish there is everywhere in LA and Venice beach is not different. Lots of shops along the way, tourist traps I am sure but you can get water, snacks, t shirts... Anything you may need. Lots of homeless artists, everyone is friendly.\nWhat made this enjoyable was watching the roller skaters - bring something to sit on and chill out in the park. Just watch your bags and take care where you sit down. I would not bring kids here or plan to spend more than an hour. Bus connection back to Santa Monica was good but not as quick as we thought. Definitely a must see!\nShow less"], ["Reviewed August 15, 2017", 4.0, "Great bike riding, running, and people watching in north LA beaches", "Great bike, walking, and running trails make up Venice Beach Boardwalk. You can see surfers, lifters, skateboarders, and lots of colorful people hanging out. Nice cool breezes from ocean and plenty of places to eat and shop for entire family."], ["Reviewed August 14, 2017", 2.0, "Not impressed", "We walked along the boardwalk and although there was nothing wrong with it I didn't care for the atmosphere. We were there in February so maybe it is better in the spring and summer. We were bothered several times by people trying to sell us stuff.\nShow less"], ["Reviewed August 12, 2017", 3.0, "An experience", "This place was an experience. I wouldn't go again, but I am glad I did it. Don't bring kids. There isn't anything for little kids to do and it is really more of an adult activity."], ["Reviewed August 11, 2017", 5.0, "Interesting", "I was a little disappointed. The Canals at Venice Beach are beautiful so we found Venice Beach a little grubby. Eclectic crowd of people. I personally wouldn't make a special trip."], ["Reviewed August 11, 2017", 2.0, "Still Sleezy After All These Years", "On a recent visit to L.A., I decided to take the family to Venice Beach. It has been 30 years since I have been last. Still fun to people watch. We were there for 90 minute and walked about a mile down the strip before we decided that we had enough. I would suggest to anyone to visit 1-2 hours and then go elsewhere. A lot of the same t-shirt shops, pot dispensaries or pizza by the slice shops. We saw two down and out men is a street brawl and many individuals in an altered state which bummed us out due to some form of substance abuse. I know all this stuff is what makes Venice Beach, Venice Beach but still better in small doses.\nShow less"], ["Reviewed August 11, 2017", 5.0, "True spirit of Bohemian La", "We walked along the Ocean from Sana Monica to Venice Beach and it's truly one of the best coastal walks ever.Venice boardwalk is a feast for the senses where anything goes and it's very relaxed and safe despite huge visitor numbers.it has a more casual bohemian vibe rather than upmarket glam..its where Jim Morrison of the Doors hung out so it attracts a lot of young boho types..there is also sadly a lot of homeless people about too .There are lots of hotels and appartments to rent in adorable secluded streets just off the boardwalk.i personally want to try Hotel California,next time.The beach is vast...a total beauty and the Ocean waves stunning.Well worth staying here for a few days.,\nShow less"], ["Reviewed August 10, 2017", 4.0, "A Colorful Experience", "I visited Venice Beach early on a February Sunday morning to try to get a flavour of the area during a quieter period before the noisy crowds arrived from downtown Los Angeles. There were already some early exhibitionists around but these just added a little off-beat interest to the scene!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Beautiful sand, sea, sun and people.", "Walked and walked along the edge of the sea. Beautiful wide, sandy beach- great to people watch. Lots to do if your feeling active."], ["Reviewed August 9, 2017", 5.0, "Advice from a Venice local", "I've lived in Venice over 35 years. It has really changed but I do believe a must do is the Venice Boardwalk. Sunday afternoons are when it is really happening if that helps you to plan. Start in Windward Circle (pictured) and head north to Santa Monica. Bring cash if you want to support the vendors on the beach side and the east side vendors in stores obviously take credit cards. There will be street performers, Muscle Beach, restaurants and bars. You can rent bikes if you desire. Ride a bike to the Santa Monica pier for more fun. Lots of homeless as well so be prepared. It is a bit gritty here but still worthwhile. Have fun!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Unique Experience!", "Venice Beach Boardwalk is a true one of a kind place! From street performers to amazing restaurants! My family enjoyed the unique atmosphere that you would only find on Venice Beach Boardwalk!"], ["Reviewed August 8, 2017", 5.0, "Unique, Breathtaking Sunsets, LA Culture. A must see on HWY 101", "Come see and feel the LA beach culture, Venice is a perfect experience. Walk, run, skate, bike along the boardwalk. You can enjoy Venice then walk north to Santa Monica Pier. Fun shopping along the way with great food for the entire family."], ["Reviewed August 7, 2017", 4.0, "Great place...", "We walked from Santa Monica pier to Venice beach, admiring all the beauty.. Street arts, people just playing music, cycling.. Loved the hustle bustle of Venice beach.."], ["Reviewed August 5, 2017", 3.0, "Yawn inspiring", "We were riding past late afternoon on a summer holiday weekday and the \"world famous/iconic/unforgettable\" hype far exceeds the reality. Plenty of people, but sleazy little shops selling garbage, no entertainers, few interesting people, no architecture, few street vendors, little quality food. Maybe a visit at another time weekend would have been better, it was yawn (not awe) inspiring to me. Locals warned us not to visit at night.\nShow less"], ["Reviewed August 4, 2017", 4.0, "great place in the summer", "great place to visit , beach, boardwalk, attraction, shop, skateboard attraction, restaurant, watching people, swim or just sit and rilex"], ["Reviewed August 3, 2017", 4.0, "Nice bike ride", "Its a pretty nice place. There are places to rent bikes and its a nice ride from there to the pier. On the down side, there were a lot of homeless people and a lot of pot smoking going on which I guess could be a good thing or a bad thing depending on your preference.\nShow less"], ["Reviewed August 2, 2017", 1.0, "ahhhhhhhhhhhhhhhhhhhhhhhh", "you go here without drugs, you are high when you come out! everyone wants to rip you off! muscle beach is drugs are us! glad to get out but can tick it off my bucket list!"], ["Reviewed August 1, 2017", 2.0, "Sleazy boardwalk saved only by the spectacular skills on the skate park", "After the upbeat liveliness of Santa Monica, Venice beach is a depressing walk and dodge between hustling vendors touting tatty souvenirs and rough sleepers having a rough time. Suggest escaping to watch the spectacular skills of the guys at the skate park, spotting some street art and then if you're peckish heading inland to find some decent tacos.\nShow less"], ["Reviewed July 31, 2017", 2.0, "Overpriced merchandise", "Part of the Venice Beach experience but not really worth it. Stores full of souvenirs and just plain sleazy. No insult to the locals but we came across a man relieving himself in public- not family friendly."], ["Reviewed July 31, 2017", 4.0, "Lots of shops and food joints and LOTS of people", "We were there on a Saturday, so I'm sure that's the worst time for crowds. We enjoyed the beach and the food was good and reasonably priced. There were lots of shops to wander through, and the people were friendly."], ["Reviewed July 30, 2017", 4.0, "Bustling and busy", "Worth a visit if you like beaches cafes quaint shops and a bustling vibrant beachside experience. A good fun place to spend an afternoon."], ["Reviewed July 30, 2017", 4.0, "Great place", "It was great to wander along the board walk. Everyone was friendly and we felt safe. The food was good and the artwork amazing."], ["Reviewed July 28, 2017", 4.0, "For some, this is a Bucket List plac.", "A slice of Calif.- people, great photos to take; and for us the end of Route 66. The sunset wasn't as spectacular as we thought it was supposed to be."], ["Reviewed July 28, 2017", 1.0, "Yuck!", "Can't understand the reviews that make it sound so interesting. This place is super nasty. The people are dirty, skateboarders are hazardous to pedestrians, dreadlocked swindlers shove junk in your hands then demand cash on every corner. Everywhere is sex junk and anti-Trump shirts, \"medical\" marijuana shops, etc. Avoid this place like the plague that it is.\nShow less"], ["Reviewed July 27, 2017", 5.0, "I love it", "There are so many different venues and businesses. i love it this a a great tourist attarction to see all of the things going on. Everyone was friendly I had a great time I cant wait to return to enjoy again"], ["Reviewed July 25, 2017", 4.0, "Great", "This is fun to do and have done. A lot of crazy people and crazy acts, painters etc, but a must if in LA"], ["Reviewed July 24, 2017", 4.0, "Cool place to walk around and explore", "This was one of our favorite stops on our tour. We got off and checked out the skate park, which was pretty cool. A short walk away is \"Muscle Beach\" where you can see some people working out and and check out some basketball courts where White Men Cany Jump was filmed. There are a lot of shops where you can pick up some souvenirs that aren't too expensive.\nShow less"], ["Reviewed July 24, 2017", 4.0, "Great place to people watch.", "Not a bad place to spend a couple hours. Reasonably priced Only a few blocks but a lot to see. I assume 20 years ago it looked a lot different."], ["Reviewed July 23, 2017", 3.0, "Interesting", "We were visiting Los Angles so we stopped by Venice Beach to see the sights. All of the different people were interesting to see. But I do not know why people would come to the beach to work out. We saw one older man that actually brought weights with him to work out on the beach.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Definitely Cool", "This was on my 'to do' list and I wasn't disappointed. We hired bikes and cycled along the boardwalk passing all the sites; muscle beach, Santa Monica pier and tourist shops.\nMost surprising was the number of homeless people who had set up makeshift accommodation along the beach front.\nThe bikes were $10 per hour from Perry's on the boardwalk but we discovered that you could hire better bikes in the town for $6.\nShow less"], ["Reviewed July 21, 2017", 5.0, "When it's both free and interesting, how's that not excellent?", "I lived pretty much next door in Marina Del Rey (MDR) 30-35 years ago. Venice Beach and the concrete strand along it were an interesting walk then (or skateboard, or roller-skate/rollerblade, or bike ride on an adjacent path) and it was every bit as interesting now that I visited it again, several days in a row in mid-July 2017. It was an every day walk, as I stayed locally for a combined business and pleasure trip and wanted a bit of exercise each day before heading out elsewhere.\n\nThe walking strand is jam packed with interesting looking residences and shops (though many fall into the cheap tourist type category), as well as various craft artisans and people-watching; add in muscle beach (a workout area with equipment where the very fit and muscular show off, as well as work-out), paddle tennis courts (basically a shrunken tennis court played with short-handle hardwood paddles and deadened tennis balls), basketball courts, a skate park, and numerous beach volleyball nets, and there is much to observe, including plenty of amateur acts of all varieties.\n\nThere are plenty of offerings to eat along the way too. If you walked from one end to the other and back (MDR to Santa Monica) you could make it in a few hours, or take the whole day, if you made many stops, which is what is most likely. If you wanted to spend an entire day, walking east to the canal district (from where Venice got its name) would also take up a few hours if you wanted to check out another batch of interesting California living residences.\nShow less"], ["Reviewed July 20, 2017", 3.0, "A place of Extremes - love it or not, it is a must-see", "What can be said? you find everything and everyone from all ways of life at the boardwalk; It is a petri dish of society, you are always surprised of all the variety; It goes for people, architecture , arts, animals, sports...etc... Love the beach, love the skate park...\nShow less"], ["Reviewed July 20, 2017", 5.0, "Unique shops", "Unique shops are the order of the day at the Venice Beach Boardwalk. From surf shops, to art shops and souvenir shops, each has their own identity and fairly reasonable prices."], ["Reviewed July 20, 2017", 4.0, "The craziness and freedom of California", "The world is there people from every walk of life enjoy the great weather and the freedom of wearing whatever they want any look is acceptable Great place great time"], ["Reviewed July 20, 2017", 5.0, "Cold but nice. Couples and singles do good here.", "It's a nice place to walk and stroll. Lot's of attractive,stationery, and moving things to do. Good looking muscles on there also. If you are hunting for a mate here is your place."], ["Reviewed July 19, 2017", 5.0, "Venice Beach and Pacific Ocean!", "If you are looking for a glimpse of the 'wild side' of Los Angeles, perhaps as a beach town, this is the place!"], ["Reviewed July 19, 2017", 4.0, "A Zoo with no cages", "You want Cali? You will find it here. They say the Country slopes slightly downhill towards the West and that all the fruits and nuts roll to Venice. Well its true. Truly a place full of characters, muscle beach and a million t shirts which will commerate your visit. It is fun and funky. Enjoy\nShow less"], ["Reviewed July 19, 2017", 3.0, "Quirky and bizarre, but fascinating", "If you are looking for a nice beach in Southern California to go swimming, skip Venice Beach and go to Santa Monica or further south. But if you want to see a strange collection of people and activities, this is a good destination. There are musicians, skate boarders, muscle men, conspiracy theorists, artists, and homeless people, among many others lining the \"boardwalk.\" There are also many tacky shops and fast food joints here too, but the attraction is the odd collection of people.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Don't miss", "Yep, it's touristy, but also a great people watching and eating spot. There are a lot of shops and vendors, (some junk) muscle beach, a skateboarding park, a big sandy beach and bike rentals. I recommend biking the trail to and from Santa Monica pier. It isn't what all of So Cal is like but a very fun spot to visit!\nShow less"], ["Reviewed July 18, 2017", 4.0, "Vacation", "Had fun. Street performers need to do more performing and less talking. Lots of knick nacks to buy as gifts. Parking is nightmare, but it was the 4th of July."], ["Reviewed July 18, 2017", 3.0, "Not my kinda place", "On our trip out to the west coast we drove to Venice Beach. The beach itself was nice but it looked old and I felt like I was in Mexico with all the little sheds selling the same stuff. If you are headed to California there are much nicer areas to visit\nShow less"], ["Reviewed July 14, 2017", 4.0, "What I imagined Southern California to be, quirky & fun!", "My first trip to California from the east coast & Venice Beach was one of the first places I went. It was everything I expected southern California to be...quirky, crazy, sunny, fun! Yes, there are lots of homeless people, tacky souvenir shops, people peddling anything you can think of but it's an amazing array of entertainers, artists,& interesting people. It's the kind of place I would want to visit at least once and spend a few hours just to see it. The boardwalk is full of shops, some with the same old t-shirts but some very unique. You can see the famous muscle beach with fit people showing off or watch some amazing street ball on the basketball court. Our favorite thing was the skate park. Some incredible local skaters & we were amazed by the little kids that showed up everyone there! Beautiful beach and palm trees in the background & it was just a whole different atmosphere. Lots of cool murals on the buildings & if you are a Doors fan, you will appreciate the Morrison one & the fact he lived nearby. Beautiful bike trails & lots of rental places. You can easily ride a bike up to Santa Monica & check out the beach & pier there. Lots of eating choices of street food or sit down. The new Venice Surfside was an awesome place for good, fresh food & clean bathrooms. My biggest complaint of Venice were the public bathrooms. So gross that we just couldn't use them. Find a decent restaurant & have a meal to use the bathrooms. Public parking & if you are lucky cheap or free street parking. For a total change of pace, walk to the canal streets & enjoy a peaceful walk through the adorable houses & their whimsical gardens. Walk the street one block off the beach to see the Venice sign & other interesting sights. Probably not the beach I would want to get a hotel room at but definitely fun to get the feel of California!\nShow less"], ["Reviewed July 14, 2017", 4.0, "always fun", "Venice Beach is always a fun place to go. However, it was very cold the night we were there and crowded. It's becoming more of a tourist site and losing some of its charm."], ["Reviewed July 14, 2017", 4.0, "Nice beach but many homeless people there", "We think the beach is very nice. The soft sands, long beach with small souvenir shops and beautiful (some very colourful) houses. There are lots of sports activities such as a skater park, fitness work out, people running/skating/cycling etc. However we think it is sad to see so many poor people living on the beach. Not that we dont have empathy with them, but they attract the attention and some in an uncomfortable way.\nShow less"], ["Reviewed July 13, 2017", 2.0, "Tacky", "I find this place too touristy and tacky for my taste. It doesn't have a hip vibe about it at all, rather something pretentious. A lot of kitsch souvenir stalls and that's about it."], ["Reviewed July 12, 2017", 4.0, "A Slice of Los Angeles", "If you're heading to the Venice Beach Boardwalk, keep three things in mind... 1) this is not an upscale place, so don't be in a suite, 2) it's street vendor heaven so be prepared to have people asking you to look at their wares, and 3) the marijuana seems to flow freely in this area. With that being said, it's also a historically classic part of Los Angeles and is worth checking out. You've got this amazing beach on one side and then rows of little shops and street vendors and artists (sometimes that term is used loosely in this location, other times it's quite accurate). There's a great skateboarding park that's worth checking out as well.\nShow less"], ["Reviewed July 12, 2017", 3.0, "Great Place to People Watch!!", "Couldn't have enjoyed our trip t o Venice Beach more!! Lots of interesting things and people to see!!"], ["Reviewed July 11, 2017", 3.0, "Nice walk and great weather", "While enjoying amazing walk in the afternoon and bargain with shops to buy souvenirs at night it get really active for nightlife with all type of pubs in the area."], ["Reviewed July 11, 2017", 4.0, "Great", "Very long Boardwalk and lots to see and do with people watching.\nThere is also a lot of souvenir shops along the boardwalk reasonably priced. We did a large part of the board walk so typically we did it in a hour and a half- thats because we were taking out time. I also saw many visitors hiring bicycles and skating down the boardwalk as an activity.\nShow less"], ["Reviewed July 10, 2017", 4.0, "People Watching At It's Finest", "Walking along the Venice Beach Boardwalk was a fun way to spend the afternoon. Strolling through some of the shops and buying souveniers was fun. The coastal breezes kept it nice and comfortable while walking around. There were street performers and street artists all along the route.\nShow less"], ["Reviewed July 10, 2017", 2.0, "bettee places to go", "You get bombarded by people wanting you to buy their wares as you walk down the boardwalk... I guess because they don't or can't pay for a space to rent to sell their stuff.\nEvery freaking night.... LOUD ARGUING...ECT.. OK SO IT'S MORNING RIGHT NOW AND SOME HOOD RAT SCREAMS LIKE SHE IS ON CRACK.\nYou won't rest here if you want to sleep at night...\nYou have a long trek to the beach.\nIf you want pics with something or someone.. Like Harry Perry.... Expect to pay.... I went to take a picture of A MERMAID SAND SCULPTURE... And was halted.... I DIDN'T SEE THE SIGN .. AND I SURE WASN'T paying for something I wasn't buying and keeping. ...ill keep my free SAND SCULPTURE PICS FROM OCEAN CITY MARYLAND... WHICH IS A FANTASTIC PLACE! There is a place 4 skating.. Biking and skate boarding... But it appears the boardwalk seems preffered.\nA lot better places to go\nShow less"], ["Reviewed July 9, 2017", 4.0, "Interesting", "We enjoyed walking along the boardwalk. Many things to see - interesting the things people will do to make money. Felt safe altho there were some people that appeared under the influence of something."], ["Reviewed July 7, 2017", 2.0, "Dirty, Seedy Place to Run, Even Early in the Day", "Ran from MDR Marriott to Santa Monica Pier and back early Tuesday morning, via Venice Boardwalk. While not crowded at this time of day, tons of homeless loitering around with several getting into loud arguments. Would not feel comfortable if my wife was running alone here. Boardwalk area was dirty with trash and lots of sketchy looking tourist traps. Got miraculously cleaner once into City of Santa Monica. Would not return if in the area.\nShow less"], ["Reviewed July 6, 2017", 3.0, "Glad to see it once, once was fine", "Traveled with three teens. Happy to see the boardwalk and muscle beach as it is on tv/movies all the time. Some of the boardwalk shops were nice, some where sketchy. Spent an hour or so and that was fine for us."], ["Reviewed July 6, 2017", 4.0, "Fun place to visit", "It's a really busy street way lined with stores filled with everything from trinkets to tattoo parlors on one side and on the other street performers and local artists selling their unique artwork. I loved it and felt that it was a great place to visit and people watch I didn't end up buying anything because I didn't have any cash on me so if you go I recommend that you bring cash with yoy\nShow less"], ["Reviewed July 3, 2017", 2.0, "Didnt care for it", "I found nothing but shops with cheap useless souvenirs and people running around looking for attention. I guess there are a lot of people showing up to see the show that is the Venice Beach Boardwalk but I can do without it."], ["Reviewed July 3, 2017", 5.0, "Life Lessons Are Learned Here!", "Our fifteen year-old and naive (as we'd like fifteen year-olds to be) nephew visiting from Indiana farm country wanted to stroll the Venice Beach Boardwalk. We were happy to oblige: where else can one see freaks, surfers, hookers, skateboarders, dopers, buff folk, etc., in such a beautiful setting? The nephew is now enlightened and says he doesn't want to spend his life in Indiana...\nShow less"], ["Reviewed July 3, 2017", 4.0, "Funky and fun", "Lots of artists selling their wares, also lots of homeless, some a little on the aggressive side so do be careful."], ["Reviewed July 1, 2017", 4.0, "Very cool", "We thoroughly enjoyed ourselves at Venice Beach. We did not expect that much to be going on. It was busy, so much going on. The only downside was all the people pressuring you for money constantly."], ["Reviewed July 1, 2017", 5.0, "It's what you expect.....", "This is the basic tourist trap and what you have seen in the movies and on TV. It is nice to walk along, rent a bike, watch people and just hang out. Lots of souvenier shops and vendors."], ["Reviewed July 1, 2017", 5.0, "People watching galore!", "If you are up for some of the best people watching of your life, then you MUST hit up Venice. Be warned if you or your kids aren't familiar with the smell of the green stuff you will be after you leave here. There are LOADS of shops and artists here as well as an abundance of beach bums. You will leave with an education of the local culture for sure. We biked from Santa Monica to Venice. The paved path was perfect for skaters, bikers, skateboarders etc. We also visited the Venice skate park which my boys really enjoyed.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Exactly what I wanted it to be!", "Holy smokes, Venice Beach Boardwalk, please don't ever change!! You're perfect with your beach worn paint jobs, carnival food options, psychedelic tapestry stores, and constant stream of wingnuts skating, biking, and pumping iron nearby."], ["Reviewed June 29, 2017", 1.0, "Scary", "Avoid at all cost after dark , everything is closed nothing happening except for hundreds of homeless , most with mental illnesses not looked after and left to sleep on beach or streets . Terrifying for visitors and so so sad and depressing to see.\nDaytime busy things going on but watch your wallet , drugs everywhere but no one bothered us . Do not go at night !!!!!!\nShow less"], ["Reviewed June 28, 2017", 3.0, "Tattoos, marijuana, tee shirts and bathing suits . . .", "People come to the boardwalk to see oddity, and there is no shortage of it. It seems every fourth building sells \"licensed\" marijuana with signs reading, \"The Doctor is In.\" There is no shortage of Tee shirt and bathing suits among the tattoo parlors and smoke shops. Rent a bike and tour the area -- the bike trail is abundant. Stop by to visit, but keep your expectations low.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Bustling", "This is a must do when in the area I was told, and they were right. It had a very fun vibe and there was plenty to see and do"]]}}