{"Venice Canals Walkway": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Venice Canals Walkway", "url": "/Attraction_Review-g32655-d266790-Reviews-Venice_Canals_Walkway-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0f/0c/60/08/venice.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1622"}, "address": {"@type": "PostalAddress", "streetAddress": "Washigton Blvd. & Dell Ave.", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90292", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 5 days ago", 3.0, "Little over-rated with lot of Hollywood drooling all over the place", "Its a man-made canal system replicating venice,italy. Extremely expensive and home to many hollywood stars. nothing exceptional about it, honestly. Lot of nice olden structures laid around the place, but kind of crowded."], ["Reviewed 1 week ago", 4.0, "Worth a walk", "As previous posters have said, it is well worth a walk. It is not an equal comparison to the real Venice, but still a nice place to visit once."], ["Reviewed 1 week ago", 4.0, "Well worth a walk", "It really is like walking in Venice Italy with it lovely canals and stunning houses all different in shape and colour"], ["Reviewed 2 weeks ago", 4.0, "Worth a walk", "Lovely place to visit if you like architecture, so many different styles of houses and beautiful gardens. do mind the dog mess seemed to be alot about."], ["Reviewed 3 weeks ago", 4.0, "Cool place to stroll!", "It's definitely not the coolest thing ever, but being from the Midwest and also a avid GTA V player I really wanted to visit the Canals! I loved getting to see this in person and it was a fun date to walk to after a day at Venice Beach!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Must see in Venice", "If you are in Venice, this is a must see! Perfect place for a walk. Very relaxing and close to the beach."], ["Reviewed 3 weeks ago", 2.0, "I was expecting something more", "Even though not expecting something similar to the real Venice, there is nothing of really interesting. Maybe a quiet place for the residents."], ["Reviewed 4 weeks ago", 3.0, "Interesting if you're in the area", "When we visited the water level was pretty low making for muddy, somewhat stinky waterways. The homes surrounding the canals however are fun to look at. If you're in the area, it's a nice stroll. Venice Beach has alot more to look at."], ["Reviewed 4 weeks ago", 5.0, "BEAUTIFUL", "This place is a hidden GEM! I LOVE going here and walking along the canals after a rough day. Being there when the sun is setting or rising is beautiful! Even when the sun goes down it is so calming to walk around the canals ! I haven't been on any tours for the canals but you can definitely walk them yourself and enjoy alone time by yourself or with a loved one! I'm from the east coast and this place is a spot I come to when I'm home sick!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Strolling the Canals", "The canals are a fun walk on a sunny day, best done on the weekday when it is not over run by tourists. From the beach on Grand Canal, they span the area between Washington Blvd and South Venice Blvd., however, the canals perpendicular to the ocean start roughly at 26th Street if you are walking from the beach. And only go in as far as Eastern Court. Yes, a very quaint area of lovely homes: some massive ones and others still the charming beach shacks they once were.\nWhen visiting the area, please be mindful of the noise you may create when walking/talking by the houses. As one who used to live on Linnie Canal, I heard more than I wanted to of the conversations people were having as they walked past! Other than that, enjoy your stroll, and do not feed the ducks!\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Walking Through Venice", "What fun this was. We knew that this was a miniature recreation of the canals in Venice and that they had fallen on hard times. But they have recovered and are a very pleasant place to walk and enjoy the water. We saw people canoeing, we saw others tending their shrubbery and we heard lottos people working on their homes. A very pleasant walk through the canals\nShow less"], ["Reviewed 5 weeks ago", 4.0, "It's Not Ancient History", "If someone wants to know the history of Los Angeles and the beaches then a walking or a driving tour of the Venice canals will stimulate the imagination. How could a guy think of making this area an Italian paradise? It was an interesting try and with the canals that are left you will see a different way of life for the residents who have chosen to live on one.\nShow less"], ["Reviewed January 22, 2018", 4.0, "Not the real Venice but really nice", "If you're nearby Venice Beach you must do a walk of the canals Walkway ... it's nowhere near the real Venice but still it's amazing and relaxing ad you'll get to spot some amazing villas over the canals! Highly recommended!"], ["Reviewed January 21, 2018", 4.0, "It was once MUCH larger, but kinda fun just to see it all...", "I live in LA...and I like taking out-of-towners to see the canals. At the turn of the century, it was SO MUCH more extensive, and much more impressive... But, you do get just a glimpse of how funky an area it is... Totally out- of- place in today's world...\nThe surrounding area is nothing to write home about. Parking in Venice is almost ALWAYS a chore. But, like any beach town you'd expect that.. I'd say \"SURE\" go see it once, and then hit the Venice boardwalk for people watching and some out door food...\nWHY NOT???\nShow less"], ["Reviewed January 21, 2018", 3.0, "Cool! But when the water is low it is a bit unpleasant", "this is a cool network of houses and canals. The houses have a fishbowl effect...you can look in them and see what people were doing which is kinda fun to see how they are living.\nThe water was low all over the region and in the canals though and that made them kinda smelly.\nShow less"], ["Reviewed January 20, 2018", 3.0, "Never new this was here", "As many times as I have been in the area I never knew this was here. Parking is hard to find, but if you can get out and take a pic you should."], ["Reviewed January 18, 2018", 3.0, "Cute", "The Canals are cute and quaint, but I found it pretty awkward to walk through. People's homes are RIGHT THERE and I just felt as if I were invading their personal space."], ["Reviewed January 18, 2018", 5.0, "An Italian Escape Right Here in LA", "This is an area of LA few but the locals know about - and it is fabulous! Built in the 1950’s and modeled after the famed actual canals of Venice, Italy, the small 5-6 small street area is lined with small boats, canoes and gondolas that the locals use to get around. (The story goes that the local City Council agreed to let Venice flood the areas to create a Sister “floating city” - and then ran out of money! So this is all that remains). Walk around the million dollar mansions, up and down the tiny circular bridges for some exercise, catch gorgeous views of sunset, and feel like you left LA! BONUS tip: grab dinner at one of the fab restaurants on nearby Washington Boulevard and then walk off some dinner w a beautifully lit stroll around the canals. GORGEOUS anytime, but especially at Christmas and during the longer, lazy summer days to watch the sun go down.\nShow less"], ["Reviewed January 16, 2018", 4.0, "Picturesque walk", "Nice walk along the canals with some OK restaurants nearby. Quirky charm if you have half an hour after fish tacos at James Beach."], ["Reviewed January 15, 2018", 4.0, "beautiful day for a stroll through the canals", "It was fun to look at the houses as we wandered through the various canals. Very pleasant and the canals have an interesting history. I thik it is more enjoyable if you know some of it's history before walking through them."], ["Reviewed January 13, 2018", 3.0, "Nice Homes and Photo opportunities", "Firstly, be aware that you are walking around people's home yard and you have the ability to look into other's home. Do respect the privacy and becareful when taking photos; ask permission if the owner is at their backyard, it's only polite to do so!"], ["Reviewed January 13, 2018", 4.0, "Canal Exploration of Succulants", "A nice break away from the crazy of Venice Beach and only a short walk to get here. It is another world of calm after the hectic waterfront. Nothing spectacular but a pleasant place to explore and stroll. My wife particularly enjoyed the HUGE and varied succulent gardens that many of the houses had on display if you are a plant buff. Worth a visit if you have an hour to kill.\nShow less"], ["Reviewed January 12, 2018", 4.0, "Nice place for a stroll and to take some pics", "We've wanted to visit the canals here on a couple of previous trips to LA, but never made it. We had a nice walk around talking pics and recognising places from movies/TV shows and felt like I was in an episode of Californication! :-) It's a residential area so obviously you can't be too intrusive but i reckon they're used to people walking about and photographing their houses! There is parking on the main street to then be able to wander over and spend half an hour strolling about in the sunshine.\nShow less"], ["Reviewed January 11, 2018", 5.0, "Relaxing canals on LA's west side.", "Such a calm place to visit, especially if you've never been. But this was my 3rd or 4th time. Nice to look at the bridges, homes, and little row boats. Be sure to be respectful as it is a real residential neighborhood."], ["Reviewed January 10, 2018", 5.0, "put your walking shoes on!", "This area is one of my favourite ones when in LA. The houses are quirky, colorful, and they are surrounded by beutiful canals. All good things in life are free, and thi is one of them."], ["Reviewed January 10, 2018", 5.0, "Venice of America!", "We visited this place on Christmas day. All the houses in this neighborhood had very good christmas lights in place and it was a different experiences walking here. Very cute houses!"], ["Reviewed January 10, 2018", 5.0, "Worth visiting!", "While my boyfriend was visiting me in LA, I kept trying to plan things for us to do. It being his 3rd visit, I was running out of some creative ideas. A friend brought this to my attention as something that could be really fun and romantic to do with your significant other.\n\nMy story: We arrived to the venice canals just in time for the sun to set. It was the perfect atmosphere. We took a stroll up and down the canals and looked at the beautiful homes and swan boats. Finally as we were about to call it a day, we saw a man taking pictures of some other people in a perfect spot with the sun setting behind them on the water. Due to my love of pictures, I had asked him if he minded taking a picture for myself and my boyfriend. Immediately he replies, I am actually a wedding and engagement photographer, I would love to take some pictures for you! Boy did we luck out. About 10 minutes and 55 photographs later, we ended up with some pictures that will last a lifetime. It is the perfect backdrop for a picture of you and your special someone.\n\nHighly recommend for the view, the sunset and some great photographs!\nShow less"], ["Reviewed January 8, 2018", 5.0, "Great place to walk along paths! Nice vibe with great scenery! Cool houses!", "We were riding bikes down threw Venice and found these cool canals in between luxurious houses and condos. They have dirt walking paths across the concrete bridge. You can actually walk all the way around threw the neighborhoods. There is a lot of stunning art culture in and around every turn. You never know what you might see in Venice! Cool vibe with cool surroundings! Great location near the beach!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Fun area to walk around", "We really enjoyed seeing this neighborhood. There is a great variety in the type of houses and gardens. Fun to see the ducks on the water."], ["Reviewed January 5, 2018", 5.0, "Cute!", "This area was super cute. It’s nothing too eventful, but it’s a super cute area for a nice walk. It’s a couple minutes past Venice Beach and then off the beach inland a few minutes. We went around Christmas time and loved the mistletoe and lights on many of the bridges. The houses were also very different and interesting to see.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Christmas decorating!", "We walked around this neighborhood at Christmas time. Most of the homes were decorated and it looked pretty and festive. A pretty little walk and much more to my liking than Venice beach."], ["Reviewed January 4, 2018", 5.0, "Unique neighborhood with lots of character", "Great place to walk and explore houses new and old with various styles of architecture, landscaping, colors and decor. All situated along the Venice Canals. Very suitable for a nice walk and exploration on foot."], ["Reviewed January 3, 2018", 3.0, "Interesting Neighborhood", "The water was especially low the day we walked through, but it was still nice to imagine living in this little enclave."], ["Reviewed December 29, 2017", 3.0, "File under nice oddity not a tourist attraction.", "If you accidentally walk into this all well and good have a look see if you'd like to live in any of the houses beside the canal and that's it. This is not the eighth wonder of the world or even the eighth wonder of Los Angeles. The highlight of your visit will probably be seeing a few ducks. Enter at Washington Blvd and Strongs Drive\nShow less"], ["Reviewed December 28, 2017", 4.0, "Just visiting", "I wanted to see this for years so when I knew I was going to la I made sure I visited it.very nice place and very quiet"], ["Reviewed December 28, 2017", 5.0, "Great place to walk and take photos!", "I have been to Venice Beach before, but that was the first time that I took the time to walk through the canals. Great photos and scenery. Sunset was great."], ["Reviewed December 23, 2017", 4.0, "Christmas with Venice", "Very nice place to stroll around and see all the decorated houses and bridges around Christmas time. Probably just as nice the rest of the year ;-)"], ["Reviewed December 19, 2017", 4.0, "Nice Walk", "I've been going down here for years and it dawned on me I'd never really took a stroll along the canals. So recently finally got around to it. It's cool to wander along. The canals were pretty depleted in the water department when I was here. Makes it seem little rundown and ancient. I imagine when the canal levels are higher it's pretty cool. Must be nice to live right along them.\nShow less"], ["Reviewed December 18, 2017", 5.0, "Very amazing development", "Had a stroll across the canal ways and enjoyed the tranquil surroundings. Would love to have a house here."], ["Reviewed December 17, 2017", 4.0, "It’s pretty cool!", "Grab your camera and snap some photos while walking along the Canals... Get the history of why it’s there a little research makes it a more fulfilling visit. It’s a nice walk and I’d recommend a visit!"], ["Reviewed December 17, 2017", 5.0, "Funky Venice Canals are Fascinating", "Funky Venice Canals are fascinating. Not far from the beach and definitely something not found in Iowa. What once were bohemian cottages are being transformed into mega mansions. The counter culture that thrived in Venice are being replaced with computer geeks. Still, worth a gander and a very interesting walk about.\nShow less"], ["Reviewed December 15, 2017", 5.0, "Great walk", "Definitely worth visiting if you are around Venice beach. Short walk from the beach, quaint bridges and great properties."], ["Reviewed December 12, 2017", 2.0, "Beauty overwhelmed by Tourism", "I used to visit the canals on a very regular basis for a long time and until now it has always been fairly \" a local spot\". During my recent visit there were tons of tourists (groups of 20-30) walking the canals and disrupting the experience. My advice, visit in the early hours of the morning and you'll be sure to have it all to yourself.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Lovely", "This area has featured in a few movies and I know why, it's quaint and easy to get around, with small row boats tied along the canals."], ["Reviewed December 2, 2017", 5.0, "Unique place but with Christmas lights is really magic", "I love this place in every moment ! After the sunset is even more magic all the lights in the house .. look like Venice in Italy .. but now with the Christmas light is like a poem ... super suite location must to see"], ["Reviewed November 24, 2017", 5.0, "A must", "Very relaxing walk i had here , i enjoyed the quiet atmosphere and lovely views of boats and houses by the canals."], ["Reviewed November 23, 2017", 5.0, "Great walk", "A must visit and visiting Venice Beach. So peaceful and a great walk around the canals and surrounding neighbourhoods."], ["Reviewed November 20, 2017", 5.0, "A step back in time", "Loved this, didn't know this existed and it was a pleasant surpise to stumble upon. I would definately recommend seeing this if in the area."], ["Reviewed November 17, 2017", 4.0, "paced walks...", "quiet characterful walks to relax and take in the autumn sun, dipping into cafe's on the way. a different side to Venice."], ["Reviewed November 15, 2017", 5.0, "Relaxinh afternoon", "One can walk around here, strolling and enjoying the ambience. 30-45min in enough. Than go straight to the venice brach"], ["Reviewed November 15, 2017", 4.0, "Nice wee stroll.", "Had a lovely wee stroll around the canals, picturesque and quiet place for a walk. My wife and I really enjoyed our time here."], ["Reviewed November 12, 2017", 5.0, "A free and interesting place to see in Venice--and the reason the city was named", "I was taking my friend to the airport but we had enough time for one last tourist spot. She was surprised by it and I told her it was originally much larger. It's more interesting to know the history, that Abbott Kinney was trying to recreate Venice Italy. You'll see every style of house and can park for free on the streets nearby. Just make sure you note where you've parked because you can get turned around if you go through all the canals.\nShow less"], ["Reviewed November 9, 2017", 5.0, "A lovely place to take a walk", "I love walking the Venice Canals. It is a charming experience. You will walk up and over the canals- you will see lovely homes (some large and new and modern, and some small bungalows) - and you will see ducks in the canals and on the sidewalks. There is a nice little playground for small children which also has a duck pond in it.\nIt is located between Venice Blvd. and Washington Blvd. in Venice, not far from the beach.\nIt is also fun to drive over the canals on the elevated bridges. It is a highlight of your trip to see the Venice area.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nShow less"], ["Reviewed November 9, 2017", 5.0, "The nicest thing you could see in Los Angeles", "What a beautiully hidden retreat, we were overwhelmed by the beauty of the Venice Canal Historic District. Paths line the waterway allowing visitors to see the increible homes, owned mostly the creatives, and there's a surprise around every corner.\n\nThe area was built in 1905 by tobacco pioneer Abbot Kinney as part of his plan to bring Italian Venice to America hence the waterway and one-time presence of gondolas.\n\nLook out for features in the gardens and boat parks that include a giant gorilla in the center of a love heart and a pink flamingo barge!\n\nVenice Canals are a perfect way to relax and escape the hustle and bustle of the city, allow around an hour to stroll through and enjoy the view!\nShow less"], ["Reviewed November 8, 2017", 5.0, "A wonderful place to wander in Venice", "I have been here numerous times and I never get tired of walking these walkways. It is so peaceful, serene and beautiful, compared to the noise and activity along Venice Beach. It can get crowded especially in the summer, so would avoid this time of year or go early in the morning or late afternoon. I'm not sure how the homeowners feel about having hundreds of tourists walk their community, but I love looking at the housing and am envious that they get to live at such a unique place in LA.\nShow less"], ["Reviewed November 6, 2017", 5.0, "Hidden Gem", "You blink and you'll miss them, but a total escape from the crazy LA lifestyle. Gorgeous place to take photos. If you're lucky (like I was) you'll meet some people who live on the canal and get a nice boat ride around this hidden gem."], ["Reviewed October 31, 2017", 4.0, "A wild ride", "From musicians to roller skaters to head shops to Muscle Beach, this is quintessential southern California street life. A melange of sensory experiences."], ["Reviewed October 28, 2017", 5.0, "Hidden gem", "Venice canals is a beautiful place to walk around. Located at the back of the beach along a walkway. It is a quaint peaceful area full of boutique homes overlooking the canals with pretty fauna and bridges. Small boats are moored up to some of the houses which I must say look idyllic. We did encounter a group of security men who had a guy on the floor and who was under arrest for I guess breaking and entering? We diverted our route from a possible crime scene and enjoyed hidden corners and pathways. A lovely place to jog or enjoy a romantic walk. Seems a world away from the buzz of Venice and the beach just a short walk away.\nShow less"], ["Reviewed October 27, 2017", 4.0, "A beautiful walk", "Doesn't have the romance and history of the \"real\" Venice but it is a very appealing part of LA and a lovely walk. A far more interesting part of the town than downtown to enjoy variety."], ["Reviewed October 25, 2017", 5.0, "Beautiful", "The Venice Canals are beautiful. Having been to the real Venice, it is a different vibe than the Canals here but it is still beautiful."], ["Reviewed October 24, 2017", 4.0, "Right From the Movies", "Very eclectic area with numerous types of homes. Quite the high societal place to be. The canals are shallow so none of the boats can have motors. Find a place to park on the main drag to the south of the canals. It’s worth a visit if you’re in the area.\nShow less"], ["Reviewed October 18, 2017", 4.0, "Exciting walk", "Venice Canals Walkway is very nice for a short walk of less one hour. The houses around the Canals are so variously: fancy, luxury, sometimes odd but always in a good shape and renovated with passion and love to details. A very splendide area to live.\nMarcello M. Switzerland\nShow less"], ["Reviewed October 17, 2017", 5.0, "A Beautiful Walk with Friends", "We read about the canals and the community and couldn't wait to do the walk. The houses were incredible and most were beautifully landscaped. Going over the bridges of the canals were fun but it was the quiet walk in these surroundings that made it very special. We didn't see any big tour groups of people. It was pleasant. It's even better when you learn about the history of the canals before you go. It gives you an appreciation of the vision of this planned community. We had the weird and noisy time at Venice Beach boardwalk and finished with this serene walk. Perfect!\nShow less"], ["Reviewed October 16, 2017", 5.0, "An Interesting Area", "It's hard to believe this unique little upscale area is only a few blocks away from bum central (i.e. the boardwalk). This was another bucket list item I wanted to check off this trip. Many of us have seen the canals at least once in some Hollywood movie, and I wanted to check them out to see it is person. It was actually better than advertised IMHO. There is not much to see, and you are better to park and walk the couple of block area so you can see the unique houses along the canal. Plenty of people out walking their dogs and running around the area.\n\nIt only takes you a few minutes of your time, but rewarding if you like that kind of thing.\nShow less"], ["Reviewed October 11, 2017", 5.0, "A hidden treasure", "It is a few blocks of hidden treasure that must be visited. Reading a little of the history behind is good to give you perspective of the idea behind"], ["Reviewed October 11, 2017", 4.0, "An interesting walk", "This gives you an oportunity to view the different architecture and design which vary from old California bungalows to sleek creative modern. The canals create a cool respite from the heat and traffic."], ["Reviewed October 10, 2017", 4.0, "A relaxing escape from a vibrant city.", "Take the time to hike the historic Venice Canals. The area is rich with history, amazing architecture and it's just a great way to relax and feel more connected to the area."], ["Reviewed October 9, 2017", 5.0, "A mini Venice canal system in Venice CA", "A beautiful sight of mini canals in Venice CA. Beautiful place to walk in the evening. Very close to quite side oVenice Beach and close to Venice Board Walk. Coffe at Cow'sEnd, an iconic place in Venice, a must."], ["Reviewed October 5, 2017", 5.0, "Quick drive through", "We did not walk the walkways but did drive through this beautiful neighborhood. It is close to the Venice Boardwalk so a visit is an easy inclusion to your Venice trip"], ["Reviewed October 4, 2017", 5.0, "Historical, unusual, lovely", "The Venice Canals...CALIFORNIA!? It's great right? Wild, right!? I live in Santa Monica and visiting the canals never gets old for me. Abbott Kinney...visionary, perhaps madman? Who knows! But he had passion and vision and just up and built some canals a la Venice Italy! It is charming and fun to visit. Remember to respect the privacy of the people who live here. ;)\nShow less"], ["Reviewed September 28, 2017", 4.0, "Just a nice residential area", "A nice place to visit, go for a walk, quiet, relaxed, interesting to see how some people in LA live. Anyway, it does not remind of Venice at all, it seems like the boats are only a decoration, so if you expect anything that remotely is close to Venice - don't. But it is a nice place anyway.\nShow less"], ["Reviewed September 28, 2017", 4.0, "Fun evening stroll", "Walking down the canals in the evening is very relaxing. The houses are beautiful right on the water and it's very peaceful."], ["Reviewed September 28, 2017", 4.0, "Picturesque area", "This canal is a small one but beautifully maintained, Both side you find wooden houses and calm and quite at most of the time. It will be very nice in the morning . Photographers will love it."], ["Reviewed September 25, 2017", 5.0, "An LA must", "The small man-made Venice canal quarter is an LA must-see. Nice wooden houses, some gardens, a quiet oasis close to crazy Venice Beach, all reminiscent of what used to be a laid back hippy area (now I imagine the number of the price tags on those properties to be quite long). Unfortunately, the draught causes the canals to have a lower water level with not-so-fresh water at times :( Still nice though.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Peeping Allowed", "Just a short walk from the Venice pier (see picture-a great place to view the bay and SM pier) are the famed Venice Canals, a small enclave and remnant of the work of architect, Abbott Kinney. Here you walk among the original cottages and mega-mansions of this unique West LA neighborhood. In addition, you will explore diverse botany and architectural design. Birds are also plentiful so don't wear your dress shoes. Be sure to do some bridge hopping and if someone invites for a small boat ride, take them up in it.\nShow less"], ["Reviewed September 19, 2017", 4.0, "Canals in CA", "We were surprised to find the canals in Venice. If in the area, make sure to find the venice canal neighborhoods. A very beautiful area to walk or bike through."], ["Reviewed September 17, 2017", 5.0, "Go in the morning", "Nice relaxing walk to take few beautiful photos. Located not so far away from Venice Beach. Worth to see."], ["Reviewed September 12, 2017", 5.0, "Venice California Style.", "Having visited the canals in previous visits this time we were able to stay in one of the properties; it was magical. The canals are a tranquil area just a short walk away from the liveliness of Venice Beach and also the shopping opportunities of Abbot Kinsey Blvd. The canals are lined by attractive houses and gardens, the attractive bridges crossing the canals, the colours of the flowers and the palm trees all add to the charm.\nShow less"], ["Reviewed September 9, 2017", 4.0, "Quiet walk in Los Angeles", "A pleasant pocket in LA to get away from the traffic and shopping and tourist traps. If you like to walk and talk this is as good a place as any in this odd neighborhood of bridges and canals. Some nice pictures to be had here on a sunny day.\n\nParking off the canals is a hassle so it's best to try two blocks away near Washington Blvd.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Easy and close walk to the beach", "The canals are a must see if you're headed to the beach at Venice. It's a very fun, relaxing stroll and it's somewhat tucked away so you don't feel any hustle and bustle from the beach crowds. The houses are also very beautiful to walk past and look at.\n\nDon't skip it!\nShow less"], ["Reviewed September 5, 2017", 5.0, "Never knew these existed!!", "This you have to see. Beautiful homes line the canals. It's a residential area which has walkways along the homes and over the canals. The homes are all on top of each other but it's really neat to see their individuality in both décor and landscaping. Its a nice way to pass an hour before you hit the boardwalk\nShow less"], ["Reviewed August 31, 2017", 4.0, "Free parking, easy walk to the beach", "Instead of paying expensive parking fees in venice beach and santa monica beach, best to park in one of the numerous streets near the venice canals and walk to those beaches instead."], ["Reviewed August 25, 2017", 5.0, "A must see/nice stroll", "Very. Ice and beautiful walk. The water is low due to no rain but still beautiful. Lots of colors, flowers, art, clean, interesting."], ["Reviewed August 18, 2017", 5.0, "Strolling in Paradise!", "It is a must see location for my visitors when they visit me in Manhattan Beach. I usually combine this place with the Venice Beach to enjoy a whole day trip and feel so blessed."], ["Reviewed August 17, 2017", 5.0, "Little known gem.", "Found out about this treat by accident. It's really delightful. One interesting sight along the walkway is a home that has about a million different oddities and dolls. You'll laugh yourself silly. The walk around the canals is very pretty. Not sure if they have gondola rides but have heard that they do.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Venice in the States", "Need a Gondola or Gondoliere in Los Angeles? Need a Canale? U got it! Meds Ponte dei Sospiri? Ok, folks, Venice is in Italy. But kitching along the channel in gondola a Los Angeles is funny and shows u how much Americans do believe in our history. They realize they do not have history but they want to know everything about it. So they try to be cosmopolitans. However. And so immerse y'self in a different Venice surrounded by nature and buildings. Close your eyes, open'em up suddenly. What difference does it make if your fantasy's engine is functioning? Enjoy it.\nShow less"], ["Reviewed August 16, 2017", 5.0, "See Venice On The California Coast, WoW, its Special.", "Venice is a special So Cali coastline location, and walking the canal streets is so unique. Enjoy the walk, then head to the pier and walk north along the boardwalk toward Santa Monica. During the summer and fall months it is so amazingly fun and festive.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Fun to do while in Venice", "The canals are indeed a \"hidden gem\" but I wouldn't make a separate trip just for this. It's a nice walk and house-gazing is very fun, but that's about it. Pro tip: The water is public property so you can drop a paddle board in there and enjoy the water!\nShow less"], ["Reviewed August 16, 2017", 4.0, "Worth walking around", "This is a curious place but definitely worth come to. My first sweep through here was by a car driving up Bell street & looking. After that I found a park and walked through. It is quite amazing what has been created here & that it has been (in part) maintained.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Best kept \"secret\" in Venice", "Walking distance from Venice's famous Muscle Beach, this lovely setting is stunning and relaxing. Beautiful!!"], ["Reviewed August 15, 2017", 3.0, "Nice walk, small canals in Venice, CA", "If you want to walk, bike, or drive to see Venice canals east of Los Angeles, CA, this is your place. The canals are small with cute little bridges and roads. Worth a drive thru if you have time while in Venice Beach, CA."], ["Reviewed August 14, 2017", 4.0, "A place of peace and calm", "Venice Beach is manic so no better place to get away from it. The walkways provide lovely views of the canals and a good chance to be nosy and look into homes along the way."], ["Reviewed August 12, 2017", 5.0, "Beautiful walk", "We happened to stumble upon this beautiful location and decided to take the walk in the neighborhood. A Very cute area with lots of interesting houses. Great way to spend the afternoon!"], ["Reviewed August 10, 2017", 5.0, "A tranquil delight", "After spending a busy day cycling through Venice and Santa Monica it was lovely to return our bikes and spend a while walking around the beautiful canals. It was peaceful as we enjoyed the little bridges and beautiful homes and gardens. I am so pleased that we took the time to enjoy this area.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Refuge from the busy Venice Beach", "Venice Beach is a super crowded and at times, overbearing place. The canals promise nice views, shade, and few people. It's a nice walk with beautiful houses and bridges. It's a must see."], ["Reviewed August 9, 2017", 4.0, "Not THE Venice", "Subdivided in the early 20th century, originally small single family houses on a half dozen canals, with a central business agora behind the beach. Now pricey residential. Sidewalks along the canals in front of the homes and over the bridges allow visitors to dream about their waterside dwellings. Anyone can paddle through.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Not enough time", "Sadly we had to time to walk 30' enjoying the houses and views of the channels. But we enjoy the little time we had. Take more time please!!"], ["Reviewed August 7, 2017", 5.0, "Venice Canal: Awesome stroll (TIP/ADVICE for visiting)", "Great place to stroll, take a leisurely walk. We went here before the beach and strolled the 5 canals. They aren't long, but it's nice to see the houses along the canals. Some are old school, some are more modern. Nice colors. They do have security patrolling it so you feel safe (rest of town has an issue with homeless people).\n\nTIP: These are all homes, it's not a place to shop or eat if that's what you were intending.\nShow less"], ["Reviewed August 6, 2017", 5.0, "Beautiful afternoon stroll", "Visiting LA with the family, we made it a point to see the canal walk and the unique houses that are there. I LOVED it. Everything about it is so charming and the area is actually quiet. The houses were amazing and the bridges gave you wonderful photo opportunities. The teenagers in our group were not as impressed...I don't think they appreciated how unique it was. They went along with me and posed for some pictures but I think the adults liked it more. It's a hidden gem and I would visit again for sure!!!\nShow less"], ["Reviewed August 6, 2017", 4.0, "Away from the hustle and bustle of the ocean front", "Scenic and very different from the highlife of the boardwalk, but very small. It's worth the detour. We walked there in the morning with its water reflecting the colors of the gardens and the houses it was romantic."], ["Reviewed August 5, 2017", 5.0, "Best Kept Secret", "I am amazed at how many people do NOT know about this hidden treasure in LA, walking distance to the Venice boardwalk, pier and beach. There are no hotels on the canals, just multi-million dollar homes with small canoes and kayaks attached which no one seems to use. You will not be disappointed if you find an Airbnb, like I did, to stay in - worth the extra $. You can walk over foot bridges that connect the 3 islands. You can easily also walk to Washington Blvd. and Pacific Ave. for shops and restaurants. I used Uber/Lyft for the first time on this trip and got everywhere from the canals usually for under $6. There is plenty of bustling, crowded activity in LA, Santa Monica, Marina del Rey - why not have your peaceful, beautiful place to go back to. If you stay somewhere else, make sure to at least pay a visit to the Venice Canals. You will temporarily feel like you are in Europe.\nShow less"], ["Reviewed July 29, 2017", 5.0, "very nice quiet area in Venice", "Lovely place to take a short walk. Park the car north of the canals and walk to the beach. Super trendy area and very different from everything else in the city."], ["Reviewed July 29, 2017", 5.0, "Tourist visit", "What a beautiful little oasis ! Reminiscent of certain areas of the Thames , London only far prettier.\n\nWe managed to park in an adjacent side street (be careful of residents only parking areas) and walk the short distance to the canals.\n\nAs we went on a Friday mid afternoon it was very quiet and peaceful. Spent about an hour here.\n\nShow less"], ["Reviewed July 28, 2017", 5.0, "Beautiful place to take a stroll.", "Tucked away from the madness of Venus Beach and Santa Monica is the Venus Canals Walkway. Gorgeous little houses with beautiful gardens face onto these man-made canals. Picturesque bridges span the canals and colourful canoes and rowboats line the edge of the waterway ready for high tide to return. must see.\nShow less"], ["Reviewed July 28, 2017", 5.0, "Great photo spot", "We stayed in Marina Del Rey and used the Canals to walk thru on our way to Venice Beach. Very fun to see the different types of homes/architecture and watch boats and ducks in the water. Got some great photo backdrops!"], ["Reviewed July 26, 2017", 4.0, "Enjoy a quaint walk on the canal to brighten your day.", "Few settings have appeared in movies more often than the Venice canals. Of course, there's a reason -- it's absolutely beautiful. High tide is the best time to stroll, for it can get a little pungent at low tide, but the reflections from colorful boats and homes beacon you.\nShow less"], ["Reviewed July 25, 2017", 5.0, "A Must See!", "Beautiful landscaped walkways. Takes you back in time. A nice little stroll through the canals is a necessary!"], ["Reviewed July 25, 2017", 4.0, "Very nice", "Lovely area. Not sure why they drain the water from the canals on a Monday. What about those of us who are not just weekend visitors."], ["Reviewed July 24, 2017", 5.0, "Very beautiful", "The Venice canals are beautiful. It's a very peaceful place to visit. We have rented bikes and ridden there on previous visits, but the walk was lovely."], ["Reviewed July 23, 2017", 5.0, "The loveliest place ...", "... to wander and see how the other half live (in our case!). The houses are spectacular and views are incredible. The people are super nice too, we chatted to loads and were offered some champagne by some residents whilst wandering along the canals. It's so beautiful and appears to be a bit of a hidden gem. It's nice and quiet as well, should you want a break from the busy streets.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Lovely for walking", "This part of Los Angeles is peaceful (usually) and very scenic. Bikes are often part of the scene, so bring one or be careful if walking!"], ["Reviewed July 21, 2017", 5.0, "Nice Short Stroll", "We just were trying to buy some time before our next event and we took a Lyft over to walk as it was close to our hotel. Just a nice place to see and something free to do. If you like the beauty of nature, water, walking and architecture then this walk is for you. Intimate and be mindful this is persons residents so be respectful. A must see for lovers of the things mentioned above.\nShow less"], ["Reviewed July 19, 2017", 4.0, "Couples Getaway", "its a really nice place with ducks and a few other birds,flowers occasionaly in the spring but in the summer this canal can have a slight odor. great walk though for couples and just a get away. no gurantee you will have it all to yourself though. so come early or late in the evening.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Interesting area for a relaxing walk", "The Canals near Venice Beach are unusual - it's a number of homes built on canals, with most having a dock to the canal. The \"Walkway\" is mostly a sidewalk in front of each home, with the occasional bridge to get over the canal and onto the next.\n\nIt's flat walking (except for the tiny bridges), and interesting to look at the houses the that surround the area. Fun as a diversion.\nShow less"], ["Reviewed July 14, 2017", 4.0, "Beautiful place", "This is a lovely residential area. However, don't think of living there unless you have lots of money. Real estate is very pricey. Still, a beautiful place to pass some time."], ["Reviewed July 13, 2017", 5.0, "Unexpected LA history", "Saw this on LA in a day bik trip Did not expect to see this but explains Venice beach and interesting LA history"], ["Reviewed July 13, 2017", 5.0, "Very surprised", "Happened on this area more by chance but we were very pleasantly surprised with the whole area. Lovely place to stroll and enjoy the many varied houses and quiet. Highly recommend."], ["Reviewed July 13, 2017", 4.0, "Interesting History of Venice", "Our grandsons (14 & 17) wanted to see the sights of Venice Beach so we included walking the canals. One of our grandsons is interested in architecture, so this was of particular interest to him. Our July 4th outing was crowded on the beach, but walking the sidewalks along the canals was peaceful with few tourists. There is quite a variety of architectural styles of all ages of homes. The boys liked picking their favorites and taking pictures of them. On one of the bridges over a canal, we got a great family picture taken by a volunteer tourist. While this was not an exciting adventure, we all enjoyed the change of pace from the beach and were glad that we took the time to see a different part of Los Angeles.\nShow less"], ["Reviewed July 10, 2017", 5.0, "I love Venezia", "Spent 2 days in Venice while waiting for a Cruise. Loved every moment. No traffic. Quiet friendly and romantic. Winding narrow cobblestone streets throughout. Food and drinks at nearly every corner. Lots of history. Very charming. One of my faves in Europe."], ["Reviewed July 10, 2017", 5.0, "Canals in the middle of the city", "The canals of Venice are one block off a main street(Washington Blvd) but are probably unknown to most people driving by. You walk by lovely home fronting on the canal...it is a lovely walk and is, of course, free."], ["Reviewed July 9, 2017", 5.0, "Amazing Sights!", "These beautiful canals are located in Venice (not too far from the boardwalk). The canals are surrounded by small paths that you can walk along and take in the beautiful sights of the canals and houses. Great for photos. Allow 1 - 2 hours max."], ["Reviewed July 9, 2017", 5.0, "Vacation with friends", "This place was very cool to see. The water ways are beautiful and nicely kept. The people that live on these homes have some nice scenery to look at outside their back doors. It's worth seeing if your in the area, take a nice quiet stroll.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Small, lovely", "As the Abbot Kinney has the character, the neighboring canals do too. It is a fairly small area, yet it is lovely, cozy and is worth a D-tour if you are in the area."], ["Reviewed July 6, 2017", 5.0, "My favorite place in Venice", "This is a must. Believe it or not, there are Angelinos who don't know this place exist. It's tucked in the middle of Venice. Worth going for a little stroll any day of the week. It feels like you are in a completely different city, not LA at all. Absolutely love it.\nShow less"], ["Reviewed July 6, 2017", 5.0, "A must. A good walk.", "One of the great things to do whether you are a local or a tourist. There's nothing like them except in a big, big way in the real venice, Italy."], ["Reviewed July 4, 2017", 5.0, "A breathe of fresh air", "Hard to believe it is a short walk from the vibrant hustle & bustle of the boardwalk. Very enjoyable stroll, some may say romantic but definitely worth seeing. And it's free!!!"], ["Reviewed July 4, 2017", 5.0, "Afternoon Walking Visit", "We walked through the canals on our way from Abbot Kinney back to the boardwalk. Very cool atmosphere in the middle of Venice, transforms you a little. Lots of unique houses, nice photo ops from the different bridges."], ["Reviewed July 4, 2017", 5.0, "The most stunning place in LA, period.", "If you are in LA, make the effort to go to Venice and check out the canals. It's like another world, nothing else in LA, heck, probably the US compares to this little bit of paradise. The houses are all beautiful, and the perfect canals that wind around are just breathtaking.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Beautiful Homes", "It is definitely worth walking to see the beautiful homes on the Venice Canals!!! The homes are so beautiful and unique! The manicured lawns are so spectacular!!"], ["Reviewed July 3, 2017", 5.0, "Venice: The Residential Side", "Enter of the Washington Blvd side for better parking and get lost in this wonderful maze of houses. Some people will even be on their back porches to say hello."], ["Reviewed July 1, 2017", 5.0, "One of the beautiful attractions in LA area - free!", "I've been coming to LA on business and vacation for decades and never knew this was here, until a few weeks ago I saw this on TA. So we headed there straight from arrival at LAX. It's totally amazing, The houses and yards are simply beautiful, there's always something new and surprising around every corner. Best place to park is off Pacific at Venice Bl., $10 flat rate. Well worth it!\nShow less"], ["Reviewed June 27, 2017", 4.0, "\"Senic Walkway\"", "Great for taking a nice walk and enjoying the Venice area. The house's have great designs and scenic views. We viewed several boats sitting in the canal. This area is very nice."], ["Reviewed June 27, 2017", 4.0, "Beautiful, quiet walk in the heart of Venice!", "Charming walk, right in the heart of otherwise 'eclectic' Venice! There are beautiful and varied homes here - modern, Spanish, cottage, traditional - and the gardens and flowers are gorgeous. Several walkways and bridges to meander around - worth it while in Venice!"], ["Reviewed June 26, 2017", 5.0, "Venice Canals - hidden gem", "My hubby and I went for a lovely walk along the Venice canals. The homes are just lovely and some of the gardens are quite beautiful. It would be lovely to sit in the yard and just watch the world go by... the canals are also very quiet, and it is a nice escape from the hustle and bustle of Venice Beach.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Canals in LA", "I, for one, did not know that the California Venice had canals similar to those of the city in Italy. There are many charming and sometimes quirky homes among the many canals to be explored. An interesting interlude after the hustle and bustle of downtown LA.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Pleasant lifestyle, away from the boardwalk", "I saw maps of the canals (after all, this is why it's named Venice!) and owner's boats, so I had to check it out. Some very beautiful houses, but not in a grand way. Very modest, yet of course Venice is a high end living area. Seemed like people left their doors open, and it was a relaxed and beautiful stroll through a different time period and shift away from LA. This is prime LA LA Land!\nShow less"], ["Reviewed June 23, 2017", 5.0, "A peaceful oasis in Venice Beach", "Its a lovely walk around the canals walking past all the different style of houses, all with charming gardens. Its quite a large area, with little bridges from street to street."], ["Reviewed June 21, 2017", 5.0, "Come here", "What a lovely peaceful little place away from the hustle and bustle. Amazing place to just walk and take in the scenery."], ["Reviewed June 17, 2017", 4.0, "Worthwhile a stroll", "Coming from Europe and knowing the real Venice in Italy, it was kind of 'weird' to discover this Venice.\nBut the idea of wanting to copy the real Venice is quite amazing and I found it attractive enough to take a walk over there.\nThere are some nice spots, bridges and colourful houses.\nSo going there for a walk and 'play the tourist', as part of a larger visit of the region, Santa Monica, the Eames Foundation, some Frank Gehry buildings in the area, etc is quite ok.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Surprised and delighted by this charming enclave", "Reeling from a tourist-induced anxiety-ridden afternoon, I was delighted by the Venice Canals Walkway. The charming enclave is Venice's gem, second only to the ocean itself. A must see for any visitor, particularly those who enjoy the wide variety of plants and architecture the area has to offer. Accessible on Dell road, there are eight parking spaces at the end of the street where Dell meets Venice Boulevard. Get out and walk - you'll be glad you did!\nShow less"], ["Reviewed June 15, 2017", 5.0, "Charming and Really Neat", "Walked through as a shortcut, tide was out, was fun watching the birds, every house is different in its own way and the floral scenery is amazing. Went through again, went over bridges and walked most of it, tide was in this time, just adds that extra charm. watch out for the hippo ! (its only a paddle boat, but too funny)\nShow less"], ["Reviewed June 14, 2017", 4.0, "Combine with beach trip and other attractions", "Very cute and hidden. You'll love the ducks. Won't take long so do combine with a Marina Del Rey/Venice beach/Abbot Kinney Blvd. trip."], ["Reviewed June 10, 2017", 5.0, "Gorgeous Gem", "Pleasantly surprised to find this gorgeous gem around the corner from Venice Beach (which was unimpressive). Take a stroll and checkout the quaint homes and peacefulness of the area. Very cute!"], ["Reviewed June 9, 2017", 5.0, "Venice", "Really pretty area. Worth a drive through when visiting Venice. Sweet house which oberlook the short canals."], ["Reviewed June 8, 2017", 4.0, "A Beautiful Area To Walk Around!", "While at Venice Beach, walk a little farther to the Venice Canal Walkways.... May be hard for some to walk the area, because to get to them, there are some hills and rocky areas. It is a very pretty area and nice for picture taking."], ["Reviewed June 8, 2017", 3.0, "Not worth it", "If you are in the area and it's extremely convenient then check it out. Otherwise don't bother. Basically home after home on the canal but nothing special about the experience."], ["Reviewed June 7, 2017", 4.0, "Beautiful houses between the canals", "You can take a walk through these canals and see the beautiful houses that overlook them. Some are luxury homes, others are small properties, but the place is perfect for staying in a quiet place far from chaos. If you are lucky some owners may invite you to the house\nShow less"], ["Reviewed June 5, 2017", 4.0, "Wonderful neighborhood", "Such a cool area inside another unique area. Located a couple blocks from the ocean is the 'canals' neighborhood. A wonderful walk over little bridges, by beautiful gardens and unique homes."], ["Reviewed June 4, 2017", 4.0, "Pleasant Walk", "Walking the Venice Canals is generally a pleasant experience. It's a treasure in Venice Beach area that can be easy to miss. The fun part is observing the different architecture of the homes."], ["Reviewed June 4, 2017", 5.0, "fun leisurely walk", "the houses are beautiful, and when he tide is in the canals are full of ducks and other birds. good for any age."], ["Reviewed June 1, 2017", 5.0, "Amazing hidden treasure", "This place was on my list of things to do when visiting Los Angeles, from London, I absolutely loved Venice Canals. It was so much more than what I expected. Authentic, stylish charismatic houses with a canal view It was beautiful. It is a well-hidden spot that allows you to walk for a nice quiet walk and just take in the amazing experience. We brought our bikes expecting to be able to ride along the canal, but unfortunately, it was a little too narrow, but that didn't matter as the place was too mind blowing to even care. I will definitely be visiting again. I love LA but it definitely didn't feel like I was in LA here. That is the good thing about LA you get the best of both worlds.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Hidden gem", "A hidden gem at Venice, very beautiful and relaxing place at heart of Venice, LA. Enjoy narrow paths, no crowds, nice atmosphere."], ["Reviewed May 29, 2017", 4.0, "Peaceful walk", "It is nice to get away from the crowds and craziness of the boardwalk and walk along the peaceful canals. The views are lovely."], ["Reviewed May 26, 2017", 4.0, "An amazing little gem in Venice", "The canals are downright gorgeous! If you're looking to get away from the crowds of Venice right by the ocean, then this is a nice little stroll where it's much quieter. You'll probably spend 20-30 minutes walking around and enjoying the scenery—it really is just waterways and people's homes—but a cool spot to check out.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Not to be missed.", "Stumbled upon these canals without ever hearing about them, and so glad I did. So very charming, it will put a smile on your face. Beautifully quaint homes and lush landscapes."], ["Reviewed May 22, 2017", 5.0, "A relaxing stroll through the quieter side of Venice", "If you've walked the bustling boardwalk in Venice and you're ready to see the softer side, head to the canal walkway. There is a variety of water fowl, beautiful flower gardens and stunning architecture along the way. Take your time with a coffee and enjoy the stroll!\nShow less"], ["Reviewed May 17, 2017", 5.0, "what a surprise!", "I was totally taken aback to discover how the Venetian canals had been used as a marketing and city planning device for the new real estate developed into Venoice. CA. What a sotry. They are delightful to visit. just fun!"], ["Reviewed May 11, 2017", 4.0, "Really nice antidote to the hustle and bustle of the beach", "The locals have managed to protect the remaining waterways from development as a marina. They're slow regenerating the vegetation and theres lots of birds visiting now. The house are lovely, well kept with nice small gardens and there are a number of park like alley ways between rows of houses to explore.\nShow less"], ["Reviewed May 10, 2017", 3.0, "Not As Great As Pictures Make It Out to Be", "The Venice Canals Walkway was very small and smelled pretty terrible. If you need something to do and want to walk around a bit, then this is a good option. I just wouldn't recommend planning a day around this attraction as it was a little underwhelming.\nShow less"], ["Reviewed May 9, 2017", 3.0, "Nice shaded walk path", "Over rated. If you are going to walk through here, remember to go when the water is up or you will be looking at a dry ditch. Just a sidewalk behind homes, nothing special."], ["Reviewed May 9, 2017", 5.0, "Lovely!", "Very nice walk along the pathways and over bridges. Lovely homes. Reminiscent of Venice, Italy though the architecture couldn't be more different."], ["Reviewed May 6, 2017", 5.0, "A nice walk among the canals", "The Venice canals based on Venice, Italy is a nice walk. There are 8 canals left but it's so nice to see the architecture of the houses, the plants and the vibe."], ["Reviewed May 3, 2017", 5.0, "Stunning hidden gem", "One of the highlights of my tour in Los Angeles. Truly stunning place and not at all busy. Great photo opportunity."], ["Reviewed May 3, 2017", 5.0, "Nice and relaxing!", "Venice Canals is right in the middle of the city, yet the vibe is very quiet and laid back. I love strolling along the various canals on a hot summer night, there's nothing like it! The homes are very nice and it's a great spot to come and chill for the evening. There's restaurants nearby in easy walking distance and I usually park on one of the side streets.\nShow less"], ["Reviewed May 2, 2017", 4.0, "Little Venice in USA", "so these canals spans a couple of blocks and has its own charm to it. A nice place to have a soothing walk across the canals where people have their own private yards and kayaks to go for. A hidden place right behind the Venice beach and crowded roads but once you enter the canals, all the noise, traffic is kicked out.\nShow less"], ["Reviewed April 30, 2017", 5.0, "Amazing!!!", "A must see. This is a quiet magical walk. Just inspiring for a relaxing walk watching birds and flowers. This is like an enchanted place."], ["Reviewed April 30, 2017", 4.0, "Little Venice in Venice", "Not as nice as the real Italian Venice, but still nice to see those canals in Californian Venice. Just walk around and enjoy!"], ["Reviewed April 30, 2017", 5.0, "Beautiful and somewhat hidden gem in Venice Beach", "The Venice Beach Canals span for just a few blocks, so you might not even see them if you don't locate them in a map in advance. But we made a point on stopping there first before we even headed out to the beach, as we were so eager to find and photograph that gem in this neighborhood. The paths around the canals are narrow, but we saw folks in bikes, however walking is much more pleasant. I was surprised to see how close you get to people's homes and even have an insight on interior decor going on in the area. The landscape is full of trees and flowers, which conveys completely different feel from the beach boardwalk. Definitely a great spot for pictures and lasting memories.\nShow less"], ["Reviewed April 29, 2017", 5.0, "Different side of Venice", "Perfect for a romantic walk, relaxing and I love the different feel that you get from here. It doesn't feel like you're in Venice:) I highly recommend it."], ["Reviewed April 28, 2017", 5.0, "Beautiful for pictures", "this place is really beautiful for pictures, if you are going to Venice you should stop by and take some shots in this area for sure"], ["Reviewed April 27, 2017", 4.0, "Beautiful area!", "This is a beautiful area, very different from the rest of Venice. I would recommend to walk or drive through here and look at the beautiful houses and the beautiful bridges over the canal. Also a few scenes from \"Californication\" was shot here, which is just a fun face. Go here if you're in Venice, you will love the views.\nShow less"], ["Reviewed April 24, 2017", 3.0, "There's not really much to see.", "The canals are hidden amongest a quite suburb and can be viewed from the many little bridges criss-crossing over the canals for the access of traffic. There's not really much to see, something different I guess, but hard to get parking to be able to hop out and go for a walk around.\nShow less"], ["Reviewed April 20, 2017", 4.0, "Lovely", "A lovely place to check out, stroll around, take in the sight and end with a nice glass of wine near the beach!"], ["Reviewed April 19, 2017", 5.0, "Just spectacular - a must see", "This beautiful area makes you dream of living there. The canals are picture perfect and the homes are breathtaking."], ["Reviewed April 18, 2017", 5.0, "The best of LA", "You don't get to experience LA if you don't visits the canals. The architecture, the vibe - it's whimsical <3"], ["Reviewed April 18, 2017", 5.0, "Fun stroll", "We rented a house in Venice and walking the canals was a fun stroll admiring the million dollar houses!"], ["Reviewed April 17, 2017", 5.0, "Strolling the canals", "Lovely walkways and bridges allow you to meander around the neighborhood. Walk slowly and check out all the well kept gardens, particularly the succulents. An eclectic array of architecture adds to the character. It was a nice quiet refuge from the business of the beach. It is a residential area so shhhh and retain the serenity for visitors and residents alike.\nShow less"], ["Reviewed April 17, 2017", 4.0, "Worth the stroll", "A friend told me to venture over to explore this neighborhood when visiting Venice Beach. The walk wasn't too far, and my teenage daughter and I were happy we had made the effort to see this unique little area."], ["Reviewed April 17, 2017", 5.0, "Wow", "Went after breakfast so it was so peaceful - these are a delight .Oh to own one of those houses! Abbott Kinney is a short stroll so head for a cool coffee, a really fab place in Venice to eat"], ["Reviewed April 15, 2017", 5.0, "Lots of interesting buildings alongthe canals", "A short distance from the noice and loud music along the Venice beach, this is a wonderful sidestep that cannot be missed."], ["Reviewed April 13, 2017", 5.0, "So Peaceful!", "It's hard to believe that just a short walk from the colour and noise of Venice Beach is this peaceful gem. How lucky are people to live here! We walked along some of the canals and over the quaint bridges, soaking in the quiet atmosphere. It's definitely worth stepping away from the beach to visit this stunning location.\nShow less"], ["Reviewed April 12, 2017", 3.0, "OK walking tour of overpriced homes on the canals", "Some of the homes you walk past are cute and eclectic, but most are new out-of-proportion tear-down remodels squeezed onto these tiny lots. The canals can be more mud than water, depending on the tide. I'd rather walk along the ocean at Venice Beach."], ["Reviewed April 10, 2017", 4.0, "a pleasant escape from Venice Beach", "just a few blocks from the beach, this is a pleasant quiet diversion from the madness of Venice. The houses are beautiful and unique, and the neighbors are nice as long as you repect their property and privacy. Worth the walk."], ["Reviewed April 10, 2017", 4.0, "Felt really peaceful", "After walking on the city center for a couple of hours it felt lile heaven. Is really peaceful and pretty, like a haven. If you have a bit of spare time i would advise to go to st monica and then pass by."], ["Reviewed April 6, 2017", 4.0, "Nice place for a walk!", "If you happen to be in Venice and have some spare time, it's worth a visit for a walk! it has nice views and it was also where some of the scenes of 'californication' series were filmed :)\n\n(Check out my intagram for my travel photos!:) IG: anamafalda8 )\nShow less"], ["Reviewed April 6, 2017", 5.0, "Great place to wander round", "This is a great little area to take in for an hour or two. There is a very interesting mix of houses and it's just so peaceful, considering it's proximity to the madness that is Venice Beach."], ["Reviewed April 3, 2017", 4.0, "Nice route for your leisurely walk", "Enjoy a stroll through the canals on the west side. Will provide an interesting look at LA history and some interesting architecture viewing the houses on your stroll. Well worth the effort finding it and getting a parking spot near the entry point. Weekdays re probably better.\nShow less"], ["Reviewed April 2, 2017", 5.0, "Lovely stroll through an eclectic area", "This is worth a walk through. Thought the canal was mostly sludge when we were there, the eclectic homes and decor were enchanting."], ["Reviewed March 31, 2017", 5.0, "Feels Like Miles from the Madness", "Just blocks from the madness of Venice beach & boardwalk is what's left of the original canals built by Abbot Kinney in an attempt to recreate the canals of Venice, Italy.\nIt's rarely that crowded but if you go at the right time, you can enjoy a quiet stroll along the canals and pass no more than a handful of people the entire time.\nDefinitely worth checking out if you're visiting the Venice/Marina del Rey area.\nShow less"], ["Reviewed March 30, 2017", 4.0, "Glad we made time to see this", "All three days we were in Venice Beach were very foggy so we didn't get to enjoy the beach and instead headed inland. Because of this, we almost didn't stop by the Venice Canals. I'm glad we did on our last evening. It was just nice to walk through all the beautiful houses and see the different architecture and design choices. It was a very relaxing way to end our trip.\nShow less"], ["Reviewed March 29, 2017", 5.0, "cute and a little kooky", "eclectic character and charming mix of architectural and garden styles make this a fun place to wander around"], ["Reviewed March 29, 2017", 5.0, "Charming hidden gem.", "Lots of people don't know there are canals in Venice. I lived in LA 10 years before I discovered them. They are so charming to walk through. You can explore for 30 mins and be satisfied with the cute yards, attractive homes and back yards and occasional wildlife spotting.\nShow less"], ["Reviewed March 29, 2017", 5.0, "A Hidden Surprise in LA", "Despite its name, it really was a surprise to discover blocks of diverse houses along canals right in LA. The lack of master planning has led to a wildly broad range of homes and landscaping, all linked by paths and arched bridges. Strolling along the pedestrian paths near homes is a relaxing, architectural treat, especially at quieter hours of the day.\n\nAs someone else said, it might not merit a special trip, but if you are in the vicinity, it is well worth exploring.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Romantic walk at sunset.", "This is one of my MUST do's in Los Angeles. Walk the canals! It is simple and it is free and it is beautiful. What a place to live and relax. A maze of clans and small bridges. This is a selfie stick dream! Truly an LA original and something I recommend to out of town guests!.\nShow less"], ["Reviewed March 26, 2017", 5.0, "One of the prettiest neighbourhoods I've EVER seen!", "Simply stunning! The variety of architecture is amazing, the houses all nestle along the canals harmoniously. The streets and water are really clean & it's a lovely way to spend a relaxing half hour wandering over the bridges and around the neighbourhood. Lots of fab photo opportunities.\nShow less"], ["Reviewed March 22, 2017", 4.0, "Photogenic", "This is a beautiful spot to check out if you're in the Venice Beach area. I wouldn't necessarily say it's worth a special trip if you're coming from outside the Venice area.\n\nWe found the eastern edge of the canals (furthest away from the ocean) to be the most beautiful area. Our vacation rental was just two blocks away from this place, so it was a convenient site to see.\n\nWalking over the bridges reminded me of many scenes from Californication!\nShow less"], ["Reviewed March 20, 2017", 4.0, "Beautiful walk", "Beautiful walk down the Venice canals. Great view of the small and unique California houses. Perfect for a romantic stroll down the canals or a whole family just wanting to see a different part of LA."], ["Reviewed March 18, 2017", 5.0, "One of my fav's in LA area", "It is just so weird and cool to find this neighborhood and wander around it, checking out fun and funky architercture before hitting the beach for ice cream. So glad I stumbled on it!"], ["Reviewed March 16, 2017", 4.0, "Peaceful and beautiful", "My daughter and I rented bicylces to ride down a very busy bike path from Santa Monica Pier. We found the Canals and walked our bikes through many of the paths. It was a bit difficult with bikes. We maybe should have got a chain and locked them up and just walked around without them.\nShow less"], ["Reviewed March 15, 2017", 5.0, "Beautiful", "These canals are beautiful. It's very quiet where you can see ducks and beautiful houses along the way. Almost all of the houses have a boat and it's just a beautiful very unexpected place for a city as busy and loud as LA.\n\nIf you're looking for somewhere romantic for a date or wedding or engagement pictures, this would be the place to go.\nShow less"]]}}