{"Vernal Fall": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Vernal Fall", "url": "/Attraction_Review-g61000-d483481-Reviews-Vernal_Fall-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/23/94/31/vernal-falls.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1214"}, "address": {"@type": "PostalAddress", "streetAddress": "Vernal Falls Trail", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Very strenuous but worth it", "Below average fitness level but we did it to 3/4 of the way to the top! Round trip with selfies and breaks was 4 hours. Lots of wonderful trees and views of El Capitan and Vernal Falls. It was not misty in February and Om glad it wasn’t. The steps are very challenging dry, I cannot imagine hiking them when they are wet.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great hike, with great cardio involved ...", "I have seen Vernal Falls twice. Once in Winter and once this past Fall.\n\nIt was definitely more frequented in my last trip than the first time I hiked to it.\n\nLets start with my first time hiking to Vernal falls. The first time we trekked to the falls it was Winter or the end of December . We couldn't hike through the shortcut/ steps leading to the fall as it was chained off, for possible icy conditions. So we took the John Muir trail. It consisted of many switchback and keep in mind you are constantly gaining elevation. So after an hourand a half to two hours I believe we made it to where we could spot Nevada from a distance and had to walk down to see Vernal at the bottom. There were not many people on the trail . It was very peaceful. And a very pleasant experience overall.\n\nI tried hiking it in the middle of winter a year after my first vist, but that was an epic fail since the trail was super icy and I didn't have any proper footwear.So we aborted the mission.\n\nLast year we decided to hike to Vernal again, this time there were many people present. Too much for my liking. It was hot. The good thing was that mist trail was indeed open. Don't underestimate those steps. Even though its a shortcut to Vernal you will definitely break a sweat lol. The falls were beautiful , there was a rainbow present and it was awesome sitting and getting some shade after the exhausting steps.\n\nYou definitely get different experiences in different seasons. But winter time is by far my favorite time to visit Yosemite. It is a winter wonderland. I wouldnt bother visiting in summer, too many people and horrid traffic. Can't stand that so I go in the slower months. :)\nShow less"], ["Reviewed January 14, 2018", 5.0, "Best waterfall hike in the USA", "The best waterfall hike in the USA. The falls are pretty shocking, and the trip up is ultra-challenging. But the trail is PERFECT. It’s either paved or stepped the whole way up. The views are stunning all the way from the bus stop to the falls.\nAdvice: Don’t take photos on the way up. Wait until the trip down.\nI’m 53 and in relatively decent shape. I made the round trip from Bus Stop to Vernal Falls in about 2 hours.\nShow less"], ["Reviewed January 9, 2018", 5.0, "Great hike and amazing view", "Not very long and not very difficult hike for the amazing view of waterfall. Very mystic and also photogenic cause it is covered up by the rainbow."], ["Reviewed January 6, 2018", 4.0, "A good short walk for those with limited time", "We only had one day at Yosemite and, being more into fatness than fitness, we were never going to do anything too strenuous.\nThe hike to the Vernal Falls bridge is short but never-the-less steep enough to make it an effort for those of us who aren't in peak condition. There were plenty of others stopping to rest along the way and even some with strollers. We were pleased to make it to the bridge before heading back down.\nShow less"], ["Reviewed December 26, 2017", 4.0, "Very popular , leave early for less crowds", "This is maybe the most popular trail in the park. It is perfect for a 3 hour time frame. In summer it's misty from all the water flows but fall and winter it slows down and it beautiful with icy rims and frosty traces all around the water. The trail follows a river as it leads to the falls. The first main point is the bridge where you see the falls.another hour or so takes you up fairly steep stone steps to the top of the falls.You can continue on to Nevada falls or turn back.I'd call this a moderate to strenuous hike.It's quite beautiful and much easier than the trail to Columbia rock on the Yosemite Falls trail.\nShow less"], ["Reviewed December 26, 2017", 5.0, "Stunning waterfall", "It is a spectacular spot with amazing views. The hike itself is not extremely long but even then challenging. In the beginning it is quite steep and it is going uphill and downhill. There is a fantastic view on the wooden bridge to Vernal Fall. Near the bridge are also a water refill station and a restroom.\nOn the second part of the trail there are many steps to climb. The steps are uneven, sometimes quite high and there handrails if necessary. It can also be misty and that makes the trail slippery. There were a lot of people going up and coming down. Give the hikers who walk downhill the way. The view to Vernal Fall is on the whole trail wonderful and there are also squirrels to see. It was a great feeling to see the Vernal Fall and we had the luck to see it with an awesome rainbow. The end of September the water level was still quite high. On the top are nice spots for lunch break.\nMost guys walk back the same way and use the narrow steps. We have chosen the john muir trail back to the Yosemite Valley. It is a bit longer but easier to walk and better for the knees. The whole hike is about 4 hours and it definitely a nice one. For this hike you need sturdy shoes and clothes for warm and cold weather condition and plenty of water.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Not for those out of shape!", "We only had a short amount of time allotted to spend at Yosemite during our California road trip, so asked around the night before at out hotel about some good day hikes. The most common recommendation was Mist Trail to Vernal Falls. The trail is mostly paved, the 0.8miles from the Trail head is strenuous uphill climbing, you're calves will be on fire! You will reach a bridge about half way up to the falls and be able to capture some great pictures. If you are strapped for time or tires, no shame in turning back at this point. We continued about 3/4 of the way up to the top of the Falls but turned back because the sun was going down and we had about an hour hike back to our car. The second part of the trail is rocky stairs carved into the mountain side. We got some beautiful views of the Vernal Falls and a nice workout! (Plan to spend a minimum of 4 hours on the hike if you go all of the way to the top. If you make it to the top- you can hike a short way further to see Nevada Falls too!)-\nShow less"], ["Reviewed November 30, 2017", 5.0, "Mist trail", "excellent trail. very steep. prepare your knees. and very rewarding. we went on Fall, so water volume was low. Not impressive waterfall but very impressive surroundings and pleasant rest area up there"], ["Reviewed November 21, 2017", 4.0, "Hiked November, only to bridge", "I was trying to find pictures of what the waterfalls would look like in November before our trip and couldn't find any, so I have one to post. There was very little water coming over the fall. The hike is marked as moderate, but you should know that it is uphill most of the way to the bridge. This could be hard for some not used to the uphill climb. November is a beautiful time to be hiking as the weather was perfect. Beautiful views everywhere.\nShow less"], ["Reviewed November 17, 2017", 5.0, "awesome", "very beautiful view. you can go little close to this falls based on the current. water will be chill"], ["Reviewed November 17, 2017", 5.0, "Great photo opportunities and an enjoyable climb to the top!", "The best photos are actually mid-way up on the rocks looking up at the Fall but we enjoyed the climb to the top and the views were stunning, well worth a visit if you find yourself at Yosemite!"], ["Reviewed November 15, 2017", 5.0, "Great hike", "It's a good hike to the bridge. The upwards path is good to walk. It's moderated but with a few stops to watch the beautiful views, we made it. Loved it!"], ["Reviewed November 9, 2017", 5.0, "Highlight of Our Yosemite Tour", "Taking the Mist Trail hike and passing by the Vernal Falls was more than amazing. Our visit was last June and the waterfall was roaring and it was beautiful!"], ["Reviewed November 9, 2017", 5.0, "The Misty Trail hike up to these falls is magnificent.", "I love hiking Misty Trail up to these falls. From there you can continue on up to Nevada Falls or come back down. Expect to get wet in the spring."], ["Reviewed November 8, 2017", 5.0, "Yosemite is a must see for everyone", "Hiking in this national park is one of the greatest experiences anyone can hope to have. The trails are not easy but bring a pair of hiking sticks, pick your pace and be truly inspired"], ["Reviewed November 8, 2017", 5.0, "Easy Trail but Dangerous Waters", "Vernal Falls is part of the Mist Trail, infamous for it's narrow, wet, steps that border a treacherous drop to the rocks and water below. However, thousands of people, with babies on their backs, toddlers in tow, and kids running wild, hike it every year. I have acrophobia (fear of heights) so I usually take the John Muir trail further south to go to the top of the falls. However, due to a mixup with my companion, I had to take the Mist Trail during one of the heaviest flows over Vernal falls recorded in the last fifty years. It meant that the upper steps were virtually mini-waterfalls and slippery. However, I made it by not looking down and by using my hiking stick. If you have small kids and the water flow is heavy, I do not suggest hiking the Mist trail with children--take the John Muir Trail to the top. It's not as pretty, you don't follow the Merced River, but you get to the top in one piece. The trailhead to Vernal Falls starts out on the road at the Happy Valley tram stop. There is a bathroom with flush toilets at the trailhead, another one at the bottom of Vernal Falls (along with a drinking fountain, bottle filling station.) If you decide to continue up to the top of the Mist Trail, next to Nevada Falls, there is another bathroom. The trail to Vernal Falls is a consistent climb although not overwhelming and it's paved for strollers, wheelchairs, etc. The views down to the Merced and of Illouette Falls are lovely, especially in May and early June when the water is flowing at its highest rate. You can stop at the bridge below Vernal Falls, near the restrooms and drinking fountain, or start the climb on the Mist Trail and go up to a viewing platform at the top of the falls. Now, here's the most important part of this review. DO NOT, UNDER ANY CIRCUMSTANCES, GO INTO THE RIVER AT THE TOP OF THE FALLS. I have been in Yosemite twice when tourist have gone in, thinking the water was tame, only to be pulled by the undercurrent to their death. In 2011 I was there a week before the church tragedy where three people, each trying to save the other, went over the falls. People think Emerald Pool, which is another half mile up the river, is pretty and you can swim it, but DON'T... it's not worth the risk. However, do enjoy the great views and when you're done, don't tell anyone about the hike--it 's already too crowded! LOL\nShow less"], ["Reviewed November 4, 2017", 5.0, "Beautiful hike.", "It is a moderate climb to the bridge but scenery quite beautiful. Worth the walk but with a few stops made it."], ["Reviewed October 29, 2017", 5.0, "Excellent views", "The final part of this hike is quite challenging and requires a moderate degree of agility and fitness but the views are a just reward for the hard work."], ["Reviewed October 26, 2017", 5.0, "A spectacular hike with great views", "This is a great hike to the falls; fun and scenic along the way, a variety of terrain to go over, and then the payoff when you reach the top of the falls. Overall, this was by and far my favorite hike and spot in Yosemite. The hike does take a bit of time and you will work up a sweat since it is largely uphill to get to the falls. Take your time, bring some water (there is a water refill station about 2/3 of the way up the trail to the falls), and it is just so worth the effort! The views and pictures I took from the top are spectacular.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Able to View Vernal Falls from Glacier Point", "We started out on the trail to Vernal Falls, but it is uphill and coming back down is always a problem for me because I tend to slide when going downhill. To my husband's disappointed, I turned around and gave up. We were, therefore, delighted when we were able to see the falls from the top of Glacier Point (we drove to get up there). It was flowing beautifully, even in late September!\nShow less"], ["Reviewed October 21, 2017", 5.0, "Beautiful site, long hike up", "This is definitely an arduous hike up with more than 500 granite steps to ascend after a long hike up to the trail head, There is a second way up following the John Muir trail but it is a switch back, small gravel, sometimes slippery path to the ridge top and then descend to the falls. Slippery either way. Breath taking views.\nShow less"], ["Reviewed October 20, 2017", 5.0, "Great Hike To Beautiful Vernal Falls", "This is a great hike alongside a great waterfall,It's about 3 miles round-trip.\nWe parked in Yosemite Valley Trailhead Parking Lot,then we use John Muir Vernal Falls Trailhead- Vernal Falls Bridge ,then Mist Trail up to Top of Vernal Falls.\nThe First .8 miles of the trail is asphalt paved with a gradual incline takes you to the Vernal Fall Bridge, which is beautiful and the Vernal falls can be seen from here ,also there is restrooms, and water filling point.\nThe Second half of the trail is uneven and has many rocks, and consist of a steep granite stairway of over 500 steps which form the majority of the trail.and when you get closer to the Top of Vernal Falls, there's an area where the smaller steps and rocks are very slippery with only a few parts close to the waterfall actually have a handrail.\nThere were a lot of people going up and coming down at the same time,so give way to other hikers going down from the top and vice versa.\nThe Vernal Falls were beautiful and still running good in September and the view throughtout the entire hike and from all the different angles is amazing,we stopped for breath and taking some pictures along the way.\nOn top of the falls,there are guardrails preventing people from reaching out and touching the water.\nSo once you arrive at the top of the waterfall you can walk along the river to take a break or relax on the rocks and eat your snacks.Pay attention of the Funny Squirrels!,they will come right up to you and steal your food!\nWe came back same way,the walk down is a lot quicker but can be a little hard on the Knees.\nWe done this Hike in last week of September,It took us 3 Hrs. to do the complete Hike.\nOverall,Its not a hard or long hike,but you should take precaution,so if you are planning to do this hike make sure to come prepared,wear a Comfortable shoes,and take with you a trekking pole,water and snacks and start early.Enjoy The Hike!!\n\n\n\n\n\n\n\nShow less"], ["Reviewed October 15, 2017", 4.0, "Wonderful", "We take about one hour walk to see the fall. It is better than we expected. I think if we come in summer and it will have more water. Next time we should stay here for long time and it is better got the hotel inside the park.\nShow less"], ["Reviewed October 12, 2017", 4.0, "nice few hours hike to stunning falls view", "it is not a long hike to the top of the falls. a few hours will do. the view of the falls well worth the effort. make sure you fill enough water before leave the last water station."], ["Reviewed October 11, 2017", 5.0, "Stunning", "Vernal falls is reached by taking a very moderately aggressive trail up from the valley. The trail is paved but requires some uphill hiking. The falls is well worth the effort. We visited the falls in the early afternoon and were rewarded with not only the beauty of the falls but a vivid rainbow as the sun shown down through the mist. This is a must see attraction if you are visiting Yosemite National Park. If you are feeling a bit more adventurous, continue the climb up to Nevada Falls but be prepared for an aggressive, steep climb going from Vernal to Nevada falls. It is well worth the effort. Thane the more leisurely \"winter route\" back down. It is a little longer but the decent is accomplished by a series of switchbacks rather than the steep, narrow tack steps experienced on the shorter trail.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Our favorite hike for the family", "This is a more strenuous hike but it also became our family favorite. The kids (ages 4 and 6) made it to the footbridge with a couple of stops along the way and if you want to you can continue on to the Mist trail. Vernal Falls is beautiful, even in the fall and the paved trail makes getting there pretty easy. But you will be climbing uphill most of the way so be sure to take extra water and take breaks if needed.\nShow less"], ["Reviewed October 9, 2017", 5.0, "Great hike to stunning waterfall", "We visited Yosemite during the first week of October and therefore i was worried that the waterfalls would be dry. However Vernal Falls was still flowing nicely and the hike to the falls was an exhilarating experience. The first part of the hike is moderately steep but on a paved trail. Once you reach the bridge over the river it's only a modest hike along the river to the base of the falls. The views are worth it! definitely a great hike. It can be crowded, so the early you go, the better!\nShow less"], ["Reviewed October 7, 2017", 4.0, "Sensible shoes needed!", "A challenging walk to the base of the falls. Some seriously steep climbing with uneven surfaces. Don't bring children in a stroller, you will end up carrying both."], ["Reviewed October 5, 2017", 5.0, "Loved this hike! A decent challenge but not overwhelming.", "I'm a 60 year old hiker and I did Vernal Fall (lots of stairs but not too strenuous) and then Nevada Falls (wore me out completely!), going up the Mist Trail and down the John Muir trail, for a total of 7 miles. The views are fabulous. There is one steep set of stairs along the edge of a cliff going up to Vernal Fall, but there is a handrail. If you're afraid of heights just take your time. Note that the hike up to Vernal Fall can be quite crowded. The crowds thinned out going up to Nevada Falls (but there were plenty of people even on that trail.)\nShow less"], ["Reviewed October 2, 2017", 5.0, "It is the second Half of the hike from the Valley floor after the Mist Trail.", "After you go through the Mist Trail on your way to Little Yosemite Valley you have to do the Vernal Falls Trail. It is a bit harder then the mist trail due to its longer length but still worth it. The falls even in September were spectacular\nShow less"], ["Reviewed October 1, 2017", 5.0, "Minnesota Nice", "We did this walk first in the park. I am 64 and it was very strenuous for me. I made it to the bridge and had to stop...some of the rest of my party went all the way to the top to the falls....they climbed the steps up by the falls.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Beautiful!", "Lovely falls = wonderful to see as part of the Mist Trail. Worth the climb to see - truly magnificent."], ["Reviewed October 1, 2017", 5.0, "Worth the Hike", "Some guidebooks call this an easy hike, some moderate. I will say it is not easy. Its uphill the entire way. No lie. But so worth it. Take lots of water. There is water once you get to the bridge, restrooms too. Plus, if some of your party do not want to make the strenuous hike to the very top, the bridge area is a nice place to sit and wait.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Towering", "It was a good pick to visit. I would call the hike up there more then moderate which is what the guide book says. I was pretty beat when I came back down. Agreed, nearly 61 and not in good shape.\nBut it is worth the trouble. The falls are impressive even in September. I understand that in spring it must be even more so.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Beautiful climb", "Take your time, carry water and all is good! The hike is classified as moderate and it's moderate. Take your time and enjoy the views. Lots of young folks that can run up and down the trail, but the view along the way needs to be taken in,\nShow less"], ["Reviewed September 28, 2017", 5.0, "We reached the top", "This was a lovely walk, a bit strenuous in some places, but worth every step, we walked it mid morning so was very busy, reached the top, took some wonderful pictures, had a breather, then walked back down, although you can carry on.\nWould recommend good foot wear and an early start.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Steep Mist Trail", "Start early to avoid crowds. Wear grippy hiking boots because trail is step, full of steps and sometimes wet."], ["Reviewed September 13, 2017", 5.0, "Stunning when you get you eventually get yo the top.", "Very congested, with just about everyone doing this trail. It's very steep, gets slippery on the rocks and be prepared to get wet from the spray from the waterfall. Sensible shoes eg walking boats not flip flops , sandals or trainers. Slow going when the people in front of you stop every 5 seconds to take a photo. At the top walk along a bit further up to the Nevada Falls.Nice place to stop and have your picnic and some more stunning views\nShow less"], ["Reviewed September 11, 2017", 5.0, "tough walk", "This is stunning but the walk to the bridge can be tough You go up in elevation about 400 feet. If you want to go up higher to the falls it is steep and when you get closer there are very uneven steps to climb. I think they said 600 steps. Still if you can do it it is worth it.\nShow less"], ["Reviewed September 9, 2017", 4.0, "huge and relaxing", "if only you go hike up to the half dome that the sprinkling effect of this huge water fall will solace ur mind and body.. its such a good feeling.. This water fall is not 'the biggest' but is very beautiful and makes up a good family hike (moderate effort) with kids ok.. The steps are steep but only a few... Make the best of your family time here.. go ahead never miss it.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Breath taking", "Definitely worth the hike. Moderate difficulty level. Stairs can be slippery so be careful. People love to take their children up it and seems to be rather dangerous, but to each their own. Take the option of the Jon Muir trail on the way back down so you don't have to track all the wet steps back down. It adds an additional two miles to your hike back down but it's quite enjoyable and you don't have to go down the steps with hundreds of people fighting their way up to the falls. Very crowded in the afternoon and from June-September.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great Hike", "Don't take it for granted as people get hurt all the time on the steps. Bring lots of water and snacks and wear a good sturdy shoe."], ["Reviewed September 5, 2017", 5.0, "amazing!", "This was probably our favorite hike - the payoff of the falls is incredible! Pack enough water, and don't forget to stop and enjoy the view along the hike, not just the waterfall."], ["Reviewed September 5, 2017", 4.0, "Strenuous walk with great waterfall views", "Undertook this walk on a very busy weekend. We are a reasonably fit mature age couple but found the walk quite hard. One must remember Yosemite valley is about 4000 feet above sea level and as it was very warm we were a little unprepared for feeling so short of breath and needed to stop a few times on the steep climb on the way up. The track is well surfaced but there are no rails or barriers between yourself and the steep ravines below. Couple this with a large number of walkers - some quite slow and others rushing past can be quite daunting. Beyond the bridge where you can get some lovely photos of the falls the path becomes even steeper and quite slippery. There is no warning signs on the need to take care and and with no rails to hang onto one needs to be sure footed and not subject to vertigo.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Great waterfall", "We really enjoyed the hike to see this great waterfall. There was a beautiful rainbow as well! Definite must see."], ["Reviewed September 2, 2017", 5.0, "Beautiful", "Vernal Falls was one of our favorite places. The mist enveloped us and made the hike even more breath taking. Two in our group hiked close to the base of the fall making a great picture and just showed us how powerful the fall actually was. This is a must see Vista.\nShow less"], ["Reviewed September 2, 2017", 5.0, "best hike we did as a family with teens", "it is a straight up climb, but can go slow. 1/2 made it to the top, you can always turn around when mist gets to be too much or too slippery. still rushing falls this week can't imagine what its like in the spring, lots of areas to take photos, last week of august not too busy.\nShow less"], ["Reviewed August 23, 2017", 5.0, "Hiking experience!", "It is a strenuous hike but you will be rewarded. Please motivate yourself to do this hike. It will not take more than an hour even if you stop and go. Kids can do this also and I have seen many elderly people doing the hike. Incredible!\nShow less"], ["Reviewed August 19, 2017", 5.0, "Lots of rocky steps", "The hike to Vernal Falls is wet, slippery, and rocky but worth the climb. On a summer day it is very crowded - including families with young children as well as older adults. I was glad I had a hiking pole to help steady me on the wet slippery rocks.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Must do hike in Yosemite!", "Absolutely incredible hike! You must do this if capable. It is fairly strenuous. The path is paved up to the lower bridge where you get your first distant view of the falls. From there on it gets more challenging but more rewarding. The walk up alongside the river is amazing and then the steps up to the bottom of the falls are like something from a Tolkein novel. Beautiful! You will get wet though which in the summer heat was refreshing. The steps on up from there are steep but keep going up to the top of the falls for the view is stunning. Don't come back down that way as the steps are hard to descend but keep going up to Clark point for that in my opinion was the view of the day! From up above the falls - incredible! The walk down has seemingly endless switchbacks which can be a bit slippy due to dry gravel/sand, but easier than going down the afore-mentioned steps. Bring plenty of water and something to eat. All told it is probably about a 3 hour hike including stopping for views and photos.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Wow! Incredible!", "WOW! Do not miss this waterfall! Incredible power and exhilarating hike that keeps you engaged and easily motivated as you continually see a more beautiful section of this flowing canyon as you ascend! We started in the morning and took a nice snack break at the top before descending. A little treacherous at spots and the wet steps can be slippery, but it was well worth the hike and effort...it was INCREDIBLE! One of the highlights of our trip for sure!\nShow less"], ["Reviewed August 16, 2017", 4.0, "Nice waterfall", "Beautiful waterfall. Be careful of slippery steps. Beautiful hike up to it of easy to moderate difficulty. Kinda looked like doing a lord of the rings style journey"], ["Reviewed August 16, 2017", 5.0, "Underrated, should be called rainbow falls", "I took the Mist Trail, which puts you right at the bottom of the falls. You can get quite close to the base. It's beautiful with so much mist that everywhere you look a rainbow shines, but it is dangerous. Be very careful. The water will crush you if you try to shower in it. And don't swim in the pool above it, the current is very strong and you will be swept over the edge.\nShow less"], ["Reviewed August 15, 2017", 5.0, "A strenuous beautiful hike", "My husband did this one this year; he and his buddy, both in their 50's and 60's and not in bad shape, felt it was testing their limits. But beautiful!"], ["Reviewed August 15, 2017", 5.0, "600 steps", "This is a short walk but the height gain makes it a bit more strenuous than the distance suggests. There are 600 or so steps to get up in order to get to the top of the falls. Most of these are wet from the falls so care is needed, especially on the descent. Small rainbows are visible from the path where the water spray diffracts the sunlight. Very pretty. Well worth the effort though. It is popular so is a bit of a motorway .\nShow less"], ["Reviewed August 15, 2017", 5.0, "Wow", "All I can say is that the waterfalls including this one are just amazing to watch in awwwwe. Make sure you go in the spring because that is when they are the most spectacular to watch."], ["Reviewed August 14, 2017", 5.0, "Amazing but not easy", "This trail is long and steep. The views are great but I found the heights at the end to be too scary for me. Tons of people in it which does not make it easier. However just being able to be there was amazing"], ["Reviewed August 14, 2017", 5.0, "Breathtaking View", "This is one of the most beautiful places I have ever seen. It is definitely worth hiking further past the Vernal Fall Foot Bridge so that you can walk up beside the waterfall. Unfortunately I did not fully complete the hike as the steps were very slippery and there is no hand railing near the top. Nevertheless it was still breathtaking from three quarters of the way up.\nShow less"], ["Reviewed August 13, 2017", 5.0, "Fantastic Vista", "Wow - what a view. This hike takes about 3 hours but it is well worth the effort. It is all up hill. The first half is easy to a bridge. The path is paved and is suitable for strollers and possibly wheel chairs. The next half is a challenging stone path with some very steep steps to get to the top of the fall. The gradient is steep. Not for the faint hearted. I would not recommend doing this portion unless in good physical shape and wearing good sturdy footwear.\n\nOn the way back down we used the John Muir trail. More uphill with a good vista above the fall and also if Nevada Falls in the distance. Then down hill via a series of tee lined switchbacks ending up back at the bridge at the half way point.\n\nWe started first thing in the morning - 0830 and there were quite a few people on the trail. The Muir Trail was peaceful with only a few people using it. Once back at the bridge at about 11:15 it was like rejoining all of humanity or Piccadilly Circle at rush hour.\nShow less"], ["Reviewed August 11, 2017", 5.0, "Powerful waterfall - bring a rain poncho", "This is one the the more famous sights in the park and heavily trafficked. We left our car near the lodge and took the free shuttle to get to the trailhead. It's a 3 mile roundtrip and steep with 1000 ft elevation gain so although it's a paved path for the most part until you get to the rocky steps leading to the fall it's lined with people wheezing their way up or taking a break. This is also a wider, more powerful fall so you will get soaked at the top by the sprays - a rain poncho would be a really good idea. On the way we were entertained by many fearless squirrels running about, posing for photos, and singing loudly, clearly used to the crowds.\nShow less"], ["Reviewed August 7, 2017", 4.0, "LONG, STEEP HIKE UP TO VIEW FALLS", "This view of the falls requires a long, steep hike. The last part of the route can be quite slippery due to the spray from the falls"], ["Reviewed August 5, 2017", 5.0, "Awesome place to go.", "It's challenging but when you reach the top of the falls and see the rainbow below you, it will all be worth it. Definitely."], ["Reviewed August 3, 2017", 5.0, "The Falls Were Beautiful This Trip!", "All of the falls were running really well for this time of year due to the winter snow run-off. I'm always amazed at how many (usually young) people ignore the dangers and venture into the water's edge on the slick rock. One slip and you're a goner! Respect the circumstances and you'll enjoy breathtaking views and beauty...\nShow less"], ["Reviewed July 31, 2017", 5.0, "Beautiful setting", "This walk is well worth the effort but a bit of common sense and knowing your limits is required. It starts on an excellent track with a steady but relatively gentle gradient.There are excellent views all the way. Once you reach the bridge you get a good view of the falls but at this point as you head up towards the mist trail the path gets noticeably steeper, rougher, narrower, wetter and becomes actually quite dangerous.\n\nThe volume of people makes this a place to be very careful and where awareness of and consideration towards other people is required. Some of the more challenging parts are where some of the more moronic people who come here stop to take selfies thereby causing others who are struggling to get up or down to pause which in turn causes dangerous bottlenecks. By all means enjoy yourself but please have consideration for others.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Crowded", "The place was packed and it was tough getting up close, but ti was worth it as in our country we do not have a lot of open spaces, and no water falls. Not the biggest or most impressive but worth seeing"], ["Reviewed July 24, 2017", 5.0, "needs to walk a lot", "beautiful look but, you need to walk a lot to see the water fall, it is hill up, but all the walk wort it"], ["Reviewed July 19, 2017", 5.0, "Go Early!", "When the fall is in full effect! I'm talking spring, not in the AM. You may bust your butt climbing those stairs! Ha. It's very slick, cold... but beautiful at the top. Don't miss this hike!"], ["Reviewed July 17, 2017", 5.0, "Don't fall off the Mist Trail!", "This was great though I wish that the path wasn't paved (you're basically just strolling along a sidewalk) and that there were less tourists around. Be careful on the wet, slippery stairs along the Mist Trail!"], ["Reviewed July 16, 2017", 5.0, "Stunningly beautiful but be very careful.", "I've had no prior knowledge about this fall and I am so glad I did not come back home without seeing this amazing fall. It is not a easy hike up to the fall and some parts are very steep. As almost all reviewers had mentioned, it is absolutely beautiful. From the base of the fall to the top, you are walking up a narrow, wet and steep rock stairs (only few parts with guard rails). There were just too many people going up and down this slippery stairs and I felt little scared. Be careful and slow down. Take care of your children.\nShow less"], ["Reviewed July 14, 2017", 5.0, "Vernal Fall", "Very beautiful waterfall but also very risky. Over 600 stairs to reach the top and those stairs are very very wet. Scary if you're afraid of heights or not steady on your feet."], ["Reviewed July 12, 2017", 5.0, "Gorgeous water fall", "I found Vernal and Nevada falls more beautiful than Yosemite falls. Not only powerful but their surroundings can be misty, green to rocky. The beginning of the trail is very steep but paved. Then you walk along the river and misty stone steps to get to the fall. You need a rain gear for this trail (mist trail). And if you hike all the way to Vernal Fall, please extend your walk to Nevada fall. It's worth it.\nShow less"], ["Reviewed July 12, 2017", 5.0, "Must see", "We went for the trial. Its bit steep trail. Truly worth if we reach the top and see the beauty of the falls and the feel of mist on our body awesome. If much interest there is Nevada falls nearby. We returned back with vernal falls only.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Glorious Hike!", "This is a deservedly famous hike and and is worth the effort. The relatively gentle first part turns into some steep steps that, following a heavy snow season, are wet and slippery. I went the last day of June and there was so much mist coming from the falls that it seemed like a rainstorm in places. And, at around 9:30 in the morning, also quite chilly. Bringing a poncho and a pack rain cover is advised. The rewards are a closeup view of the falls, a nice view of the Merced River flowing below, and a warm rock on which to soak up the suns rays and dry off.\nShow less"], ["Reviewed July 10, 2017", 4.0, "Incredible hike, but too crowded!!!", "Yosemite National Park is an amazing and awe-inspiring place to visit. I strongly suggest visiting during the \"off-season\" or when schools are in session! The scenery and hiking opportunities are incredible, but fighting the crowds was a bit frustrating."], ["Reviewed July 10, 2017", 5.0, "Worth the climb!", "I would recommend that you have a pair of good hiking shoes which are waterproof. The walk up is a bit steep and at some point, could be wet (near the fall). Have a poncho or water proof jacket as the wind may bring some moist and water which will result in wet clothes and shoes. The steps up are steep and slippery if you wish to have a good view of the fall from above.\nShow less"], ["Reviewed July 9, 2017", 5.0, "Great hike, very wet!", "This year, the waterfalls are still absolutely spectacular at the beginning of July in Yosemite, so the trail is wet, but very exciting. If you choose to continue to Nevada Fall and don't want to come back on the same trail, pick John Muir trail (slightly longer, but easier, and also dry!).\nShow less"], ["Reviewed July 7, 2017", 5.0, "A great hike, but bring a rain coat", "The hike round trip to the top of Vernal Falls is 3 miles, so it's a nice easy distance to start off your day. The half-way point is a small bridge crossing the river under the falls, with a nice view of the falls as well as bathrooms and water fountains. From there, it is a steeper climb up to the top on rock stairs. From this point on, expect to get wet from the mist of the waterfall. At the top there are more bathrooms and plenty of space to sit and rest with a great view of the falls. From there you can also continue on to Nevada Falls. Because of the heavy snow pack, the falls are definitely roaring and beautiful. I would recommend going earlier in the morning; we began out hike at around 8:45-9 am. As we were coming down, we noticed that it was definitely more crowded on the Mist Trail, and people had to wait in order to move. Definitely a must-see in the valley!\nShow less"], ["Reviewed July 4, 2017", 5.0, "Beautiful hike to the falls", "Great short hike to see the falls. It is under two miles round trip but be prepared for the incline on the way up. We are in our 50s and in ok shape. We took our time and stopped several times to take pictures along the way. It is paved which is really nice. Once you get to the bridge it is worth the hike. The waterfalls this year were fabulous due to all the rain so it was even more beautiful than normal. You can hike up beyond the bridge but you need rain gear as the overspray from the falls was a lot this year. We only hiked to the bridge and that was perfect for us. Great views and pics!\nShow less"], ["Reviewed July 3, 2017", 5.0, "Awesome 3 mile RT hike", "This is a one of a kind hike. Along the upper portion of the trail, it feels like you are walking under the water fall. It is only the spray from the waterfall, but this is one massive waterfall. Take a break at the top of the fall to watch the water and listen to the incredible roar of the water.\nShow less"], ["Reviewed July 2, 2017", 5.0, "Amazing Scenic Waterfall!", "Hiked across Vernal bridge and up the Mist Trail to get to the top of the falls. Amazing views starting from the bridge all the way to the top. Water flow on July 2nd was amazing. Hurry up and visit while the awesome snowpack this year is melting!\n\nKeep hiking up another 100-200 yards up the trail from the top for a nice place to picnic. The granite slab has the water gushing over it and you can walk right up to it. Just make sure to watch your young ones.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Once in a lifetime hike", "The water is flowing this year, so you will get wet as you ascend the staircase towards the top of the falls. The hike is a pretty steep, paved incline to the stairs and then a steeper stair journey. My suggestions: avoid the crowd by going late in the day! We started at 3:30 pm and met a lot of people coming down while we were going up, but met hardly anyone when we hiked back down. On hot days, if you are only going to the top of Vernal Falls, if you go after 3:30 you'll avoid larger crowds. Might be colder, but you'll still dry off. Once at top of falls, be sure to walk up an extra 1/4 to 1/2 mile to see beautiful raging river that connects Nevada Falls to Vernal. I'd stop at a distant vista of Nevada, unless you really want to exert yourself and have a lot more time on your hands. A rather fun hike, walking up a staircase, getting drenched by the mist as the water pours over the falls. Have fun!\nShow less"], ["Reviewed June 28, 2017", 5.0, "Excruciating but exhilirant!", "If you go to Vernal Falls and Nevada Falls this is a tough trek and strenuous but very much worth the effort. It will take at least 5 - 6 hours for the average fitness level. Start early - 8 AM! You will then also et parking near bus stop #16 where the trail head starts. Take lots of water and a lot of energy bars. There are great places to rest and eat your energy bars at the two falls. If you take the Mist Trail in Spring or Summer take a poncho or get drenched. Coming down from Nevada Falls taking the Muir trail is tough since it is 2.5 miles but you miss going through Mist trail again.\nShow less"], ["Reviewed June 27, 2017", 3.0, "crazy fun scary hike", "We went here for a hike and wow was it a hike. Once you hit the stairs it is anything goes and slippery/scary. Beautiful area and great scenery. Very crowded and quite challenging towards the top."], ["Reviewed June 27, 2017", 5.0, "Heaven on earth", "Absolutely Stunning! You will get drenched from the mist...More like rain. Go early to avoid crowds."], ["Reviewed June 24, 2017", 5.0, "Amazing trail!", "The first portion of the hike is mostly straight uphill. But once you make it to the bridge crossing, the rest of the way to the falls is incredible. We visited in June, 2017 and were told Yosemite received much more snow that winter than usual so the falls and the river were raging. Bring a poncho or rain gear as you will get soaked. But I can assure you it is well worth it. Also, be careful! The day before we arrived someone slipped and fell into the river close to the falls and their body was not recovered.\nShow less"], ["Reviewed June 17, 2017", 5.0, "Trip to CA", "This walk is strenuous but the views are worth the hike.\nYou do get wet from the spray from the waterfall and the walk is very wet - so dress appropriately.\nI was wearing hiking boots which worked well going up but the trip down was very hard on my toes. Guess I need to buy new shoes.\nFor the more adventurous you can walk further to the Nevada Falls.\nShow less"], ["Reviewed June 16, 2017", 4.0, "Something totally new for two 65 year olds", "Went to the top of vernal falls in May. Wow talk about water. We got to the parking area for mist trail and vernal falls by 800 am. We did find parking Bring lunch!!!!!!!! and snacks. This is not a short stroll. It is close to 5 miles from parking lot and back to parking lot. So many people wrote it was three hours and I believed them. It took us 8 hours and we bike 45 mn three times a week at 5000 ft. The walk to the beginning of the falls is very nice. Bring lots of water. Fill up at each place on the trail and drink your water. Lots of people on the trail. Twenty year olds were jogging and people going in both directions.When you decide to go up to the top of vernal falls is what I considered difficult this spring. Extremely wet. It was the same as a moderate rain. Rivers of water running down the steps. The steps are not even some of very tall and some have 1/2 inch of water on them. I had dri pants and two tops but not rain gear. It felt good to be wet. I did have a walking stick which helped. At the top there is a great chance to dry off. We went up to the john muir trail and this is about another 400 ft up, then there was a great walk down. We had three liters of water and the two of us drank it on the way up and the john muir trail.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Experience the mist and then reach the top of the fall", "I highly recommend this trail that goes through the mist of the fall. We were completely wet but jubilant when we reached the top of the fall. The rainbow in the fall waters was wonderful and so was the view from the top. This is not a very difficult climb so do attempt it. Caution - a good pair of trekking shoes are highly recommended.\nShow less"], ["Reviewed June 14, 2017", 3.0, "Thought Mist Trail up Vernal Falls was dangerous", "Hate to be the naysayer, but the segment of the Mist Trail at the side of Vernal Falls was a dangerous hike the day we took it. The trail was crowded at 9:00AM. Hikers with walking sticks were wielding them carelessly. The falls were producing wet, extremely windy conditions that resulted in slippery footing and fogged glasses. Inconsiderate idiots frequently stopped on the steps for pictures and selfies. And the people hiking down on the narrow steps really made the situation crazy. I think the NPS should at least make this segment one way.\n\nThe return from Vernal or Nevada falls on the John Muir trail was absolutely terrific with outstanding views. Consideration should be given to taking the Muir trail to the top of Vernal, particularly if you have kids in your group.\nShow less"], ["Reviewed June 14, 2017", 5.0, "So much water and spray", "Vernal Fall can be accessed by the Mist Trail, which is 2.4 mi/3.9 km roundtrip with an elevation gain of 1000 ft/365 m.\n\nWe visited Vernal Fall as part of the longer Panorama Trail (from Glacier Point to Yosemite Valley) on Memorial Day. There is so much water and spray due to the record amount of snow and rainfall in the winter. This was the highlight of our Yosemite trip for my husband (my favourite was the Four Mile Trail). Bring a rain jacket or poncho! You will need it for other hikes as well - Lower Yosemite Fall Trail, Bridalveil Fall Trail.\nShow less"], ["Reviewed June 14, 2017", 4.0, "Vernal Falls from the bridge", "This is a 1.6 mile trail to the Vernal Falls Bridge. It's a steady incline, but paved the whole way. At the bridge you get a view of Vernal Falls, but I don't know if this view is worth it. It's only partial. The trail leading to it though is beautiful & you get some great views. Hike on if you're able to continue on to the Mist Trail (strenuous).\nWe parked at the hikers day use parking lot, past Half Dome Village. There's also a shuttlestop. Happy Isles nature center is nearby, but not open until after Memorial Day.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Mist trail is a must", "Be prepared....take plenty of water and good shoes. Lots of slippery steps and a god climb to falls. Was well worth it. Don't quit here....take trail to Nevada Falls and than return John Muir trail. Unique and so memorable. The huge water sprays produce amazing rainbows one of our favorite trails in the park.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Tough walk, but worth it", "The walk up is tough (and I am fit), but it is well worth it. You need to be prepared as you walk through the mist of the waterfall and get very wet, so bring a poncho or waterproof coat. The views of the waterfall and the valley are well worth the walk. Go early to avoid the crowds.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Absolutely Beautiful", "This is a beautiful hike! We did get wet, the runoff this year is off the charts. Don't miss this! We are already planning a trip back!"], ["Reviewed June 7, 2017", 5.0, "Amazing but you will get wet!!", "Vernal fall was good fun!\n\nGo early because it will get busy and parking spots are rare!\n\nThe hike up to Vernal fall is steep but not very challenging as the trail is paved all along the way. It's about 1,5 miles one way.\n\nAs you approach the waterfall, you will quickly feel the mist. Bring a cheap poncho if you have because there is no way to stay dry\n\nPlease watch your step. The steps are very slippery and only a few parts close to the waterfall actually have a handrail. After working your way up to the top of the fall you get to enjoy an amazing view.\n\nDon't stop here though because Nevada fall is at least as rewarding as the Vernal fall!\nShow less"], ["Reviewed June 4, 2017", 4.0, "Great hike - vernal, mist trail, nevada, half dome...", " The half dome cables are the highlight of the hike, and a draw to the park for many, including myself. However, Vernal Falls, Nevada Falls, Mist Trail and even the return leg of the John Muir trail are all very picturesque than it makes for a great hike no matter how far you go. Hike as far as you are able and turn around as needed – you won’t be disappointed.\nShow less"], ["Reviewed June 4, 2017", 5.0, "Incredible!", "Take the Mist Trail! You will get soaked but it will be worth it. Just be sure to do it on a warm day so you dry off. Or you could always buy a poncho The view up top is awesome"], ["Reviewed June 1, 2017", 5.0, "A steep climb", "A 0.8 mile steep climb up to the bridge with views of the falls. It takes about three times to get there than to get back. In after May (with the snow melt) the falls were thunderous and the river is a spectacular view al the way up the walk. Take plenty of water.\nShow less"], ["Reviewed May 31, 2017", 5.0, "Good hike... Can go up to the lower falls or take the mist trail up to the top", "Really nice hike and the falls are beautiful.. This is one one the reasons to visit Yosemite so must see.. If you are in good shape hit the top and have a picnic in the rocks at the top of the fall"], ["Reviewed May 31, 2017", 5.0, "Gorgeous fall and a pretty easy hike", "At this time of the year (late May), the waterflow is at its high, and the waterfall is amazing. The hike (Mist trail) starts at the shuttle stop 16, right across from the bus stop. You will cross a small bridge over a river first, and then set your feet to the hike. Take your time, there are plenty of spots to sit and relax along the way. Once you reach the footbridge across from the waterfall, you will have two options - to turn left, onto the second part of the Mist trail (which will lead you to the top of Vernon Fall and to Nevada Fall), or to turn right, onto John Muir trail (which leads to Nevada fall, Glacier point and Half Dome, Clouds Rest and Tenaya Lake).\nShow less"], ["Reviewed May 29, 2017", 5.0, "PERSONAL FAVORITE OF WHOLE PARK", "Other locations take hours and hours and are hard to reach. This is moderate in difficulty, takes 4-6 hours depending on route and breaks, and has a great view at the top. Plus you can keep taking the Mist Trail to get to base of Nevada Falls.\n\nPARKING!!! Do not park in main area by visitor center. Arrive as early as possible, before 9am I recommend and follow signs to Half Dome Village. There is parking 10 min walk away from start of trail. Mist Trail is what you're going to want to take (it goes to base and top of falls where John Miur Trail goes around the back). Shuttle stop 16 is not far from Half Dome Village parking.\n\nYOU WILL GET WET. Bring extra pair of socks. Depending how hot it is clothes will dry not too long after more walking. But spare socks is key. Friend I went with got multiple blisters day one. Made the rest of the days quite difficult for her. Make sure to bring snacks and water. Break often as you gain altitude quite quickly.\nShow less"], ["Reviewed May 28, 2017", 5.0, "make sure you have a parka", "The mist coming off the falls will soak you if you are not wearing a parka, the 600 steps up are at times a little dangerous with no handrails"], ["Reviewed May 27, 2017", 5.0, "Very beautiful hike to Vernal and Nevada falls", "I really enjoyed this hike. Many beautiful views and alternating paths. The stairs to Vernal falls are indeed very special. Fortunately I took my poncho raincoat which I needed. Also the trail from Vernal to Nevada falls is magnificent. I descended via the John Muir trail which is an easier trial than the Mist trail but still I needed my poncho due to water falling on to the trail from above. From this trail you get a great view of the Nevada falls and Liberty Cap. I saw many people starting on this trail ill-prepared. When doing this trail make sure you carry a raincoat and wear good hiking boots.\nShow less"], ["Reviewed May 26, 2017", 4.0, "Use the loop trail", "Great walk but must take a rain jacket to avoid being cold and wet\n\nIts best to walk up the steps then return via the Muir trail rather than risk all the idiots walking down the wet slippery steps\n\nI would not recommend talking small children as its a steep drop off and no railings\n\nAnother Yosemite gem\nShow less"], ["Reviewed May 26, 2017", 5.0, "Magnificent Waterfall", "If you choose to ascend along the waterfall using the 600+steps this year (2017) bring rain gear as there is so much water, you will get drenched! If you are not surefooted and not in shape, do not go past the bridge. If you continue up, at the bridge, there are water fountains and flush toilets most the time (sometimes in winter the bathrooms are closed). Steps are slippery and the climb is strenuous. There is a back route using the John Muir Trail which is also a strenuous hike but not wet. Part of the trail is shared by mules, so watch your step. There are pretty steep switchbacks but the trail is beautiful and mostly in the shade. This trail will split off and bring you down to the top of Vernal Falls or you can continue to Nevada Falls. Bring plenty of water and wear hiking boots. While at the Falls enjoy the magnificent nature without putting yourself at risk. People die each year because they do stupid things and do not respect the power of nature. If you step into the water, you will most likely be swept off your feet and you will fall over the Falls to your death. Be wise and respect nature. Watch your children and teach them to do the same.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Get ready to sweat!", "This was a difficult hike. Lots of up, up, up and lots of wet from the waterfall. After reaching the top, you basically have to do the 4 miles down the backside. We saw no one coming back down the way you went up. Very dangerous. Glad we did it!\nShow less"], ["Reviewed May 24, 2017", 5.0, "Short but challenging hike and what reward once on top :)", "We started the hike thinking it would be easy peasy since it was very short but it is actually quite challenging. It's all the way up through steps hence it is not quite easy. But so wonderful. The views you get here are gorgeous. You get splashed by the mist of the waterfall as you hike up so it's just lovely. We were very tired when we got to the top but it felt so rewarding. There were older people and children so not too bad!\n\nVisited summer 2005.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Magnificent", "Quite challenging but worth it for the spectacular views along the way. We got some great photos and this hike certainly has the wow factor."], ["Reviewed May 23, 2017", 5.0, "Beautiful", "This is a gorgeous view, but prepared for a strenuous uphill hike. I only made it as far as the bridge, but others in our group went all the way up and said it was spectacular."], ["Reviewed May 20, 2017", 5.0, "Falls", "It was spectacular view to watch the falls as it was raining day previously water gushing out was in full swing and we really enjoyed it"], ["Reviewed May 18, 2017", 5.0, "Be prepared...", "I was interested to read the other reviews. Let's start with the scenic aspect-high marks! It was beautiful the whole way up. Here's what you need to know:\n\n1. Wear waterproof footwear with strong grips.\n\n2. Bring plenty of water\n\n3. Be prepared to ascend via 600 watery, slippery steps and to get wet (poncho is a must unless it's really hot out)\n\n4. The Muir trail is a long ascent followed by a winding descent. We took this because the thought of going back down via the 600 steps seemed crazy. Be prepared to climb rocks and ascend for awhile before finally heading down.\n\nEvery step was beautiful but if you're in lousy shape, you're going to feel it.\n\nFinally, the trails are not well-marked. You really need to know what you're doing before you leave so you don't end up walking many miles further than you anticipated.\n\nIn the end, it was worth it.\nShow less"], ["Reviewed May 17, 2017", 5.0, "Amazing", "Great walk, hard at the end but amazing views all the way up. We went when it was raining and it added to the excitement. If raining where good shoes as the last steps are slippery"], ["Reviewed May 14, 2017", 5.0, "Steep hike but worth it!", "Wow! This was a great hike but very wet and steep. Well worth it to bring some food for the top where you can munch on something before your way down. Beware for the big puddles around the falls area."], ["Reviewed May 13, 2017", 5.0, "Go Early & Bring Rain Gear", "We got to the trail around 8 am and it was perfect timing. We passed crowds beginning to come up as we headed down, but still not too busy yet. It can be very cold and very shaded in the early morning though so bundle up and wear plenty of rain gear. You will get wet if you want to get closer to the falls. We had to stop because we were carrying an infant and did not have rain gear. Beautiful views along the way!\nShow less"], ["Reviewed May 11, 2017", 5.0, "Busy trail, great view for pictures", "Our hike to Vernal Fall was worth every single step. We wore layers which was perfect for staying comfortable throughout the hike. Bring a lunch and walk the trail past the footbridge. There is a large rock area with a perfect view of the falls. However, walk carefully, the rocks can be slippery and uneven. Due to icy conditions we were not able to ascend the 600 steps. We tried to make it to the steps but it was truly treacherous. We desperately wanted to make it to the Nevada Fall so we turned around and hiked the challenging John Muir Trail which was a great challenge due to the ice and snow. Hike with lots of water, no time limit, and a camera.\nShow less"], ["Reviewed May 6, 2017", 5.0, "Love this Hike!", "This was our favorite hike of the trip. It is somewhat challenging with its elevation, but a wonderful paved trail. The falls are very full right now!"], ["Reviewed May 4, 2017", 5.0, "Wet and exciting hike", "Spectacular hike in April . Both Vernal and Nevada Falls are at full strength . Very wet so bring a light wind breaker . Also bring water and some snack food to enjoy at the top of the falls . Bring good shoes with lots of traction because it is very slippery and WET ! Go past the top of Vernal Falls about 50 to 75 yards along the river for a great place to rest and enjoy a snack or lunch away from the crowds . We took the Winter Trail back to the Valley for some great and different views . After the long walk back from the top of Nevada Falls a cold beer at the Majestic was heaven . Tip : Take the Shuttle to Happy Isles to avoid the parking issues .\nShow less"], ["Reviewed April 28, 2017", 5.0, "Bring water", "This is a popular trail so be prepared for crowds. To the bridge view it is less than a mile but straight up on asphalt. There are lots of places to stop with great views of Upper Yosemite falls, Glacier Point, Illilouette falls & of course the mighty Merced. You can continue up to the top either on the Mist trail which you better have rain gear & waterproof boots since it is wet & slick or you can go up the John Muir trail. Great view up top.\nShow less"], ["Reviewed April 26, 2017", 4.0, "Short distance, but long hike!", "This is only an .8 mile hike in distance, but when you are going uphill, it is a long hike. It is a very impressive fall, but there is one across the distance that you can see from this trail that is even prettier."], ["Reviewed April 22, 2017", 4.0, "Good.", "This is a lovely moderate hike to the footbridge. Paved and not too tough. About a mile with some amazing views.\n\nAgain, go as early as you can to have some time in the quiet.\n\nAnd again, go past the footbridge. The trail to the top of Vernal is a little tougher than the trail to the footbridge, but few go that far so its worth the quiet. And the views are lovely.\nShow less"], ["Reviewed April 20, 2017", 5.0, "Must go to the top", "We went up mist trail to the top of the falls. Icy steps at the top be prepared to go slow and wear a jacket from the wetness. The top was amazing and we had time to relax and watch the squirrels."], ["Reviewed April 18, 2017", 4.0, "Tough Climb, Great View", "Be prepared for significant elevation gains on this trail. Combined with the crowds it will be slow-going."], ["Reviewed April 18, 2017", 5.0, "Beautiful Day Trip", "The route is not that difficult if you take your time to get to the top. The falls are beautiful and you can get right up to the water and see it go over the edge. The toughest part of the hike was at the beginning from Happy Isles to the bridge. Take the Mist Trail up and the John Muir Trail back. Wear shoes which are light and have good traction on slippery surfaces.\n\nEven though it does not show on the map there is a restroom at the top a little ways up from the falls.\nShow less"], ["Reviewed April 16, 2017", 5.0, "Scary and beautiful!", "Visited during a rainstorm during peak spring runoff and the river was raging! The last portion of the mist trail was covered with water flowing down the steps. Made me a little nervous hiking with a ten and 13 year old, but they did great."], ["Reviewed April 16, 2017", 4.0, "Not the highest falls in the park, but accessible.", "Vernal Falls is reached by hiking the Mist Trail from the valley floor. The falls are not the highest in the park, but they are still impressive. This is a good, worthwhile hike of moderate difficulty."], ["Reviewed April 4, 2017", 5.0, "Double rainbows!", "Isnt it magical when you get to see 2 rainbows?\n\nDon't miss the Vernal Fall hike. You will be well rewarded with the stunning and picturesque view!\n\nWear appropriate hiking gears and a waterproof jacket as you approach a higher altitude because of the mist. Be prepared to be soaked this time of the year.\n\nI would also suggest you bring a dry bag to place your camera too!\nShow less"], ["Reviewed April 2, 2017", 5.0, "Same thing as mist trail", "The Mist Trail puts you at Vernal Falls so it's the same thing. We were there right when they opened the top of the mist trail so you could walk to the top of the falls. The walk to the bottom of the falls is paved although uphill all the way. But, definitely not a difficult hike.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Must visit waterfalls in Yosemite for Hikers", "If you are a good hiker, do not miss this. It is beautiful hike of nearly 1.5miles from the shuttle stop and you can continue on to Nevada falls for another 1.5miles if you are strong enough. Its beautiful, light dangerous till the falls, but if you are lucky you can see rainbow during afternoon/evening right in front of it.\nShow less"], ["Reviewed March 23, 2017", 5.0, "Really incredible hike", "Almost two mile hike from the valley floor, and much of it on an incline - be ready to get stressed and tired. The bridge (where the falls are visible) is roughly the halfway point. Be sure to go - it's beautiful. And very worth the effort. It's moderately strenuous. The falls were very full in mid-March (largely due to snowpack melt).\nShow less"], ["Reviewed March 19, 2017", 3.0, "Whew!", "I had to sit down halfway up. Almost passed out. Very steep climb. I felt there should have been a notice posted that the view of the falls was closed due to danger or rock slides. We got up to the bridge and then found this out a few minutes later when we saw the closed sign near the top. If we had known we would have picked a different hike. It's a great view when you do get up there however.\nShow less"], ["Reviewed March 16, 2017", 4.0, "Lovely walk", "Unfortunately, due to the inclement weather (it started to rain and there was a fair bit of snow) we didn't make it right to the falls. However, it is a lovely walk up through the forest on a well marked trail."], ["Reviewed March 15, 2017", 4.0, "scary, but satisfying", "The main trail was closed for the winter, so we took the other trail. The trail was scary in places because of ice and snow due to avalanches. The view was beautiful at the top, but we had a lot of slipping and sliding coming down.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Moderate hike", "Hiked this waterfall 15 years ago and have not hiked back though we have visited Yosemite many times over. After 3 kids, it is a bit challenging. The steep and unprotected steps going to the top isn't very safe, the switchbacks and wet condition, no bathrooms and constant snacking required for kids makes it impossible. I consider this a moderate hike, can be accomplished half a day depending on how much pictures you take, how long you stay on top and your pace. Wear good shoes and bring lots of water. Stay away from posing precariously to avoid falling over the edge of anything.\nShow less"], ["Reviewed March 7, 2017", 5.0, "Another Great Falls in Yosemite", "Less famous than some of the others, but still a falls worth seeing. This one is wider at the top and makes a great picture."], ["Reviewed March 1, 2017", 5.0, "Worth everystep to the top !!!", "I am not a person who is very active, so for me the hike was like do I really need to do. But was tempted to go and try. This was my 4th visit to Yosemite and the first three times I did just a the lower falls and mirror lake that too in the summer when there was any water at all.\n\nThis time I went on Feb 19 when there was so much water and some snow. We had seen some reviews about the mist trail and it tempted me to try it, so finally decided we should do this time. Initially the trail was all clear so it was all good. After we reached the bottom of the vernal falls we decided to go to the top as it was only 1.5 miles. But when we reached there the trail was closed as there was a danger of rock falling due to the wet weather. So took the long trail to go to Nevada falls and from there to top of the vernal falls. The trail to Nevada falls had snow no defined trail at some spots. I was not prepared for that kind of trail due to my inexperience. Long story short when i did reach the top it was simply spectacular no words to describe the view from there and then the slight rain. Everything made it so magical and then felt every step and hurdle was totally worth to get there and experience that feeling.\nI took the closed oad to come down and it has 300 steps and clear path. This is good to come down as you can see the vernal falls through the path and u can feel the mist all through the way ..\nAmazing trail and everyone should do it atleast once when there is enough water in the falls.\nIf you are someone like me carry enough water and plan for enough stops and carry something to eat on the top you will feel hungry. :-)\nShow less"], ["Reviewed February 13, 2017", 5.0, "Moderate Hike, Worth The View!!!", "We visited Vernal Falls in late August and the weather at the time was wonderful. Not too hot, nice breeze. Right before the hike you get all these warnings about the hike itself and how heat can really go to you if you are not someone that hikes or you are not carrying enough water. Even though my husband and I do moderate hikes, we had to think about it for a few minutes before deciding if we were going to continue as we were not familiar at all with the area and the signs make you a bit concerned. After we decided we were going to continue, (checked our water supply, sunblock and hats) we started the hike. The hike itself offers gorgeous views along the way and plenty of opportunities for pictures. It was crowded that day and seems like that is the norm, but if you go early you may be able to beat some of the crowds. Once you reach the waterfall, you have different places where you can stop and admire the views. We were so glad we decided to give it a go, the views are worth every minute of the hike, which btw seemed moderate to both of us. If you visit Yosemite Park, I highly suggest you visit at least one of the waterfalls and in our case; we were very happy with our choice!!\nShow less"], ["Reviewed February 6, 2017", 5.0, "Great Trail and Waterfalls!!!", "This is one of the famous waterfalls and trails at Yosemite National Park. Therefore, it is crowded most of the time. It's a 3 miles (5 km) round trip hike to the Vernal Falls. The scenery is beautiful. The hike was rated as easy but the steepness actually makes it harder, especially with kids. The best time to visit the falls is in the spring between April-June. You can see other small waterfalls trickling along the cliffs while walking the trail. You also can get wet when getting near Vernal Falls.\nShow less"], ["Reviewed January 18, 2017", 5.0, "Great first attraction on the Mist Trail", "This is a nice introductory hike for Yosemite. It is a 3 mile return moderate hike to Vernal Fall. You can carry on up the John Muir trail to Nevada Fall but that is a lot further and harder going. The walk to Vernal fall is longer than the walk to Bridalveil Fall but it is worth it as it is a more enjoyable medium hike and the Fall is more impressive and you also get closer to it than you get to Bridalveil Fall. There are many great views all along this walk. It gets pretty slippy as you climb closer to the Fall obviously so be careful, but you can get some great photos here and if lucky you'll capture a waterfall rainbow!\nShow less"], ["Reviewed December 29, 2016", 5.0, "Amazing, but hard with 3 young children..", "We thought we were going on a 3 hour trek, it ended up being around 7-8. We continued to the top of the falls and went over the other side. This way we did't have to go down the steep steps again. Our kids were 4, 7, 9. It was hard work, but they did it and I would recommend it, just be prepared for a lot of stops and take plenty of water and snacks.\nShow less"], ["Reviewed December 29, 2016", 5.0, "Great moderate hike", "great hike to do with the kids. Final segment close in the winter. Spectacular waterfall views from the bridge."], ["Reviewed December 28, 2016", 4.0, "Sooooo much longer than we thought...", "It's beautiful. But a warning: it is much farther than it seems. Even if you have the correct mileage in mind (and we didn't -- our whole family (all four of us!) thought we saw a sign at the bridge saying it was just .3 miles to the top -- it was NOT), it will feel longer than expected. Why? The elevation, for one... plus the stone steps are STEEP (you are literally stepping up to the level of your knee -- so it's slow going). We were there in November and there was still a back-up at the narrowest part. I can't imagine how crowded it must be and how long it must take at that point during the summer.\nShow less"], ["Reviewed December 26, 2016", 5.0, "worth the hike", "For beginners it kicked our butt. Totally worth it though. Be sure to go all the way up to the top. Seems a lot longer than it is because mostly up hill."], ["Reviewed December 15, 2016", 5.0, "Loved the stone steps up!", "The hike includes alot of stone stairs...600 I believe. It was fun and especially since in the fall it wasn't wet! Lots of places to rest at the top with views of the water and the valley."], ["Reviewed December 7, 2016", 4.0, "The walk was amazing, but we turned back", "This is an amazing walk. Endless scenery. You can walk just under half way to the footbridge and see the falls and rocky stream or continue to the top.\n\nHOWEVER, do note that as of 6 December the mist trail is closed and you have to take the longer, steeper alternate trail. This is fine, but towards the top it gets very icy. I'd say 90% of people continued and made it with just hiking or running shoes. We had to turn back though as a past knee issue made slipping around on the ice too difficult. It was still 100% worth it though. You still see the falls from the bridge and there are endless breathtaking views of the valley.\n\nWe only had mild fitness and a knee issue, and while the hike was challenging it was not overly difficult. It's a very manicured path.\nShow less"], ["Reviewed November 29, 2016", 5.0, "Good Walk", "Easily accessible trail. Trail is about an hour to the foot bridge. Good place to rest and soak your tired feet, before heading up to the falls. Good scenery."], ["Reviewed November 16, 2016", 5.0, "Taking the steps up to Vernal Falls in the spring is an amazinrience you get totally wet with the mist", "The walk from the happy Isles Visitor Center in the hike up to Vernal Falls isn't really that long but it's very very Steep and you don't really see much until you get half way up to the top but it's an amazing view and once you get to the bottom of her and I'll Falls you will take pictures like you've never seen the Cascade is a solid wall of water and the water hits the rocks and it provides missed all the way up the trail make sure you bring lots of water and then if you're going in the sump in the early summer make sure you go up really early\nShow less"], ["Reviewed November 16, 2016", 5.0, "Wow... how many steps", "A must walk in Yosemite Great views of the valley and the falls are breath taking So so many steps, get fit!!!"], ["Reviewed November 15, 2016", 5.0, "Beautiful Falls with varying level of effort", "Parking is the most difficult part of this endeavor. The shuttle will deliver you to the start of the trail. However, if you drove, like we did, then you will have to park approximately 1/4 mile away and walk. The walk isn't too bad, but it isn't marked clearly so you may wander around for a few before you find the trailhead. Not too difficult, but a little frustrating.\nThe falls are beautiful. The best part of this hike is that you can decide how much effort you want to put into it based on how close you want to get to the falls. The Vernal Bridge is approx. .8 miles from the trailhead. It is semi-strenous (moderate effort) to get to the bridge. You will have a decent view of the falls from the bridge. If you are tired, you can turn back.\nHowever, if you are motivated (as we were) you can continue for another .5 miles to get to the base of the falls. This portion is definitely strenous. You literally climb rock stairs up the side of the mountain for a good portion of the trek. Experienced hikers won't have a problem, but definitely do not bring children under 12 years old! This isn't DisneyLand! There aren't any guard rails, hand rails, or esclalators here. It is worth effort though.\nThe entire endeavor only took about 1 1/2 hours. We scheduled two more hikes for that day, which we had plenty of time to do.\nOverall, this is a must see hike for Yosemite. Highly recommend it!\nShow less"], ["Reviewed November 13, 2016", 4.0, "Challenging Hike, Stunning Vistas", "A group of friends and I decided to hike to the top of Vernal Fall via the Mist Trail on the recommendation of a park ranger, and we're so glad we did! The trail itself is only moderately difficult (park guides have it listed as \"strenuous\") and very well-maintained the entire way. The first portion of the trail is a paved walkway with a decently steep incline. After you pass the footbridge, the majority of the trail consists of stairs that will take you to the top of the falls.\n\nAlong the trail, several beautiful lookout points exist. I recommend bringing a camera...the fun pictures you can take here are numerous! Definitely use caution along the trail once you get close to the falls, however; the granite stairs become fairly slippery.\n\nOnce at the top, the views are stunning! This is a good spot to take a break and have some lunch. There are some very friendly squirrels at the top who expect you to feed them, so don't be startled if they get close! From here, you can trek back down Mist Trail, or you can hike further onward towards Nevada Falls.\n\nThis is definitely a good spot to visit. If you really want to see the falls, check with a park ranger to make sure the water's flowing...during the latter parts of the year before snowfall, many of the falls are dry. Luckily for us, that wasn't the case!\nShow less"], ["Reviewed November 12, 2016", 5.0, "A great hike", "Strenuous trail to spectacular views. Although you can stop at a good view of the falls, it's worth hiking up to the top. Be prepared to share the path with other travelers and also to get wet as you approach the falls. The last section is a steep climb but doable (we are over 60). On the return trip, we hiked a bit higher and away from the falls to join the John Muir Trail back to the valley floor. It made a wonderful circuit.\nShow less"], ["Reviewed November 5, 2016", 5.0, "Moderate and beautiful", "This portion of the trail is very doable. One can go up on Mist Trail and come down on John Muir. We hiked in November and there were not too many people but I imagine in the summer this is pretty crowded."], ["Reviewed November 1, 2016", 5.0, "A great walk - well worth the effort", "Allow a couple of hours for this walk, we stopped for lunch at the footbridge as with family of 5 - some were more keen than others! The walk is fairly steep in places but the views the whole way are stunning, and the last section to the waterfall is amazing. Some great places to take pictures. At the end of it we were all really excited to have been to the top. Brilliant!\nShow less"], ["Reviewed October 26, 2016", 5.0, "Beautiful hike", "Beautiful falls and rushing River. Beautiful hike to bridge at bottom of falls or more difficult on up to top of falls."], ["Reviewed October 26, 2016", 5.0, "Great Hike and Beautiful scenery", "We hiked to vernal falls and it is a moderate hike. The trail is well kept and easy to hike on. It is a beautiful and very peaceful hike. We went early in the morning and the fog was over the valley which was very serene.\nShow less"], ["Reviewed October 23, 2016", 4.0, "Great hike", "Water was at a trickle but a great hike nonetheless. Want to revisit in the spring when more water is flowing."], ["Reviewed October 22, 2016", 5.0, "Stunning - worth the hike!", "The trail up to the top of Vernal falls and back down again took us about 2 and a half hours. This included stopping at the top and along the way to take photos.\nMake sure you wear sensible shoes as the section that goes from the bottom up to the top of the falls is a little challenging in places and you could probably fall or slip without appropriate footwear. Also make sure you take enough water and some snacks in case you need a sugar it. It is quite steep in places.\nI wasn't sure about going to the top of falls but I'm so glad we did. Your efforts will be rewarded by an amazing view!\nShow less"], ["Reviewed October 21, 2016", 5.0, "Very nice", "Its hard to classify any hike in Yosemite valley as less than exceptional, this one included. Note that this is a short hike, but it does have some rough rocky terrain to cover."], ["Reviewed October 19, 2016", 4.0, "Fantastic but you need nerves of steel to get to top", "One hell of a waterfall but getting up there is quite traumatic.\nIf you are not fit or are afraid of heights then don't risk it.\nIt may only be a 1.6 mile hike but as mostly uphill and the later stages up steep undulating steps it feels a lot longer. Make it to the top and you are rewarding with fabulous views and sense of achievement. I saw many people who had to give up which is a shame but at least you get views all along the trail. Make it to the lower falls then great but the next section is tough but you can see the main waterfall most of the way. Not for the faint hearted or young children I would say\nShow less"], ["Reviewed October 17, 2016", 5.0, "Worth the work to get there", "Wear good shoes and take plenty of water and a picnic to enjoy the falls for a while. Recommend taking the John Muir trail down. The paths are poorly marked."], ["Reviewed October 17, 2016", 5.0, "A nice hike with great views", "We followed t he Mist Trail to Vernal Falls. It was October so there wasn't a great deal of water but it was enough to thoroughly enjoy the experience!"], ["Reviewed October 13, 2016", 3.0, "Kind of boring", "Long hike for fairly ordinary falls in my view. Also the crowds in October on this trial were very large. All asphalt trial surface was hard on my knees as well. There are better falls and hikes at Yosemite"], ["Reviewed October 6, 2016", 4.0, "Popular waterfall and trail", "The Panorama Trail comes down past Vernal Falls and we observed the beauty from the top, side, and bottom. Even though water flow is reduced by early October, there was still a substantial amount of falling water when Yosemite Falls was dry. However, the Mist Trail had no water mist. Lower views of the falls are more spectacular than those from the top. In spite of our trek being all downhill, this is a steep trail with a lot of steps at irregular heights and slippery footing due to dirt on rock. Generally fit, my calves were sore for a few days following this descent.\nShow less"], ["Reviewed October 4, 2016", 5.0, "Worth the effort", "We hiked to the vernal fall by the panorama trail. We visited in October so the stream was relatively small but nevertheless worth the effort. It gives a nice scenic view from the top and during the hike."], ["Reviewed October 4, 2016", 4.0, "Steepish climb but lovely view of a dismissed waterfall", "For this walk/climb you need sturdy boots and in summer heat. lots of water. There is a rest room part way. You need to be reasonably fit and healthy as it is ascending most of the way. The last section is steps. You don't have to go to the top of the falls for your photo opportunity. There was water in the falls!! But not as much as in the film we viewed in the visitor centre!!\nShow less"], ["Reviewed October 2, 2016", 4.0, "Worth the effort", "Not an easy uphill hike but well worth the effort. At the end of the summer, Vernal Falls is one of very few places where you can find water in Yosemite Park."], ["Reviewed September 30, 2016", 5.0, "Incredible", "Hiked this enroute to Half Dome....def one of my fav's...the trail has earned it's name the mist trail from the Vernal Falls spray! Loved Loved this !!!!"], ["Reviewed September 28, 2016", 5.0, "Necessary Hike", "When visiting Yosemite valley our go to hike is to vernal falls. Walking to the bridge is a moderate hike uphill. Continuing to the top of the falls is a more challenging walk up 600 steps which are quite tall in spots. Regardless of which time of year be sure to carry lots of water with you.\nShow less"], ["Reviewed September 28, 2016", 5.0, "Be ready to walk!", "Be ready to walk, the walk up here is just amazing, you get to spend time as a family, talking , reminiscing and laughing! Its so beautiful you wont feel it. Get out there ASAP"], ["Reviewed September 27, 2016", 4.0, "Within reasonable walking distance", "For the young, you should go right up close - for others who are challenged a view from the footbridge will suffice. I am sure there is more water when the snow melts and it gradually diminishes during the summer. View with El Cap looks good!\nShow less"], ["Reviewed September 26, 2016", 5.0, "beautiful", "This took a lot of effort to reach the top - but so glad we did! I would list it as mildly strenuous - lots of climbing - but well worth the effort!"], ["Reviewed September 24, 2016", 5.0, "Awesome", "Beautiful hike to Vernal Falls. Falls was still running good. Was a moderate to difficult hike at times. The hardest part were the granite stairs toward the top."], ["Reviewed September 24, 2016", 5.0, "Medium difficulty but worth it", "The trail got quite busy around 12. Worth going a little earlier in the day as the climb can be unbearable in the heat. Really spectacular views after about 20 minutes."], ["Reviewed September 21, 2016", 5.0, "Nice Trek but Falls Was Not Like the PIctures", "I came here expecting to see some large falls but I guess it depends on the season because the waterfall was pretty weak. It was about a 2 hour trek (to and back). We started close to evening so when we were ready to climb back it was getting dark and we had to use my iphone for flashlight.\n\nThe hike isn't too strenuous and I recommend it, just go in the day, unless you bring flashlights. There are parts when you are inches away from the cliffs but be careful and you will be fine.\nShow less"], ["Reviewed September 19, 2016", 5.0, "ITS A HIKE...BUT SO WORTH IT", "HAVE KIDS? Ok so we brought our 6 year old and it took us about 3 hours to hike up to the waterfall. She was good and lots of people of all ages were doing it. THE WAY UP IS ALL UPHILL. There is a water and bathroom stop. You can stop on the way and enjoy the scenery...bring some snacks. It's defiantly a moderate hike be prepared. We only had a day so we did this first. A deer walked beside us on the road so that was awesome!\nShow less"], ["Reviewed September 14, 2016", 4.0, "Nice, but probably September is the wrong time...", "My wife and I are not in the greatest of shape, but decided to hike to the Vernal Falls footbridge. It's supposed to be a 0.8 mile walk, probably is closer to 1.1 miles, from the shuttle bus. We got to the footbridge, with a number of stops, but did not feel we could make it further. The view from the footbridge, in September, was not especially great. It looked like the waterfall was partially obstructed, though perhaps this is not an issue when it is flowing better. Many people got to the footbridge without any problem, and moved on to climbing to the top of the waterfall. For me, climbing to the footbridge in September was probably not worth it. Still, I feel it deserves a good rating.\nShow less"], ["Reviewed September 13, 2016", 4.0, "Lovely falls", "We were there during dry season in September, so there was not much water, but it was still spectacular. It is a bit of a hike on a hot Summer day, but well worth it."], ["Reviewed September 13, 2016", 5.0, "Beautiful Fall", "It's about 3 miles round-trip up the mist trail if you only want to get to the top of Vernal Fall and turn around. We visited in September, so the flow was less than it is in early summer, but it was still impressive. You can climb down some rocks to get closer to the waterfall, but be careful. There are a lot of steps, which were dry for us, but I read could be wet and slippery when the flow is greater.\nShow less"], ["Reviewed September 12, 2016", 5.0, "Beautiful fall, 3 miles round trip.", "It's about 1000 feet elevation gain to the top of the fall. Take shuttle from the valley to stop 16 and follow the direction and be prepared to climb up. (Nevada fall is about 1900 feet elevation gain.) Lots of steps during last half mile, be safe climbing and descending.\nShow less"], ["Reviewed September 8, 2016", 5.0, "Still gorgeous at the end of August", "These falls still had a beautiful flow of water even for the end of August. We were in awe of it's beauty and power, and really can't imagine how amazing Vernal Falls is during the spring. We must come back!!\n\nTips: You can park at the Happy Isles trailhead - just get there a little early to beat the crowds. Don't waste your money on a shuttle or a paid guide. We didn't use either our entire time at the park (5 days).\n\nTake plenty of water in a camelbak or hydration vest. It's very hot in the late mornings, afternoons here in the summer, so you will sweat. There are some water fountains before you begin the stair ascent, so you could refill a water bottle if that's all you had. My boyfriend and I take 3 liters everywhere we go just in case.\n\nDon't be like the dumb girls we saw, filling their water bottles up in the stream. You will get sick from bacteria and ruin your trip. Filter the water first.\n\nGo early - we started at 11 AM and paid the price. The trail was jammed with people the entire way, but we still enjoyed it immensely and got some amazing photos.\nShow less"], ["Reviewed September 8, 2016", 5.0, "What a hike!", "Wow! Just wow! I'm not an experienced hiker by no means but I completed this hike. My family and I ( 55,32,30,10,9 and 4 years old) are active people and would say in good physical shape but this was challenging. It took us about an hr of active hiking to reach the top. The Yosemite website states that this trail is strenuous and it definitely is. I would use caution in doing this hike if you have asthma or any prior medical injuries it took a lot of physical activity to complete this hike but it was doable. You are climbing up most of the time but at the end of this hike you reach vernal falls which is an amazing sight to behold. If you keep going a long this trail you can reach Nevada falls but we felt it was to risky for our young daughter and my mother in law. Towards the end of the trail the steps became big and shaky. If you have height issues this might bother you. I felt like going down was a little more strenuous on my knees because of the steepness and the momentum you gain in going down hill. ( trying to stop yourself from rolling) there is a bathroom located along the trail before the assent to the falls. No soup so make sure to have hand sanitizer. There was plenty of toilet paper though. The was a water fountain located right after happy isle bridge. Be sure to bring water and a light snack. It was all worth it!\nShow less"], ["Reviewed September 5, 2016", 5.0, "Great reward close to the end of Mist Trail!", "You can reach the waterfall by hiking on the Mist Trail. The views are quite impressive, and to top it off, after you pass the waterfall there is a nice lake were you can cool of after all the walking there1"], ["Reviewed September 4, 2016", 5.0, "Great walk though but scary", "We went up to both Vernal and Nevada falls. We never quite made it to the top.\n\nThe walls were great on well designed trials.\n\nThe steps up to the top of the Vernal falls are really scary. I didn't like them at all and they freaked me a little bit but I got to the top by doing a bit of scrambling.\n\nThe falls are both great sights and well worth the effort.\n\nYou should note that you c an go down the John Muir trail by the back route which I recommend to avoid going back down those steps which are scary.\n\nThis was a tough walk and you should have the right gear.\n\nThe views are spectacular which is something Yosemite specialises in.\nShow less"], ["Reviewed September 1, 2016", 4.0, "Beautiful falls after a moderate hike", "The hike up to Vernal Falls was a moderate one. There were a lot of families with children and we even saw a father pushing a double stroller. It is quite a walk uphill though, so we took a lot of breaks. The water flow at the falls was low in August, so it was easy to get close to the falls, and a lot of people went swimming in the pool under it. It was beautiful.\nShow less"], ["Reviewed August 31, 2016", 5.0, "Breath taking", "We have just completed our 2 week holiday on the west coast and this is a certain highlight. You do need a 'fair' level of fitness and decent trainers. That said, I did it (age 47 with a couple of extra stone) with several stops and yes, it is worth it. The view of the waterfall is beautiful and the surrounding landscape equally mind-blowing. Just do it!\nShow less"], ["Reviewed August 28, 2016", 5.0, "Amazing flow even in August", "Hiking to the top of Vernal Falls is strenuous. If you're up for the challenge, it is certainly worthwhile. The waterfall is beautiful, and it's fun to watch the young folks jumping off the rocks and swimming. The mist from the falls it's quite refreshing once you arrive at the top.\nShow less"], ["Reviewed August 25, 2016", 5.0, "Stunning", "We planned to do the moderate walk to the Vernal falls footbridge but then continued to the top of the falls. Mid way up we were rewarded with a view of the falls and a rainbow going across it! The latter part is a more strenuous climb, up a steep and narrow path but if you've plenty of water and take your time it is doable (my youngest was 10). At the footbridge there is a water refilling point. We had a great sense of achievement on reaching the top! In summer as this is one of the few waterfalls still running this is a busy spot but this didn't stop me enjoying this walk.\nShow less"], ["Reviewed August 23, 2016", 3.0, "Busy trail", "This trail is SUPER busy. It is mostly paved. Easy terrain, but a steady climb up. Take the mist trail around. Less people and slightly less steep."], ["Reviewed August 23, 2016", 5.0, "Inclined Walk!!!", "The hike going up to the fall is moderate but can be difficult once you are closer near the top. Be courteous to others and share the path or take turns. Once you reach the falls you'll be amazed how gorgeous it is, take some time by the fall and just be awed.\n\nThere was a lot of people when we were (August 22) and the fall had a little water gushing out but it's totally worth it going and seeing this amazing place. God Bless America!!!\n\nGo see this place it's amazing!!!\nShow less"], ["Reviewed August 23, 2016", 5.0, "Hiking to the top and camping was a remarkable experience", "I was lucky enough to hike and camp in Yosemite many times as a young man. My trip up to the top of the two waterfalls, spending the night sleeping under the stars, was memorable....now 40 years later!"], ["Reviewed August 21, 2016", 5.0, "Great views, glad we did it.", "We decided to see how far we could get as wanted to see a waterfall here in late August. Had read it was moderate to strenuous. We are not very fit but took it slowly - kids aged 11 & 9. We started out at 7am as up early with UK time diff and parked in trail head car park as early. It was a long uphill climb but we stopped regularly to take in the views and it wasn't busy. My son started moaning on the steep stairs but we pushed on and made it up to the top. All very pleased to have done it. Great views even in summer. Waterfall not huge in late August but still impressive. Go early to avoid crowds and walk in shade. We came back same way but it is steep on steps. Recommend if up for it even if not an athlete! It is steep and you will be puffing at times. Not recommended if medical issues or under about 7 as there are big drops and steep steps. It was very dry when we went so not slippery.\nShow less"], ["Reviewed August 20, 2016", 4.0, "Crowded in August", "Since the Yosemite Falls are dried up, this is one of two spots you are going to see running water. It's crowded and hot in the middle to later afternoon. I would suggest going as early as possible to take advantage of the cool and fewer crowds.\nShow less"], ["Reviewed August 18, 2016", 5.0, "Stunningly Beautiful and Very Crowded", "Vernal Falls is near the bottom of Yosemite Valley, it's about 2 miles from Half Dome Village and it's a gradual incline most of the way if you are coming from the valley. The paths are very well maintained, there are rest rooms and running water to fill your water bottle at the bottom of the falls area. A free shuttle will get you to Happy Isles bridge area and then it's about a mile up to the Falls. This is a beautiful area, it's also not a permit restricted area so to say it looks like Disney at mid-day would be accurate since it is packed with people. There are very steep granite steps, the terrain deserves at least sneakers. It would be very slippery when wet. Not everyone out there is respectful of nature, warning signs or other people so I would prefer to do this area of the trails very early in the morning when it is much quieter and much less crowded. Well worth seeing, just go early and then go elsewhere.\nShow less"], ["Reviewed August 17, 2016", 5.0, "Great place!", "Vernal falls is not really easy to reach, that's why it's mentioned in \"strenuous routes\". The Misty Trail is very steep, rocks are uneven, trail boots is a must! Be sure to head there with some hours of daylight ahead, as you don't want to descend this super-steep trail in the darkness. Also I wouldn't advise to go there with small children. Age 12 is ok.\nThe view is incredible! Don't forget to bring your swimsuit, as you can swim right under the waterfall!\nShow less"], ["Reviewed August 17, 2016", 5.0, "Combine it with Nevada Fall", "We went up Vernal Fall via Mist Trail, then Nevada Fall and down to the Valley via John Muir. Fantastic but very steep uphill. On the way down we struggled with the trail (sand was rather slippery). What a scenery!"], ["Reviewed August 16, 2016", 5.0, "Amazing place", "Bit of a trek but soooooooo worth it once you get to the top.\nGo carefully if its icy as the the path can be very slippery but the walk and the view was so worth its this is a must see and do if you visit yosemite.\nShow less"], ["Reviewed August 16, 2016", 5.0, "Its a tough walk but do it.", "To get to the top of the falls takes quite an effort but you have to do it. There are a lot of steps so its not for the faint hearted. The best views are actually from the bottom or half way up, so if you don't make it all the way don't worry. I told my brother about it and when he did it he saw a bear!\nShow less"], ["Reviewed August 15, 2016", 4.0, "Long & steep, but worth it", "Long & steep, but no real climbing until you get to the stairs at the base of the falls. I would have given this hike 5 Stars, but I'm not crazy about the paved trails in Yosemite.\n\nTake plenty of water, and snacks. The trail is moderately strenuous. Try to hit this one when cool. Saw plenty of older and younger people struggling.\n\nViews are outstanding! Loved feeling the mist as we approached. Worth the effort for sure.\nShow less"], ["Reviewed August 14, 2016", 4.0, "Great without tourist", "If you are in august there too many tourist who are in the trail and they goes slow and all of there are dump so you have to wait so much."], ["Reviewed August 10, 2016", 5.0, "sweat, broken bones and tired muscles.....", "I took this walk on with my wife and two daughters (aged 6 and 9). The initial climb is a little steep compared to the valley floor but that is the easy bit!\n\nThe climb up to the first bridge (inc toilets and water stop) is shaded for half of the length and is very pleasant.\n\nAfter the bridge, the climb gets a lot steeper and a lot narrower. There is one more stop before the top where you can take great pictures of the falls and the inevitable rainbows that it creates. At this point, it is steps all the way and quite narrow.\n\nThe last part is aided by railings and you should push on for the jewell at the top; the view of the falls and the cold water which you can swim in (we went in Aug when the water level is low and the flow is slow (non existent) - DO NOT ATTEMPT TO SWIM DURING HIGH FLOW LEVELS OF THE RIVER.\n\nThe walk down is a lot quicker but can be a little hard on the joints.\n\nOverall stats are: under 2 miles to the top of Vernal Falls and approx 400ft elevation climb. Took slightly under 4 hours pushing the kids hard up the walk in 80 degree heat.\n\nAlthough it was tough for them, my 6 and 9 year old managed the whole climb with numerous stops. They even got nods of acknowledgement and praise from a lot of the adult walkers who were struggling.\n\nAn outstanding walk in an outstanding area. Be aware that the walk from the bridge is stepped and covered in sand - it can be VERY slippy underfoot.\nShow less"]]}}