{"VillageFest": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "VillageFest", "url": "/Attraction_Review-g32847-d156985-Reviews-VillageFest-Palm_Springs_Greater_Palm_Springs_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/01/e0/47/farmers-market-along.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1464"}, "address": {"@type": "PostalAddress", "streetAddress": "Palm Canyon Drive between Baristo and Amado Downtown", "addressLocality": "Palm Springs", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 4.0, "a fun night market set up on Thursday evenings", "It was a great place to peolpe watch and check out the many booths selling everything. most items were as pricey as the stores so we \"window\" shopped."], ["Reviewed 2 days ago", 4.0, "Palm Springs comes to life on Thursday Nights", "About 5 blocks of downtown Palms Springs on Palm Drive are closed to traffic after 6pm. There are street vendors and most stores stay open. Lively bar scene and street musicians create a festive atmosphere."], ["Reviewed 3 days ago", 4.0, "NIce Night!", "Had a great time walking, eating, listening to music, and shopping at the tents. Great way to spend the evening!"], ["Reviewed 4 days ago", 5.0, "So fun!", "Great vendors, lots of fun. Amazing food choices! Highly recommend ensuring you go if in Palm Springs when it’s on."], ["Reviewed 5 days ago", 4.0, "Join in a Palm Springs Tradition", "Thursday night is Village Fest.\n\nTourists and locals alike enjoy the comraderie and there is something for everyone.\n\nFood, art, music, farm fresh fruits and vegetables, greeting cards and even spiritual guidance are part of the festivities.\n\n\nThis makes downtown Palm Springs a Thursday night destination.\n\nIt’s a street fair. It is a tradition!\nShow less"], ["Reviewed 1 week ago", 3.0, "Canadian in Palm Springs", "Not what was expected from tales of others' experiences. Was hoping to see buskers walking the streets entertaining visitors and a steady stream of a variety of performers at the street corners. Sadly there were no wandering buskers and it was the same performers all evening. No signage to indicate what particular vendors were in what area. For example, had we known that a quick turn would have taken us to the food vendors, we would have enjoyed their offerings instead of eating at an established restaurant. Far too many vendors with same or similar products (jewellery, soap and CBD oil). Appreciated the artwork vendors but limited luggage space so not able to take any pieces home. Parking was not an issue - Parked across the street from Spa Resort & Casino and had no problem finding an available space. Now that I've been there, I would not go back\nShow less"], ["Reviewed 1 week ago", 3.0, "Street Fair", "I’ve been going to the street fair for several years whenever I come to Palm Springs for part of the winter. Most of the vendors are the same ones each year and if you are just visiting once, that’s fine, but gets somewhat boring if you visit each week. And finding parking is like winning the lottery you show up late.\n\nHowever, it’s a wonderful atmosphere and gives a sense of what a medieval market would have been like. Worth the visit and try the College of the Desert market on Saturdays and Sundays.\nShow less"], ["Reviewed 1 week ago", 5.0, "Enjoyable evening", "Fun evening of walking & shopping over 4-5 blocks of downtown Palm Springs. Had a great meal after viewing all the booths."], ["Reviewed 1 week ago", 5.0, "a must see Thursday night tradition", "we always make sure our trip includes Thursday stay so we can visit what we call as street fair. Lovely to walk the strip in the evening and experience the sights, sounds, smells. Such tasty treats and wonderful friendly vendors, happy to talk and answer questions. This year found 2 men with four eyes card vendor and happily purchased several seasonal cards. My husband found a one of a kind leather bracelet purchased for the artist himself who spent more time than necessary making sure the bracelet was just the one that worked. don't forget to venture down the side streets and take in the fresh farm goods, discovered a ne vegetable we hadn't tried before and lovely dates, avocados and cranberries\nShow less"], ["Reviewed 1 week ago", 4.0, "Great Evening to Just Walk Around", "You may have to park a few blocks away but it is well worth it. Not that you need to spend a whole lot of money. They have food vendors, crafts, art and odds and ends."], ["Reviewed 1 week ago", 5.0, "Palm Springs Village Festival", "One of the fun things to do in PS on Thursday Evening is going to the Village Festival. S. Palm Canyon is closed down from several blocks. There are all kinds of booths, so fun to browse through. There are food booths and the restaurants are open. In addition to shopping the booths many stores are open.\nWinter months are 6:00 til 10:00 and summer months are 7:00 til 10:00 (due to heat).\nShow less"], ["Reviewed 1 week ago", 4.0, "Impressive", "This is worth checking out, it seems to go on for a mile with a huge variety of stands and even a farmer's market"], ["Reviewed 1 week ago", 5.0, "Wonderful Wander", "Music. Food. Arts. Block after block of booths with different and interesting wares. We didn't buy much, but enjoyed walking along, watching so many people out enjoying themselves."], ["Reviewed 2 weeks ago", 5.0, "Fun evening outing", "Thursday evening 6 tom10 pm. Lots of vendors. Lots of food to try or sample. Jewellry and tourist souveniers and art. Enjoy evening downtown."], ["Reviewed 2 weeks ago", 5.0, "Enjoy the Sights and Sounds", "This was my third visit to this weekly event. Lots of unique gift ideas, tasty food, great entertainment. Makes for a great evening stroll with an exciting vibe! Came away with a few treasures to take back home."], ["Reviewed 2 weeks ago", 4.0, "Fun and lively Thursday night", "Palm Springs is very quiet during the week, but comes alive on Thursday night. Although there wasn't anything original in terms of vendors, the crowd and the energy definitely make it worth it!"], ["Reviewed 2 weeks ago", 4.0, "People watching!", "If you haven't been it's mostly about the people. There are lots of booths with interesting things to buy and yummy food booths, but mostly it's just fun to see who's there and wander about. Pet friendly and kid friendly entertainment."], ["Reviewed 2 weeks ago", 5.0, "Great street fair especially if you're visiting!!", "Love this street fair!! This is the 2nd time I've come while in Palm Springs and it's always a great place to shop for things you might not ordinarily find elsewhere and to eat.\nThere are about 5 full blocks of shopping vendors that range from selling handmade jewelry, to art, to handmade soap, and unique things for animals.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Cool and safe place to see lots of unique crafts and cool collection of people!", "If you don't like crowds, pass on this. But if you want to see a side of Palm Springs that is real ... this is one way. Plus all the restaurants are open when you get hungry."], ["Reviewed 2 weeks ago", 5.0, "Fun", "Great way to spend a Thursday evening in Palm Springs. Walk up and down for blocks checking out endless booths full of all kinds of neat things music and food at every turn. Thanks Palm Springs for having this market truely a fun time in the desert\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun and some beautiful art pieces", "i was looking for my car and just walked right in to village fest. just the right amount of vendors and people. felt very clean and fun talking with other people , listening to live music at diff spots along the way, and many diff opportunities to stop and chat with vendors who where there from diff areas. many pieces and vendors i haven't seen before being from oakland, ca, prices varied from low end to high end. interesting and creative pieces. plus all the restaurants where open as well which gave it a nice feel.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Crowded", "Very busy with lots of vendors in a small space. Overall recommend the desert faire at Palm desert, many of the same vendors but more space."], ["Reviewed 3 weeks ago", 4.0, "WOW!", "Everything imaginable & great food choices! Fun thing to do on a Thursday night. We were visiting & staying a Hotel California. Maria told us we could catch the \"Buzz\" for free & enjoy the nice evening & have a lovely dinner. She was right! Don't miss it if you are in town.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "\"Enjoyable Evening, lots to see\"", "A very pleasant evening walk along the street with a host of vendors selling their products. It is nice to venture along at your own pace seeing the many different items available to browse through. There are a variety of food options along the way which wets your appetite. We stopped by the gentleman selling corn on the cob, baked potatoes and yams. Very very good. They have a few musicians busking on the street corners which was nice to see and listen too. Many artists, jewelers, date vendors. It is a nice evening option.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "Good reason to get out on a Thursday night", "A fun walk on a Thursday night. Great for people watching. Various vendors selling their wares. I was expecting more local music. There was none."], ["Reviewed 3 weeks ago", 4.0, "Thursday Night Fun!", "When we're in Palm Springs, we always look forward to Thursday nights on S. Palm Canyon Drive where the VillageFest takes place. Lots of interesting booths to check out, live entertainment and food too!"], ["Reviewed 4 weeks ago", 2.0, "Cheesy street fair", "Mostly food vendors with some sparse few art and jewelry vendors which were not all that great. Go if you are craving kettle corn."], ["Reviewed 4 weeks ago", 5.0, "Must Experience!", "Every Thursday night they close Palm Canyon for a few blocks and keep all shops open. There are tent vendors in the streets and local music on every corner! All kinds of art for sale and to experience, as well as food. The Two Guys With Four Eyes greeting card tent was my favorite.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Typical, not exceptional", "This was very typical of street fairs, people hawking their creations and products, different foods to snack on and buy, musicians entertaining. It was nice to do at night by lights, which was still warm to me, even in January (in Palm Springs)."], ["Reviewed 5 weeks ago", 5.0, "Thursday Night out", "Very pleasant evening walking around. Arrive early to get a good parking spot. 3 year old enjoyed looking at all the sights. Something for everyone in terms of diversity of vendors. All the stores stay open as well."], ["Reviewed 5 weeks ago", 4.0, "Fun evening out", "We were told that this was a 'must see' by lots of people so we decided to go along. It was ok. There were lots of stalls selling all different things. The food stalls were good as well. You probably wouldn't want to spend more than a couple of hours max there. It is family friendly.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Family night out at the Village Fest", "We've been to this twice (always on a Thursday night) and it was great fun both times. My wife, mother, and kids all love something about it. Whether its the outdoor downtown shopping, the sidewalk sales, the food vendors or the live music -- its free and worth the walk!\n\nParking is available in local parking lots and side streets for free. Lots of police out on foot and bikes to make sure everyone stays chill, which is nice.\n\nGrab a beer or wine and walk the entire 8 blocks or so, grab a burrito and find a place to sit on a bench and relax. Or shop....\nShow less"], ["Reviewed January 22, 2018", 3.0, "Village Fest, only so so", "We were expecting a lot when we decided to check out village fest, Palm Springs downtown is a fun place, lots of stores and restaurants...The Fest itself was packed w/people but the things offered were very repetitive and not what we expected. Lots of same usual cheap stuff with a few unique booths, but very pricey for what was offered. Not much for food item booths, but lots of ready to eat Carny food....Would recommend College of the Desert Street Fair for more unique shopping....But the downtown area is still a fun place to be, esp. on weekends!\nShow less"], ["Reviewed January 22, 2018", 4.0, "A must see at least once", "Go hungry because there are a bunch of food stands. Great night out for a walk and a good place to pick up a few souvenirs. It is very busy so go early for free parking."], ["Reviewed January 22, 2018", 4.0, "Lots of fun!", "A lovely event on Thursday evening. Lots of interesting crafts, jewelry, clothing, and food. It’s fun to people and dog watch as you stroll along the street. All of the shops and restaurants are open as well. There is something for everyone."], ["Reviewed January 21, 2018", 5.0, "Always something new to see", "Every Thursday the Village Fest on Palm Canyon Drive is worth a look. We always go out for an early dinner and then hit the Fest at 7 pm. Rain or shine it goes ahead and the art, street food and the creations from very talented artisans. It is a lovely stroll as the weather is almost always perfect in Palm Springs.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Never disapoints", "During winter season, Village Fest is a must experience as a visitor or a resident. Full of amazing vendors from sweet popcorn to amazing local art. Always music along the route, food vendors of all types, bring your dog on a leash. Palm Springs PD always present for security.\nShow less"], ["Reviewed January 19, 2018", 5.0, "Lots of Good Street Food, Lots of Street Vendors", "A Fun Place to take visitors or just to get out of the house on a Thursday Evening. Good Exercise, Good Food, fun Trinkets."], ["Reviewed January 19, 2018", 5.0, "Art and Other Things That Aren’t Art", "Come for the jerky and popcorn and stay for the one of kind creations. It’s gets busy but you’ll want to take your time anyway if your into craftwork and whatnots. Not into crafts? What about food and free samples? Independent musicians? Guys that throw brightly lite toys in the air? Yep. Those are also present. I spend $100 on jerky every visit. I just do.\nShow less"], ["Reviewed January 15, 2018", 3.0, "Not Much Special at Village Fest", "Disappointing experience last week at Village Fest. Mostly low-quality, over-priced prepared foods, goods and \"art work\". Parking is a problem, and the crowds were a bit overwhelming for a small town. The street was kinda dark, and one patron stumbled on a curb or sidewalk.\n\nI did buy some excellent raisins, dried apricots and Medjool dates from local growers at very competitive prices. I highly recommend International Dates R Us & Sons at the Village Fest.\nShow less"], ["Reviewed January 13, 2018", 2.0, "Meh", "While it was fun to mingle with the crowds, the offerings were of low quality and mostly overpriced."], ["Reviewed January 12, 2018", 5.0, "Don’t miss this six blocks stroll", "Every Thursday night from sundown this event closes the main streets for six blocks and local vendors line the streets selling fresh food and crafts. Lots of fun and I love buying the multiple choices of Pistachios."], ["Reviewed January 11, 2018", 4.0, "Great to visit", "I always tell my customers to come out and check this place out at least once it’s something to do and something to experience in Palm Springs you have a lot of vendors and restaurants and also bars close by . Thursday nights check it out!\nShow less"], ["Reviewed January 11, 2018", 4.0, "Crowded but fun", "Part of the downtown Palm Springs experience. Quite crowded, come early. Great things to buy...good food...music."], ["Reviewed January 10, 2018", 5.0, "FREE- Must Do Thursday NIght, Free Museum too", "This is a great street fair to wander around and check out some of the local wares. It does have some of the typical street fair junk, with some unique items sprinkled around.\n\ngo to the museum too, since it's open and free the same night.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Every Thursday night. Nice walk. Lots of vendors", "Found out about this at the visitor center and since we were staying nearby, we visited this festival. It's every Thursday night from around 6-10pm. Lots of vendors, all shops along the strip all stay open extra late creating a good atmosphere. Don't forget to visit Art museum and Architecture Museum who are free on those night as part of the festival.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Fun Evening Stroll", "Fun stroll on Palm Canyon Drive. Lots of local artists, food vendors, entertainment. Tourists and locals alike."], ["Reviewed January 9, 2018", 5.0, "Great Festival", "Really enjoyed the festival, but I’d suggest getting there early, as it really does get crowded. A lot of different art to see and buy."], ["Reviewed January 8, 2018", 5.0, "Fun Time", "Lots of amazing artisans to check out, food trucks and you can pit stop at pubs along the way for a sip or two."], ["Reviewed January 8, 2018", 3.0, "Great people watching", "Not a huge fan of the merchandise for sale, but the people watching is awesome. More dogs than the Westminster dog show!! Get a table outside at a restaurant and have dinner while watching the show."], ["Reviewed January 6, 2018", 5.0, "Great variety", "What I liked about this street fair was the variety of booths. I've been to many where there is only food, or just very few booths. This street fair was lively with performers, food, pets, art, massage, holistic oils, soaps, and more. It was definitely worthwhile. I recommend walking through just for the experience of it, if nothing else.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Most people will find something here to like.", "On Thursday evenings they block off a good portion of Palm Canyon and have street vendors. Some are genuine artists, but beware of cheap imported items passed of as arts and crafts. The food smelled good! There was a guy playing the guitar singing songs with insulting lyrics, don't expect he got many donations. It's a fun family event, you just have to be careful what you buy.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Fun", "This is a fun evening with many local artists and great street food. The tamale guy offers some amazing tamales is many different flavours. We also tried some tacos which were delicious. Definitely worth the visit."], ["Reviewed January 2, 2018", 5.0, "Way to spend a Thursday evening!", "Attended village fest on 12/28. An amazing street fair several blocks long that features food, arts, crafts, music and great people AND dog watching! Several musicians playing along the streets from singers to pianist, to cellist, to you tube sensations!!\nArts included jewelry, leather works, paintings, clothing, candles, soaps and metal work.\nHighly recommend you go when in Palm Springs.\nAlso a great way to support local artists and businesses\nShow less"], ["Reviewed January 1, 2018", 3.0, "Street fairs are going downhill", "I've been coming to Palm Springs for 25 years for the holidays. This street fair used to be a lot more fun and interesting. The \"crafts\" for sale are nothing special. There is no vetting of who is going to provide the live music and most of it was unbearable. I will not return\nShow less"], ["Reviewed December 29, 2017", 3.0, "just another local street fair", "actually it was kind of annoying as we just wanted to check out the shops and their were vendor tents and people (and their dogs that they weren't paying attention to) everywhere. Push and shove... Same old stuff, different location, granted it was \"local stuff\""], ["Reviewed December 29, 2017", 4.0, "Vibrant and Festive", "This is a fun venue for an evening of walking downtown, checking out all the funky vendors and just people watching in general. This market has a little bit of everything from cheap, really bad art to higher quality jewelry and food items. Definitely worth checking out on a Thursday night.\nShow less"], ["Reviewed December 27, 2017", 5.0, "Entertaining Evening Street Market", "The Village Fest is an enjoyable way to spend a Thursday evening strolling through the artisan market stalls and listening to the different entertainment. There are many food stalls along the way too but also many restaurants are located along the street. Many of the stores along the street stay open for the evening but go to them earlier before the market starts at 6:00 so that you won't be rushed. Head to Shanghai Reds for dinner after you are finished for excellent food and entertainment. They have wonderful fish tacos.\nShow less"], ["Reviewed December 22, 2017", 5.0, "Great Night market", "lots of great vendors like organic fruit/nuts/herbs, jewellery, pottery, wood & leather crafts. Hot food vendors and so much more...."], ["Reviewed December 21, 2017", 5.0, "Not our first visit... and definitely not our last!!!", "Always a good time, whether we enjoy the local eateries or eat our way though the many street vendors, it’s always fun, plenty of entertainment, great food and great artisans. A must see on Thursday evenings in Palm Springs"], ["Reviewed December 19, 2017", 4.0, "Loved this!", "Plan on being in Palm Springs on a Thursday and make a point of getting our to this event! Palm Canyon drive is closed to cars and vendors set up their stalls on the street. Enjoy lovely samples and view local artisans' works, crafts and produce. It's fun and the stores are open too!\nShow less"], ["Reviewed December 17, 2017", 4.0, "Street Full of Options", "We were to be in Palm Springs for only two nights and were so happy that one of them was Thursday, the night of the weekly Village Fest. Shortly after 6 pm. on the last Thursday of November, we became part of the swelling crowd of shoppers at the Street Full of Options. We had read about the Village Fest and thought it might be a fun way to spend an evening, we were sure right.\nThe vendors were of a wide variety and this was a big help to our Christmas shopping.\nOne recommendation, arrive early and you should have no problem finding parking in one of the free area lots or on street parking.\nShow less"], ["Reviewed December 14, 2017", 3.0, "Busy", "Pricey and busy with a lot of strollers and dogs. Seems like most aren't shopping, just strolling along slowly talking in groups."], ["Reviewed December 12, 2017", 5.0, "Thursdays are my favorite in Palm Springs!", "Hanging out at the village fest on Thursdays is the best thing to do in Palm Springs. Everyone is out and about, all the restaurants are open and the vendors are the best. The entertainment is fabulous and even the street food is good. It was wonderful seeing everyone walking their dogs down the street and taking the time to chat with strangers and mosey through the stores and booths along the street. We like to go to the Copa for the Lipstick show after the street fair and it makes for a perfect evening.\nShow less"], ["Reviewed December 9, 2017", 5.0, "Always a good evening", "The Thursday night Village Fest is always fun. There are plenty of foods and interesting vendors. It attracts a good crowd"], ["Reviewed December 8, 2017", 3.0, "Mediocre Crafts", "Quite a few imported crafts seem to have taken over this market - though I refrain from calling them junk. It’s a nice way to spend a couple of hours, but we did not see anything that appealing to buy in the way of crafts. The small street section selling vegetables has great deals on fresh dates, and that’s where we spent our money. A box of new harvest Medjool dates was $28 for 11 pounds - and they are delicious! Nice local musicians and food stalls, there seemed to be quite a few empty booth slots the night we went.\nShow less"], ["Reviewed December 7, 2017", 4.0, "A street fair-held every Thursday evening from 6 pm on Palm Canyon Dr", "Music, food, dance, restaurants ,bars, vendors selling every ethnic food, clothing, fresh produce - the atmosphere is cheerful and great for families with children or couples who just want to enjoy a evening in downtown Palm Springs. You can find solar power vendors, find time share opportunities, the list goes on and on. The Buzz is available to take you around downtown from Thursday to Sunday. I always buy my dry dates for my Christmas cooking as their prices can not be beat. Wear good walking shoes and keep a smile on your face. This is a must stop when you visit Palm Springs.\nShow less"], ["Reviewed December 7, 2017", 3.0, "Not up to much!", "This is billed as one of the \"not-to-be-missed\" events in Palm Springs. I guess that as a European, I am accustomed to better!\nI last visited the VillageFest four or five years ago and on my most recent visit, saw that little had changed since then. In a way, I guess that is a good thing. However, it is more a curiosity than anything else.\nThe locals seem to enjoy it and some of the tourists, which I guess is the object of the exercise.\nLots of fruit, vegetables and other local produce available at the farmers' stalls.\nAs for the so-called \"craft\" section, again I guess its \"folksieness\" appeals to some, but it's not for me!\nThere is some entertainment, too - again if you like that kind of thing!\nGetting to Palm Canyon Drive is easy as it is pretty central. Walk if you can, because the parking area fills up fast.\nShow less"], ["Reviewed December 4, 2017", 5.0, "Loved the Thursday night Street Fair!", "If you are in Palm Springs on Thursday make sure to visit the Street Fair/Village Fest! Great vendors with crafts, food and unique items. Very nice family atmosphere! Parking was easy! If you go, go early to avoid the rush but stay all night! Loved the live music, there was a marching band competition there the night we were there! Fun Fun time!!\nShow less"], ["Reviewed December 4, 2017", 5.0, "Thursday Night is VillageFest", "This is a 'must do' when you are in Palm Springs. Before the Christmas holiday, all of the vendors are in town and you can shop, buy one-off things and eat your way along Palm Canyon Dr. with NO traffic. They block off the traffic from around 5:00 pm to midnight.\n\nIt is a wonderful way to spend a Thursday night. You can always eat at one of the stalls selling food on the street or you can eat in one of the restaurants on Palm Canyon Dr. There's much choice and it's all very good.\n\nIt's easy to spend $$$ and I did. There are many stalls selling organic cosmetics such as olive soap, creams, exfoliates, etc. and I'm a sucker for such products. I also bought a beautiful dragonfly and a butterfly from a woman who hand makes them. I had previously purchased a hummingbird so now I have everything she makes. They can decorate your tree or just hang from a hook and look beautiful as they do in our rental apartment.\n\nThere's also a Farmer's Market area where you can buy fresh produce, dates, licorice, bread, jerky, kettle corn, etc.\n\nThere were also about four different performers along the street that were all pretty good which makes walking even more entertaining.\n\nYou cannot have a bad time going to VillageFest on a Thursday night. You have not been to Palm Springs until you do. Go, have fun and circulate some $$$.\nShow less"], ["Reviewed November 27, 2017", 4.0, "An interesting evening", "A pretty long street fair, you can find just about anything food or craft wise. Entertainment on a couple of the corners. Very well organized, everyone seems relaxed and enjoying themselves. Mix of ages. Only drawback is parking, it fills up fast."], ["Reviewed November 22, 2017", 5.0, "Fun time!", "So much to see. Great walking experience from a farmers market to great pieces of art to music and good food. If you are in town on a Thursday don't miss this event"], ["Reviewed November 21, 2017", 5.0, "A great outdoor event!", "Once you find parking the rest is all terrific. So many vendors of local art, jewelry, food.. Street performers. Seems to always be well attended. Palm Springs humane society sells great shirts...Shops stay open so something for everyone. Stop and eat from the street food vendors or pop into the restaurants and bars that stay open.Make sure your visit includes a Thursday night so you don't miss out.\nShow less"], ["Reviewed November 20, 2017", 5.0, "A nice stroll downtown", "It's Thursday and you wanna go out well the Villagefest is worth the time. All kinds of booths, food and drink. Keep in mind that it is a street fest so very easy to pop in to any establishment for a seat, drink and a bite if you don't find what you like on the street.\n\nFun!\nShow less"], ["Reviewed November 19, 2017", 4.0, "Lots of fun!", "So many great vendors, people watching and street performer- great food too! Stores open late great for souvenir shopping or just having a look!"], ["Reviewed November 18, 2017", 4.0, "Week with fam", "This is a typical street fair.. lots of vendors and activity.. we visited vendors.. ate at restaurant and resumed shopping"], ["Reviewed November 18, 2017", 5.0, "A Favorite Thursday Evening PS Activity", "Thursday 7 to10 PM roads are closed and they are filled with vendors and people walking. Start at the PS Art Museum which is open and free for the evening and park for free also in the parking deck. Then walk Palm Canyon Drive and delight in all the crafts and items for sale. Taquitz Canyon Road has a farmers market with fresh local produce for sale. Right now, get the dates. Barhi dates are extra special and not available everywhere. Best price at the farmer's market! Restaurants also open.\nShow less"], ["Reviewed November 17, 2017", 4.0, "Very nice", "Lots of shops with food and other sorts of handmade things☺️ live music. Lot of people. Went There on a thursday."], ["Reviewed November 17, 2017", 5.0, "The Street Comes Alive", "Great night last night on the Street.\nIt’s closed through the town and all becomes pedestrian.\nLots of Local Art- And Produce.\nThe shops all stay open and wandering Oman Out is very attractive.\nI spoke to 3 shop associates and the Towns got a Great History ( As We Know) But You Get a Few Private insights to The ⭐️’s that come in.\n\nThe Psychic was my main attraction.\nHer property was the first to be built on the Road (Allegedly) And was used as an information centre.\nIronically is still used as an information centre to people’s Past -Present and Future.\nShe’s also an interesting person.\nMind You All The People I spoke to On the stalls are interesting.\nStop off and See For Yourself.\n\nShow less"], ["Reviewed November 15, 2017", 4.0, "Good food", "Plan your Thursday evening to attend the village fest. There is a variety of street food options and one can use the Buzz (bus) to travel there for free - a fun outing for the entire family!"], ["Reviewed November 11, 2017", 4.0, "Love villagefest!", "This is something that the whole family can enjoy. It is downtown so the stores and restaurants get a lot of people inside too. Smart to have it on a Thursday night since there generally not much to do."], ["Reviewed November 9, 2017", 5.0, "Enjoyable regular Thursday night event in Palm Springs", "VillageFest is a regular event scheduled on Thursday nights in downtown Palm Springs. There maybe around 200 boothes with all sorts of products and services. There are several food boothes and many boothes offering unique items for sale. A lot of people come for these Thursday night events. It is a lot of fun just walking around and checking out the different items on display and for sale. There is also some musical entertainment available on the street. It’s a great place to get out and mix with people and enjoy life.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Surprise visit!", "Visited here on our one night stop to palm springs. We were driving to dinner and wondered why all the roads were being shut, upon doing some research found out why! A lovely little selection of stalls and entertainment! There were lots of people and no where to park but seems like a good thing to happen for the town! :)\nShow less"], ["Reviewed November 9, 2017", 2.0, "Ordinary", "Blocks and blocks of booths with really nothing of interest. Downtown was packed with tourists which must keep it going."], ["Reviewed November 8, 2017", 3.0, "Nice evening", "As a resident I tend to go when we have guests in town. This is a local, regular event. It takes place every Thursday evening. The street is closed to traffic and you have the chance to walk, shop, and eat at the various vendors. It's a nice way to spend an evening with friends or family but not something you might want to do each and every Thursday evening.\nIf you drive you'll need to park on a side street. It can be a challenge but do able.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Do not miss it.", "If you are in Palm Springs on a Thursday you have to go to the village fest. Food,art and jewelry.say no more"], ["Reviewed November 3, 2017", 5.0, "Great place to be on Thursday's", "Every thursday night since the days of Sonny Bono as mayor, this is a fun experience to wonder down the main downtown avenue and see the stands of food, gifts, art and souvenir's. Great fun and great food to be had."], ["Reviewed October 31, 2017", 5.0, "Fun, colourful weekly event", "100's of vendors on display up and down 3 blocks (approx) of Palm Canyon Drive and some side streets, in downtown PS. From food to arts and crafts, musicians, and a huge assortment of products and services being demonstrated, this is a fun/enjoyable hour or two to spend. And you can always take a break in one of the many restaurants, cafes, bars along the street. Lots of police on hand so you feel pretty safe.\nShow less"], ["Reviewed October 31, 2017", 3.0, "Fun evening!", "Nice way to get out on a Thursday night, check out the vendors and catch dinner at a restaurant. Very laid back and relaxing."], ["Reviewed October 29, 2017", 5.0, "Make Sure You Have Time!", "We only had 90 minutes to stroll through the market. It was fantastic but not enough time. Since it was late October, lots of Halloween themed items, treat, gifts and costumes! Worth going in October...we will be back!"], ["Reviewed October 28, 2017", 5.0, "VillageFest Palm Springs", "Definitely worth a visit on Thursday night if you are in Palm Springs. Main Street downtown shut down to car traffic. Pedestrian traffic only. Lots of vendors and shops open. Take the BUZZ bus for free. Don't try to park. Bus stops everywhere. Parking is horrible to find. We loved it. Slow stroll up and down the Main Street. Good deals on local stuff. A nice evening out.\nShow less"], ["Reviewed October 21, 2017", 1.0, "Hippie Fair", "Boomers will think the macramé hangings & pot-scented honeys are cool. Everyone else: Run for your lives. BTW: Don’t park at the Casino; they tow. Unfortunately, I’ve not been given an option of zero."], ["Reviewed October 20, 2017", 5.0, "A great way to spend a warm Thursday evening", "Great atmosphere and well organised, parking can be a challenge. Lots of interesting things to browse/buy/eat!"], ["Reviewed October 20, 2017", 5.0, "Truly a Fair", "Wide variety of vendors, minstrels, musicians and foods. Found a number of unique household and gift items."], ["Reviewed October 20, 2017", 5.0, "Great Experience", "Such a fun, pleasant evening. The exhibitors were exceptional. Lots of good food. Everyone was really friendly. Pet friendly too. Great for everyone."], ["Reviewed October 19, 2017", 5.0, "Fun night!", "This street fair is held every Thursday evening starting at 6 pm. Lots of food vendors plus art, jewelry ,clothing etc. You can eat from a vendor or choose from one of the many restaurants on the street. Lots to see and do."], ["Reviewed October 17, 2017", 5.0, "We did our Christmas shopping at this fair. Might need another suitcase to carry all the neat stuff back home.", "We did our Christmas shopping for 2017 at this fair. Might need a new suitcase to carry it all home!"], ["Reviewed October 16, 2017", 5.0, "Thursday nights", "A great place to wander on a Thursday night. Not only are all the stalls offering different products but the stores also stay open. You can do all the shopping you want on a Thursday night. Plus there is food & entertainment."], ["Reviewed October 14, 2017", 4.0, "Fun!", "Great way to spend an evening--- safe, unique shopping, many food options, lots of great people-watching, pet friendly!"], ["Reviewed October 13, 2017", 5.0, "Thursday night must do!!", "Loved walking around after a nice dinner and looking at the artisans and booths During village fest. Food and entertainment galore and people watching make this a great Thursday evening out in PS. Park by the museum another street West of the main drag and walk over a block to the festivities.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Something to do", "Thursday nite they have various tents set up. At the end, they had food which smelled delicious. We had already eaten, though"], ["Reviewed October 12, 2017", 4.0, "Fun opportunity to walk around if the weather is nice. Parking isn't easy.", "Your enjoyment of VillageFest is likely going to be dependent upon the weather. If it is a beautiful night in Palm Springs and you are looking for something to do, it is a great opportunity to be outside, walk around, mingle with people and see some cool things and food. Just manage expectations of the items for sale. The cool part is it is a lot is locally made. It is mostly the same vendors weekly though so go for a nice night out. An important tip is to be prepared and VERY patient when finding a parking place. Because Palm Canyon is closed, you will likely need to spend some time looking, but don't get too creative. The city will ticket you if you park illegally. If it is operating, consider taking the Buzz trolley or even Lyft or Uber.\nShow less"], ["Reviewed October 11, 2017", 4.0, "Stroll Down Palm Canyon Drive", "Every Thursday night, all year long, Village Fest is held on Palm Canyon Drive (main street in Palm Springs for eating and shopping). There were about 200 vendors when we went, and although we bought nothing, it was nice walking slowly down the street looking at all the interesting stuff. The stores on the street, well, most of them, stay open late too, so if you want to do a little regular shopping you can. Parking is difficult, but there is a lot of street parking and a garage on the side streets.\nShow less"], ["Reviewed October 11, 2017", 4.0, "An unexpected Retail opportunity", "There were a vast array of stalls selling everything from food to golf tees. It provided a pleasant pre-dinner stroll and we even got some Christmas presents. There is a fair amount of duplication in the products being sold so its worth shopping around"], ["Reviewed October 10, 2017", 4.0, "Wandering advised!", "We had a blast wandering down Palm Canyon. Road closed, all sorts of things to see and buy!\nI was hoping for more artisans to represent the unique PS vibe. I did enjoy several of the booths with a variety of stuff to munch on. I would think, if I were a local, it would make it my weekly event for eating out and something to do. Low key and fun!\nShow less"], ["Reviewed October 9, 2017", 5.0, "Best street market ever", "Thursday nights in Palm Springs you have to go down town to see the market ,the music the wonderful atmosphere at the weekly event\nIt gets bigger every year\nEat in one of the street restaurants and watch the people\nWe go every Thursday we are here such a great spectacle give it a try\nShow less"], ["Reviewed October 6, 2017", 3.0, "Every Thursday", "There are alot of vendors. Big selection of a variety of things. You need to know your prices to know if it is a good deal."], ["Reviewed October 6, 2017", 5.0, "Don't miss this", "Not our first time for the fest and it won't be our last. They close Palm Canyon Drive on Thursdays, in season, and hold a street fair from 6-10 PM.\nA wide variety of vendors from trinkets to baked goods to Jewelry to a Farmers Market section. They also have several food trucks of very good quality.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Fun to see", "We enjoyed this in early Oct. I thought the vendors might have been more crafty...nothing really unique that I haven't seen at other craft shows. Still fun to walk and see. We had a good time."], ["Reviewed October 5, 2017", 5.0, "Fantastic Atmosphere", "A great selection of local craftsmen/women selling their wares in a street market setting which occurs every Thursday. Masses of stalls and live music. Arts, pottery, carvings and food. Well worth a visit"], ["Reviewed October 5, 2017", 5.0, "Fantastic", "We came here to do a tasting and have lunch. We enjoyed our tasting, but did not purchase any wines. Afterwards, we went outside and enjoyed the food and the view for lunch. It is a wonderful place to sit, relax, enjoy some wine and food. We had the antipasti platter and a pizza, both were very good. The view from the patio was the best part of the entire visit.\nShow less"], ["Reviewed October 4, 2017", 4.0, "Fun area to view street vendors. Shops and restaurants stay open late", "Vendors with a variety of goods and jewelry. Lots of people walking down the closed off street. Most restaurants on this strip get pretty busy but it is not hard to find something a half a block off the main drag."], ["Reviewed October 3, 2017", 5.0, "Great Time", "We will have been enjoying this weekly event for many years. Great food and treasures for all to enjoy. This is a great time of families to enjoy together. great place to find unique gifts."], ["Reviewed October 2, 2017", 4.0, "Fun Free Evening", "It's nice to be able to walk down the middle of the street in either direction and gawk at the other walkers and the stalls of stuff for sale., If you like to people watch, this is the activity for you!"], ["Reviewed October 1, 2017", 5.0, "Magical transformation of downtown streets", "We had lunch on this very street early Thursday and returned in the evening to find a totally different place had appeared in the form of the Village Fest. Lots of original jewelry, clothing and craft booths and some great food there too. Great destination for families looking for some cool entertainment.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Cool Shopping", "We had a great time walking the street looking at the different vendors. Bought a few items of course\n\nIt was a nice crowd, not too busy yet, but I think they open it at 6 in October instead of 7.\n\nWas a great way to spend our Thursday evening.\nShow less"], ["Reviewed September 18, 2017", 3.0, "Quite nice", "Been couple of times nice night interesting stalls bit expensive though and could do with more musicians think I enjoyed it more the first time round could be improved"], ["Reviewed September 13, 2017", 4.0, "Flee Market", "This market takes place every Thursday night in downtown Palm Springs, lots of stalls selling nick knacks and street food."], ["Reviewed September 8, 2017", 3.0, "Something different on a Thursday night!", "Lots of people. Nice walk from our condo. Festival is between Amado and Baristo on Palm Canyon Road. The stores stay open late. There are some performers, not bad. The people watching is interesting to say the least. The vendors do a good job displaying their wares. Lots of street fare to eat. Some really interesting goods for sale but no idea how to get it home.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Fun Local Event", "Always a good time strolling downtown Palm Springs and seeing the local vendors and musicians. I always run into people I know walking around, and it reminds me what a great community Palm Springs is."], ["Reviewed September 1, 2017", 3.0, "A little bit of shoppers guilty pleasure I'm sure", "Yer it was alright. We went early to avoid the crowds but to be honest with you it was the same as any other place on the planet with stalls selling there wear. Good for the atmosphere and marvellous for walking around at 90 degrees on an August evening!. My highlight was grabbing a drink in the HardRock Hotel round the corner! Take it or leave it. Some people with love, some will hate others like me will take it as it is ~ somewhere to stroll along and gather in the sights\nShow less"], ["Reviewed August 28, 2017", 4.0, "Great street fair", "Lots of food. Creative vendors. Nice to walk along the street at dusk when it's not so hot. Live music on each inter section. Would go again"], ["Reviewed August 26, 2017", 5.0, "A Delight Even in Summet", "The Village Fest in Palm Springs on Thursday evenings is full of varied vendors and artists. Even at the end of August, it was well attended!!\n\nThe air was warm, but the crowds were friendly and appeared happy to be enjoying the star studded evening while strolling along and listening to live music, or sampling the culinary treats, or finding artistic mementos.\n\nIt was nice to see both young and old enjoying an evening in a Palm Springs.\nShow less"], ["Reviewed August 22, 2017", 3.0, "Nice Festival", "I've been to this festival a couple of times and it is typical of festivals in any state. The items for sale are pretty much the same you find at any festival. The performers are fun to watch and I would recommend it if you have never been before.\nShow less"], ["Reviewed August 19, 2017", 3.0, "Crafts, Food, and Drink but No Toilets", "Lots of interesting crafts and some food stands. Very limited seating, so plan to eat while walking. No toilets! Of course there are lots of adjacent bars and restaurants - maybe that explains absence of toilets. Some produce, including excellent strawberries, cherries, nuts, and dates. Parking a challenge - handy, free parking garage fills quickly.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Great fun - but get there early to park!", "What a cute experience - lots of local crafts, some great food, and the best Palm Springs shops open late into the evening. Great atmosphere, too, and you can even get a great massage. I'm told it's even better in the cooler months than it was at the height of summer in August.\nOne tip - get there early or you might have trouble parking!\nShow less"], ["Reviewed August 14, 2017", 4.0, "Fun, Longtime Street Fair", "After dinner, we spilled out onto the strip for the VillageFest. It was totally fun. Lots of gift items. I bought a gorgeous cactus night light. Love it!"], ["Reviewed August 10, 2017", 5.0, "SO much fun!", "We just happened to be in Palm Springs on a Thursday, and made our way downtown for this. It was so fun! Lots of booths with art, and food and local stores. We were on a stop along a fairly intense and activity-packed road trip, so it was nice to just stroll and enjoy some of the local music and food for an evening. I highly recommend it if you are there on a Thursday night.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Great outdoor activity, fun street fair", "This is a lot of fun to do when it's not too hot. We went on a particularly scorching nite and it was better when it's a bit cooler. I did make up for it with a giant snow cone but it wasn't enuf!! Tons of great shopping and people watching. Great cheap thing to do at night if you can resist buying stuff!!\nShow less"], ["Reviewed August 9, 2017", 4.0, "village fest", "A great place to see local vendors products, without going into a store. easy parking and great walking space"], ["Reviewed August 9, 2017", 3.0, "It was ok", "I was in Plam Springs while on vacation and heard about this street fair. It was ok if you have nothing else to do. I got the kids a shaved ice and some bracelets with their names on it. If you have nothing else to do on the Thursday night it is nice to go see all the art items\nShow less"], ["Reviewed August 8, 2017", 5.0, "PS VillageFest", "VillageFest is one of the fun activities that one can go to in Palm Springs. This event is held every Thursday. It is a dog-friendly venue. It is not uncommon to see dogs in costumes! One can purchase food, clothes and arts and crafts. Musicians perform at VillageFest and try to sell their CDs. The spray paint artist on Arenas and Palm Canyon Drive is the best I have ever seen. I highly recommend attending this event. I attend at least twice a month!\nShow less"], ["Reviewed August 5, 2017", 5.0, "Fun little street fest...", "Just happened to be staying at the Calla Lily Inn, and the hostess, Laura, suggested it. Nice little street fest, with some interesting artists."], ["Reviewed August 3, 2017", 4.0, "Fun Times at VillageFest - Downtown Palm Springs (Thursday night)", "It was fun going to VillageFest and seeing the various vendors - arts, crafts, food, and other vendors. Its nice being able to walk down one of the major streets in downtown Palm Springs without any cars on it. We were able to find a parking spot nearby.\nShow less"], ["Reviewed July 29, 2017", 4.0, "Hot night", "Lots of vendors selling their wares. Good place to get out and enjoy the area. Was a hot night when we were there, so that did take away some of the enjoyment."], ["Reviewed July 27, 2017", 3.0, "Thursday Village Fest", "Not so great! Maybe because it was very hot that night. Not as many vendors as usual. They need new vendors. I have been before during the winter months and it's more enjoyable then."], ["Reviewed July 23, 2017", 5.0, "Great time!", "Walking the downtown PS area, exploring. Different stands of food venues. Bought a few souvenirs, a bit warm but plenty of pubs and bars to choose from. Thursday was awesome"], ["Reviewed July 13, 2017", 5.0, "Fun event", "Great fun. Front desk at our resort recommended checking out Village Fest. So glad we took their advice. Lots of food, art, jewelry, crafts & artisans. Was a great intro to the area on our first night."], ["Reviewed July 12, 2017", 3.0, "a small, standard, run-of-the-mill street fair.", "There didn't seem to be very much going at Village Fest on the week that we were in town. A bit sad really."], ["Reviewed July 12, 2017", 5.0, "Wonderful street Fair in Palm Springs", "Best way to spend Thursday night in Palm Springs. Come out and see the artisans and enjoy the wonderful food. I only wish that some of the restaurants would have booths with small tastes from their restaurants. Note that during the winter months there are more booths, but during summer it is a nice outing, just hotter!\nShow less"], ["Reviewed July 10, 2017", 4.0, "Fun street fair in downtown Palm Springs", "We just happened upon this while visiting Palm Springs, and it was a fun filled evening wandering around several blocks of downtown Palm Springs, closed for traffic and filled on both side with vendors of every kind. Many good street food options and craft vendors, and some produce and sweets as well. The street is closed for pedestrian traffic only from 7-910 PM, and many of the local shops and restaurants stay open late as well. Lots of fun for all ages.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fun way to get the Palm Springs vibe", "Despite the heat, fun fest to walk around and enjoy the wares. Lot's of funky artwork and little tchachkies."], ["Reviewed July 10, 2017", 5.0, "A Must Do on Your Trip To Palm Springs", "I'm so glad I took the time to visit the Thursday Evening Village Fest on my trip to Palm Springs. Lot's of fun, some cool stuff from vendors and great food. Everyone was so nice - and it gives you a real sense of the Palm Springs community.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Just a lot of fun", "Great vendors and a really nice evening during the week in Palm Springs. You need to do this when in town!"], ["Reviewed July 8, 2017", 5.0, "Great atmosphere and plenty of interesting stalls", "Even if you are not in the market to purchase anything its a great night to head into town. The atmosphere is buzzing. There are street performers to entertain, and some of the bars and restaurants have live bands too. It really is a must do.\n\nLeave your car behind and take the free trolley to get around to take the stress out of finding parking.\nShow less"], ["Reviewed July 6, 2017", 3.0, "Evening out", "Had hoped that the village fest would have had a little more buzz about it. However, credit to all the stall holders - it certainly made the night a little more interesting and down town Palm Springs a little more alive at night!"], ["Reviewed July 1, 2017", 3.0, "Okay", "Sure it is better when not so hot, but only 1 performer (who was not real good) and not many people there. We did have the best taco ever from a taco truck."], ["Reviewed June 29, 2017", 4.0, "Lots to see!", "Lots of fun and creative craft booths and some yummy food vendors. Enjoyable way to spend an hour or two. Great place to people watch too! Also several musicians for your entertainment pleasure. Only disappointment was that there was only one fresh produce booth! Expecting much more this time of year.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Worth looking at", "A nice way to spend a Thursday evening. Though I did not see many vendors that sold things that I would buy, except food items perhaps."], ["Reviewed June 26, 2017", 4.0, "Nightly entertainment on Thursday", "Good entertainment for an evening. Recommend stopping at one of the restaurants and enjoy the evening. There are a few entertainers that do some shows worth watching."], ["Reviewed June 26, 2017", 5.0, "The Best Festival", "This is the best festival I've ever been to. Every Thursday night, from 7pm to 10pm, Palm Canyon drive is closed to traffic for a lively street fair. Downtown shops get in on the act also. Food. Fun. Great crowd. Good Music. This is a must see event. You won't be disappointed.\nShow less"], ["Reviewed June 23, 2017", 5.0, "A Thursday Tradition!", "I love that this town literally closes Palm Canyon Drive (the main street) every single Thursday for a street fair! My husband and I visit Palm Springs 3 or 4 times a year, and I insist that we visit VillageFest every time. I love the friendly atmosphere, the music, the food, the hawkers, the artists, etc... Wouldn't miss it!\nShow less"], ["Reviewed June 22, 2017", 5.0, "My wife's favorite part of Pam Springs", "We always go to this when we are in Palm Springs. Huge long stretch of booths featuring everything from arts, crafts, food, fruit, unique products. Very festive atmosphere and lots of music. A real enjoyale evening treat."], ["Reviewed June 21, 2017", 3.0, "Entertaining Stroll", "Meandered down Palm Canyon Drive and took in this 4 - 5 block weekly happening. Good for grabbing a bite at one of the several vendors, finding a spot to sit and spending some time people watching. Assortment of items available was typical for events of this nature: jewelry, crafts, artwork, etc. A pleasant, relaxing way to spend a couple of hours in the cool of the evening. Seems to be quite popular with locals and tourists alike.\nShow less"], ["Reviewed June 20, 2017", 5.0, "good variety of arts and crafts", "This was our last night in town and it was a perfect wrap up to our week. I was surprised by the number and variety of booths for an event that is held each week. We were able to pick up several gifts for friends and got a couple of goodies for ourselves, too. I bought a beautiful Egyptian alabaster candle holder that glowed like a star when the vendor held it up to the light. Also found out that he was from my hometown, Columbus, OH. Oh, small world! Wish I lived there, think I would be trying to join on the seller side of the equation!\nShow less"], ["Reviewed June 18, 2017", 5.0, "enjoyable every time", "I've been to Village Fest twice now and enjoyed it both times. There is a wide selection of things to look at including pottery, photography, food, pillows, jewelry, soap, lotion, and more. The vendors are nice, and the ones who sell food often hand out tastes. It's a fun thing to do on Thursday night in Palm Springs.\nShow less"], ["Reviewed June 18, 2017", 5.0, "Local bazar and craft", "Took a walk down here on a Thursday night quite good but very expensive, but enjoyed the night out .. had a tarot card reading done stated 20dollars but the truth is that was only for five mins so don't be conned"], ["Reviewed June 15, 2017", 4.0, "A fun time to have an evening meal along the restaurant row.", "Vendors line the closed off street with their special crafts/wares every Thursday evening. One side street has fresh fruits and produce for sale. We enjoyed eating dinner at Maracas and Brickworks two different evenings. Lots of the shops along the street are also open. Many people are out to enjoy the evening but it's not too crowded in June. There was also live music.\nShow less"], ["Reviewed June 6, 2017", 4.0, "An Enjoyable Way to Spend a Thursday Evening", "We changed our day into Joshua Tree National Park to attend this and were glad we did. It's the usual street fair, but it was a lot of fun. There are lots of crafts for sale and lots of nice restaurants to eat at along the way. We really had a fun evening and are glad our hotel was within walking distance.\nShow less"], ["Reviewed June 5, 2017", 4.0, "Beautiful and cosy street market", "One of the most cosy street fairs I'be ever seen. Restaurants and bars are surrounding it so it's excellent to stroll down the road and then go for dinner or a drink. (The street is traffic free during the village fest.)"], ["Reviewed June 4, 2017", 5.0, "Always Great People Watching and Unique Art and Crafts", "VillageFest is always part of our annual visit to Palm Springs. Don't be intimidated by parking downtown. It's quite easy and it's a small town. Just get close and then walk. There is a free deck downtown and ride sharing services or taxis can get you there with ease. VillageFest is probably the best place to buy souvenirs for family or yourself (nice handmade items, instead of plastic junk). It's also a great place to take in local performing artists, people watching and dog petting. We always miss our dogs when vacationing, but lots of locals bring theirs for a walk (leashes) at VillageFest since the evenings cool down and it's fun to see them all.\nShow less"], ["Reviewed June 2, 2017", 5.0, "A fun family tradition!", "We have been enjoyed our visits to Palm Springs for many years. An event that is a lot of fun is the Thursday night Stree Fair. We park and walk up the streets lined with vendors, musicians, food booths, stopping along the way to talk with the artists and enjoy the music & food.\nShow less"], ["Reviewed June 2, 2017", 5.0, "So many booths and great gift ideas", "Every Thursday the downtown area closes down for VillageFest and 20,000 people crowd the street to shop, dine or look at art. There are rides for the kids and great music imported from LA. Great place to buy inexpensive gifts for people not fortunate enough to be there.\nShow less"], ["Reviewed May 31, 2017", 4.0, "Fun evening of kitsch and street food", "A wonderful Thursday evening tradition. The whole world comes here, dogs and kids welcome! A wide range of vendors from food truck food to art and home remedies. Charming, quant and free."], ["Reviewed May 30, 2017", 1.0, "Something to avoid", "Unless you like crowds, noise, street food and souvenir vendors, best to avoid this weekly event. Parking is difficult and going to any of the usual downtown restaurants or bars is a major hassle on these nights. Can't imagine why this event endures."], ["Reviewed May 25, 2017", 5.0, "Palm Springs street fair", "Every Thursday about 100 venders, from art to food, gather in Palm Springs on closed streets every Thursday at 7pm. It is a literal street fair with multiple bars and restaurants located right on the blvd. Great family or date outing."], ["Reviewed May 24, 2017", 5.0, "Just a fun time for family, friends or whomever. Thursday \"something to do\".", "Great Kettle Corn in addition to all the variety of booths up and down the drive. Even musicians filling the air with songs."], ["Reviewed May 24, 2017", 4.0, "this is a must visit place", "held every Thursday evening this is always a great event to introduce visiting guests to. A large variety of stalls and art on display."], ["Reviewed May 22, 2017", 4.0, "Every Thursday Night", "It's a fun place to wander around and check out all the artisan offerings. It gets pretty crowded with lots to see. Live music and lots to eat. Best of all - it's free!"], ["Reviewed May 21, 2017", 4.0, "Village Fest", "Bring friends with us for vacation each year and a visit to Village Fdt is a must there are always many interesting and new ideas from the vendors.\nIt's one of the jystcdirs every year when we go to Palm Springs fir vacation don't miss it!!\nShow less"], ["Reviewed May 20, 2017", 4.0, "Thursday's Block Party", "Free parking, many vendors & great food!!! Plenty to entertain everyone's needs. Gives everyone a chance to mingle & shop."], ["Reviewed May 19, 2017", 4.0, "Nice atmosphere", "My husband and I visited the village fest during a four day stay in Palm Springs. We didn't know it was on so it was a nice surprise! The street was so lively and there was a nice mix of stalls and music. Well worth a stroll!\nShow less"], ["Reviewed May 18, 2017", 5.0, "Lots of stuff to see", "Every Thursday night they close 'main street' and have a 'Village fest'. You have people selling home remedies, jewelry, lamps, massage by the minute, lots of cool stuff to just 'check out'. It's about a mile walk in total. You also have the shops that normally do business in the area as well as lots of places to eat.\nShow less"], ["Reviewed May 16, 2017", 5.0, "Village People", "I think the reason we make sure we always make the Street Fair a part of our Palm Spring visit are the people. The vendors are always so happy to see you and help find the perfect thing you are looking for. The guests are usually very courteous to each other walking through the busy passage way. Truely a unique experience. Love it.\nShow less"], ["Reviewed May 16, 2017", 5.0, "What to eat first? What to buy?", "This street fair/farmers market is amazing....Everything sold there has to be handmade, which means it's made locally and good for the economy! And then there's the food of all kinds, plus fudge, drinks, kettle corn, etc. Clothing, artwork, jewelry, skin lotion, coasters, purses, you name it. Be ready for a big crowd, lots of dogs, and 3/4 of a mile walking!\nShow less"], ["Reviewed May 15, 2017", 4.0, "Fun, Unique Experience", "If you like to shop in the streets with live music and good vibes....this is the thing for you. Supporting local vendors and eating fresh treats is always a fun time for us."], ["Reviewed May 15, 2017", 4.0, "It's cute with some good finds...", "We were doing a self made food/bar hop...and left one of our restaurants to head here...the bartender said \"Why are you going there you need another dream catcher or bag of nuts?' We laughed but, decided we needed to check it out ourselves...we actually found some really unique items...it wasn't life changing, but fun. But, it's mainly shopping, so, if you don't want to shop...maybe don't bother.\nShow less"], ["Reviewed May 12, 2017", 4.0, "Fun Evening, But Busy!", "The VillageFest is a fun free event, but don't go if you can't handle the crowds, as it gets very busy. We always go downtown early, find a good parking spot, find a place to have an early dinner, and then walk the festival. Lots to see and lots to buy if you like, including a Farmer's Market section, many food venues if you want to grab something casual on the street. It's a good place to run into someone you know. A suggestion is to visit the Art Museum the same night, as the entrance fee is free that evening. If it's a hot night, there's many air conditioned places to keep cool.\nShow less"], ["Reviewed May 8, 2017", 5.0, "Fun relaxing way to spend an evening", "What a fun way to spend an evening! Thursday nights, 6pm-10pm, Palm Canyon Drive downtown is closed off and vendors populate the street with crafts, artwork. Snack items include nuts, honey, bread and bakery items, fudge, jerky and dates.\nCraft items include jewelry, soap, purses,scarves and hand made clothes and meal items galore, tacos, burgers and hot dogs, ice cream and even an entire prime rib done on the grill! A great night to walk around and enjoy live music on different street corners.\nShow less"], ["Reviewed May 7, 2017", 4.0, "One rude vendor", "One extremely rude vendor shouldn't ruin your impression of this great weekly event, but it definitely put a damper on our evening. We were in town for one night only. We were happy to learn that we would have the opportunity to attend VillageFest. We took the town trolley here from our hotel. The nice driver dropped us off in the thick of the event. it was a beautiful April evening. The street was hopping with music and sights, all framed by the gorgeous palms.\nWe are from the east coast, so there were some foods and items for sale that we were not familiar with. We were eager to explore the types of things available, and met some really nice people who were very proud of their offerings. We passed a cart called something like \"Minus 30\" They were making some type of sorbet on a frozen surface. It was a warm evening, and we had saved some room after our dinner for a treat. I stopped for about 5 seconds to observe and determine what this was. A young woman with extremely garish make-up asked me for my order and I replied that I needed to see what the finished product looked like before I would be ready to order. She then announced loudly that \"anyone who was watching needed to move along to make room for the paying customers\". Now mind you there were very few people near the cart and no paying customers. I was blocking no one. Shocked and insulted, we moved along, right to Ben and Jerrys when I would have preferred to patronize a local vendor. Aside from this unfortunate encounter, we liked the VillageFest.\nIt had a nice variety of gifts, wares, street food, and fresh produce, baked goods, and jerkies.\nShow less"], ["Reviewed May 6, 2017", 4.0, "VillageFest - Thursday evenings!", "They block off part of Palm Canyon for this street fair. There are good choices of food to try or things to buy from merchants. My review would've been the highest if not for construction nearby, which they could not help. Parking is one block off Palm Canyon -simple and close.\nShow less"], ["Reviewed May 6, 2017", 2.0, "To be avoided", "One of the few things that annoy me about Palm Springs is this thing every Thursday when roads are closed and undesireables come to town to hang out. Nothing for sale is worth it and the street food is awful."], ["Reviewed May 5, 2017", 3.0, "Just okay.", "Typical street fair filled with vendors selling items you really don't need. Did enjoy the live, musical performance."], ["Reviewed May 3, 2017", 3.0, "Palm Springs Thursday Night Market", "I like the atmosphere, they close down Palm Canyon Drive, where merchants displacing the goods in kiosks spread over 4 blocks, they sell crafts, clothing, have live entertainment and food trucks. Parking is bit difficult, should bring a flash light with you if you are parking on the street.\n\nWe usually start our Palm Springs vacation on Thursday, so we can visit the night market, pick up Arizona Jack's beef jerky and fresh fruit.\n\nIts fun, should go there for the expereince.\nShow less"], ["Reviewed May 3, 2017", 5.0, "Love Thursday Nights in Palm Springs", "We love VillageFest every Thursday night. It is something we look forward to when we are here. The variety of vendors offers something for everyone. The crafts, artwork, housewares, clothing, jewellery, etc. are really interesting to puruse. The fact that many businesses are open during this time allows us to really take in a lot. We usually stop for a cold drink somewhere along Palm Canyon Drive and enjoy just 'watching the people' along the route. Great way to start the weekend! Would recommend VillageFest to everyone!\nShow less"], ["Reviewed May 3, 2017", 5.0, "Thursday night event in Palm Springs", "You can't beat this street festival for something to do in downtown Palm Springs on a Thursday night. Lots of people, food, art, crafty things for sale, and even some fresh dates, fruits and vegetables! It isn't as fun when the weather is hot, so get there soon!\nShow less"], ["Reviewed May 2, 2017", 5.0, "Such fun!!", "Love village fest! There is always something new to see. Great vendors, food and entertainment! This is one of my favorite things to do when visiting Palm Springs!"], ["Reviewed May 1, 2017", 5.0, "Always a fun evening", "We love visiting Palm Springs and enjoying an evening stroll at village fest: great vendors, artists, entertainment. We love buying fresh and juicy local medjool dates, trying and buying the Brandini Toffee and making a stop at Palm Springs Jerky - we had a lovely chat with Stan and Lynn and love the quality, selection and flavors of their jerky - we always end up taking 3 bags home! Black pepper and sea salt is one of our faves! Also enjoy the Mediterranean restaurant on the corner and just browsing in general. The vendors are really nice friendly folks all through the village fest. Must be all that sunshine!\nShow less"], ["Reviewed May 1, 2017", 5.0, "Love it!", "Really neat stuff to check out. We try to stay on a Thursday Night just because it's just a fun walk and learning fun. You have to do it!"], ["Reviewed May 1, 2017", 3.0, "Okay, if you like street fairs.", "There was a lot of vendors, food and stuff. Lots of businesses were open too! I guess I'm getting to old to just walk around and buy stuff. Rather sit and enjoy a glass of wine and people watch and listen to some good music."], ["Reviewed April 30, 2017", 5.0, "A favorite for Thursday nights", "If you are in the Palm Springs area on a Thursday night this is the place to go dine & take a stroll & shop. Open every Thursday unless for some reason the weather is bad. We go often & get great food items, soap and other cool stuff. There are all kinds of booths & it is a great atmosphere. Really shows off Palm Springs.\nShow less"], ["Reviewed April 30, 2017", 3.0, "Nothing New", "If we happen to be in Palm Springs on a Thursday night, we routinely walk the Village Fest before or after dinner. Rarely, have we noticed any new vendors and this particular evening was no different. I hope for the sake of the participating vendors, our attitude is not too common because with each visit we do less and less booth browsing. We typically visit Palm Springs 3 or 4 times a year, and will more than likely continue to be part of this Palm Spring kind of thing, but more for walking and people watching.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Great street fair!", "Very large street fair with wide variety of vendors. Good food available. Nice to be able to shop at the booths and also downtown stores."], ["Reviewed April 29, 2017", 4.0, "Nice Weekly Event Not To Be Missed", "Weekly on Thursday night all year long. Main Street closed for a pedestrian event that includes booths of local businesses. Arts and crafts, jewelry, services, bands, local produce, music, etc. Although traffic and finding a place to park can be a pain, this is still a fun way to spend the evening before or after dinner.\nShow less"], ["Reviewed April 27, 2017", 3.0, "Okay market", "This is an okay market... nothing out of the ordinary to make it any different from other markets I've been to elsewhere. Parking around the area could be difficult. If you would like to go for dinner somewhere along the festival make sure to make reservations ahead of time. If you have trouble making them yourself, always ask your hotel concierge as they might have connections to get you at a restaurant that otherwise says they aren't taking anymore reservations.\nShow less"], ["Reviewed April 27, 2017", 5.0, "Good Entertainment.", "Lots of sharing between all which is always a nice experience. Gets very crowded pretty fast. But just grin and bare it. Fun food to try and lots to explore and look at."], ["Reviewed April 25, 2017", 4.0, "Really good variety of market stalls", "If you are in Palm Springs on a Thursday then you can not miss this. From 5pm some of the down town roads are closed off to allow stall holders to set up.\nAll are very friendly and sell quality merchandise. The snacks from the Greek food stall were great!\nShow less"], ["Reviewed April 23, 2017", 5.0, "A Great Time", "Was a great time walking through the streets seeing all the artisan works (paints, pottery, lots of handmade jewelry, clothing..etc). Many kinds of food vendors, the shops that line the street were open plus Pet friendly too!"], ["Reviewed April 23, 2017", 5.0, "If you are in Palm Springs on a Thursday evening, you simply must go to Village Fest", "Think about it, every Thursday evening Palm Springs, California has a street fair with food, art, music, vendors and people--lots of people! It is a blast. It is the place to be on Thursdays for sure. Eclectic and way cool!"], ["Reviewed April 23, 2017", 5.0, "Need souvenirs? Place to go.", "Always a fun evening out., especially after a hot day at the pool. Local artisans at their best. All restaurants and shops are open, so brand names and all food types are available."]]}}