{"Walt Disney Concert Hall": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Walt Disney Concert Hall", "url": "/Attraction_Review-g32655-d258384-Reviews-Walt_Disney_Concert_Hall-Los_Angeles_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/32/c4/68/disney-concert-hall.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2608"}, "address": {"@type": "PostalAddress", "streetAddress": "111 S Grand Ave", "addressLocality": "Los Angeles", "addressRegion": "California", "postalCode": "90012-3034", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 4.0, "The famous walt disney", "You wanna experience about walt disney? go for it and visit it. architecture was great and lovely. They made it for real acoustic and it was perfect"], ["Reviewed 3 days ago", 5.0, "Goethe would be thrilled", "Music and architecture come together in this, the best of all concert halls. The garden in the rear is a jewel. The organ a fanciful cluster of delicious French fries. The sound perfect; the location of the orchestra a stroke of genius."], ["Reviewed 3 days ago", 5.0, "An Acoustic Masterstroke", "This is a review for the concert going experience and after two concerts I must say it is a truly world class venue! Parking was pretty cheap ($9) and easily accessible since you find yourself right inside the building itself. The lobby is very labyrinthine and maze-like which leads you into the main theater which is truly breathtaking! The arrangement of the seats is like a compromise between traditional concert halls with most of the seats being in front of the orchestra and the vineyard style where the seats are terraced and surround the orchestra (similar to Berliner Philharmonie). I've heard much about the acoustics and after seeing shows from both the very back and right in front of the orchestra I can confirm that they are fantastic, every note sounds crisp and polished and I can hear every cough, paper ruffling, thud, and clearing of throat throughout the room (not that I wanted to hear those last four, but that's beside the point). Gustavo Dudamel is an amazing conductor and the entire orchestra was unbelievable. It was a magical experience and Frank Gehry should be proud of this great achievement.\nShow less"], ["Reviewed 5 days ago", 4.0, "Fabulous Architecture", "From the exterior and from several interior vantage points, this Frank Gehry-designed building is stunning. Unfortunately, you typically do not get to see the concert hall itself when you take a tour of the building - they show a video. But there is still much to see and enjoy, both inside and out. The tour is free, but they ask you to sign in at 2 PM.\n\n\nShow less"], ["Reviewed 1 week ago", 3.0, "Beautiful", "This Gehry building is indeed beautiful. If you want a l-o-n-g audio documentary, please take advantage of the audio tour equipment (free). I would have appreciated something less (more concise) than the audio tour in writing. The map was not helpful in this regard.\nWe were VERY disappointed not to be able to see inside the auditorium. The signs say that these are not included, but some accommodation should be made (as in other venues) to have some access to this space.\nOne last bit: the parking in the Disney is validated for tour goers (thank you), but since this is a unattended parking facility why the scarcity of machines to pay? As far as I could tell, in this huge complex, there were machines on two of the 7 parking levels.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "I am an Architect of the \"ball up a piece of paper project of architecture Geary/Hall Inc.", "For example Frank Geary and Karen Hall used my architecture for the Walter Elias Disney Hall of Music."], ["Reviewed 2 weeks ago", 5.0, "Genius", "Well, its nice to retain a critical edge, finding that higher ledge where you can feel bit superior... but then when you're faced with the work of real genius - Frank Gehry's Walt Disney Concert Hall - well, I am humbled. I know Gehry's long history of work which took quite a bit of development... often his earlier buildings were cricked for water leaking joints, construction materials coming loose, or idiosyncratic experiments. To walk through this building was an amazing experience. I had met another architect who had worked in his office just before this commission came out... the economy was in recession and Frank's office was teetering. Then this project came along. The individual architectural thoughts here, the expressive wholes, the coherence of the this wild ensemble is simply true greatness. I was in awe wandering around here. It's architect heaven for sure. PS, admission that day was free, which was dandy as well.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Excellent acoustics and amazing design", "I have fallen in love with this place. Though I admittedly do not go to LA much I have made this place an exception. The design of this concert hall is incredible and the acoustics are outstanding. If you do go I recommend sitting on the side that is, either orchestra east or west. This way you get a very good overall view of the entire orchestra and can see the conductor's face. The seats themselves are comfortable and unlike some places I have been in, the seats do not feel crammed together. I cannot imagine anyone not liking the place.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow", "What a fabulous work of art! Unfortunately, we got down there too late in the day for an inside tour of the building but we walked around the outside and it’s impressive. Self guided tours end at 2:00. Just so sorry to have missed the inside.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "A must see downtown", "At the very least, walk by and see the incredible building. Visit the secret garden . Sign up ahead of time for a tour. ( must sign up ahead). And if you are feeling really flush with money. Go to a concert here. The acoustics are incredible.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "The key point of the LA Downtown. It has a garden on the roof.", "There is the great garden on the roof of the building. Highly recommended, when you are visiting the downtown and got tired. The garden is beautiful, quiet, green and magnificent."], ["Reviewed 4 weeks ago", 4.0, "piece of ART", "i haven't gotten inside the building, but i was there to view the building art from outside, it is pretty and a nice piece of art indeed, it is unlike any other building, where the outside of it is covered with a shaped metal.\nthe area there is pretty nice.\nthis will take you 30 to 45 mins\nyou can find street parking if you take the right turn after the building.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Wonderful design and acoustics", "During our trip to Los Angeles last summer we had the great pleasure to attend a concert at this wonderful hall. We've been to numerous concerts in several concerts halls in the United States and in Europe. The acoustics of Disney Hall are second to none. You can hear so much detail and the sound is so rich and resonates even more with the huge amounts of wood in the hall. If you love good music, make sure you attend a concert at Disney Hall. The hall itself is really beautiful inside and out. Well worth a visit just to look at it. Inside it is all lovely golden wood, even the speaker boxes are paneled in it. Though the hall holds lots of people, it feels intimate. A gorgeous venue with amazing acoustics.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Home to art legends", "A classic place, home to innumerable legends. Definite visit while in LA. The gift shop also is incredible"], ["Reviewed 4 weeks ago", 4.0, "Outside garden for his wife", "We visited the outdoor amphitheatre and garden dedicated to his wife while waiting to get in to the broad. Some interesting and unique plants and great space to relax."], ["Reviewed 4 weeks ago", 5.0, "Do the tour!", "We were given a (free) tour by a staff member and it was great. Recommended. They show you all around the complex, tell you about the history of the building, point out all sorts of things that you wouldn't notice otherwise and answer your questions."], ["Reviewed January 23, 2018", 5.0, "Wow what a sound!", "This building stands out in Los Angeles and the acoustics on the inside are amazing! We were left tickets at will call and without that I'm not sure I would've have gone there for a concert. We were at USC from out of state for a college visit. The LA Phil produces a great sound and the building does not let down the philharmonic. The parking was easy as it's right under the building. All of the staff were friendly and courteous. This was a matinee show and I would definitely go back and pay for tickets next time!\nShow less"], ["Reviewed January 23, 2018", 5.0, "Went to a symphony concert", "The building is a work of art, the orchestra is world class and the acoustics are just perfect. If you love classical music and you can get tickets for a concert, it's a must"], ["Reviewed January 20, 2018", 4.0, "Interesting outlook", "We visited on a sunny day and it looked shinning and great. We did not go inside but the outlook of the Hall itself attracts quite a few people to take pictures."], ["Reviewed January 19, 2018", 5.0, "Beautiful in Sight and Sound", "This is an extraordinary place to see a concert. It's not too big, and I have never had a bad seat. I've been to classical, pop and rock concerts and every time the experience has been wonderful. We are so lucky to have this venue in Los Angeles!\nShow less"], ["Reviewed January 19, 2018", 5.0, "Great place to see a concert", "I saw the L. A. Phil last week. Wonderful acoustics. Friendly helpful staff. On certain nights they have a lecture before the concert and they explain the music you are about to hear. Get there early for that because it fills up. I took the subway and it is a 2 block walk to the hall from there. Frank Gehry building so modern and unique.\nShow less"], ["Reviewed January 18, 2018", 4.0, "Worth it to walk around and enjoy a concert in the hall", "Interesting building to look at from the outside; very good acoustics. Unfortunately the website was not up to date. I had my heart set on the tour but none of them was happening that day due to concerts. good thing I had a ticket to a concert and was free to roam around. Would have enjoyed a bit of explanation.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Extraordinary Building", "I'm trying to tick off Frank Gehry buildings when I have the opportunity - have previously been to the Guggenheim in Bilbao and the Marques de Riscal in Rioja - so it was great to see this amazing concert hall in Los Angeles. There is an organic beauty to this style which sits in stark contrast to the usual downtown boxes of steel and glass. The Guggenheim in Bilbao is said to have revitalised this dying port town, and the Marques de Riscal winery hotel in Rioja is an extraordinary sight in the tiny, ancient village of Elciego.\n\nWhenever I see these magnificent buildings I am always reminded of the Sydney Opera House - a building, designed in the 1950s, of which Gehry himself said \"Utzon made a building well ahead of its time, far ahead of available technology... a building that changed the image of an entire country.”\nShow less"], ["Reviewed January 8, 2018", 5.0, "Stunning Architecture", "I went just to visit the building. Absolutely beautiful achitecture, much needed for a shabby downtown environment."], ["Reviewed January 3, 2018", 4.0, "Must be experienced to understand it.", "This is where the architectural world was turned on its head. Its impact will be criticized for decades to come. Whether you are a music lover or a devotee of architecture, it is unlike any preception you may have of a concert hall. Both sophisticated and crude in its detailing, it occupies a prominent site at the center of downtown.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Concert", "WoW! Even before the orchestra appears, you'll be surprised, enthralled and taken aback. It's so different and stunning inside the concert hall. Not the lobby necessarily, (though if you have time there is a 'museum' of sorts inside, but it's the concert hall itself. We sat, Behind the orchestra! Loved it. I would go again just to experience it and take others who haven't been there.\nShow less"], ["Reviewed January 2, 2018", 5.0, "Beautiful building!", "We did the self guided audio tour while visiting LA. This building by Frank Geary is amazing. There is a beautiful outdoor space on the third floor! The outside of the building looks like metal waves. It is just so impressive. Also to take the self guided audio tour it is free. It was a wonderful way to spend a couple of hours. I mean just stunning!\nShow less"], ["Reviewed December 29, 2017", 5.0, "Beautiful design by Frank Geary", "Similar to others we have seen (in Bilbao, Spain), his buildings are beautiful and unusual. Excellent acoustics in the hall. Architecture is beautiful. Besides the music, great place for an interesting architecture tour. They give guided tours, or you can do your own. Be sure to go outside into the garden.\nShow less"], ["Reviewed December 25, 2017", 5.0, "Free Self-Guided Audio Tour is great!", "I love how accessible this building is during the day. My son and I enjoyed wandering through and hearing stories of how Gehry worked Lillian Disney to design so many aspects of the buidling. Don't skipt the terrace garden and rose fountain - so beautiful!"], ["Reviewed December 24, 2017", 5.0, "Proud to be an Angeleno", "This wonderful building, combining woods and metals, and soft and hard, is truly our city's landmark. A masterpiece that will make you happy when you gaze upon it."], ["Reviewed December 22, 2017", 5.0, "Decking The Halls", "If you ever wanted to attend the concert Deck the Halls, I REALLY, REALLY recommend it. Great for the whole family especially the kids. Don't worry if you don't know the words to the Christmas songs. Music sheets are provided. Great seats everywhere except behind the singers in my opinion. We sat in the terrace section and we loved it.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Los Angeles Philharmonic concert venue", "Disney Hall is the home of the Los Angeles Philharmonic. I am a season subscriber, and attend 8 or more classical music concerts each season. The orchestra plays a wide variety of classical music, from the Baroque to modern 20th century composers. They musicians are very skilled, and always give a good performance. The venue also attracts world-famous soloists such as Joshua Bell (violin) or Hillary Hahn (piano). The acoustics are outstanding in this Frank Gehry-designed hall, and there are no pillars to obscure your view of the orchestra. There is not a bad seat in the house. Behind the orchestra is a magnificent and unusual pipe organ with up to 32 foot pipes with a tremendous sound. There are a few organ concerts sprinkled through the season.\nShow less"], ["Reviewed December 21, 2017", 5.0, "One of the best concert halls in the world.", "World famous Frank Gehry architecture, The hall itself has near perfect acoustics. By Los Angeles standards, it's relatively easy to park."], ["Reviewed December 17, 2017", 5.0, "Very nice venue", "Went there for the first time for the Christmas choir presentation - sing a long concert. It is a \"small place but it looks like you have a nice view no matter where you sit. Nice seat."], ["Reviewed December 14, 2017", 5.0, "Travel back in time on a tour", "The tour takes you behind the scenes of this amazing complex. Although the steel structure is the one that visually dominates, you are taken into other concert halls that are a part of the whole. You will feel like you are in your grandparents living room as they take you through lounges and entrances graced by the wealthy and royals over the years. A must-see LA attraction.\nShow less"], ["Reviewed December 6, 2017", 5.0, "Beautiful architecture and beautiful concert hall!", "I just go to take pics of every angle of this beautiful architecture. I've been to a couple concerts that were equally beautiful in space and in content; One was Dudamel with Flamenco dancers! Worth a visit!"], ["Reviewed December 5, 2017", 5.0, "Definitely take a docent led tour", "What can I say, I work here and I love it here. I love the spellbinding architecture. I love the hidden garden on the third floor where I eat lunch most days. I love the perfect acoustics. I love the thrill of watching a fantastic orchestra play. I love watching Gustavo Dudamel perform. I love the prolific artists who play and the classical music and the sense of getting lost in time when you close your eyes and listen to the music performed. I love that every seat in the house is a good seat. Needless to say, I love this iconic LA experience.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Superb Structure.", "Visited Just from outside at night. Great view of some other buildings in DTLA from the steps of this Hall."], ["Reviewed December 2, 2017", 4.0, "Visit the whole structure", "Unfortunately I haven’t had the opportunity to watch any concert there but I visited the whole structure inside, outside and the garden in the second floor. It’s impressive, it’s extremely beautiful the architecture."], ["Reviewed November 27, 2017", 5.0, "great archticture", "a must for archtictual fans. great building by frank gehry. also great view from the top of the place. check it out. if possible also visit a concert or event."], ["Reviewed November 23, 2017", 5.0, "Really neat place!", "I have not been inside, but the outside architecture is amazing! I wish we had time to visit inside!"], ["Reviewed November 22, 2017", 5.0, "Beautiful Architecture !", "Walt Disney Concert Hall has a unique and ultra-modern architectural style. It is the one to remember, as much as one remembers Sydney Opera House or Berlin Philharmonic House."], ["Reviewed November 21, 2017", 5.0, "Disney Mania", "the best concert hal by far in LA. really liked the architecture and the concept of the concert hall. the location os also very prime. will definitely recommend this place to a friend."], ["Reviewed November 20, 2017", 5.0, "No better place to see music", "If you think the outside is stunning, wait til you step inside. Mathematically designed for acoustical precision, there concert hall never fails to dazzle. There are no bad seats, and if you check the website, there are some cheap seats offered two weeks prior to selected shows. Great place to eat inside and nearby. Train lets off a few blocks away.\nShow less"], ["Reviewed November 11, 2017", 5.0, "Love the building", "In heart of LA iconic building of modernity and creativity I just visit outside and is magnific upstairs has magical Disney gardens is a must in DT LA"], ["Reviewed November 10, 2017", 5.0, "Always lovely concerts!", "we go quite often for varied artists..some we know and others are new to us...auditorium is comfortable and acoustics perfect!"], ["Reviewed November 9, 2017", 5.0, "If you're a World Class Music Lover- Don't miss it-", "the Architecture = Unique from the outside and most importantly on the inside = fabulous as a World Class Concert Hall it's a must for everyone's Bucket List-"], ["Reviewed November 9, 2017", 5.0, "Why did I wait so long to visit?", "What an amazing concert hall. Frank Gehry design (need I say more?) . Perfect acoustics and small venue so there are no bad seats. I've lived in LA for 20 years and this was my first visit - will return for a concert soon."], ["Reviewed November 9, 2017", 5.0, "Classy", "Always feel good going here. All seats are good to hear and see the music/musicians. Get dressed up and enjoy a beautiful place and listen to great music. A joyful experience."], ["Reviewed November 9, 2017", 5.0, "Simply a masterpiece inside and out!", "WDCH is truly a magnificent place to hear music. The iconic building defines LA. Acoustics in the hall are superb and there really is not a bad seat in the house. The LA Phil is currently the best classical musical organization in the USA with unrivaled programming.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Dining with the orchestra", "Patina is a beautiful fine dining restaurant within the Frank Gehry designed Walt Disney Concert Hall and it lives up to its reputation for delicious food, elegant service and a beautiful location."], ["Reviewed November 9, 2017", 5.0, "A Frank Gehry masterpiece", "\"The Disney\", as it's known locally, became an instant architectural icon in a city that had few outside of City Hall. Located on Grand within eyeball distance of the 101 Freeway between the famed Dorothy Chandler Pavillion and the Broad Modern Art Museum, and home to the Los Angeles Philharmonic, it's a huge tourist draw even for those without an ear for classical music.\n\nEven without tickets to a show, you can step inside and self-tour the lobby. One of L.A.'s top restaurants for several decades (in a city where few things last), Patina, is located within the complex, and there's a cafe at the sidewalk offering coffee drinks and light fare all day for those who want to just sit and savor the fact that you're there.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Israel Philharmonic", "Fantastic acoustics and ambiance. Wonderful music at every level - composers, conductor, soloist, orchestra. A night to be remembered and cherished."], ["Reviewed November 4, 2017", 5.0, "Awesome Architecture!", "I think many people can agree that this is a pretty unique looking building. You've probably seen it in various commercials and photoshoots. It has a very modern aesthetic and vibe which I like. Bring your camera and go check this place out.\n\nMany talented artists and musicians also perform here for shows. Incredible acoustic design with.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Admiring the great architectural design", "The main hall was closed when we came for a visit . But the main focus was the exterior , made by a great architect and designer . Strolling around , and taking different photos , it made my day . Reminds me of the Sydney opera house and those in Glasgow . A must photo opportunity when in LA .\nShow less"], ["Reviewed October 23, 2017", 5.0, "Brilliant acoustics", "One has the feeling that one can hear a pin drop on stage from any seat in the house -- an engineering marvel."], ["Reviewed October 20, 2017", 5.0, "Frank Gehry's Stunning Work of Art", "If you love the work of Frank Gehry, you will love the Walt Disney Concert Hall. If you're not a Gehry fan..... I love the flowing design and find the many unusual curves and shadows fascinating. It's worth taking a tour, as they describe how and why the City selected the Gehry and the reasoning behind the design. Unfortunately, there were rehearsals in the concert hall, so we were not allowed to enter but saw the hall on a video. The second level gardens and fountain are beautiful. Parking was pretty easy under the building.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Better than you can imagine.......", "I am here for the building.\n\nNow, I do not have to travel to see the Guggenheim in Bilbao, Spain, and I think I like this building better, or more........\n\nIt just makes you happy.\n\nAnd no one told me there was an Aerial Pathway that allows you to get close and personal. Discover it on your own. It is not hard to find.\n\nAnd then find the garden, small and intimate in the back, with a blue mosaic rose fountain....so much fun.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Very nice Hall", "We arrived at a poor moment where the Hall was closed but we could still see the outside and the beauty of it. It was really nice and I would have loved to see a show."], ["Reviewed October 11, 2017", 4.0, "Organ Concert by Jean-Baptiste Robin", "We attended an organ concert at the Walt Disney Concert Hall ~which consisted of French organ music. It was an enjoyable evening with a masterful organist.\nThere were 2 organs, one located on the floor of the venue and one located high up nestled in with the massive organ pipes. At one point he left the organ on the floor and played a piece on the other organ nestled in the pipes. Honestly I couldn't tell the difference but then again I'm nut the organ enthusiast. It was amazing to watch his hands and feet fly in 100 different directions and to actually hear music come from all that flailing.\nStupidity I thought a few Disney tunes would be played or at least a Disney toy in the gift shop for my granddaughter. I think the Disney's are just big benefactors thus the name.\nShow less"], ["Reviewed October 11, 2017", 5.0, "the los angeles phil is tops", "dont miss this concert hall. it is easy to get to by auto or metro rail. you can hear and see easily from any price seat."], ["Reviewed October 7, 2017", 5.0, "John Williams", "Concert was a great Star Wars show with John Williams as the conductor. I will definitely attend another concert on my next visit."], ["Reviewed October 6, 2017", 5.0, "One of my favorite concert venues.", "As others have noted, this hall is a wonder of modern architecture. I have been here a number of times over the past several years and last week attended the Los Angeles Philharmonic gala opening concert, an all Mozart program, which was delightful. A distinctive feature of this hall is the Rosales pipe organ, with its unusual pipework case, popularly referred to as the \" French Fry \" organ, because of the irregular and unusual placement of the pipes that are visible to the audience.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Grand architecture. Great acoustics", "This concert hall is a treasure. The soaring architecture is inspiring and the acoustics are great. Now that there is a train connecting Downtown LA to many other parts of the city it is more accessible which is great!"], ["Reviewed October 4, 2017", 5.0, "Great Architecture Must see", "If you enjoy architecture this is one of the unmissable locations in LA we were able to spend several hours just marveling at the the way the building was designed and put together. We weren't able to take a tour as the auditorium was in use for a private function but we were able to go through the foyer of the building. Convenient parking is also available across the street.\nShow less"], ["Reviewed October 4, 2017", 5.0, "Carmina Burana", "This was the first performance of the season and my first exposure to a full orchestra and chorus. I was moved beyond my expectation within the first minute of the performance. I felt privileged to be present. The concert hall was beautiful, staff and ticketing process was easy and helpful when choosing a seat as I had know idea where I wanted to sit or how much I should pay for the experience. For under $70 a seat I got an amazing view and the sound was phenomenal.\nShow less"], ["Reviewed October 3, 2017", 5.0, "Great place for Great Music", "The Walt Disney Concert Hall is Great Architecture meets Great Music. Affordable first class seats no matter where you sit. Each section promotes a different range of sound. Pitch perfect Orchestra and the most Talented Conductors. A must visit for Tourists and locals!"], ["Reviewed October 3, 2017", 4.0, "Enjoyable tour of Disney Hall & Dorothy Chandler Pavilion", "Meet at the entrance of Disney Hall and you can sign up for a free tour of the venues in the music center. The guide was very welcoming and the tour was intersting and enjoyable. N.B. The LA Philarmonic play at the Hollywood Bowl in the Summer and in Disney Hall in the winter. Therefore if you do this tour in summer you can go around the whole building, whereas if you do the tour in winter you cannot go inside the auditorium due to rehearsals. I did the tour in winter - but it was still enjoyable as we were shown a video of the auditorium which the guide described for us.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Architectural Gem!", "Great location to visit day or night to take in the beauty of the structure. Also, the acoustics inside are incredible in any seat, as such a concert is a must! I especially enjoy the side seats."], ["Reviewed October 2, 2017", 5.0, "Worth spending a day at/near Walt Disney Concert Hall", "We have been to this venue many times and continue to enjoy the incredible acoustics during performances. The self tour is well worth doing, takes an hour or so but the docent led tour is the best. If time allows there are many other places of interest within walking distance, ie: MOCA, Ahmansens Theatre, The Music Center, Angels Flight, Central Market, Union Station, The Biltmore Hotel (check out their swimming pool!), Olvera Street, Phillipe's the Original, famous for their French Dip Sandwiches. Park your car at the Disney Hall for $9 and spend the day exploring this area. Lots of places to eat, drink and people watch. The DASH buses will take you all over the area if one is not up to walking. Try it, it's a great way to spend a day.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Swirly Stainless Steel", "Looks are free outside. Inside maybe the reputation was oversold - or I'm too uneducated to appreciate the acoustics - if something was special. The music pretty much sounded like ...music. But daaaang, that architectural stainless, what an architectural specimen."], ["Reviewed October 1, 2017", 4.0, "Unique Building", "It has several nice features, for being outdated. It would be amazing to see this facility revised and updated."], ["Reviewed September 30, 2017", 5.0, "Stunning architecture by Frank Gehry", "This place was on our list ‘must visit’ and it is really stunning - inside and outside. Unfortunately we did not take the guided tour but you can do self guided tour which is great. The building consists of several curved metallic surfaces reminiscent of a ship. There is a contrast in the materials used inside (wood radiating the warmth) and outside (metal evoking a cold feel). Originally the metal was reflecting too much light and heat so that it had to be treated to reduce the shine. If you have time try to get ticket for a concert as acoustics are fantastic.\nA must see place in LA.\nShow less"], ["Reviewed September 30, 2017", 5.0, "The best acoustics ever", "Even though it looke funky from the outside, the actual auditorium is pretty small and cozy with awesome acoustics. Have been there a few times and couldn't be happier."], ["Reviewed September 29, 2017", 5.0, "Wonderful acoustics", "Looks are transitory, but the experience of hearing a concert ( orchestral or Master Chorale) will stay with you"], ["Reviewed September 29, 2017", 5.0, "This a must see, and should hear if you can", "The Walt Disney Concert Hall is an architectural gem designed by Frank Geary and sitting on Grand Avenue with several of our other cultural icons surrounding it. It has to be seen both inside and out. Curved metallic surfaces reminiscent of a ship, curved surfaces throughout the interior, a public park on the terrace level accessible by a staircase from Grand Avenue, the Disney Concert Hall is a marvelous public space. There is a modest café inside, open to the public when there are concerts. I believe there are also tours available. To really experience the Disney, however, you should probably try to attend a concert. The acoustics are fabulous, the interior design very interesting, the organ is not only a piece of art but it is one of the best organs in the world.\nThis is definitely a Los Angeles must see!\nShow less"], ["Reviewed September 26, 2017", 4.0, "Attractive architecture", "This is situated at Grand avenue close to the city hall walking distance to Union Station Metro. We couldn't go in to the building but had a good view. The architectural design is different and impressive. Worth a visit."], ["Reviewed September 24, 2017", 4.0, "Beautiful Building", "We didn't get to tour the building due to our tight schedule but we were very impressed with the architecture of the outside which was only a couple of blocks from our hotel"], ["Reviewed September 16, 2017", 5.0, "Architectural marvel", "You need to admire the structure in person upclose. Take plenty of pictures, every angle yield different result. One thing off my bucket list."], ["Reviewed September 15, 2017", 5.0, "Concerts Sound Excellent", "This hall has the best acoustics that I've ever heard...and I've dealt with audio my entire career! Check the lineup on-line."], ["Reviewed September 15, 2017", 4.0, "Unique architecture in LA.. very interesting landmark!", "We were here for a couple of hours and the concept of this building is very interesting. It is well organized for the plays or shows inside. While in LA (excluding Hollywood :)), you don't have much to do, hence this place is recommended for the first time visitors.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Great music in downtown Los Angeles", "this is a great concert venue and if you are in town when there is a downtown festival available they even have free concerts. so if you are into classical or jazz check this out when in L.A."], ["Reviewed September 10, 2017", 4.0, "A Beautiful place to hang our for a while", "We spent most of the time outside walking around this beautiful building. We didn't see a performance but simply enjoyed the architecture and the views that it provided. A very peaceful haven in the city."], ["Reviewed September 7, 2017", 5.0, "Open to the public with a free audio tour", "It's a very cool building in downtown LA. The best part is they keep it open to the public (all but the main auditorium) and have a free audio tour."], ["Reviewed September 7, 2017", 5.0, "Wish I could have heard a concert here!", "This is a beautiful modern building that is HUGE. It has amazing acoustics and I wish I could have been there for a concert!"], ["Reviewed September 6, 2017", 5.0, "Free to tour - must do when in LA", "We really enjoyed touring the concert hall! Amazing architecture and materials, you can get a guided tour, an audio guide or just walk around on your own"], ["Reviewed September 4, 2017", 5.0, "A Masterpiece of Contemporary Architecture and a World Icon", "This is a breathtaking landmark and people come from all over the world to see this as indicated by everyone taking pictures of it around the intersection. You can actually climb around the outside of the structure which takes you around the back to this beautiful hidden garden and back out to the front. I have never seen a show here before (and didn't see one today since it was closed) but once I do I will definitely update my review to talk about the concert-going experience as well. Even if you aren't seeing a show here, I highly recommend exploring around it and going into the garden, as the outside is open to the public unless there's a private event. What can I say that hasn't already been said? This is an international icon and a masterpiece of contemporary architecture.\nShow less"], ["Reviewed September 4, 2017", 5.0, "Worth the stop", "Fascinating information about architecture and acoustics. Short self guided tour that's interesting and free."], ["Reviewed September 1, 2017", 5.0, "One should not miss this :)", "Very beautiful architectural design with free self paced audio tour!\nThe audio tour will explain all about the concert hall, from how it was planned and started out as an inspiration up to the design and parts they used to make the Walt Disney Concert Hall one of the best in the world.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Unique", "This place is really nice! the building is unique!! There is a free tour that it is very interesting, it's a self audio guide tour that explains everything about the concert hall. I had a very good experience."], ["Reviewed August 28, 2017", 5.0, "Great concert hall", "As indicated in title, it is a beautiful concert hall. music is great wherever you sit. I have sat in front orchestra, rear orchestra and balcony. It is all good. There is really no bad seats in the concert hall. You get a slightly different feel, and it is all good.\nShow less"], ["Reviewed August 28, 2017", 5.0, "Wonderful events and acoustics", "Top choices for everyone. Great sound for all parts of the auditorium. Wonderful building, worth a tour."], ["Reviewed August 25, 2017", 5.0, "Very cool!", "This was our first time visiting the Concert Hall. We did a free tour and enjoyed all the architecture, history and garden. Great place to stop and see!"], ["Reviewed August 25, 2017", 5.0, "You'll be Astonished & Speacheless at the same time!!", "Located in Downtown L.A this awesome place it's a must when visiting L.A.Best of all its free.A self audio tour will guide you around this marvelous building.I travel all the way from N.Y to see it.The outside will leave you speacheless,but the inside will leave you mesmerized.Hope I spelled that right!!Makes you wanna go back and visit L.A once again,so many things to see and do!!\nShow less"], ["Reviewed August 23, 2017", 5.0, "do not just look at the outside", "each time I attend a concert I have enjoyed the music, and also marvelling at the woods used as the interior."], ["Reviewed August 22, 2017", 2.0, "very nice building. not worth the effort", "you may take your own tour free of charge. However, as we could not enter the hall itself, the value was limited"], ["Reviewed August 18, 2017", 4.0, "Tranquil Self-guided Garden Tour", "It is so relaxing to do a self-guided garden tour behind the Hall and chatting with your friends there besides having a close look at the outside of the Hall. I impressed my Taiwanese visitors by exploring this small garden."], ["Reviewed August 17, 2017", 5.0, "Wonderful Hall!", "Beautiful building, wonderful acoustics! Saw my first symphony here and it was a lovely experience. Good snack bar too! :)"], ["Reviewed August 17, 2017", 5.0, "Marvelous Venue", "So proud to have this first class concert hall in Los Angeles. It is beautiful - exterior and interior. All associates are so helpful and friendly."], ["Reviewed August 17, 2017", 5.0, "Art and Beauty Inside and Out", "I've had the joy of DJing the Los Angles Food and Wine Festival as they blocked the street in front of this beautiful building. I loved gazing on this structure as the sun set. The architecture alone is nothing less than breathtaking. Go inside to witness the music and you are in heaven. Great acoustics and music on an orchestral level. I love this place. Eat before you go. There are not a lot of good places in walking distance. You won't regret it the experience.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Beautiful Buidling, Great Music!", "The Building itself is a must see and the Music offered is wonderful!\nGetting to the Concert Hall is HORRIBLE by freeway and parking lots are designed to confuse!\nThere is a Cafe located inside the Concert Hall, it is small with limited seating and high priced limited menu.\nEmployees are friendly and helpful!\nRestrooms are neat and clean, but limited space makes for long waits.\nShow less"], ["Reviewed August 16, 2017", 3.0, "Interesting for a building", "The Walt Disney Concert hall is near the Broad and the MOCA. On the weekend, we parked on a Sunday for $9 for the day. We wanted to take the 10 am tour but it was cancelled. We took the 11 o'clock tour but it was very crowded. A lot of people were turned away. We did not get to see the actual inside of the hall, just a video. The place is a little strange - it looks like tree trunks cut off. They emphasized that there was an organ.\n\nThere was a lot of misinformation given about the surrounding services. To clear it up - the MOCA costs $15 not $12. Tickets sold 2 hours before the performance are discounted for seniors or students, not for other people. Anyone else has to pay the standard price.\n\nI suggest that you eat before you attend the performance. A cheese plate with a few pieces of cheese and a handful of grapes was $12 and a sandwich with four bites was $10. Drinks were $15.\n\nIf you want to take the tour, arrive early.\n\nThere is not a lot to see on the outside of the building.\nShow less"], ["Reviewed August 16, 2017", 5.0, "Unusually Welcoming Tour", "This Hall is open to all on purpose and has a great self guided audio tour. It explains how it all came about as well as the architecture and design. WD's widow wanted a feelling of a rose covered small church and this was the happily accepted result.\nGo see for yourself how this apparent contradiction is resolved!\nShow less"], ["Reviewed August 9, 2017", 5.0, "Another side to Walt Disney !", "I was fascinated to hear all about the Disney Family vision for the concert hall.\nTake the tour at 12.30 its free ( though sign up at least 20 minutes in advance )\nIf you can't use the free head phones guided tour also good.\n\nHave fun .\nShow less"], ["Reviewed August 9, 2017", 5.0, "Amazing architecture and great place for music", "I have been there several times over the years to listen to classical music.\nThe sound quality is amazing and you can be really close to the orchestra.\nFood choices are pretty good: a restaurant on the expensive side and a cafeteria with a reasonable choice of hot and cold plates.\nYou should take the time to circle around and look at the building because pictures don't fully convey its grace.\nEasily accessible via the Metro (Red Line), buses and not too far from Union Station (another great building!)\nShow less"], ["Reviewed August 7, 2017", 5.0, "A Unique Concert Hall", "Wonderful Gehry building with different outside gardens and other nooks to find inside the hall. Have been wanting to visit the hall for a performance for years and finally got the chance with a summer chamber orchestra. The acoustics are great, even from the seats in back of the ensemble where we sat under the concert hall organ. All of the sight lines appear unobstructed, although some of the seating in the nose-bleed areas appear quite distant. Must return someday to hear a performance from the LA Phil.\nShow less"], ["Reviewed August 5, 2017", 5.0, "A Must See Stop", "Obviously if you can stop by for a performance that would be ideal, but simply walking around the Hall is breathtaking. The original metal finish actually blinded nearby residents, that should give you some indication to the architecture."], ["Reviewed August 3, 2017", 5.0, "If you miss the music, go for the building.", "There is a free guided tour over the building. Very, very worth. You will spend a couple of hours learning about the process of design+build the place. Great to take kids."], ["Reviewed July 31, 2017", 3.0, "Tight tight seating", "The Concert Hall was designed for those under 6 feet tall. Seating is very uncomfortable. My wife and I go only if the performances are something we can not see anyplace else. Accoustics are good"], ["Reviewed July 26, 2017", 5.0, "A Frank Gehry delight.", "In one respect this is not as good as the Guggenheim Bilbao - it is not as easy to photograph it from different angles and in different lighting conditions. However it is possible to walk around the inner walls - do not miss this - there are steps (and an accessible lift) to walk around a path and small park area with seats. It was so quiet and peaceful after a brilliant visit to the Broad gallery next door.\nShow less"], ["Reviewed July 19, 2017", 5.0, "Another gehry wonder", "Architecturally it is a beautiful opera hall, very much of frank gehry style and similar to the Guggenheim museum in Bilbao! Even if you can't get tickets for inside it is a nice place to walk around for free! There is a nice garden on top with an amphiteatre and ceramic structures!\nShow less"], ["Reviewed July 19, 2017", 5.0, "Beautiful concert hall", "Beautiful concert hall! It's not too big so it still gives a cozy feel. Acoustics inside are amazing as well as the architectural details inside and out. Definitely recommend visiting when DTLA!"], ["Reviewed July 19, 2017", 5.0, "Rogers & Hammerstein", "There are no bad seats in this house! Attended a Rogers & Hammerstein concert; the acoustics are wonderful, performers were wonderful and the orchestra played beautifully. Great way to spend the afternoon."], ["Reviewed July 18, 2017", 5.0, "A must-see", "Disney Hall is a breathtakingly beautiful venue that could probably make mediocre music sound wonderful. The seating is somewhat non-traditional and my favorite place is high up in one of the gallery seats where you look down on the performance and orchestra guests. The acoustics are near perfect. Love the place.\nShow less"], ["Reviewed July 18, 2017", 3.0, "Crazy Architecture", "The view from the street is jarring. This is crazy architecture and does not appeal to me, but it does catch the eye. Not sure how functional it is. Does not add to the neighborhood."], ["Reviewed July 18, 2017", 5.0, "Take the free tour", "Excellent free guided tour or you can do your own self guided with an audio stick. Beautiful building. Great to get information on the background."], ["Reviewed July 14, 2017", 4.0, "Interesting", "This free tour takes you all around the hall, and the other venues os the music center. You'll find hidden gardens and beautiful artwork. Well worth the time!"], ["Reviewed July 13, 2017", 4.0, "Very Beautiful Inside & Outside", "Home of the Los Angeles Philharmonic, Disney Concert Hall is a stunning piece of architecture. Surprisingly the materials used inside & outside are completely different with the outside having a \"cold\" metal look while the inside auditorium has the effect of \"warm\" wood. I believe this amazing bold architecture can only be found by the same architect in Bilboa, Spain. Note that there are very small \"pocket parks\" around the building. Fun trivia: originally the outside metal reflected so much blinding light & heat that the entire building had to be \"brushed\" to reduce the shine! Walk to the nearby Music Center to see the fountain where water disappears into the concrete!\nShow less"], ["Reviewed July 12, 2017", 5.0, "Extremely helpful staff", "We took the free audio guide tour and found it very interesting. Amazing building. The staff went out of their way to guide us on our way and give us a little extra insight"], ["Reviewed July 12, 2017", 4.0, "Amasing building", "The Walt Disney theater is one of the most amazing structures i've ever seen. Although i've visited it only from the outside because of lack of time, i think is spectacular from the inside too."], ["Reviewed July 10, 2017", 5.0, "Gorgeous Concert Hall", "Beautiful venue right downtown LA. Lovely afternoon concert, easy in and out and love the outdoor areas scattered all around the building. Wine and snacks available!"], ["Reviewed July 10, 2017", 5.0, "Take the free guided tour.", "Take the free guided tour. Includes the other 3 famous and historic theatres all in a row. Add Our Lady of the Angels Cathedral on your own."], ["Reviewed July 10, 2017", 5.0, "Beautiful inside and out!", "After years of building, it is well worth the wait. If you are a lover of music I would say some of the best acoustics around."], ["Reviewed July 9, 2017", 5.0, "Wow!", "We were staying not too far from the hall and walked to see it after dinner our first night in DTLA. Having visited the Gehry Guttenberg Museum in Bilboa, Spain, it was a must see for me. Took some evening pictures and looked around the main hall (all that was open when we visited).\nShow less"], ["Reviewed July 4, 2017", 5.0, "Stunning Building Inside and Out", "I went to see a concert in the Concert Hall - awesome interior and great acoustics. Outside this Frank Gehry designed building is architecturally outstanding. There is a garden level well worth a visit."], ["Reviewed June 28, 2017", 4.0, "Beautiful Sunday afternoon", "What a delightful way to spend a Sunday afternoon. We listened to a concert by \"Wagner at the movies\". The maestro was very entertaining and the orchestra and choir were superb.\n\nI couldn't get enough of The architecture in the hall. I just wanted to keep looking.\n\nIf you get a chance spend a Sunday here.\nShow less"], ["Reviewed June 28, 2017", 4.0, "You'll Want Some Pictures", "Only saw the place from the outside but what a striking building! It may not be worth a special trip but you'll certainly want to see it if you are nearby."], ["Reviewed June 25, 2017", 5.0, "Beautiful", "We didn't go in the concert hall but drove by it. The architecture, thanks to Frank Gehry, was really neat and fairly iconic. I was glad we detoured to see it and take a photo, but without Los Angeles Philharmonic tickets, I didn't feel the need to go inside.\nShow less"], ["Reviewed June 25, 2017", 3.0, "Striking architecture", "If you are in the vicinity then definitely worth admiring the building, as the architecture is striking. However, unless you are a particular fan of classical music or architecture I wouldn't say it was worth a special trip."], ["Reviewed June 22, 2017", 5.0, "Amazing", "The building is so fantastic I like musical music I saw lots of souvenir are really cool! I want to buy all of these!!!"], ["Reviewed June 22, 2017", 4.0, "Beautiful", "Another great free attraction in LA where you can take a self guided audio tour or just stroll around as you pleased. I personnally only visited the gift shop (very nice) and the third floor where I could enjoy sitting in their main concert hall (beautiful!) and view their interior garden.\nShow less"], ["Reviewed June 21, 2017", 5.0, "Heavenly", "This place will have you travel with music in your soul, just close your eyes and you'll feel you are in the Classical era. Its A must for the classical music lovers. the philharmonic must see. Plus Walt Disney Hall has a lot of exciting shows.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Get in, if you can.", "Sometimes a stunning building can disappoint when it comes to experiencing a performance inside. Unlike the Sydney Opera House, in my city of Sydney, the Walt Disney Concert Hall surpasses any expectations from the outside in. We visit Los Angeles often and watched as the titanium panels were lifted into place on this stunning building. We have since seen a variety of performances there and each time we are bowled over by the beauty of the wooden fittings, the acoustics and the service areas within. One slight drawback is the number of season ticket holders who merely turn up regardless of who or what may be on stage. This reduces the number of seats available for visitors to Los Angeles who may only have a few days to chase a ticket or two. It is a cultural highlight in this city which is supposed to be an intellectual desert. Sheer beauty.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Unbelievable architecture outside and inside", "Attended the opera \"Young Caesar\" June 13, 2017. Amazing visual and audio experience. Unique use of the space. A stimulating evening that I would love to repeat. The LA Phil. New Music Group was actually made the center of performance with unusual instruments. The singers, dancers, illustrations, film, and puppets moves around them. My first experience in this venue and I loved it.\nShow less"], ["Reviewed June 13, 2017", 4.0, "Tour for free", "You can take a 90 minute guided tour or a 60 minute self -guided audio tour. we did the later and cut it short beacuse we were hungry. This is an amazing piece of artchitecture and the audio tour is clear and interesting. Well- worth doing.\nShow less"], ["Reviewed June 12, 2017", 3.0, "Very special building style", "The building is really special and worth some snaps. However the day i visited has nth going on there and even the souvenir shop & restaurants were closed so didn't really expereince that much."], ["Reviewed June 11, 2017", 5.0, "A Frank Gehry Dazzler", "Some day I will attend a performance inside, but in the meantime, I am just thrilled to come gaze upon the structure. It's beautiful. I wish I knew about it before a long journey in Spain to see the 'cousin' building in Bilbao (the Guggenheim). I don't regret visiting the latter, but as a northern Californian it would have been a lot easier to visit the Los Angeles masterpiece, but I didn't know about it until after the trip to Bilbao!\nShow less"], ["Reviewed June 9, 2017", 5.0, "Free self guided tour with audio", "The architecture of this building is amazing. As seen from the outside it looks like it will be dark inside until you walk inside and see all of the natural light coming into the building. frank gehry is an amazing architect, and this building really stands out against the sunny california sky and contrasts beautifully, Well worth the stop and walking through the building exploring all the nooks and crannies. While did not have time to see a show, i think it would be amazing to see an orchestra perform inside.\nShow less"], ["Reviewed June 6, 2017", 5.0, "Worth A Visit Just To See The Building", "This is a Gehry gem!! I worked on the Beekman Tower Gehry project in NYC so I am a fan of his work. Whether you are a design enthusiast or not, this is still an awesome visual treat."], ["Reviewed June 5, 2017", 5.0, "Last concert of the 2016/2107 season...", "As a subscriber it is always sad to know that I will have to wait a few months until the 2017/2018 begins. But looking back at the 18 performances I attended, there are some great memories to be had from this tremendous orchestra and the beautiful Walt Disney Hall. We do not often get to introduce someone to the excitement of a first visit to the Hall and their first LA PHIL performance. This past Sunday, yesterday we had the opportunity to do just this. And what a time it was. Gustavo Dudamel conducting, Stravinsky, Bartok and Janacek, with Yuja Wang as soloist. We had attended the concert the Sunday before, during her first of the two weeks here in Los Angeles. It was fantastic to listen and to watch her play. However, from our regular subscription seats we do not get a look at the hands while playing. We were so lucky two days prior to the concert, to add on these seats on the other side of the hall and to watch her hand movements. My God, my fingers do move like that; the speed, power, lightness, placement and precision was just thrilling to watch. As were her 2 encores that elicited more standing applause than I have ever seen here. The audience roared with the conclusion of each. We showed our guest the usual routine, an hours drive from Orange County, a light lunch at the Patina Cafe within the hall, 1PM pre concert talk, UpBeat Live, pre order drinks for intermission, and settle into our seats and watch the people enter and be seated. Always amazing to see the clothing, from short pants and Hawaiian shirts, to suits and ties. Barely there dresses, to 1960's hippie style long skirts, no make up to way too much plastic surgery. But we all have in common the music and the love for the LAPHIL.\n\nShow less"], ["Reviewed June 2, 2017", 5.0, "Stunning architecture", "Saw this from the outside only. Incredibly unique architecture with its metallic wavy folds. Took a peek inside and saw a concert hall much like Sydney Opera House's interior."], ["Reviewed June 2, 2017", 5.0, "A visual and aural treat", "The Frank Gehry design sits atop a hill in downtown Los Angeles that has become the culture neighborhood of museums and performance halls. Disney Hall as it is colloquially known is home to the La Philharmonic which is worth a listen anywhere you find them. Music Director Gustavo Dudamel is a gift from Venezuela infinitely more valuable than the oil from his country. His innovative and energetic programs have opened eyes and ears in LA to repertoire that is often modern and drawn from not often heard pieces. There are plenty of traditional programs as well. Disney Hall doesn't have a bad seat in the house. Sight lines are better than in any other hall I know, and the acoustics are even throughout. Do not hesitate to go for the cheap seats in the 5th level where prices are affordable and sound is even better than in the orchestra. L.A. now has one of the great concert halls of the world, ask the musicians, they love it too. An on-site cafe and ample parking (not cheap) are available.\nShow less"], ["Reviewed June 2, 2017", 5.0, "One of LA's newest icons. Not a bad seat in the house.", "I finally feel like I have visited the Walt Disney Concert Hall enough times that I can really write about it.\n\nThe Disney Hall is an icon of Los Angeles for so many reasons. It is the home of the Los Angeles Philharmonic and plays host to a variety of musical performances from classical, jazz, and world musics. Artists include everyone from Björk to Bramwell Tovey. Frank Gehry's architecture features attention-grabbing curving and swirling metal and cool white stone on the outside, juxtaposed with colorful carpets and warm woods on the inside. There is a staircase on the north side of the building that leads to a sculpture garden that has a fine view of Bunker Hill, yet feels cozy and tucked away from the din of downtown.\n\nThe WDCH offers free hour-long tours during most days, including guided tours for concert goers ahead of select performances. You can also take a self-guided tour with audio narration by actor John Lithgow.\n\nThe auditorium is an acoustic marvel. Sound carries to every corner without echoes. The pipe organ in the center of the room draws your eye to it with its seemingly haphazard array of pipes (unless you are seated in the rear orchestra section, in which case, you should take some time before the show to admire the organ from a vantage point on the other side of the room). Though ticket sales warn of partially obstructed views, I have sat in these partial view sections, and did not find any obstructions. The auditorium itself is remarkably small (capacity holds 2265 people).\n\nThe Los Angeles Philharmonic takes care to provide an excellent concert experience, so they take such things as audience punctuality and conduct very seriously. The lights in the lobby will flicker 5 minutes ahead of performance time. If you do not take your seat, the usher will not allow you to enter the auditorium until there is a suitable break in the performance. Photography is STRICTLY PROHIBITED during performances, though you are welcome to take pictures before and after the show. A friendly voice will remind you to silence your electronic devices. If you do not heed this warning and your mobile phone goes off, the usher will send you out if your fellow audience members haven't killed you first.\n\nWhile this is a fairly casual theatre compared to some concert halls, call me a snob, but I think it would behoove patrons to familiarize themselves with proper symphony etiquette ahead of time. It's not a black tie sort of place, but dress neatly and appropriately. Applaud the concertmaster and the conductor. Don't applaud between movements of a musical piece. Sticking to these rules will ensure a good experience for everyone in the audience (and not create unwanted distractions for performers).\nShow less"], ["Reviewed May 27, 2017", 5.0, "Great Acoustic and Orchestra View from Rear Terrace Seats", "We booked the week before the concert when the best seats available to us were near the back of the Terrace. The acoustics, ambience and orchestra view from our seats were superb at this great concert with Yuja Wang, Dudamel and the Los Angeles Master Chorus. Not inexpensive, but excellent value and enjoyment. Also there is an excellent restaurant, Au Lac, and coffee shop, Prime Grind, right across the street (West 1st Street).\nShow less"], ["Reviewed May 26, 2017", 5.0, "Not to be mussed", "I have lived in LA for most of my life and have been a subscriber to the LA Philharmonic for many years. Disney Hall is spectacular, inside and out. The building represents Frank Gehry at his very best. The interior is stunning - the woodwork is spectacular, the acoustics are near perfect and the LA Philharmonic is among the world's top symphony orchestras. While the price for seats is on the high side, I would suggest that a visitor treat themselves and spend an evening of fine music and beautiful surroundings at Disney Hall\nShow less"], ["Reviewed May 25, 2017", 5.0, "Amazing Concerts!", "This is a terrific place to hear a concert. The architecture is beautiful and there are plenty of nice restaurants in the area. Make a date night out of this one!"], ["Reviewed May 24, 2017", 5.0, "Opera and symphony and a fabulous building", "My grandchildren take visits to the Disney Concert Hall very much in stride while their grandmother is ecstatic. They attend concerts designed for children but the building is designed for lovers of beauty and thoughtfulness. Oh my. You won't be satisfied with lesser halls after you have been here.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Great music in a glorious setting", "This concert hall designed by Frank Gehry is a magnificent venue to hear classical music. We had the opportunity to hear Gustavo Dudamel conduct the LA Phil here, and it was a soul satisfying experience. A superb experience and worth making a trip through the messy LAX airport !\nPut this one on your Bucket List\nShow less"], ["Reviewed May 23, 2017", 1.0, "Christmas carol", "My aunt bought us tickets that was nice of my aunt, However, we not treated with respect. Customer service could use work and the show could have been more exciting."], ["Reviewed May 22, 2017", 4.0, "Very special", "I would say it's a very special place if you admire music, architecture or just want to find something different in LA! I also believe it's one of the most photographed spots of DTLA (best time would be a sunset if you want to snap a great shot). Place has same intriguing character inside as it's looks from outside. Great acoustics and great visibility from almost any seat. Couple of small bars inside have simple refreshments and snacks but I wouldn't count on having something substantial or special inside, besides there are plenty great restaurants around (like Otium for me). Parking is a breeze!\nShow less"], ["Reviewed May 20, 2017", 3.0, "Cool architecture", "Cool to see, and the shop is great for music fans, but I wouldn't go out of my way to see it. If there's a concert, then it would be a cool place to be. They also offer tours, but I didn't get the chance to take one.\nShow less"], ["Reviewed May 20, 2017", 4.0, "Superb Design!", "This was one of the activities I wanted to do and I loved it! The design is very futuristic but the curves and shape makes it feel like a masterpiece. If in LA I would definitely recommend this."], ["Reviewed May 18, 2017", 5.0, "Breathtakingly beautiful", "All the other reviewers have covered many facets of this incredibly designed concert hall, from the architectural wonder of Gehry's creative talent to the impossibly perfect acoustics. This place is an opportunity to have your senses dazzled, including the exquisite interior design incorporating three different types of wood as well as the stunning organ. The attention to detail is beyond perfect. From Gustavo to Yo-Yo, it is a sensory explosion to be present for every performance. We are absolutely blessed to have LA Phil in our city.\nShow less"], ["Reviewed May 18, 2017", 5.0, "Beautiful Gehry building", "Beautiful Frank Gehry building. Free tours are offered weekdays only earn there is not a concert. Check the weekday schedule so you won't be disappointed. If it's sunny out, the metal sides heat up the surrounding areas at least 10-15 degrees."], ["Reviewed May 15, 2017", 5.0, "Concert by the LA philharmonic- I am speechless!!!", "The concert hall is such an architectural masterpiece. Beautiful design. Modern, clean, wonderful staff. We had seats on the side upper rows and were able to look down on the orchestra which afforded us not only a great vision of the musicians playing, but also the sound was amazing. Gustavo Dudamel is a true treasure! We were thrilled to be able to experience this concert.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Most amazing Gehry Architecture/ Outstanding Acoustics", "This building, inside and out, is a phenomenon! The Disney Company deserves wild applause for what they created in this space. If I lived nearby I'd have to just drag out a chair and sit and stare at it. The sun light changes the exterior. Inside, the orange walls glow and the skylights change color with the help of hidden lights (I'm guessing.) We were fortunate enough to see Yo Yo Ma, Edgar Myers and Peter Thile, all 3 musical child prodigies, perform Bach there. If that were not enough, we came back two days later to hear Gustavo Dudamel conduct the LA Symphony in Straus and Mahler pieces. Put this place and its world-class performers on your bucket list!\nShow less"], ["Reviewed May 11, 2017", 5.0, "Awesome concert", "The Yoyo Ma concert was music to our ears as the acoustics were just perfect. It was delight getting in and out of the venue. A great place for a concert"], ["Reviewed May 6, 2017", 5.0, "There's a Dude in the House", "I don't claim to enjoy the classical music scene, yet when Gustavo Dudamet conductors the LA Philharmonic, you should listen. Under his energetic leadership the Orchestra reaches new heights. You will Not be disappointed in the musical program. The Walt Disney Concert Hall is without a doubt, world class. The acoustics were superb. Fans of Classical Music do not miss this scene.\nShow less"], ["Reviewed May 6, 2017", 5.0, "One of a kind", "Great place to see music. The design (by Frank Geary) is amazing and the sound perfect. Worth a tour if you can't see a concert."], ["Reviewed May 4, 2017", 4.0, "Beautiful Concert Hall, Patina is in the same Building", "The WDCH is a stunning piece of Art inside and out. I love coming here. Patina is in-building if you want to have a Splichal experience. The Broad is next door if you want Otium for dinner. Wander about and sense the architecture, attend a concert here if you like. The acoustics is very good, not excellent.\nShow less"], ["Reviewed May 1, 2017", 5.0, "This is a feast for the eyes and the ears!", "The Walt Disney Concert Hall has wonderful acoustics, comfortable seats, a fantastic organ, beautiful rooftop gardens, a fountain dedicated to Lillian Disney, a shop full of music related gifts for adults and children, and an aerial walkway around the top. If you are able to attend a concert here, absolutely do it!\nShow less"], ["Reviewed May 1, 2017", 3.0, "Cool architecture.", "If you have time over in LA, I suggest you to drive downtown and have a look at Walt Disney Concert Hall. It has a super architecture and you can get a lot of cool pictures there. And also it's free. I enjoyed it since we had a lot of time, but wouldn't say that it's a must.\nShow less"], ["Reviewed April 29, 2017", 4.0, "Great architecture", "The outside of the building appears amazingly cool and modern but within it are warm shades and has good use of lighting. Go on the free audio tour or if you prefer a personal touch to join the daily tours available at 1230pm."], ["Reviewed April 28, 2017", 5.0, "Brilliantly designed building offers beauty inside and out", "Walt Disney Concert Hall is a national treasure. The acoustically perfect performance hall was designed by legendary architect Frank Gehry and opened in 2003, part of the beautiful Music Center complex which also includes the Dorothy Chandler Pavilion, Ahmanson Theater and Mark Taper Forum.of the Los Angeles Music Center and was designed by Frank Gehry. It is in a perfect location -- with pretty shops and restaurants nearby, and even if you are not going to a play or concert, you will enjoy strolling the grounds, having a cup of coffee or a beverage at one of the outdoor bars and eateries, enjoying the buskers (always talented) and arranging a tour of the building if there is not a concert. Gustavo Dudamel conducts the fabuous Los Angeles Philharmonic, a treat. Many world class orchestras also perform there. Don't miss it. And plan to stay at the fabulous Omni Hotel, right across the street. Fine fare there and often live music to continue your cultural immersion. We have posted many travel stories about this delightful part of town at whereiscookie.com.\nShow less"], ["Reviewed April 27, 2017", 5.0, "One of Gerhy's greatest.", "I live in near San Diego and I made it a point to visit the Walt Disney Concert Hall after moving here from Phoenix. During a recent trip to Los Angeles, I was able to fit it in to a Saturday morning. What a piece of art this building indeed is! I explored all sides and even spent a little time inside. Even if you're not attending an event at the concert hall - give it a visit.\nShow less"], ["Reviewed April 24, 2017", 5.0, "A must-see in L.A.", "Not only is Disney Hall an architectural marvel, the acoustics for concerts are superb. Highly recommended."], ["Reviewed April 23, 2017", 5.0, "An excellent venu for music.", "My husband and I spent an evening at the Wat Disney Concert Hall listening to the LA Philharmonic Orchestra during the Reykjavik (Iceland) Festival. What a fabulous place for music! The acoustics are extraordinary and the building (exterior and interior) are worth a visit of itself. Kudos to the LA Philharmonic for thinking 'outside of the box' and bringing new music to a younger audience.\nShow less"], ["Reviewed April 21, 2017", 5.0, "Great acoustics and fascinating architecture", "The Disney Concert Hall has great acoustics. No matter where you sit you can see well and hear well.And the architecture is interesting."], ["Reviewed April 21, 2017", 5.0, "About the Tickets", "Based on my personal experience, if you are planning to purchase ticket for a LA Phil concert, go to the LA Philharmonic website! Don't just search for 'Walt Disney Concert Hall tickets'!\n\nThis is exactly what I did. I was lead to the Ticket Center website which appears no different than a normal ticket page and purchased two LA Phil tickets which are 3 times priced as on LA Philharmonic website! After I eventually figured out the trick I was so regret but no way to get refund. This is a trap especially for the tourists who are not familiar with the local concert but only know Walt Disney Concert Hall.\nShow less"], ["Reviewed April 19, 2017", 5.0, "Great acoustics and a gorgeous, innovative venue", "The Disney Concert Hall is a must-experience site in DTLA. The acoustics are wonderful, and the entire building inside and out is aesthetically pleasing. There really isn't a bad seat in the house. Combine a concert here with one of my favorite DTLA restaurants, Baadmash, a wonderful contemporary Indian place. You can walk there easily from The Disney Concert Hall.\nShow less"], ["Reviewed April 19, 2017", 5.0, "A breathtaking space for breathtaking music", "Frank Gehry's use of steel is well known, and Chicago and Bilboa claim similar structures to this one. But what makes Disney Hall unique is the variety of Japanese gardens that sprung all around the concert hall, accessible from the hallways. It is the most amazing feeling to go to a concert there, and walk out at intermission to the most serene and dramatic garden I have ever seen.\nShow less"], ["Reviewed April 18, 2017", 5.0, "Walk around inside and out", "This is one of the few venues that you need to walk around, inside and out, to get the full effect. There are doors outside the second floor, and you can get a good view of the city looking outward, and a great view of the building's architecture, looking inward. you don't have to be a fan of architecture (perhaps you are a fan of music instead:--)) to enjoy a walkabout of this building.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Love Frank Gehry", "Self guided tour is a great way to navigate the building and learn about the centre, & its free.The outdoor garden is a particular attraction, a picnic lunch here is perfection, Its disappointing you cannot get into the Auditorium."], ["Reviewed April 16, 2017", 4.0, "Awesomearchitecture", "Easy accessible and with fantastic shapes of the facades. The small garden and its mosaic fountain also looks nice. Short time visit when you are in the neigborhood. Don't drive hours to see it."], ["Reviewed April 15, 2017", 5.0, "Premium sound and concert experience", "Walt Disney Concert Hall is one of the premiere places to see a concert in Los Angeles. The venue was built for optimal sound and every seat is good.\n\nIt's also a distraction-free venue. They don't allow cell phone use, photos, nor videos during the show, and people are only seated between songs and during intermission, so you can relax and get completely immersed in the night.\n\nI've seen Fiona Apple, Ben Harper, Sigur Ros, and more at WDCH - every show has been exceptional.\nShow less"], ["Reviewed April 15, 2017", 5.0, "Amazing Sound", "The Disney Concert Hall was built specifically for concerts, and I haven't been disappointed yet. I've attend a variety of performances here showcasing diverse musical styles, and every time it has been a pleasant experience. It truly has become one of my favorite venues in Los Angeles.\nShow less"], ["Reviewed April 15, 2017", 4.0, "Walt Disney Concert Hall", "An absolutely beautiful building! We loved just looking at the architecture. Easiest is to drive around it to view as parking on the street wasn't really possible. That was you can get a lovely pic. Be warned lots of traffic though!"], ["Reviewed April 13, 2017", 4.0, "Great to See this Iconic Building in Real Life!", "As well as seeing the unusual exterior designed by Frank Gehry, you can take a self-guided tour of the interior (but not the auditorium, because there are often rehearsals occurring). The Nimbus art installation in the foyer – a cloud-like formation that changes colour and plays music – is mesmerising. The LA Phil Store has a stunning array of music-themed goodies on sale.\nShow less"], ["Reviewed April 13, 2017", 5.0, "What a Classical treat!", "I love the Disney Hall in the LA Music Center. Matinees are our favorite since the traffic and parking seem a bit easier. The seats are comfy and the feeling in the Hall is airy, modern, yet warm. Love the orchestra. Esa-Pekka conducted as a guest, great to see him again.\nShow less"], ["Reviewed April 13, 2017", 5.0, "an architectural gem", "An amazing place to see, walk around outside and in, even if your not seeing a performance. Go to the cafe, its an amazing building"], ["Reviewed April 12, 2017", 5.0, "Beautiful Building, Marvelous Music", "We have season tickets to hear the LA Symphony at Walt Disney Concert Hall. Always a great night out. The architecture is stunning, the concerts moving, the museum shop interesting, the cafe very convenient and reasonable. Can't go wrong.\n\nThe tour of just the building is good too. I've taken relatives on that and they thoroughly enjoyed.\nShow less"], ["Reviewed April 12, 2017", 5.0, "A Gehry Masterwork", "Downtown Los Angeles is starved of ground-breaking architecture...the kind that makes one stop and wonder, Who designed that and how is it built? The Walt Disney Concert Hall is one of those buildings, and here's your opportunity to get up close and personal with one of Frank Gehry's masterworks.\n\nPritzker Prize-winner Gehry crumpled a piece a paper and conceived of a seemingly random structure, then engineered it to become a world class symphony hall. This kind of architectural conception doesn't happen everyday, so take time to appreciate this amazing building inside and out.\n\nThe LA Music Center conducts FREE docent-guided tours on most days at 12 noon and 1:15 pm. Self-guided audio tours are from 10:00 am to 2:00 pm. Be sure to consult the tour schedule on The Music Center's website, because some days are blacked-out for tours. We opted for the docent-led tour which lasted one hour and was very comprehensive. The interior hall is closed to tours, but this chance to walk through nooks and crannies doesn't disappoint.\n\nThis is a MUST for armchair architects and every Gehry fan. Park in the Disney Hall parking garage and have your parking ticket validated at the tour desk in the lobby. The discounted parking rate is $9.00 with validation, and again, the tours are FREE.\nShow less"], ["Reviewed April 12, 2017", 4.0, "Gorgeous design that adds to the modern feeling of DTLA", "Beautiful building and center of culture a part of the Los Angeles Music Center. A must see for photos and, if there the symphony playing, it is well worth a stop."], ["Reviewed April 11, 2017", 5.0, "One of My Favorite LA Places!", "We go to the Disney for a concert series and it remains one of my most favorite places in Los Angeles. It is exquisite on the outside, especially in daylight, but also at night -- a true work of art. The concert hall itself is brilliantly designed, and the LA Philharmonic a joy to hear. Go go go if you're in L.A. (despite the only fair restaurant in a dingy corner of the first floor!).\nShow less"], ["Reviewed April 11, 2017", 4.0, "Symphony Hall (UK) is better and cheaper", "We attended a Los Angeles Philharmonic concert and sat behind the orchestra, even so the acoustics were very good. We are fortunate to like near Birmingham (UK) and have access to the work leading Symphony Hall where you can get similar seats for half the price. We pre-ordered wine for the interval and were disappointed to be served poor wine in plastic cups (and it wasn't cheap either). This took the gloss off an otherwise good night out\nShow less"], ["Reviewed April 10, 2017", 4.0, "Great sound, comfortable seating, ugly.", "We have been there for 3 concerts; sound is terrific. Had great seats and cheap(ish) seats. All were good. Parking ample, but slow to exit."], ["Reviewed April 10, 2017", 5.0, "Simply the best", "Gorgeous interiors, weird and awesome exteriors/lobby. Been Here five or so times, loved every instance."], ["Reviewed April 8, 2017", 5.0, "lovely venue", "The main room of the Walt Disney concert hall is a lovely space - every seat in the house has a great view of the stage."], ["Reviewed April 6, 2017", 5.0, "A wonderful experience", "Even for a New Yorker and frequent Lincoln Center visitor, the Disney Center is a treat. Beautiful building, garden, options for walking and dining, all true, but the orchestra itself is amazing. We had seats behind the orchestra so we could watch the conductor-- a truly thrilling experience. Make this a stop and splurge on the tickets. Really, really, really worth it!\nShow less"], ["Reviewed April 3, 2017", 5.0, "Remarkable", "A masterpiece of architecture and engineering! Frank O. Gehry and his works are incredible! You must see and touch this building!"], ["Reviewed April 2, 2017", 5.0, "Unforgettable", "What a treat to be able to squeeze in a concert at the Disney. The Frank Gehry designed Hall never ceases to amaze me. LA is so fortunate to have this. Make sur3 you come early so you can walk around and visit the garden on the 3rd floor.\nShow less"], ["Reviewed March 31, 2017", 5.0, "Truly remarkable architecture and a well-conceived environment", "We have season tickets to the LA Philharmonic but we've been to the Disney Hall any number of times since it opened. There are several distinct possibilities when planning a visit.\n\nThe most rudimentary is to walk the grounds and building. Frank Gehry's conception is truly remarkable and one gets a full appreciation by walking around the place. There is a garden and amphitheater in back as well as superb scenic views of downtown LA.\n\nThe second experience would be to take in a concert. The LA Phil is one of the country's great orchestras and the sound within the auditorium is outstanding. We've sat in orchestra, orchestra east and terrace west seats and the sound is good in each section. However, the terrace sections are a bit narrow and my wife experienced a bit of vertigo getting to our row 1 seats. The viewing angle is a bit weird (high and to the side) but it can be advantageous for piano concerts. Terrace is quite reasonably priced for what you get.\n\nWe prefer Orchestra East or West seats. We're close to the orchestra and having a view angle that is arguably better than orchestra (which is, of course, an excellent section).\n\nAlso visit the gift shop, particularly if you're a musician or play a musical instrument. A very nice and different selection of merchandise from other gift shops.\n\nAnd for a special experience, have pre-concert dinner at Patina restaurant. Fine dining at a pinnacle.\n\nBuilding parking is ample. You can get to the Disney via the Metro. The stop is Civic Center, but it's a bit of an uphill walk.\n\nThe Broad Museum, Museum of Contemporary Art, Music Center and Colburn School of Music are within a block and each is worth visiting. And the Cathedral of Our Lady of the Angels is two blocks in the other direction but is a don't miss stop.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Iconic", "A beautiful display of architecture and interior design. Amazing acoustics , best place to see an indoor concert in a large LA venue regardless of the genre. Seats in all price ranges , not a bad seat in the house ! A Gehry great!"], ["Reviewed March 30, 2017", 5.0, "Unsurpassed", "This venue is one of the most beautiful and satisfying concert halls in the world . Architecturally it is stunning with curved surfaces everywhere that are mellowing, colors that are soft and inviting, There is a public garden accessible from both the street and from the concert hall . The acoustics are nearly perfect . The organ is a sight to behold. It is also honored by all of the world's organists that I have heard performing there . The current orchestra and its conductor, Gustav Dudamel are deservedly world famous.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Iconic Architecture", "Make this part of your walking tour of downtown Los Angeles. The building is by Los Angeles architect, Frank Gehry and is amazing to gaze at. You can walk around inside and take a tour or better yet, attend a concert here. The inside is all wood and so it presents the opposite of the exterior metal facade.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Wonderful concert hall located in downtown Los Angeles", "Beautiful facility, excellent sound system, unusual decor. Whatever you go to see, the music fills the air and makes you feel a part of the event, easy access, handicap accessible, Have been there in several occasions. Enjoy it each and everytime."], ["Reviewed March 25, 2017", 5.0, "Beautiful! Wonderful venue!", "Beautiful venue! We went to a symphony. Nice acoustics and comfortable seats. Enjoyed the evening very much!"], ["Reviewed March 22, 2017", 5.0, "Stunning.", "It IS an architectural landmark building, especially as a music concert hall. Although more impressive for a distance than up close, the real surprise is the hall itself. If you can get past the miss-guided choices for carpeting and seat covers, it is a stunning hall, visually and acoustically. My choice for best seat in the house? Behind the orchestra, so you're looking at the conductor.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Amazing", "Originally, I went there to take some good pictures of the building's architecture after the Broad museum had a huge line in the front but ended up walking in and taking the free audio tour.\nThe hall itself was impressive but going through the audio tour I appreciated it even more. The tour takes you through the building, back gardens and even on the roof (almost roof).\nIt was one of the best experiences I had while visiting LA this time.\nHIGHLY RECOMMEND!\nShow less"], ["Reviewed March 19, 2017", 4.0, "Check out the back yard", "A must see building in LA, worth visiting. For architects it is iconic and they should visit the back yard to see also these views and the trees."]]}}