{"Walt Disney Family Museum": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Walt Disney Family Museum", "url": "/Attraction_Review-g60713-d1556974-Reviews-Walt_Disney_Family_Museum-San_Francisco_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/cc/92/3f/photo1jpg.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2381"}, "address": {"@type": "PostalAddress", "streetAddress": "104 Montgomery St The Presidio", "addressLocality": "San Francisco", "addressRegion": "California", "postalCode": "94129-1718", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 6 days ago", 5.0, "Brilliant Museum", "We travelled to San Francisco to visit this museum, and spent all day there. The displays are exceptional, the museum is very clean, the staff are friendly and helpful, and gave a personal story of Walt Disney and his family. We stopped during the day to have tea in their cafe, and it was very reasonable.\nShow less"], ["Reviewed 1 week ago", 4.0, "Worth Seeing for the Whole Family", "I visited the Museum on 02/18/18. One adult and one senior ticket is $45. But I feel I received my money's worth. The Museum is a testament to Walt Disney and his company. They have provided entertainment for kids, young and old, for over 60 years. The museum takes one on a magical tour of the Disney family and the progress Walt made during his early years as an illustrator and cartoon developer.\nShow less"], ["Reviewed 1 week ago", 4.0, "You understand who he was", "Great display of examples that qualify Walt Disney first of all as an innovator. Unforgiveable the little material on Mary Poppins -but you do understand that Disney corporation is probably not backing this museum."], ["Reviewed 1 week ago", 5.0, "Great Experience", "The place alone is located in a beautiful location. The museum had a great set up. Depending on what pace you go, it can take about 1.5-2hrs to do it."], ["Reviewed 1 week ago", 5.0, "Fascinating wee gem, tucked away in San Francisco", "I came across this museum by accident and as a Disney fan, caught the local bus service to visit. The area and buildings were interesting, it is a beautiful part of the city with great views of the Golden Gate bridge. Inside a treasure trove of Disney history that I found fascinating and well presented.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Fun experience with lots of content", "Located in the old Presidio buildings near Crissy Fields, the Walt Disney Family Museum is a fun and informative look into the life and work of Walt Disney. There is a lot of content here. With personal items, videos and animated works, it really tells the story of Mr. Disney. It takes about an hour and a half to two hours to get through and there is a cafe, gift shop and coffee bar on site. We showed up on Walt’s birthday and were surprised to find out the entrance fee was waived. A nice surprise. It’s worth a visit for any Disney fan.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Comprehensive museum in a great location", "In addition to all the info on Walt himself, there is a great view of the GG bridge, and the Presidio has lots of hiking trails, and a nice historical museum. The museum follows Walt's life, and we all know he died, so be prepared to cry at the end of the museum - Mickey in tears, of course that never fails to make me cry too!\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Great Museum!", "This is a well laid out museum with lots of interesting things to read and watch. I'm not sure its great for children as there is a lot to read and not much hands on interaction for them, but for me as an adult it was great.The size of the museum took me by surprise, i expected to just spend an hour there but ended up nearly 3 hours! It shows a lot of the early (traditional?) Disney life and works. Well worth the money.\nShow less"], ["Reviewed 3 weeks ago", 3.0, "I had high expectations", "I LOVE all things Disney. And I knew this was a museum about the man, not the parks. But I have to say my husband was bored out of his mind. My daughter and I enjoyed it a bit more, but we were all 3 somewhat disappointed. It was mostly a lot of reading. Which got tiring after a while. We did enjoy seeing the memorabilia that was in the museum. I did love the miniature version of Disneyland towards the end. That was impressive.\n\nThe map showed there was an Exhibition Hall around the corner. We walked there and all the doors were locked. The building and the surrounding grounds were very beautiful.\n\nAnd do take care when using a GPS. There are 2 locations for this address with the only difference being the zip code. This was on our tickets but we didn't notice it immediately. We had considered walking from Fisherman's Wharf but our GPS pulled up the closer address which was a mile away. The museum is actually over 3 miles away! So we took an Uber.\n\nI thought it was little expensive at $25/ticket. Would probably not do it again. And I don't think young children would care for it at all. I hate saying anything bad about anything Disney, but my expectations were high for this.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Not your average museum", "You can visit this place many times and watch classic Disney movies. While to a theme park, it has plenty of familiar faces. It shows how the Disney magic is made, many of the awards, the history, the \"inside\" view of the Disney company. Big bonus view of the Golden Gate bridge surprises you going form one section of the museum to another. An unexpected gem in the Presidio.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Interesting for Disney Aficianados", "The museum is in one of the Presidio buildings so that in itself was of interest. It takes about 2-3 hours if you really examine all the artefacts. We were a bit fast paced, only because we were trying to time the Hop On Hop Off bus transport. The museum has mostly Disney movie, disney art, and disneyland (s) history and then small segments of Disney family history that were very enjoyable. NIce gift shop and food service available.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "A Supercalifragilisticexpialidocious Experience", "The location of the Walt Disney Family Museum on the beautiful Presidio grounds in San Francisco came as a surprise. After all, Disneyland is down in Southern California. The quality of the museum, however, was everything you'd expect from a Disney attraction. Educational and entertaining exhibits abound, taking visitors on a tour of Walt Disney's life and his many outstanding contributions. Be sure to allow plenty of time to savor the different galleries.\n\nOur visit took place during a special exhibition featuring the work of renown artist Eyvind Earle, famous for the paintings in Sleeping Beauty. Touring the special exhibit (which changes every few months) was well worth the extra cost of admission.\n\nPhotographs without flash are allowed.\nShow less"], ["Reviewed January 23, 2018", 4.0, "History of Disney", "Very interesting museum PACKED with Disney history. I wouldn't really recommend this for kids, as it is very info heavy. As a Disney-phile, I loved this place. Situated in a pretty building off a quiet green square, this is a perfect place to spend a couple of hours browsing through - learning more about the man behind the modern-day behemoth, and seeing actual pieces of your childhood behind glass (animation cells, sketchbooks, paints, models, original merchandise, family photos, etc.) There are various interactive sections of the museum, but probably not enough to keep young children occupied while you're trying to read through the info. There's a gift shop & coffee shop at the end as well.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Lots of Surprising History", "Whether you're a Disney fan or not, you'll find this place interesting. Just learning about Walt's history and legacy was quite interesting. Did you know Walt had a Doctorate Degree? Or that Walt essentially put Technicolor on the map? Neither did I until visiting this museum. All of the awards he received during his lifetime, and the creation of the parks.\n\nYou'll also learn about how he use to work on a farm, all the hardships his family endured and came out on top, good values that most take for granted, it was a very educational and took you down memory lane from early years up to the present.\n\nThere are items from Oscars, to medals, to actually internal memos, to the jeep he drove in the war, etc. There are live recordings of him, you'll even get an opportunity to operate one of the animatronics as the puppeteers did, its just simply too much to list in this review you'd be reading forever.\n\nTickets in my opinion were a bit high, if you are a student definitely ask for student discount adult tickets are $25 per person. Parking is free which is nice as if you are in the San Francisco area there is no free parking anywhere.\n\nYou are allowed to take as many photos as you like, so long as the flash is OFF as in NO FLASH, its amazing how many people don't understand that, especially with camera phones, a flash is a flash; I digress; as in true Disney fashion all rides must end at the gift shop, so does this tour whether guided or self-guided you'll end at the gift shop. Speaking of said gift shop; it was very pricey and surprisingly there were not a lot of specialty pins and magnets as you would find at any of the parks. I really couldn't justify paying $25 and then spending another $40 on a pin and a magnet. They have a small cafe inside on the bottom level\n\nIf in the area, its worth checking out if you have the time, but again it can get pricey if going with a large group. Looks are deceiving when you approach the building looks large, but in reality the museum is not also making it hard to justify the entrance fee.\n\nIf you're a die hard Disney fan, you'll learn the reasoning behind one of Walt's sayings \"Let's us not forget, that it all started with a mouse\".\nShow less"], ["Reviewed January 22, 2018", 4.0, "Good History Of Walt Disney", "Very enjoyable trip to the Presidio to visit this museum. Probably of most interest to adults who want to know more about the man himself - don't recommend for kids. Lots of reading, much to absorb. Very well done."], ["Reviewed January 18, 2018", 5.0, "Excellent museum!", "My husband and I went with my daughter and her husband (who are in their early 30s). We all thoroughly enjoyed the museum. We all thought it was well organized, nicely put together, and very informative. We particularly enjoyed the family stories, photos, and videos. We spent 4.5 hours wandering through the museum and enjoyed every second. Three “complaints”: as soon as entering the paid portion of museum, there is immediately long written info about Disney’s family predecessors. Crowds form right inside the entrance, so I felt I needed to hurry reading the info. Also, first few displays are a little dark and difficult to read. Third complaint is about one of the displays about halfway through ( on second floor) there is a display case in front of wall with pictures. Pictures have small explanatory plagues. Impossible for me to read the small plagues because I couldn’t get close enough with the display case in front of them.\n\nGift shop is pretty worthless. We didn’t partake of anything at the cafe.\n\nOverall though, we thought it one of the nicest museums we’ve ever visited.\nShow less"], ["Reviewed January 17, 2018", 3.0, "Good museum - way over priced", "Whilst we were sitting in the cafe after our visit, the universal comments heard were that it was “nice” and it was “interesting.” No one thought it was worth the $25. It’s just not enough to see for that price. It’s okay, just not great. Cafe is ridiculously overpriced.\nShow less"], ["Reviewed January 12, 2018", 5.0, "Spending Time with the Creator of Disney", "I grew up watching Disney cartoons and movies, enjoying theme parks and singing to his soundtrack. It was nice to learn more about Mr. Walt Disney: his beginnings, passion and dreams. It was a reminder that a dream is a wish your heart makes and it is enough fuel to keep it real.\n\nI sure had a great time!\nShow less"], ["Reviewed January 11, 2018", 3.0, "Great for Disney enthusiasts!", "This museum is kind of hard to get to without a car so if you're a tourist, you can ride a Lyft/Uber to get here.\n\nIf you're interested in Walt Disney's life and his early work, this should be on your bucketlist! I didn't enjoy it as much as I'm not really a die hard Disney fan, but it was interesting to learn about him.\nShow less"], ["Reviewed January 10, 2018", 5.0, "Plan for several hours !", "It's much bigger than I expected and well worth it! Admission is $25 for adult, but they give $5 off for students with valid ID. This museum offers an exciting detailed history of Walt Disney, his family, and the foundation of the Disney empire. It follows Walt's story all the way to his death. Children and adults will enjoy this fun whimsical museum, and the café food is really good too. There's also a gift shop. Also, there's plenty to explore nearby after you're done with the museum.\nShow less"], ["Reviewed January 8, 2018", 5.0, "Amazing!", "I am a serious Disney enthusiast and love visiting the Disney Family Museum!! What an incredible collection of artifacts from throughout Walt Disney's life. Spectacular exhibits and information! Highly recommend for anyone visiting the San Francisco area!"], ["Reviewed January 7, 2018", 5.0, "Wonderful excursion through Walt Disney's remarkable life and achievements", "I would call this museum \"not to be missed\" for anyone with an interest in the life of Walt Disney or the background behind the Disney tradition of film making and animation. There seem to be a dozen or more display rooms and seeing them all and using the interactive displays took us more than 2.5 hours. I would recommend reserving at least this much time for the exploration, perhaps taking a break in the cafe. While we were there an exhibition of art by Eyvind Earle (a Disney artist) was also available in a separate Disney Museum building--beautifully displayed and completely enchanting.\nI would note that the museum does not spend any space hyping the current operations of the Disney empire, and it covers only the years of Walt's life from 1901-1966. Hence recent events with Disney co. are not presented, but that allows focus on how the whole evolution of Disney's work occurred. It is so amazing to see how things came to the brink several times before success broke through. You do get to see cases of Walt's awards too, including the special oscar with 7 little oscars.\nParking is available (charge) on the street in front of the museum.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Just Go!", "This was a highlight of our trip. We spent 3 hours and needed so much more time but we're limited by other factors. This is the best attraction and can not recommend it highly enough. Find time to go you won't be disappointed."], ["Reviewed January 3, 2018", 4.0, "Great place for Disney fans to visit", "This museum was lovingly created by Walt Disney's daughter. It encompases his entire life and all of his accomplishements. It was extremely interesting to learn how Mr. Disney grew up and realized his dreams. While this was a great stop for our family, I would not recommend it for families with small children.\nShow less"], ["Reviewed January 2, 2018", 5.0, "more than expected", "First, this is not a small children and toddler museum.\n\nIt's a museum for those curious about the Man behind Disneyland. It chronicles his life and risk taking and ends with his death. There are many things to read and a few videos to watch along the route. Everyone moves in the same direction thru the exhibits so go at 10am to avoid waiting.\n\nIt was fun learning about Walt as a child and young man, the risks he took with animating a full length film and opening Disneyland. I enjoyed the personal stories about him and his family along with the narrative about the Disney studios animation.\n\nPay Parking is right in front on the street or in a lot. There are some great views in the Presidio, so make sure to leave time before or after your visit to explore the area. Excellent view of the Golden Gate Bridge.\n\nWe all got free admittance b/c my son is active duty Army.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Good museum, better for teenagers than younger children", "The Disney Family Museum provides a complete history of the Walt Disney story. The museum is definitely geared towards adults, and I would suggest generally children who are 13 and older can appreciate the history presented in the exhibits. My younger boys (8 and 11) were engaged in certain areas of the exhibits (especially the model of the original Disneyland), but overall there was a lot of information that was just too in depth for them to appreciate.\nShow less"], ["Reviewed December 30, 2017", 4.0, "Loved the history", "Inspiring to see Walt's thought-process and his tenacity when more than one venture didn't pan out. Neat to see the old drawings and models. Our entire family enjoyed it. Bonus that it's located in the Presidio."], ["Reviewed December 30, 2017", 3.0, "For enthusiasts", "This is a must see for Disney enthusiasts. It is a collection of personal family photographs and quotes from the Disney family set as a timeline through Walt's lifetime ending in the early 1960's. My husband is an enthusiast and took 2.5 hours to go around it. Myself and my kids would have did it in around 2hrs. We could have done it quicker but didnt want to rush him.He could probably have spent longer. In hindsight we pribably should have left him there, saved the $60+ for our entry and met him later. The last part of the museum was stunning. Don't miss this if you are a Disney fanatic. If you are not or you have young kids, I'd give it a miss.\nShow less"], ["Reviewed December 27, 2017", 4.0, "Inspiring!", "If you're a Disney fan, and want to know more about Walt, you'll go. Nothing I write will make a difference! haha.\n\nI am a Disney fan & really enjoyed it. Well put together exhibits about the man (& family) behind the mouse. Lots of interactives... and pretty nice views of the bridge too!\nShow less"], ["Reviewed December 24, 2017", 4.0, "Interesting", "This museum is in a beautiful part of San Francisco. It is interesting and enjoyable and makes you want to watch disney movies. Not a place for young children as there is quite a bit of information to take in."], ["Reviewed December 21, 2017", 5.0, "Do Not Miss This Museum", "The Walt Disney Family Museum is a wonder amongst the many wonders of San Francisco. Imagined and made possible by Walt's daughter Diane Disney, it is massive amount of the history not only of the creative Disney business but that of the movie business and the eras during its reach. Located within the Presidio, reserve enough time to visit. The collections as vast, moving along the time-line of Disney's beginnings to today's parks and results of the Disney brilliance.\nShow less"], ["Reviewed December 21, 2017", 5.0, "Hidden gem!", "I love coming to this museum. The rotating exhibits are always so interesting and well put together and the permanent pieces (specifically the Disneyland model) are always fun to revisit. I love bringing new people here to experience some of the Disney magic in a place you wouldn't expect.\n\nAs part of the Presidio, even before you enter the museum, it's an interesting experience and one that I've come to associate with SF.\nShow less"], ["Reviewed December 19, 2017", 4.0, "ONLY Serious Disney Fanatics to Attend!!!", "At 1st I was concerned The Presidio would be very busy this time of year (Dec 18th). To my surprise it was very pleasurable from the parking availability to the ease of viewing the museum displays.\n\nUpon our arrival, we ate a delicious lunch at the restaurant on property. Note to self, next time pack a energy bar so I have ample time to tour the museum.\n\nWe thoroughly enjoyed the Eyvind Earle art exhibit and the film, \"Home for the Holidays at Carolwood.\"\n\nThe next time I visit, I would like to arrange a private tour with one of the docents. As we were touring I overheard a woman sharing a plethora of information that wasn't common knowledge to a group of ladies.\n\nNote #2 to self: don't forget flashlight and magnifying glass... some of the descriptions were at knee height and in darkened rooms.\n\nMy spouse and I can't wait to return to finish our tour and to dabble in the rest of what the Presidio offers. I think we'll start at the end and work our way forward next time.\nShow less"], ["Reviewed December 13, 2017", 5.0, "A must for Disney fans", "I enjoyed the last t=room the best, The model of Walt's Disney park and the actual Lilly Belle train were awesome! The cafe and store are very nice,"], ["Reviewed December 12, 2017", 5.0, "A magic museum which highlights Walt Disney's life and creativity", "One can spend hours looking at films, hearing accounts of this visionary's life and still also marvel at the various movie, books, TV shows that have been significant to us as children or young adults. We opted to also include the movie in our day at the museum and it brought back many happy memories.\nShow less"], ["Reviewed December 10, 2017", 5.0, "A Fitting Tribute to Walt Disney", "This is a very touching museum. We spent three hours here going through the life of Walt Disney, learning about his passions, projects, the good and the bad years, and getting a renewed appreciation for this great man.\n\nBefore the entrance to the museum proper, there is a room where the many Disney awards are displayed, including Oscars won by the company. There are a lot, which just goes to indicate how great Disney and his company were, and I guess still are for the most part.\n\nThe museum follows the chronological events in Disney's life, starting with the early family portraits and pictures of the very young Walt, and ending in his passing in 1966. In between, there is a great deal of content regarding everything: the first animations, creation of Mickey Mouse, the fantastic Fantasia, Disneyland, and the unrealized projects get very detailed treatments. We especially enjoyed the stories about creation of the iconic Mickey Mouse character. After visiting the museum, we watched some of the complete black and white Mickey cartoons, and were again overly impressed with how much fun and entertainment is packed into these pieces, made in the 1930's, without any of the gruesome violence and darkness that prevails in today's children's animated fare.\n\nThere are also a number of projects described that did not come to fruition. One of these, I learned, was the Mineral King ski resort, planned in a remote alpine valley south of Sequoia National Park. Disney passed away during the early planning stages for the project, and the entire undertaking fizzled after his death. The area looked like a great spot for a remote, car-free resort, in the style of some famous ski villages in the Alps. One can only speculate about it though, since we'll never know if Disney's marketing prowess, charm, and tenacity would have been enough to take Mineral King to completion...\n\nThe museum is not large, but is very high quality and with enough things to see, explore, and imagine that a thorough visit could take a half day or more. We came somewhat late in the day, and so were a bit rushed at the end of the visit. But, if you have just a short time to stop by here, it's worth it to get just a glimpse of the Disney family collection. There is a well stocked museum store, as well as a small café where you can rest with a snack and a nice latte.\n\nI was not aware of this museum's existence, until doing a general search for things to do in San Francisco, for a short visit with our two boys. They were very interested and even captivated by the displays at the museum, which says a lot of the quality and variety of the exhibits; there is something for everyone here.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Disney For Adults", "Walt Disney before and after Mickey Mouse and the Disneyworld(s). An in depth journey through his very productive life and the lasting gifts he gave to American society. The artifacts, photographs, and interactive displays are attractively presented. You will learn a lot about the man and his place in cultural history.\nShow less"], ["Reviewed December 6, 2017", 4.0, "Fantastic collection about Walt Disney and his life", "This is an educational museum. It is very well put together. The life story of Walt Disney is shared. I learned many facts about Walt Disney and his creation of Disneyland."], ["Reviewed December 6, 2017", 5.0, "This museum brings Walt's story to life...it was a sad day when Walt passed away far too soon in 1966", "We have always taken our children to Disney since early this century and this visit was therefore a MUST.\n\nWalt's family story is certainly an American journey and the museum illustrates it exceptionally well. Learning about Walt Disney's early struggles in Hollywood was fascinating. If you can't manage the massive biography...just visit the family museum. I still remember the BBC TV news in Britain the day Walt Disney passed away. Almost everyone who saw the broadcast must have shed tears along with the animation of Mickey Mouse crying. It was so sad. But Walt's achievements were amazing. We are off yet again to Disney in Orlando later this month...and then to Disney in Paris in April 2018 as our teenagers, especially my eldest daughter absolutely love it. It reminds them of their childhood. If only I had managed to visit Disney when I was a child...\nShow less"], ["Reviewed December 5, 2017", 4.0, "Definitely worth a visit before you visit disneyland", "Worth a visit if you have the San Francisco Go Card. The entire place is absolutely incredible. Filled with a rich history of Walt Disney. You get to see how cartoons were made in the past and how it gradually evolves through Walt's innovation and creativity. You also get to see how he came up with concept of Disneyland and the actual blueprint is simply astonishing. I highly recommend this place if you do visit California.\nShow less"], ["Reviewed December 4, 2017", 5.0, "The Magic Behind Walt and his Business & Arts Mastery", "It was simply amazing to walk the Walt's journey from the era at his family farm to all the way to opening of the Disney Land. I learned a lot about his values and how those came about. Mostly, it was nice to discover how his experiences led to business innovations that took places decades before the main stream. He did things in 1950s that most of the companies are starting to do today like Service Design or Innovative Office Interior Designs. If you like Disney and/or Business Management, this place is worth the time and investment.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Fantastic museum - not for really young children", "I'm a huge fan of Walt Disney, so it was great to see a museum that highlighted his early life, and the hurdles he overcame to build the company we all love. The exhibits were well maintained and the museum itself was fairly large. If you like to really read and examine things I'd block off 3-4 hours for this. Also, per the title, it's not really good for very young children. If they're not old enough to read long descriptions and appreciate historical artifacts they'll likely get bored fast. Instead of lots of Disney World types of images of Mickey Mouse, for instance, expect to see things like early sketches and cells. Really wonderful stuff.\nShow less"], ["Reviewed November 29, 2017", 4.0, "cool, but pricey", "Cool places, some really interesting displays, perhaps a bit pricey for the length of time I wanted to spend there, but then again, it probably keeps it a little less crowded, which is nice."], ["Reviewed November 26, 2017", 5.0, "Well worth the time", "I like the way they presented Walt’s work and life from his birth, childhood, adulthood and death. He’s a great inventor of cartoon."], ["Reviewed November 26, 2017", 5.0, "Great place to visit", "This museum is no doubt a \"Must do\" in every list of places to visit in San Francisco. Inside of a beautiful park named Presideo, where families go there to spend an outside day,"], ["Reviewed November 22, 2017", 2.0, "Not to our taste", "If you’re a fan of Walt Disney the man then this is the museum for you. If you’re curious about how Disney came to be, then this doesn’t have as much as we thought. It’s set up really well and clearly the museum has put a lot of effort into presentation and dedication to its objects. However we felt the entrance fee is overpriced for what is on offer. It felt more like an exhibit than a museum for much of the display. The final model of Disneyland is impressive but overall, not a satisfying afternoon.\nShow less"], ["Reviewed November 21, 2017", 4.0, "Walt Disney...the genius..", "Being a great fan of Walt Disney this was on my list to do. The history of Walt Disney's achievements and awards...the story of his family life was interesting. The only thing I thought about the visit that it was a bit expensive to just go into the museum for what was actually on show...but being a Disney fan found it interesting.\nShow less"], ["Reviewed November 14, 2017", 5.0, "What a great museum!!", "Mom & I loved every bit of this museum. It was really neat how they depicted Walts life and incredibly interesting to learn how Disney came to be. If you're in the area and have about 2 hours- you should definitely go!"], ["Reviewed November 14, 2017", 4.0, "Great biography of Walt Disney", "This museum tells the story of Walt Disney's life. I enjoyed that they had artifacts from his entire life, with audio interviews with him telling his own story. The model of DisneyLand and the ability to program a tiki bird were also fun."], ["Reviewed November 12, 2017", 5.0, "Extremely Informative.", "The museum is very detail oriented. I believe it has more than sixteen galleries. We got to the museum late and only had about two hours to explore, could have use at least another one. If you go during daylight hours you will enjoy a great view of the Golden Gate Bridge from the second floor. We use public transportation and found out the hard way that you can take bus number 43 to the new transit station. Which is only a 5 minute walk to the museum.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Not a fairy princess to be seen", "This intimate museum traces the family history of Walt Disnes, his executive genius and his legacy. Often there are contemporary shows of the studio animators, artists and people related to the Disney empire."], ["Reviewed November 8, 2017", 5.0, "Excellent museum for kids", "Its a beautiful museum with Walt Disney characters, a must for kids to visit & enjoy, playing with them for different rides."], ["Reviewed November 8, 2017", 4.0, "Disney History on Display", "Very nice place for older kids and adults to learn more about Walt and his very big creative vision. Lots of interactive exhibits to keep you interested. There's a small snack shop with coffee and treats of all kinds. Beautiful gift shop.\n\nThe museum focuses on Walt's creative career but includes some personal family information. If you like Disney, this is the place to visit. There's a scale model of Disneyland that will blow your socks off. Bring your camera.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Good Day out for families", "Situated in the Presidio Area this is lovely musuem set up to show the amazing life of Walt Disney Lots of information about his life and achievments and his family Interresting displaysand lots of fun for families or those who are young at heart"], ["Reviewed November 8, 2017", 5.0, "Walt Disney Family Museum - a must visit", "We have lived in Marin County for 2 years, after having relocated from Australia. After all this time, a friend said “have you been to the Walt Disney Family Museum?” Alas, we went and it is one of the best tourist spots I can recommend. We spent 2.5hrs there and it wasn’t enough. Given that we got there a bit late in the day. Our 14yo daughter & her friend (neither of whom wanted to go), loved it. They both said “can we go back to see more?” Absolutely loved this place. Perfect for adults who grew up with Disney classics & kids. Art lovers & and budding artists and lovers of history will be enthralled. This is a must visit.\nShow less"], ["Reviewed November 8, 2017", 5.0, "More Than Meets The Eye", "Very impressed with the museum. It's almost if you turn one corner expecting something small, then impressed by how much is covered through Walt's life.\n\nOnly issue I could think of is in the first room has multiple segments with audio pumping into the room so it is a little distracting.\n\nOtherwise, bank on at least two hours here even if you do not read everything and simply glance over some exhibits.\nShow less"], ["Reviewed November 8, 2017", 5.0, "A must for Disney fans", "Fun for the family to see the history of Disney! My kids loved the museum. There is a small cafe to eat."], ["Reviewed November 5, 2017", 5.0, "Wonderful, not for kids", "If you are an adult history buff, fascinated with movie making or love Disney then you will enjoy this museum. There is so much to learn about the processes & technology that Walt and his partners developed.\n\nI wouldn’t recommend even bringing teenagers unless they are into the history, technology, etc. There are some interactive activities, but if they are expecting a high gloss Disney production they will be disappointed.\nShow less"], ["Reviewed November 5, 2017", 5.0, "A must if you love Disney", "A great museum, learnt lots about Disney we didn't know. The model is amazing too. Very modern and well put together."], ["Reviewed November 5, 2017", 5.0, "First Class Museum", "Have been to San Francisco many times, but never made it to the Walt Disney Family Museum...until now. Glad we did! It's an outstanding museum. You could easily spend half a day there. There is substantial content, very well laid out. Even if you have only passing interest in Disney, you will find the museum interesting and worth your time and money.\nShow less"], ["Reviewed November 1, 2017", 5.0, "Wonderful museum to get a glimpse of a visionary", "The Walt Disney Museum is located inside SF's Presidio. When u r outside the museum and it is a clear day, u can have sweepibg views of the Golden Gate Bridge and Alcatraz. This museum gives an indepth look about Walt Disney's life. There r a lot of memorabilia of the thing he created. It is easy to spend 3 hours walking and looking at everything. U can park directly in front of the museum. However, it is better to park your car in areas longer than 4 hours so u can leisurely walk through the museum as well as walk around the Presidio. The well manicure lawns, sweeping views, beautiful trees and historical houses make this place a nice relaxing place to hike.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Fascinating trip back into my 50s-60s childhood", "I learned SO much about Walt Disney, things I'd never known, or had forgotten. This is a museum that focuses on the man, as well as the body of his creative work. His life story is very inspiring. His accomplishments are mind-blowing. The museum is expensive ($25/head). You can park at the Presidio, or Uber/Lyft there. Plan to spend some time: reading the various documents or viewing the various display items. Also watching snippets of his famous (and not-so-famous) movies. After we left, I Googled his descendents and was saddened that many seem to have squandered the wealth he left behind -- his life was dedicated to making children happy. So if you want to step back in time, and see what contributed to his genius, this is a great place to visit. There is a small cafe where you can grab coffee/ or tea after you visit. There are also lots of places nearby to eat. The gift shop is small and the items are overpriced and pretty mundane.\nShow less"], ["Reviewed October 30, 2017", 4.0, "Interesting, but truncated", "Very nice museum located in The Presidio. We took about 1 1/2 hours to go through, could have been a little more if we read everything. Nicely laid out and tells the story of Walt Disney from birth to the 1950's, but stops there. Doesn't cover DisneyWorld era, and only very briefly about Disneyland and Mickey Mouse club or TV in general. Very informative about Walt's earlier years, just don't expect the whole story. Worth going.\nShow less"], ["Reviewed October 30, 2017", 4.0, "Knowing the history of Walt Disney.", "If you are a fans of Disney and looking to know behind the scene, this is the right place to visit ! This museum provides details of Mr.Disney life and the birth of Mickey Mouse."], ["Reviewed October 29, 2017", 4.0, "Things you never knew about Disney", "If you are a fan of Disney...beyond the cartoon movies and theme parks, this is the place to visit. The museum traces Walt Disney’s life from his childhood paperboy days, through his failures and ultimate success in the movie Business. The genius of his work shares credit Business and creative partners, showing off the amazing skills of the Disney team. Most fascinating was Disney’s plan for EPCOT as a city of the future demonstration where workers lived within easy reach of manufacturing sites via monorail. Some of the best views of the Golden Gate Bridge from the repurposes Precidio Army base.\nShow less"], ["Reviewed October 28, 2017", 4.0, "First visit to Walt Disney Family Museum", "As a Disney Vacation Club member and a Disney fanatic from the east coast we decided to visit the Family Museum on our trip to the west coast. We had never been to the Presidio where the museum is located so it was like 2 trips in one. Parking was a challenge and the need to find a parking meter that worked became a challenge. Once in the museum we were fascinated with all it had to offer. Walt's history from the very beginning was amazing and seeing hand written letters and original sketches from Walt Disney's earlier years was impressive. There is so much to see and interact with in this museum that it's well worth the time and visit! They have a small gift shop and a place to gets some snacks and drinks. There was a group of children there when we arrived but they appeared to be more interested in the gift shop than the exhibits.\nShow less"], ["Reviewed October 26, 2017", 5.0, "If you love Disney, this is a must do!", "I am from Anaheim and I am an annual pass holder. I rolled my eyes when I found out this museum charged a $25 entry fee, but I begrudgingly went to see what it was all about. I am a huge Disney fan and I found this museum to be absolutely amazing! I really enjoyed the immersive experience. There were tons of little exhibits for children, though it’s not that child friendly. I think if you are really into Disney’s history and Walt himself, this is a must see. It takes you through his life journey and I was blown away by the museum’s carefully curated items as well as the presentation. I would not say it was worth $25, but it was a great 4 hour activity in the city. I’ve been to SF so many times, I’ve run out of activities to keep myself occupied... which is how I ended up here! It is a nice rainy day activity. The temporary exhibit was nice too, however, that’s another fee *eye roll*\nShow less"], ["Reviewed October 22, 2017", 4.0, "Recommended for adults", "I am a Disney freak so this was a must do. You pay to park in the park. It's cheap. I think we paid 1.50/hour. This isn't a Disney museum. It's a Walt Disney life museum. So kids may like it but I would have probably been bored as a kid there. It's a lot of reading and looking at pictures. We went through in about 1.5 hours but we didn't read everything or watch the videos they had. I think it would probably take you around 4 hours to do everything. It's awesome to see the original drawings from the 30s when Walt was just getting started. The gift shop was a slight let down. I wanted a magnet that said 'Walt Disney Family Museum' but they didn't have any. It was worth the $25 we paid to get in for sure. I'm just not sure it's something I would bring children to. But overall, a must do for Disney freaks like myself.\nShow less"], ["Reviewed October 22, 2017", 5.0, "This spot will please all Disney fans", "Whether you like learning about the history of Walt himself or some of his earlier films you’ll love it here. It’s definitely got me geared up for my next Disney trip! The Disneyland model is worth the price of admission in my opinion. There’s parking out front if you get there early enough and a lot across the way.\n\nThe gift shop is mostly books and art which is fine, I ended up buying a cool sweater I just wish they would’ve had some more types of merch. It’s a truly beautiful museum and I would put it on your list for your next visit to SF.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Disney fans!", "This is a wonderful museum. Full of facts and events that Walt Disney experienced during his life. It is set up chronologically beginning with Walt's childhood. We also saw the Eyevind Earle exhibit which was stunning. As a 60 + year old I could have used a bit more seating throughout the museum and some of the facts written on the walls next to the displays were a little dark for my vision deficits. I did spend approximately 5 hours in the museum and my feet gave out. I will have to go back, well worth the time and entry fee!!\nShow less"], ["Reviewed October 15, 2017", 5.0, "Not to Be Missed", "This is why I came to SFO - I had wanted to see this for years. After visiting his grave (or his interrment site) in Glendale, we drove up here. I love Disney, but dig beneath the surface of the parks and get into the history. This is a beautiful testatment to his life and contributions - the last part leaves you in tears so be forewarned.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Impressive Historical and Cultural Tribute to Walt Disney", "First, this is NOT a museum for kids or casual Disney fans. It is an important and impressive collection of information and artifacts curated by the Disney family of an American icon. It showcases Walt's early life, influences, interests, decades long career successes and failures, awards; it is not just about the animated movies and the things for which he’s well known. We spent at least four hours there and learned a lot; we left with an insight into and appreciation for Mr Disney. I think it could be improved by having someone in all or most sections of the museum to answer questions. Don't miss whatever special exhibit is in the ancillary building (additional charge).\n\nThere is paid parking in the lot across from the museum or you might snag a (paid) space in front of the museum itself. Skip the little cafe; it is very crowded with only a handful of tables and exceptionally slow service. Also, the gift show is a disappointment.\nShow less"], ["Reviewed October 12, 2017", 5.0, "i visit every time i'm in the area", "i love this museum, worth every penny and i love every thing in thir gift shop, i always have to purchase at least one thing! so much history and love went into this museum and you can definitely tell when you walk in. they also have a small cafe and different areas that offer different experiences a part from the museum. it is also across from the golden gate bridge so views are amazing\nShow less"], ["Reviewed October 12, 2017", 4.0, "Informative", "This is well laid out with lots of really interesting information and facts. It is a museum about the family as opposed to Disney world / land. For adults not kids."], ["Reviewed October 11, 2017", 5.0, "Disney Family Museum", "Do not miss this if you're a Disney fan. The exhibits were very good and informative. so glad we read about this and put it on the list of to do while in SF. And the grounds of the Presidio were AMAZING"], ["Reviewed October 10, 2017", 3.0, "So sad", "We had planned to go here on Tuesday - when pricing tickets on Monday evening I realised it was closed - very poor planning on my part!! We still went and saw it from the outside."], ["Reviewed October 9, 2017", 4.0, "Fun for Disney Fanactic", "We are a disney family, so we enjoyed all exhibits. It was interesting to learn all information about Walt. It was well thought out, with interactive displays. So glad we went."], ["Reviewed October 6, 2017", 5.0, "Amazing life amazing story", "This museum is the creation of Walt Disney's family. All the articles on display are owned by the family and on display so you could enjoy his life. Very interesting and shows his courage and determination to get the film and Disneyland up and running. Worth the trip\nShow less"], ["Reviewed October 5, 2017", 4.0, "Wonderful Walt", "The museum is located about 15 minute walk from the palace of fine arts in the presidio.\n\nThe museum is very fascinating and gives a really in depth insight into Walt Disney. Museum is set out very well and nothing is cramped and the displays are set out well.\n\nA great way to spend a couple of hours\nShow less"], ["Reviewed October 4, 2017", 5.0, "well organized and displayed...", "I loved seeing pictures of the Disney brothers in their early career. Also there are videos of building Disneyland and the Disney Studio in Burbank."], ["Reviewed October 2, 2017", 4.0, "Very Interesting", "Good to see the family History. The museum is very well done. There is a lot of reading to do - so be prepared !"], ["Reviewed October 2, 2017", 5.0, "Wonderful for a Disney junkie like me", "I loved walking through Walt's life and seeing the history. I totally recommend it to anyone who loves Disney for more than movies and parks."], ["Reviewed October 2, 2017", 5.0, "Beautiful", "Excellent historic account of Disney and the struggle to bring us animated entertainment. So much original drawings and material on display, giving insight into how Disney used innovative and forward thinking to achieve the images we love today."], ["Reviewed October 2, 2017", 3.0, "Cool but not wow", "It was nice to check old disney movies that has been forgotten a long time ago. And also read about Walts life. There was a miniature disneyworld that had nice features but in overall this was not mind blowing experience."], ["Reviewed September 30, 2017", 5.0, "Outstanding Testament to and Outstanding Man", "My wife and I spent the afternoon at this museum. The brochure suggested that one should allocate at least two hours to see all of the different exhibits in the museum. We spent a total of six hours and felt like we could have stayed longer, but they close at 6PM!\n\nEvery Exhibit is a detailed examination of the life, times, and business experience of Walt Disney. The museum has an unbelievable assortment of personal items including 20 Oscars, hundreds of awards and accolades, and all of it is put together in a highly entertaining, engaging, and personal experience utilizing high-tech multi-media displays. Original artworks, letters, equipment, paints and the like are all on display.\n\nI would recommend this museum for young adults but NOT little children. The exhibits delve into the life, times, and business accomplishments of Walt Disney, his family, colleagues, and his company. It is not the sort of museum where small children are going to be engaged.\n\nThe exhibits include many hundreds of personal keepsakes that Walt Disney collected and built, like the train set he had in his backyard at his CA home.\n\nThere is a small café that serves sandwiches, salads, coffee, and pastries. My wife and I split a chicken salad for $5. We sat on the porch out front overlooking a park and took a short break.\n\nThis is a must-do experience. One of the finest museum presentations I've ever enjoyed.\n\n\n\nShow less"], ["Reviewed September 29, 2017", 5.0, "Very nice.", "I enjoyed this museum very much. It was a nice crossroad between static and film exhibits. The view of the golden gate bridge from the museum was amazing!"], ["Reviewed September 28, 2017", 5.0, "The Walt Disney Family Museum – A Wonderful Story was told...", "It was the morning of the very last day of our holiday, ending in San Francisco after a lovely 2-week coach tour that also started in San Francisco. My wife and I had decided for our last morning that we’d go to the Walt Disney Family Museum within the Presidio in San Francisco. We got a taxi from our Hotel to take us up there, had breakfast at Starbucks and then walked around to the museum ready for their opening time of 10am. The museum is set out very well, starting with Walt Disney as a baby, through to his death in December 1966. You can see photographs, models, sketches, drawings and excerpts from many of the Disney films that everyone now knows and loves. The estimated time was stated to be approx. one and a half hours; we were there almost three hours, it was so enthralling and informative, with so much that we thought we knew about Disney, but that we realised we really didn’t. We didn’t have time to stay longer, so we will be back someday in the future to make up for that. This museum is designed for anyone of all ages to enjoy, families, couples and even those elderly people who remember and enjoyed (and still enjoy) Walt Disney films. The cost is $20 per person, but it is well worth it; you will not be disappointed. We had a really excellent holiday on our coach tour, and this wonderful story finished it off beautifully.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Well worth a visit if you're interested in everything Disney.", "Well laid out museum in modern premises with loads of exhibits from the past and present with interesting and some interactive displays."], ["Reviewed September 27, 2017", 5.0, "So wonderful!", "This museum has been on my list for ever, and I am so glad we finally got to visit. The entire display is overwhelming and so inspiring. We spent hours walking through the museum and we still didn't get to read/take it all in. Seeing all of Walt's oscars was so amazing, and going into the rich history of Mickey & Oswald made me smile. He was an incredible man and this homage to him is just wonderful. I can't wait to go back!\nShow less"], ["Reviewed September 27, 2017", 4.0, "Only a true fan would understand", "If your a fan of Walt Disney himself and not his achievements your in for a treat, while there is exhibits regarding his movie achievements and how he started his theme park empire, this museums concentrates more on the man himself and how he made his achievements, well worth a visit if time available.\nShow less"], ["Reviewed September 26, 2017", 4.0, "For Disney fans - this tells the full story of Walt", "We visited with our 11 year old son in October 2016. The museum was even interesting for him, however for children under 9 I think they may be a little on the bored side.\n\nThe museum will take you about 2 hours to go through at a leisurely pace, they have a cafe on site with sandwiches and drinks.\n\nIt's quite nice in the location (the Presidio), plus quite easy to get to on a shuttle bus from Golden Gate Bridge (free).\n\nEnjoy your visit, don't rush.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Outstanding Museum devoted to Walt Disney", "Much better than we expected. We spent three hours here and, but for our schedule, could have spent four. Very extensive collection of Disney memorabilia. Story is told in a linear fashion. Lots of explanations of technical movie techniques. Very knowledgeable docents."], ["Reviewed September 24, 2017", 4.0, "Great for real Disney fans", "I had limited time to visit the museum but I am sure a Disney fan could spend the day there. I skipped the first section about the early life of Walt and his family, and went straight onto the animation section. Even then, there was so much to see (original sketches etc) that I had to dip in and out on what particularly interested me. The final section on Disneyland was great, especially the large DL model and the Tiki room parrot which you can control. I had caught a hop-on/off bus so I had to walk from the Palace of Fine Arts stop (10-15 minutes) through the Presidio. The café menu in the museum was limited but the food on display looked ok. I would recommend to Disney fans\nShow less"], ["Reviewed September 22, 2017", 5.0, "Very Interesting if you are a Disney fan.", "Our group of 9 included 5 children aged 5-15. We are avid Disney fans so we found this place really interesting. The younger kids got a bit bored, but the older ones were happy to read along and learn about the life of Walt and his life.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Interesting", "This was not what I expected. It is all about Walt, his family and his beginning career. Well presented. Small gift shop. Friendly, helpful staff. Small cafe with limited menu. Set in the beautiful Presidio."], ["Reviewed September 19, 2017", 5.0, "Love this Museum!", "This is probably one of my favorite places to visit in San Francisco. The museum has all kinds of wonderful items for Disney fans. My daughters and I went with a big group (on our first visit, we've since been a few more times) and they allotted 1.5 hours in the museum. Well, 5 hours later, we were done and ready to visit the gift shop, having long ago been ditched by our group. If you're a big Disney fan, plan plenty of time because you'll want to read every little plaque, look at all of the exhibits in detail, and not feel rushed. Added bonus to the museum is that there is a marvelous view of the Golden Gate Bridge at one point, it was unexpected and even though I see the GG Bridge all the time, it still took my breath away.\nShow less"], ["Reviewed September 18, 2017", 5.0, "Excellent", "We went as we didn't know what to do that day and it looked pretty good. I was pleasantly surprised at just how high quality the whole experience was. No expense spared fitting out this place. I feel it was designed with adults mostly in mind. A high quality and interesting museum.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Great Museum Even if You Are Not a Disney Nut", "I am a Disney fan, so I will caveat my review by telling you that up front. This museum did not disappoint. Even though I know the Disney story nearly by heart, the exhibits here brought the story to life. You will enjoy this attraction even if you are not a big fan.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Interesting Insight into Walt Disney's Life", "Fantastically set up, this museum tells you all, from Walt as a child, through to him setting up his first company. the memorabilia is so interesting, a lovely exhibition. One of the highlights is the miniature Disney World."], ["Reviewed September 14, 2017", 5.0, "If you are interested in the rest of the story!", "This wonderful museum is mainly for adults and teens interested in the history and the amazing tale of Disney family. There are many Disney rarities - from the earliest sketches by Walt to the equipment that was custom made to do live animations. It is truly a unique experience if you are in the area!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Edvind Earle Exhibit", "If you are a Disney fan this is a must. Great history of the art and parks. I also really enjoyed the special exhibit on the art of Edvind Earle (Sleeping Beauty fame) and inspiration for modern works such as samauri jack!"], ["Reviewed September 11, 2017", 5.0, "History of How Disney Changed Animation", "The Walt Disney Family Museum may not be what you think. This isn't like a Disney store at all, but rather is a more personal story about Walt Disney and the much larger one about how he utterly changed the animation industry and then our notion of amusement parks.\n\nThe museum starts with Disney's own family and his own start drawing advertisements, getting into the budding animation industry, and then innovating it entirely. Along the way, you'll see a lot of funny old cartoon clips and learn some neat tricks about how Disney made his studio and its productions so terrific. The museum gets more elaborate as it goes along, including the large model railroad Disney built in his back yard, specialized cartoon making equipment, and large models of Disneyland and Epcot.\n\nAlong the way, you'll see lots of film interviews of Disney, home movies, and samples from movies and movie clips.\n\nWe saw a fair number of very young children here, but I think they were lost with some of the exhibits. You'll want someone old enough to see that, yes, there are lots of funny cartoons and clips, but the story here is the man who invented them.\n\nThis is a neat museum.\nShow less"], ["Reviewed September 11, 2017", 5.0, "Wow! So much to see!", "We had no idea this museum would be so large and so interesting - a pleasant surprise. Set aside a few hours to see it all."], ["Reviewed September 10, 2017", 4.0, "A Great Tribute to Walt", "As a Disney fan, I was so excited to visit the museum! It is located in a beautiful area with great views of the bay. The museum contained a great collection of pictures, drawings, and short videos to look at. The only downside was there was a LOT to read in very small font. It was very crowded, so it made it difficult to get a thorough experience. I would love to be able to spend an entire day here!\nShow less"], ["Reviewed September 10, 2017", 5.0, "A Disney Fan's Heaven", "If you are a Disney fan (even mildly) you cannot miss the Walt Disney Family Museum. A stunning tribute to Walt, his studio, and his family. The museum has all of your classic Disney touches, and you are immediately captivated upon your arrival. Even non-Disney fans will appreciate the detail and history conveyed in every exhibit. Not to be missed.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Great place to visit if you are a disney fan", "The Walt Disney Family Museum it full of memorabilia, the story of Walt and his family are displayed with abundance of photos and what was really good were family home videos with his children and parents. The dolls house is amazing and the working model of Disneyland is great. Well worth the visit. It is quite hard to find.\nShow less"], ["Reviewed September 6, 2017", 4.0, "This was surprisingly informative and interesting", "I would say this is an interesting museum to see for teens and up. While there are many wonderful drawings and cells from famous animated movies that would delight children, this museum is a much more serious look at the life of Walt Disney and his work as an animator, his family life, the creation of his studios, his hard times and conflicts and eventually the creation of Disneyland and his subsequent death. Plan for a few hours to see it all. There are many videos to see. If you are deaf most of the videos are closed captioned if you ask for the card that activates them. The gift shop was small. It was well-layed-out, and had a lot of information. I thought I knew a lot but realized how little I actually knew about this important man.\nShow less"], ["Reviewed September 6, 2017", 5.0, "loved the Pinocchio exhibit", "This was my husband and my third time to the museum. We went specifically to see the Pinocchio exhibit. I loved all the different kinds of drawings of Pinocchio - helped me realize that there is not just one vision for a character, but many"], ["Reviewed September 3, 2017", 3.0, "Disney", "A nice little museum full of fun facts and information situated inside the Presidio. Not a place I would go out of my way to visit but if you're at the Presidio definitely drop in. A great gift shop."], ["Reviewed August 31, 2017", 5.0, "A must see for Disney fans!", "I found this jewel a little by accident... and what a nice surprise it was. If you are a Disney-holic this is a true must see. The museum gives a very good background of Disney both prior to Mickey and post- Mickey. You will see the first Mickey sketch and my fav , the scale model of the Disneyland concept. Very cool.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Interesting and informative", "Set on the lawn if a wonderful park, the museum takes you through the life of Walt Disney. Lots of great facts and wonderful art work. My kids if 12 and 15 were very impressed."], ["Reviewed August 30, 2017", 5.0, "Fascinating for both WD fans and those interested in early animation and cinema", "Not far from the LucasFilm building is the Walt Disney Family Museum. This museum chronicles both the life of Walt Disney and the history of the Disney movies and parks, as well as early efforts in animation and film making. I found it quite fascinating to see the process of innovation that they went through in the early days, finding ways to improve animation and movies. I also came away with the sense that he was one of those people who seem to ooze ideas and dreams as well as the energy to pursue those dreams.\nShow less"], ["Reviewed August 29, 2017", 5.0, "Great Museum for the Walt Disney (the Man) Fan", "This was an amazing museum for people who want to learn the life story about Walt Disney. The attention to detail was outstanding and the presentation was as good as would be expected from a \"Disney Production\". This museum is not ideal for little kids as there is lots of reading and history - it is not a play area.\nWe loved the museum and left with an ever greater appreciation for Walt's life and dreams.\nA bonus is the awesome location of the museum - great views and beautiful neighborhood to walk around.\nShow less"], ["Reviewed August 28, 2017", 5.0, "A glimpse into the life of Walt Disney", "Very well laid out Museum\nIt walks you through the life of Walt Disney and members of his family\nVery educational and informative\nNot recommended for young children as they will get bored very quickly\nDefinitely recommended for anyone who wants to know more about the man as well as the story of animated film\nWe spent about 4 hours here and thoroughly enjoyed it\nShow less"], ["Reviewed August 27, 2017", 5.0, "Gem of a place", "Surprisingly brilliant museum in the Presidio. Modern and well laid out exhibits tell the Disney Story in an informative way. well worth 2 hours or so."], ["Reviewed August 26, 2017", 5.0, "Excellent", "Wonderful glimpse into life of Walt Disney...the person behind \"Disney\". Learned a lot about animation, and how he pioneered this sector of movies. Staff was friendly and knowledgeable."], ["Reviewed August 26, 2017", 5.0, "A Must!", "Great place to visit with friends or family. Very interesting and in depth look at the Disney people and history. In addition, great views and places to eat."], ["Reviewed August 23, 2017", 5.0, "Best museum of our road trip", "This was our second visit to the WDFM. We thoroughly enjoyed it. The cafe also has very good food. Bathrooms are lovely. Gift shop has Disney books / magazines that are hard to find elsewhere - great for your Disney fan. Beautiful viewing of the Golden Gate Bridge from within the museum. Museum also offers special talks and movie screening. Checkout whats happening during your visit.\nShow less"], ["Reviewed August 22, 2017", 5.0, "Very well done museum", "This is a must visit for any Disney fan, and even my husband who is a casual Disney fan thought it was great. I would not recommend this museum for young children, as it is truly a museum, but if you go in knowing that it is a museum, it's great. Very comprehensive, well thought out exhibits. The museum is very clean and all staff we encountered were very personable. Well worth the visit!\nShow less"], ["Reviewed August 20, 2017", 4.0, "Surprisingly new and ecclectic", "The Ferry Building which is where ferries from Alcatraz and Sausalito docks is a very clean, new building housing many interesting stores and restaurants. There is bakery, ice cream shop, farmer's market, fruit stands, arts and crafts..."], ["Reviewed August 20, 2017", 4.0, "Very interesting and a must see for any Disney fan.", "Visited with my wife and 2 teenage kids. Was a little expensive ($30 adult & $15 children under 16) to get it but there was so much to see. They have an incredible collection of everything Disney including the entire history of Walt Disney. Well worth the visit.\nShow less"], ["Reviewed August 16, 2017", 5.0, "It's Not Disneyland - It's The Disney Family Museum", "I live in San Francisco and 6 of us visited this amazing venue in The Presidio. We had a 13 year old with us who was bored stiff. We adults went nuts over our time in this place. Walt Disney was a genius that most of us don't hear about these days and the displays are incredulous. Go and enjoy and learn about the amazing Mister Disney and his futuristic mind. Much of what we have today is due to him .. yes true. I would return again and well worth the entry fee which seemed steep but when we departed we realized the fee was a pittance of what great fun we had\nShow less"], ["Reviewed August 15, 2017", 5.0, "If you love Disney", "My family are all Disney fanatics and even as east coasters, we prefer Disneyland. This museum spends a lot of time on Disneyland, the World's Fair ( I went there when I was 4), and sadly on Walt's death. If you like Disney - you will LOVE this museum\nShow less"], ["Reviewed August 15, 2017", 5.0, "Very nice!", "We loved it. It doesn't look that big from outside, but if you want to you could spend hours in here learning anything and everything you would want to know about Walt Disney and his family. There are 17 galleries, a lot of information, and some cool interactive exhibits as well. I really liked the huge Disneyland model. If it wasn't as crowded as it was when we visited, we would definitely have stayed longer. We would like to go back again when there are less people to give us a chance to really have time to read all of the exhibits because we think the Disney story is so interesting.\nShow less"], ["Reviewed August 14, 2017", 5.0, "Great Museum about a great man!", "Wow, so interesting... This man was so much more than just the creator of Mickey Mouse! It gives a great story from his childhood to his death"], ["Reviewed August 13, 2017", 4.0, "If you love Disney it is a must see.", "A enjoyable museum for those who are interested in Walt Disney. Lots of photos and early history. Maybe a little too much history for younger children."], ["Reviewed August 10, 2017", 5.0, "Great experience of Walt Disney's life", "Great way to learn about Mr. Disney growing up and his cartoon characters. Not for kids, not super interactive and a lot to read. Loved looking back on so many cartoons and animations though!"], ["Reviewed August 9, 2017", 4.0, "This is a wonderful museum, but it is not for small children", "My adult daughter and I toured this museum in July. It was a wonderful experience. It had all sorts of great memorabilia like the first drawings of Mickey Mouse from 1928. It also had movies that were narrated by Walt Disney himself telling the story of his childhood. My favorite was the model of Disney Land. There is also an annex that has rotating exhibits. Currently, there is an exhibit called Awaking Beauty about Eyvind Earle the background artist for Sleeping Beauty. The museum itself is in the lovely Presidio area and there are great views of the Golden Gate Bridge. It is well worth the price of admission.\nShow less"], ["Reviewed August 9, 2017", 4.0, "Pricy but fun", "I had a bit of sticker shock here, especially since the special exhibit was an extra charge. However, it was a ton of fun and really neat to see the history of the Disney Family and Company. My party was 2 adults, and although there were families with children, I have to say that the children did not seem so entertained. It was awesome for adults for sure.\nShow less"], ["Reviewed August 9, 2017", 5.0, "A must see for Disney fans !", "If you love Disney you should include this in your San Francisco trip . I won't give everything away but it basically tells the story of Walt's life in order room by room . There is so much to see each room is filled with exciting things from a certain point it Walt's life . Great for both kids and adults alike . Also paid parking was easy to find in the lot behind the building .There is also a wonderful gift shop .\nShow less"], ["Reviewed August 8, 2017", 5.0, "Great place to spend a rainy afternoon", "This museum is from the Disney family's perspective and tells about the life of the man and his family, rather than from the corporate perspective. I enjoyed learning about his family background and his struggles to succeed in the early days of film. It is nicely laid out and very informative and entertaining. My one caveat is that too many people were here with very small bored children. This is not Disneyland, it is a museum full of exhibits and things to read. Not the place to entertain small children looking for Mickey Mouse.\nShow less"], ["Reviewed August 7, 2017", 4.0, "Disney Fans", "The Museum is located in the beautiful Presidio. It provides a lot of details and information about Walt Disney. The Museum is well maintained and has a cafe where you get a cup of coffee and sandwich after spending a couple of hours easily visiting the Museum. The location of Presidio also provide a good view of the Golden Gate Bridge from distance. The environment is so relaxing especially in a sunny day.\nShow less"], ["Reviewed August 6, 2017", 5.0, "everything Disney without the DisneyLand", "my wife wanted to cross this off her bucket list, so we made the trip\nthere is a little bit of everything for the Disney Buff without all the noise and crowds of Disneyland\ntruly a spot for history buffs\nit is at the old Presidio which by itself is worth seeing if we had the time\nMuseum self guided tour will take a good three hours but worth it\nShow less"], ["Reviewed August 6, 2017", 5.0, "An amazing tour showcasing the life of Walt Disney", "I've read two books on Disney, own a Timeshare in Disney and a certified lover of all things Disney. To find a Museum about Disney on my vacation while in San Francisco? Made the trip complete.\n\nThis is how generous Walt Disney was, even to this day. Military get in *free*. Wow. That was such a blessing and I know Walt is smiling as he saw my face. We spent over two hours here, lets get started with this review.\n\nWalking in, you start with the Disney family history. The family had their hard times and when Walt Disney first came to Marceline Missouri by train, his eyes were opened to an Idyllic lifestyle. He always hung onto the images of Marceline Missouri and built that into his Main St USA theme parks. Walt felt family was very important and that's how Disneyland was first started. He wanted a place where a father can take his kids on the weekend, to kick back and let loose.\n\nThe museum is really an American treasure. It shows the history and progression of film and how art was integrated into the medium. Walt was a pioneer in this field. He invented special cameras and technologies, won awards and kept on pressing on during and after WWII.\n\nHere's a story, it's a glimpse of the mans generosity. Walt knew his artists needed to be cutting edge. He goes to a few local art schools and was laughed at except one. He spun it, train my artists. Once my movie is finished, I will pay you in full. True to his word, the movie was finished and Walt paid the final bill. Years later, the proprietor was sick and her home & the school was about to being foreclosed. Walt heard this news, paid off all her debts, set up healthcare for her and a trust to be used until her passing. Folks, that is on a level of sainthood.\n\nSeeing all the wonderful technologies and accomplishments until his passing, Walt Disney was a great American. This museum is a testament to the mans life. I highly recommend The Walt Disney Family Museum when you're in San Francisco.\nShow less"], ["Reviewed August 5, 2017", 5.0, "Unexpected Delight", "We were up in the Bay Area two weeks ago visiting my brother and sister in law. On Saturday we chose to go visit the Walt Disney Family Museum at the Presidio. Our choice was based on the fact that we had never been there before, and the current exhibit features the work of Eyvind Earle, an artist that my brother and sister in law love (and collect). I did not have great expectations, as our artistic choices differ, but looked forward to a day of sharing time. This became a great day. First off, Eyvind Earle did more than paint fantastical landscapes in acrylics. He also sketched and painted water colors. Those were wonderful. The second floor of the exhibit displayed the connection between Earle and Disney. Earle worked in Disney's animation department in the 50's, on some of their great animated features, including Sleeping Beauty, Peter Pan, and The Lady and the Tramp. I learned a lot about an artist I knew nothing about, and now recognize his hand in 1950's era animation. And, best of all, found new works to enjoy.\nAfter finishing this exhibit, we made our way over to the main museum. The museum focuses on the Disney family from the time they first arrived in America to Disney's untimely death from lung cancer. The exhibit is comprehensive and large. You can follow his early work with the Alice animation through Mickey and on into live action (20,000 Leagues Beneath the Saw) and more. Favorite areas of mine were the sections devoted to Fantasia, the 1964 World's Fair, Disneyland, and Disney World. So much to see and absorb. We ran out of energy before we ran out of things to see.\nThis is a great place to visit for Disney fans, animation fans, and children old enough to absorb what they are looking at (there are areas of hands on experience as well).\nThe art exhibit is a great plus.\nIf you have not visited the Presidio, this is a great excuse. The setting is beautiful and the views of the Golden Gate are incredible.\nShow less"], ["Reviewed August 4, 2017", 5.0, "Great museum for all ages!", "My son who is a fan of Disney movies and I visited this museum when in SF. It is very well made and not too big but carefully design to really rendered the creative life and achievements of WD. The way the rooms are organized makes this museum a pleasure to walk through. I personally learned a lot about his path and struggle to success we know. This is a also a very confortable place (air conditioning, bathrooms, restaurant and easy parking). A must to do when in SF.\nShow less"], ["Reviewed August 3, 2017", 4.0, "A Must Visit for Walt Disney Fans", "I went here with my 24 year old son. We spent close to three hours seeing it all, including a special Dali exhibit that was amazing (but has since moved on.) People should be aware that this museum is big on the history, technology, art, business and personal family history of Walt Disney. So while it's certainly family friendly it's not really a \"kid museum\" per se. The small cafe was nice and of course the Presidio is a gorgeous location.\nShow less"], ["Reviewed August 3, 2017", 5.0, "A step back in time", "If you are a baby boomer and grew up watching Disney on TV this is a must see for you.\nThe museum is about the Disney family, the beginnings and their struggles to make Disney what it is today.\nThere are some really good displays and interactive stops in the museum.\nShow less"], ["Reviewed August 2, 2017", 4.0, "Enjoyable visit", "My daughter and I visited this museum on a Saturday and there where lots of people around. I really liked seeing all the awards Walt Disney received. i wish we had more time as it is worth a visit."], ["Reviewed August 2, 2017", 5.0, "Lovely museum in a stunning place!", "My daughter wanted to go here so we walked from Sutter street through Presidio and what a lovely walk it was. The museum was great, full of charming bits about Walt Disney. We've been to WDW 3 times and it is our favourite place and this was a lovely tribute.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Magnificent!", "This is one of the most enjoyable experiences I have ever had in a museum! Plan to spend several hours since there's so much to see here. Thank goodness the Disney family had the smarts to collect and warehouse all of these artifacts and the memorabilia! Our ticket included a film (Aladdin) in the theater downstairs that made it even more enjoyable bring here. Everyone that works here and even the volunteers are super knowledgeable and friendly! Walt Disney was an amazing man and unfortunately died way too young!\nShow less"], ["Reviewed July 28, 2017", 5.0, "Honoring a True Genius!", "We are big Disney fans and we live 25 minutes from Disneyland, which I have visited since it opened in 1955. We had already seen the excellent display on Walt's life at Hollywood Studios in Disney World, so we were curious to see what they could add to all the movies, tv shows and articles about Walt.\n\nWe were first wowed at the ticket entrance, when you stand by a glass case with every Oscar he ever won, perhaps 26 in all. The adorable big and 7 little small ones for Snow White had a prominent place.\n\nWe thought the most interesting part was the beginning emphasis on his family and the talents and entrepreneurial spirit that ran through his ancestors, and his early experiences, like volunteering to work during the war in France, WW1, at 16.\n\nThe middle part had lots of history about the inspirations, successes and failures of his cartoons and later films. We thought the emphasis on his vision and things he pioneered was interesting.\n\nThe part we thought was neglected was about the parks, and we thought the Walt Disney World exhibit was superior to this one.\n\nWe loved the mock up of the vision for Disneyland.\n\nIF you are a Disney Fan, it is probably a 5, and if just a tourist, maybe a 4, and it is probably for older children 10 and up.\n\nBut if you grew up with Walt and all the magic he created, it is a nostalgic trip back in time. Don't forget to ask for the senior discount!\nShow less"], ["Reviewed July 28, 2017", 5.0, "Make sure to check it out before going or you might be disappointed", "This is a very good museum, simply put. It covers the Disney family and in particular Walt's growing up to become a great pioneer within animated movies. My favorite part was the areas covering the initial plans for Disney Land and how it came to be.\n\nIf you're looking for a polished experience similar to that of Disney Land or Disney World, you'll be disappointed. This is a museum. If you're looking to know more about how Disney as a company evolved and became the success that it still is today you are in for a wonderful time.\nShow less"], ["Reviewed July 27, 2017", 5.0, "Excellent Exhibit", "We could have spent a few more hours enjoying the Walt Disney Family Museum, will do it again on our next trip. Many exhibits and videos chronicled Walt's life journey. Enjoyed a delightful lunch on site, and visited the gift shop. Note - purchasing tickets on-line will save a few $$$.\nShow less"], ["Reviewed July 26, 2017", 5.0, "Must DO!", "This museum is awesome! Very impressive historical timeline and collection of Walt Disney. Military friendly, too, with tremendous discounts and deals. My only regret is not making more time for the (about) 16 galleries of history, videos, and displays chronicaling Disney's life and business. You need at least 3 hours to truly capture what the museum has to offer. Great for the entire family. Our teenage girls (15 and 13) really enjoyed it. We also loved being able to take the Presidigo back to California and Davis to catch the Cable Car back to our hotel on Powell.\n\nAlso, recommend making time to explore the Presidio itself. It is beautiful. If spending the day, you could possibly combine your Golden Gate Bridge visit with this. They have a free shuttle to the Bridge Welcome Center and back! THIS IS A MUST DO!\nShow less"], ["Reviewed July 26, 2017", 5.0, "Fun for grown ups", "Note that this place isn't as much fun for kids as they might think when they hear \"Disney\". It's a museum that tells the fascinating story of Walt Disney and how he started Disney, as well as his family and childhood.\n\nReally interesting historically both about his family and past, but also how the first movies came to be, and what challenges he faced and innovations he made.\n\nThere is a gift shop here.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Prepare to be amazed", "This museum takes you through the life of Walt Disney, and it is worth every penny. Honestly, the model of Tomorrowland is worth the admission fee alone. We didn't pay full price, as there was a Groupon deal on at the time, but I would not have complained or had any issue with paying full admission fee if needed.\n\nIt is a very knowledgeable experience, you will learn plenty about Walt and his family.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Surprising Delightful Fun Time", "This museum which was the private collection of the Disney family who I'm told were holding this collection in storage for some years waiting to find a suitable home.\n\nThe presidio with it's collection of old military buildings and ample open space and car parking was chosen for the final museum. The collection is housed in single building which is beautify laid out.\n\nThe whole Walt Disney life story is followed by the unfolding of Walt's dream to reinvigorate the art of animation and create the first full length feature films in Hollywood. Through the story boards/ interactive displays and multiple monitors with historic footage the whole development of Disneyland California is explained. We happened to visit on the 62nd anniversary of the day Disneyland first opened!!!!\n\nThe last museum exhibits conclude where Walt passed.\nThere is a great gift shop - a downstairs theatre and museum members can view films from all the Disney collection across the year.\nShow less"], ["Reviewed July 20, 2017", 5.0, "One for the Disney geek", "Beautiful museum within the Presido area of San Fransisco. Lovely area with free shuttle to downtown. Shows Walts life and inspirations throughout the life and inspiration behind Disneyland. Separate museum showcasing Disney artists. One for the Disney fanatic."], ["Reviewed July 19, 2017", 5.0, "Huge Disney Fan Must-Do", "We are HUGE disney fans and our visit was extremely enjoyable. Saddens me to think Walt never got to see his dream come true. The history displayed is amazing. Don't think young children would be captivated, but for Disney nuts like us - definitely recommended"], ["Reviewed July 19, 2017", 3.0, "Exceeded Expecations", "Look, I'm not a Disney super-fan. In fact I've been disenchanted by the company and the brand the past couple of years. But that being said I was pleasantly surprised by the quality of this little museum. My group had a tour guide who did a great job explaining some of the significance of the different exhibits, otherwise I don't think I would have enjoyed it much.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Disney Fans Don't MIss this one!", "We really enjoyed this museum, and the Presidio. The museum is full of wonderful history and we loved the interactive set up. It is a must see for Disney Fans."], ["Reviewed July 16, 2017", 5.0, "Childhood revisited!", "After a 48 day cruise we disembarked in San Francisco for a few days relaxation before flying home to Sydney. We visited the Walt Disney Family Museum and this turned out to be a highlight of our SF visit. What an amazing story and phenomenal displays. The life of WD was so interesting. Don't go to SF without visiting the Museum.\nShow less"], ["Reviewed July 15, 2017", 5.0, "The Eyvind Earle Show is Bananas!", "The Eyvind Earle show in the museum's Diane Disney Miller Exhibition Hall is amazing. Such beautiful work so lovingly laid out left a lasting impression of the genius of Eyvind Earle. I've seen a number of incredible shows at the museum (Tyrus Wong, Mary Blair) and this ranks up there as one of the best.\nShow less"], ["Reviewed July 15, 2017", 5.0, "A muist for Disney fans", "This place is great. The story of the Disney family and the business that became such a part of America! I'm a disney girl but I think everyone would enjoy all these exhibits and just to know the story of Disney"], ["Reviewed July 13, 2017", 5.0, "Great Museum for All Ages!", "My 13 year old son wanted to visit the museum, as he is very interested in the history of Walt Disney and the Disney movies and parks. I wasn't sure how interesting this museum would be for my younger children (ages 4 & 10), but many of the exhibits are interactive. I would definitely visit the museum again on a future vacation to the San Francisco area.\nShow less"], ["Reviewed July 12, 2017", 5.0, "A day at the Presidio", "This is a must place to visit when in SF. It is very informative and the exhibits are wonderful. I could spend an entire day."], ["Reviewed July 11, 2017", 5.0, "A Magical Place That Provides Insight Into Walt Disney As a Person", "My daughter and I visited the Walt Disney Family Museum in the Presidio in San Francisco on Monday, July 3rd. This was my second visit to the museum and my daughter’s first. We both thoroughly enjoyed this museum and would highly recommend it to anyone who is a Disney fan, someone who has fond memories of the Wonderful World of Disney on TV, or anyone who enjoys an inspirational American success story.\n\nWhat I enjoyed about the museum is the cleverness in the way Walt Disney’s personal story is told. Since Walt Disney was such a public figure, he gave many interviews about his life. This exhibit primarily uses actual audio and video of Walt Disney himself to tell his own story. The exhibit includes incredible amount of personal artifacts, letters, photographs, and video. The presentation really helps the visitor understand the unique originality and quality of Walt Disney’s many accomplishments. Almost every aspect of Walt Disney’s career is covered from early animation, feature animated films, true life adventures, feature films, Disneyland, Disney World, and the 1964 World’s Fair in New York. There are so many wonderful surprises in the museum from both Walt Disney’s professional and personal life. I once remember reading that one of Walt Disney’s hobbies was creating a miniature railroad around his home. I was so delighted to see that the exhibit included a large presentation on his miniature railroad, along with his actual locomotive engine, the Lilly Belle, and many of his railroad cars.\n\nI especially enjoyed the Family Insights exhibit that were placed in each room to give the perspective of family members on Walt Disney as a father and husband. My daughter and I spent almost a full 2-hours reading and watching the various exhibits. The facility included a delightful gift shop with many books and items related to Walt Disney as an artist and a small snack bar. Furthermore, the museum often runs special exhibits related to various artists who contributed to Disney animation.\n\nThe only thing that I would caution is that I don’t think this is a museum for young children. I think the person who would enjoy this museum the most would be someone who grew up with the Disney influence in his/her life. The museum is best appreciated by fully reading and watching the many presentations. I really felt that this was a museum for adults who appreciated all that Walt Disney has contributed to entertainment and culture in America. The cost for adult admission was $25, and I felt that this was good value considering the quality of the exhibit. If memories of the Wonderful World of Disney, Disneyland, Disney World, or Disney movies have any place in your heart, then don’t miss this gem of a museum in San Francisco. It is truly one of my favorites.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Great museum - you need time!", "This is an impressing museum! Didn't really do any research, so this was not what I expected, but I loved it.\n\nIt's a lot of information, but if you are interested in Disney and the history and how this man built his business, this is amazing. I think it is not the best place for kids, as there is so much to read, which you want to do when you pay $25 entrance fee. In my opinion the price is very fair, you can easily spend 4 or 5 hours there.\n\nThe staff was very friendly and helpful.\n\nThe only thing I didn't like was the coffee! Sorry but this was a really bad Cappuccino.\n\nBesides of that everything was perfect.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Disney Museum in San Francisco?", "We arrived about 2 hours before they were closing. We rushed a little at the end, because this museum is huge. Told the story of how Mickey came to be and how the first movies were made. It was great to see the Disney family's accomplishments on display.\nShow less"], ["Reviewed July 10, 2017", 5.0, "This gem should not be hidden", "We were so impressed at our first visit of this wonderful museum. It's beautifully put together, easily accessible in a great location in the Presidio, engaging, educational and fun, and has some of the most beautiful views. Absolutely wonderful both for kids and adults. Highly recommend. Give yourself at least 2-3 hours to enjoy it.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Surprising", "I had visitors from abroad who mentioned they wanted to visit the museum, which I had no interest on seeing a bunch o Mickeys! Although I am a museum super fan, I had not been there after living in the For 13 years in the Bay Area.\n\nWhat a fantastic surprise!!!! It was great to know the story of Walt Disney and his creations, very well curated in a small and quaint museum! Very good show!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Extremely interesting", "Lovely Museum and lots to see. Housed in an amazing building and location and for any Disney Fans out there, you won't be disappointed"], ["Reviewed July 8, 2017", 5.0, "Great museum about Disney's life and work", "I really admire Walt Disney and therefore loved this museum. It focuses on his life and his genius. Very well done and presents things in great detail. Not really for kids unless they like museums. Highly recommend!"], ["Reviewed July 5, 2017", 3.0, "Except more, nice location but need more collection tough.", "Surprise to know have Disney museum in SF, give it try. But not too impressive tough. Kind of like family museum, small scale and not too interesting! OK, but need more improvement! Easy Parking!"], ["Reviewed July 2, 2017", 4.0, "Great but a little pricey", "Museum is about Walt Disney and his family - NOT the parks.\n\nWe knew this going into the experience and really enjoyed our time. The museum is set in a really pretty part of San Francisco and it was a 15-20 minute walk from the main road (/bus stop). It was $25 for General Admission ($20 with Students ID) and then $!5 for the Extra Exhibit. It was a little pricey for the size of the museum but it was well worth it since we're big Disney fans. The grounds are also very nice so you can picnic after (cafe on site was yummy too and decently priced for a museum cafe).\nShow less"], ["Reviewed July 2, 2017", 5.0, "Great visit exceeded our expectations just like every Disney event", "We had already done many typical tourist attractions so we have some extra time so we came visit here. We have been to Disney world, Disneyland, & Disney cruise but don't really know a whole lot about Walt. Our whole family really enjoyed to learn his life story from his humble beginning to his imagination. We were there almost 3 hours and our 16 & 18 year old teenagers were captivated. There were a lot of information to be read so don't come tired or with young children because they will be bored.\nShow less"], ["Reviewed June 29, 2017", 4.0, "Great but overpriced", "I was skeptical about going to this museum - it was not easy to get to using mass transit and it is fairly expensive at $20 per person. The first room or two I was even more skeptical as the information seemed to be info I could get from Wikipedia. The rest though? Blew me away. It made me realize how much of a patriot Walt Disney was, how smart he was technically when it came to his knowledge of animation and film production, his entrepreneurial decisions including his failures and lots of footage from his earliest drawings and cartoons. Overall, a very enjoyable and thorough museum that is geared towards adults willing to do a lot of reading, but I still felt it was overpriced at $20 per person.\nShow less"], ["Reviewed June 28, 2017", 5.0, "A must-see for any Disney lover!", "What a treat this museum is. My husband and I gave ourselves ample time to meander through the museum and really take in all the exhibits and stories inside. The look into Walt's life is truly fascinating and inspiring. Be sure to go when you aren't rushed to get somewhere else. Trust me, you'll want to take your time so you don't miss anything! It can get a bit crowded with school tours, but there are various rooms and levels to explore, so if you find one too crowded, just hang back and it empties out soon enough. The gift shop is also a delight!\nShow less"], ["Reviewed June 28, 2017", 5.0, "Fascinating Disney history, but not really for kids", "We found the full history of the Disney family, Walt Disney's life, and the development of animation and fil all v.interetsing. There's a lot of detail in teh exhibits, all really well put together. We spent over 21/2 hours and might ahve spent more time. There's a cafeteria for light lunches or coffee breaks. Some good specil presenattiosn as well. I suspet because it has \"disney\" atatched parenst/families will think it's graet for kids, but it is reallya museum --NOT a theme park. So younger kids maybe bored or disappointed.\nShow less"], ["Reviewed June 27, 2017", 5.0, "A great overview of Walt Disney the man", "Plan to spend at least four hours here, looking at the different aspects of Walt Disney's life as well his work. Special exhibits need at least 2 more hours. We spent a glorious afternoon here and would return"], ["Reviewed June 27, 2017", 5.0, "MUST SEE - if in SF, but bring a lunch/snack", "If you've ever wondered about how Disney (the man or company) ever began and evolved, this is the place to visit. Every book I've read about Disney, Disney motion picture, Disney Parks, etc. reference a lot of the information contained in this museum. The extra $ exhibition \"Awaking Beauty: The Art of Eyvind Earle\" was worth the money. The whole museum was incredibly informative and well done. Such a treasure. My teenage kids really enjoyed it from the interactive, art and history perspective. Even if you're not a Disney fan, Disney and his creative team did have a profound impact on all aspects of entertainment even today on movies, animated movies and television, theme parks, amusement ride designs, and entertainment quality standards.\n\nI wish there was more information on the creation of Disneyland at the museum (however that could have been a whole museum in itself). Disneyland was quite amazing that it was build in just one year and that included designing all of the attractions, developing new technology, the buildings and attractions were designed by artists rather than architects, the process that took place designing and building it, etc. is extremely fascinating. The museum does display many of the technology breakthroughs that the Disney company has achieved and we've enjoyed all of our lives.\n\nThe one downside is the food service vendor. Plan to bring your own food or don't eat there. There are few other options in the area. The price is very expensive, they were out of almost all of our first and second choice items, so some of us resorted to buying a grilled cheese sandwich that was so done it was starting to turn black or mac and cheese that was microwaved mac with a little cheese sprinkled on top. We watched the guy drop a mac on the floor, spill a second on the counter (accidents happen), and then he was adjusting the mat on the floor but didn't change his rubber gloves before he went back to preparing food. Later, staff were eating themselves behind the counter and didn't change gloves while waiting on more customers. Food service was very slow and so far below any Disney standard I've ever seen or any other food service standard. These were contractors and not Disney staff, but I think the museum should cancel that contract and hire a much better food service company and demand that they make food prices reasonable and food quality and service meet all Disney standards.\nShow less"], ["Reviewed June 25, 2017", 4.0, "Washed with knowledge", "One walks out with deep respect and admiration for Mr. Walt Disney. Detailed write ups depicting his journey through from birth to death. Especially like the Interesting information about true cartoons and evolution of the characters and story behind his thoughts and creations .\nI came out planning when I would take my one year son for his first Disney land experience !!!\nThis is more suited for the adult as the child's attention might not sustain for the adult to get through all the information.\nShow less"], ["Reviewed June 25, 2017", 4.0, "A Wonderful Museum", "We found this quite hard to find by bus but glad we did..a beautiful building ,nice welcome, lots of info about the tour, 3 levels of history about Walt Disney and his family, original photos, clippings, memorabilliar and audio, all very interesting..\nGuided tours avaailable, cameras are allowed without the flash.\nBeautiful restrooms, also cafe and shop on site.\nA real pleasant afternoon...closed on Tuesdays.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Hidden Gem", "Highly interesting and lovingly created homage to the live and work of Walt Disney. Original drawings and cells from both well known work and lesser known earlier work. Beautiful and detailed model of the original concept for a disney theme park."], ["Reviewed June 23, 2017", 5.0, "So Informative !", "We returned to the museum after being here 2 years ago. If you have never been to this museum you must know that it is not about the Disney parks but the life of Walt Disney from birth to death and all his achievements. We thought we read through everything the first time we were there but no matter reading it over again is like going through it the first time.\nYou will spend a few hours here, so much to read and take in about the life of this man. You will either take a car or like what we do, we stop here from our HOHO bus before we go over the bridge. There is a café and gift shop in the museum. It is located on the grounds of the Presidio so you can make a day of spending much time here if you have it. It is also located across from the building of Fine Arts, so you can see a few things while in this area.\nThis is a beautiful tribute to Disney and you wont be disappointed in visiting.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Such a Creative Genius!!", "This museum is a wonderful tribute to a creative genius, and beloved family man! It was well planned and contained so many photos, quotes, short film clips, memorabilia and information on the life of Walt Disney and his family. There is so much to learn and he packed so much into his life. It sounds like he would have been an incredible employer. We only left a couple hours to visit but if you want to do the museum justice, you could easily spend a full day. It is a lot of reading so I wouldn't recommend this for young children. I saw a couple reviews about no photography. We were told we could take pictures but no flash photography. It is a little pricey but we were able to get discount tickets from a site through my employer and I have seen them available through Goldstar. It's definitely worth the time and money to pay this wonderful museum a visit!!\nShow less"], ["Reviewed June 20, 2017", 5.0, "A \"Magical\" Place!", "My 13 year old son is a huge Walt Disney fan. After preparing many essays & speeches on the famous Walt, we KNEW we had to see his 'personal' family museum. The museum is just wonderful, although admission is a little pricey and NOT included in the San Fransisco CITY PASS. Walt had always planned to have this museum, so after his death, his daughters followed his wishes & donated their father's prized original drawings, etchings, Oscars, photographs, etc. to create this museum. There are many interactive areas (creating the music for his cartoons) and so many photos to see & side notes to read on 'behind the scene' info. We thoroughly enjoyed it, although I'm not sure a child much younger than 13 years old would. Afterwards, we ate in the cute cafe & although it was a little expensive, it tasted good & was nice to sit & view the Presidio surroundings. Depending on when you go, there might be a school tour so check ahead! LOVED their giftshop! And be sure to use the restrooms in the basement - very cool to see the walls covered in numerous DISNEY Movie Posters from movies as far back as the 1940's! ALSO: this is a little difficult to find! Just stop & ask in one of the Presidio Bldgs. if you get lost! There is a HUGE green lawn in front of it!\nShow less"], ["Reviewed June 20, 2017", 5.0, "Very Special Adult Museum", "Walt Disney a genius marketer and animator so deserving of this tribute. We visited the Walt Disney Family Museum yesterday, and what a beautiful day it was in SF. The museum is located in the beautiful grounds of the Presidio. It is full of memorabilia from every aspect of Walt Disney's life. It is truly a reflection of his genius.\n\nThe museum people recommend 2-3 hours but if you truly dedicate the time it takes to really appreciate this museum you could well spend half a day to a full day there. It is self guided and paced but allow time to truly appreciate the content.\n\nThere is a small cafe with good sandwiches and drinks which I found tasty.\n\nWe really loved our morning here.\nShow less"], ["Reviewed June 19, 2017", 5.0, "Amazing tribute to a modern pioneer", "Read an article about this place and knew I would have to fit it in on my next visit to SFO. The museum did not disappoint. It contains thousands of personal memorabilia of the Disney family. The museum is not really for kids, but the young at heart.\nShow less"], ["Reviewed June 18, 2017", 4.0, "Well done, enjoayable and informative", "The museum is well laid out and chronological. Each room covers a specific period with many personal items from the family. Plenty of art information (for the artist), lots of technical information (for the nerd), and lots of history. My wife and I compromised on a 3 1/2 hour visit. Both were happy. Lack of places to sit to rest, and a too generic gift shop lowers our review to a 4. Friendly staff and a complimentary coat/bag check room are a definite plus. Go when it opens to get ahead of the crowds.\nShow less"], ["Reviewed June 15, 2017", 5.0, "Disney Fan? Must visit here!", "My daughter who is a huge Disney fan and dreams of being an animator was the driving force behind this visit but it was throughly enjoyed by all. Plan about 2 hours for your visit. It's located in the Presidio so perfect to extend your visit. The amount of artifacts is incredible. We loved the room with the trains and model of Disneyland. Note: when we arrived it was not very busy at the museum but halfway through it became very busy. There were a few large groups of children (8-10 years old) that were very loud and really not interested in the exhibits but just made it difficult for everyone else to enjoy. Not recommended for small children. This is not Disneyland but the history of Walt Disney himself.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Wonderful place", "It's a shame that you cannot take photos at the Walt Disney Family Museum, but it is worth a visit in the Presidio for children and adults alike. It has a great gift shop where you can buy Disney-related items. It is clean, modern and easily accessible with plenty of parking.\nShow less"], ["Reviewed June 12, 2017", 4.0, "A must for Disney fans", "I absolutely loved this museum. You got the Disneyland side, of course, but what made it more interesting was the human aspect of the Disney Family. Seeing pictures of the family, letters, and personal effects helped you see the people \"behind the mouse.\" I love Disneyland, and this just made me that much more of a fan.\nShow less"], ["Reviewed June 12, 2017", 5.0, "A must stop for any Disney fan!", "I have long wanted to visit and finally had my chance last week. The history of the Disney Family as well as insight on Disneyland is not to be missed for the Disney fan."], ["Reviewed June 12, 2017", 5.0, "loved the Edvynd Earl exhibet", "In a separate building with a separate admission from the main museum, this exhibit displayed a career of art - not only the interesting stories of his time with Disney (he was the chief background artist for Sleeping Beauty) but his own wondrous, unique work - it was so fab to see the original pieces instead of inferior reproductions that nowhere near captured the depth or stunning color.\nShow less"], ["Reviewed June 12, 2017", 5.0, "What a Gem", "This wasn't high on my list of things to do, but boy am I glad I did. What a great collection of memorabilia with a fascinating story of how Walt Disney created the Disney Studios that we know today. This is a tribute to Walt from his daughter and has been done very well. The museum has a good flow to it and the story is easy to follow.\nA great stop for something a little different. Thoroughly enjoyed it!\nShow less"], ["Reviewed June 11, 2017", 5.0, "Family Behind the Magic", "A must see for all Disney Fans!\n\nYou can feel the passion and love that was put into this museum. Start with the famous Seven Dwarfs Academy Award nestled among many of the other awards Walt earned. Then travel through the history of Walt Disney's Family, life, and work through a collection of photos, audio stories, and collectible pieces. The exhibit provides more detail to some of the more commonly known history about Walt. The early Family photos, hand written letters, and bench from Griffith Park were amazing. Just before the bench, there are windows with an amazing view of the Golden Gate Bridge. Take the time to watch the short piece with the Tiki Bird and try your hand at moving the audio-animatronic. Words cannot begin to describe the model of Disneyland, wow!\n\nIn addition to the main exhibit, there are specialty exhibits which require additional tickets. Due to time constraints, I opted for only the main exhibit and spent @ 3.5 hours exploring Walt's life. The Museum is located in the Presidio, set aside some time to look around. There is a view point near the transportation stop.\nShow less"], ["Reviewed June 8, 2017", 4.0, "Go if your a Disney fan", "A very complete and well laid out museum detailing Walts life and the Disney empire. Done with direct input from the family. Lots to see so plan to spend some time. I would recommend early rather than later in the day. They do have a cafe and the food was ok for a sandwich.\nShow less"], ["Reviewed June 8, 2017", 5.0, "Fascinating tribute to the man himself Walt Disney", "Nice way to spend our last day in San Francisco. I have been a Disney Passholder for many years and have wanted to visit the museum for quite some time now. It did not disappoint. The museum chronicles Walt Disney's life from his humble beginnings in Kansas City. Through his earlier career to his creation of Mickey Mouse and his first feature length cartoon Snow White. The pitfalls of Hollywood during the depression era and WW2.Up to his building of Disneyland in CA and plans for the Magic Kingdom in FL.\nShow less"], ["Reviewed June 8, 2017", 5.0, "Highly recommend!", "We'd been looking forward to seeing The Walt Disney Museum for quite some time. We were not disappointed. What a great Walt Disney treasure trove it is! Even though we have been big fans of Disney for many years - annual pass holders - and my husband has read several books, we learned so much more about his life, creativity, inventiveness, passion for his work and his family, the struggles he went through, and how huge the body of his work is. It was much larger than we realized.\n\nWe spent 5 1/2 hours at the museum including a quick lunch in the cafe - pulled pork and coleslaw is delicious - and could have stayed till closing except for being tired. We were grateful to have caught a few of the presentations by the docents who are friendly and knowledgeable.\n\nWe will recommend this museum to anyone who goes to San Francisco.\nShow less"], ["Reviewed June 7, 2017", 4.0, "A well done summary of Walt Disney's life", "My husband and I took our 2 college age kids to visit the Disney Museum. Being from Arizona, they have visited Disneyland many times through the years. This hotel is exceptionally well done. It really describes Walt's entire life, with lots of memoriablia and extensive details. If you're a Disney fan, this museum is a must-see.\nShow less"], ["Reviewed June 5, 2017", 5.0, "The complete Walt Disney history", "You could spend days in this museum - it covers the entire history of Walt Disney and includes cool explanations of how comic strips are made into movies. Some hands on viewing places for my boys (ages 12 and 14). It's really close to the Golden Gate Bridge so there are a lot of photo opportunities too.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Fantastic! I loved it!!", "What an intimate, wonderful experience. The presentation is pure Disney. I would say that most people need about two hours here. There is a lot of reading and listening. This isn't going to interest very many children under age 15, and few 16-21. This is really for folks who lived with The Wonderful World of Disney, early Disneyland and Disney World. I didn't see the extra exhibit, because I had just about 2.5 hours. I loved this museum.\nShow less"], ["Reviewed June 2, 2017", 5.0, "Fantastic museum!", "This is a real gem of a museum and any Disney fan should visit it. Plus it has great views of the bay."], ["Reviewed June 1, 2017", 5.0, "Disney History", "I love this museum as a great insight into Walt Disney's life and success. Great family photos, details and history pieces. Don't miss the cameras used to shoot the feature films, the Oscar(s) for Seven Dwarfs, the inside story. Great way to spend the afternoon, near the Golden Gate Bridge. There's a little cafe too, if you want a quick snack. Add this to your afternoon agenda.\nShow less"], ["Reviewed June 1, 2017", 5.0, "Must see for Disney fans!", "We love Disney World and after our first trip to Disneyland had to check this out. Best part of our time in San Francisco! Spent an hour more than we had planned. Definitely must see!"], ["Reviewed June 1, 2017", 5.0, "A delightful surprise in the Presidio Park", "We went to the park to take photos of the Bridge and the national cemetery and stumbled across this museum. Having \"educated\" our daughters with the many delightful Disney films, we could relate well to this excellent chronology of Walt Disney's trials and tribulations, leading into his great successes (and challenges). Our visit triggered many memories! I do not feel that the museum has glorified Walt Disney, but rather has tried to be factual about his career. I recommend some 2- 3 hours are set aside for any visit, which makes the $25 entry worthwhile. If you are staying downtown, then the free shuttle bus from California and Drum provides for any easy way to get to the park\nShow less"], ["Reviewed May 31, 2017", 5.0, "Wonderful museum for the whole family!", "The museum is fantastic! it follows the life and career of Walt Disney, as well as the birth of his major characters through unique and interactive exhibits. It contains some original pieces (I loved the Oscar statue he received for Snow White, with seven little statues next to it!), drawings and many, many projections, on different screens. Loved it!\nShow less"], ["Reviewed May 31, 2017", 3.0, "Day Trip", "Spent couple of hours here on our first trip to SF\nThe Museum is pretty conventional and has a surplus of b/w & sepia photos of the Disney Family\nIt gets more interesting on next floor with some great images from the classic Disney films Snow White Fantasia Bambino and others\nI felt price of $25 dollars a tad high .\nShow less"]]}}