{"West Cliff Drive": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "West Cliff Drive", "url": "/Attraction_Review-g33048-d609295-Reviews-West_Cliff_Drive-Santa_Cruz_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/3e/f3/8d/west-cliff-backyard.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1087"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "Santa Cruz", "addressRegion": "California", "postalCode": "95060", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 3 days ago", 5.0, "OMG ! What a treat after an epic drive down", "During my brief visit to Santa Clara I drove down route 9 to Santa Cruz destination West Cliff Drive. If you’re going to head down from SFO or surrounding areas and love to drive and have a more engaging drive then Route 9 all the way .... the treat at the end is arriving directly into the West Cliff strip. To be honest I didn’t bother with the other side comprising fairgrounds and rides. Hidden gem of a place.\nShow less"], ["Reviewed 5 days ago", 5.0, "A great drive", "Use your GPS to stay on drive. Houses are great, but the glimpses to beaches, rocks, and surfers, stopping along the way makes great scenery"], ["Reviewed 2 weeks ago", 5.0, "The only nice part of Santa Cruz", "Wish I had know about this part of Santa Cruz early on our trip. Beautiful coastal walking trails flanked by the ocean cliffs on one side and lovely homes on the other. The only worthwhile part of Santa Cruz worth visiting."], ["Reviewed 2 weeks ago", 5.0, "Drove along West Cliff Drive", "I was bored watching my husband helping a friend do some repairs on his Home so I took a drive along the coast on West Cliff Drive....It was beautiful and everyone walking around and the surfers were all smiles....It was about 74 degrees and in February\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful", "Took the family we so enjoyed ourselves this is a definite must so calm and relaxing beautiful view next time I want to take a picnic lunch it just sit there enjoy The View"], ["Reviewed 3 weeks ago", 5.0, "Gorgeous", "Do yourself a favor and take a leisurely drive, walk or bike along this beautiful stretch of ocean. You can stop at many points along the way, catch a sunset or just breathe in the clean ocean air. It’s very healing and enjoyable."], ["Reviewed 4 weeks ago", 5.0, "Beautiful scenic many stops along the way", "One of the most beautiful roads that I've ever seen along the coast especially the coast of the Pacific at Santa Cruz California"], ["Reviewed January 24, 2018", 4.0, "Drive along the ocean", "Beautiful drive along the ocean, you can park and watch the surfers and if you are lucky you might see a pod of whales going by.\nIt’s a nice walk too, there is a beach to take your dog and bike riders love this area too.\nShow less"], ["Reviewed January 15, 2018", 5.0, "Sunset, Surfers and big waves!", "We spent a lot of time on West Cliff Drive. If you can, ride a bike or skateboard. Looked like a cool thing to do!"], ["Reviewed January 6, 2018", 5.0, "Good for a blustery walk along the cliff edge", "A westside Santa Cruz favorite strip to walk, jog or carouse about. Bike along the road edge though be careful for gawking motorists who often turn into bikers when they are not paying attention to the road as they drive along.\nOn a blustery day expect gusts of wind as the path directly faces the open ocean, unlike Capitola's Esplanade or even Pleasure Point East Cliff Drive which is protected around inner corner of the Monterey Bay.\nIf you're new to the area make sure to visit the surfing museum located in the old lighthouse.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Magnificent Views of Pacific Wonderlands", "Whether you walk it, jog it, or drive it, this road will be busy -- with good reason. At every bend, there are fresh vistas of natural beauty, both in the landscape, but especially on the seascape. Surfers abound, and bystanders are amazed at their stunts.\nShow less"], ["Reviewed December 31, 2017", 5.0, "Great place to experience", "Lovely walk with the family. Roomy promenade. Lots of walkers, runners, jolly pets, stunning views. Wish had more time to enjoy it! Will be back."], ["Reviewed December 29, 2017", 4.0, "Perfect place to watch sunset", "Nice views and walk near sunset. Only downside are some homeless people and pot smokers .. you can go all the way down to the beach or rocks for a nice view"], ["Reviewed December 26, 2017", 5.0, "Great Walking Location", "Beautiful setting, gorgeous view, great walking or bike riding. One of our favorite places to get some exercise"], ["Reviewed December 22, 2017", 5.0, "Gorgeous views. One of the highlights of Santa Cruz.", "My son lives a block from West Cliff Drive, so I walk there quite often. Because of the horseshoe shap of the Monterey Bay coastline, you can catch both the sunrise in the east and the sunset in the west. Enjoy the Santa Cruz Beach Boardwalk, the pier, and the long lovely paved walkway that will take you all the way north to Natural Bridges State Park.\nShow less"], ["Reviewed December 21, 2017", 5.0, "A must do in Santa Cruz", "Rent a bike or take a stroll along beautiful west cliff drive. Bonus points of you time it with the sunset or sunrise and manage to see whales, otters or sea lions (oh, or surfers!)."], ["Reviewed December 19, 2017", 5.0, "Amazing views and excellent for daily runs", "Excellent for walks/runs with stunning views of the seaside. You can stop by to watch surfers as well. It's just beautiful and highly recommended."], ["Reviewed December 9, 2017", 5.0, "Beautiful drive", "Beautiful weather and great drive in the convertible. Would love to spend. More time here. Coast has a few areas to park and walk down to the water."], ["Reviewed December 7, 2017", 5.0, "The Best Walk in Town", "Walking along the cliffs for your daily exercise is THE BEST. Park on Swanton Blvd so you start down by Natural Bridges State Park, and then the blue mile markers on the ground tell you how far you've walked. Stop to watch swells coming in that activate \"the dragon,\" a blowhole between Chico and Auburn Streets. From Natural Bridges to Mitchell Cove and back is about a 2-mile stroll that presents you with non-stop views of the ocean, waves, birds, and sometimes otters, porpoises, and whales. How can you go wrong if you start your day with that?\nShow less"], ["Reviewed December 6, 2017", 5.0, "Pretty but typically crowded", "The views from West Cliff Drive are lovely. You can drive from the boardwalk to Natural Bridges State Park, however, if you want to get the best view of the drive, opt to walk along the cliff path."], ["Reviewed December 6, 2017", 5.0, "One of my favorite places... ever!", "I lived in the Santa Cruz area for almost nine years and used to go there a few times a week to walk ‘the cliffs.’ Whether you’re wanting to take your little one in a stroller, bring the bigger kids on scooters or go for a family bike ride- this place is optimal for all of the above. Also had a great dog beach close to the lighthouse and beautiful spots for coastal photos. More than once we’ve even gotten to see whales feeding in some of the coves.\n\nI recently moved to the Atlanta GA area and is is one of the things I miss the most about California.\nShow less"], ["Reviewed December 4, 2017", 4.0, "Nice scenic drive or walk", "Nice scenic drive but parking can be tricky. It was winter and sunset and was so busy that we had to find a spot in the neighborhood to park. Ride up and down to beach, boardwalk, wharf, lighthouse, etc."], ["Reviewed November 25, 2017", 4.0, "Brilliant views and an easy ealk", "We decided to walk along West Cliff Drive, it’s ideal for walkers, runners or cyclists. A gentle easy trail with fantastic views out to sea and back towards Santa Cruz. Saw more wildlife than anticipated, including a very friendly Snowy Egret. Out in the bay you could see Sea lions and seabird colonies. We finished the walk with a paddle in the sea a great way to while away an afternoon without spending any money.\nShow less"], ["Reviewed November 24, 2017", 5.0, "Iconic Santa Cruz Views- Not to be Missed", "Strolling along Westcliff should be a must for all visitors. You can see surfers or want to bed, stop by the surf statue and surf museum, people watch, ride a bike, and of course enjoy the views. Natural bridges park at the north end is a gem as well. You may be lucky enough to see seals, sea otters, whales and ocean birds in their habitat. The sunset from here is glorious. DO not miss this free delight in Santa Cruz.\nShow less"], ["Reviewed November 23, 2017", 5.0, "Wonderful sunset (Thanksgiving week)", "Absolutely wonderful sunset. On one side of the Surf Museum you have the surfers waiting for the big ones and on the other side you have the sunset. At this period of the year it s early, near 17h00. That day the sky changed colored and became red. Everything happened in 30 minutes. It was not difficult to park because people were leaving. Highly recommended. Extremely beautiful. There is an access to the beach near the museum and you can profit of the ocean.\nShow less"], ["Reviewed November 19, 2017", 5.0, "Beautiful", "What can I say. An amazingly scenic drive. Beautiful coastline on one side and homes that get the most awesome view everyday on the other side."], ["Reviewed November 18, 2017", 4.0, "Picnic on the bluff", "Watched surfers from up high while we ate our picnic lunch. Just found a parking spot and walked the path looking for the right spot. It was midday, midweek ... not crowded"], ["Reviewed November 12, 2017", 5.0, "Great outdoor spot", "Stunning views of cliffs and crashing surf along a winding road/sidewalk/bikepath/running path. One downside: can be crowded and force you to avoid getting hit/hitting others. Occasional benches to sit on. Good for a long walk from Harbor/Seabright Beach past Boardwalk up to West Cliff Drive and to Natural Bridges. Also good to walk any part of it and turn around. Parking found near the surfing museum (old lighthouse) and at Natural Bridges.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Great walk along the path above Monterey Bay.", "It is a beautiful experience, strolling, running, biking or walking your dog on the path at west cliff drive. Watching pelicans fly by, spotting otters and in season, whales, and enjoying seeing surfers catch a wave. There are lovely benches along the way so that one can sit and admire the views and contemplate nature. One of the most wonderful Things to do in Santa Cruz and it is free!\nShow less"], ["Reviewed November 9, 2017", 5.0, "Best West Coast Walk", "West Cliff Drive presents a fabulous walking opportunity. Every trip & walk is different each day. Great sites and wildlife galore!!"], ["Reviewed November 9, 2017", 4.0, "Great bicycle ride from from Capitola, to the end of West Cliff", "West Cliff is the prime spot for watching surfers at a beautiful spot along the ocean, but you can also ride bicycles from Capitola, along West Cliff Drive, ending at Natural Bridges State Park, and then back again. Not really the Tour de France, but just right for novice bicycle riders in decent physical condition.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Owner", "The most beautiful walk.\nOne can go the distance or opt for a short stroll.\nI head that way whenever I can to watch the ocean, otters, dolphins, seals, surfers, dogs playing, sunsets.\nIt’s just always an uplifting experience.\nThis is a great walk for everyone that likes to get out and move.\n\nShow less"], ["Reviewed November 9, 2017", 2.0, "Keep right", "It's called a bike path and says keep right on the path every 500 ft or so. Don't take up the whole path, don't let doggies 20 ft leash all thw way out. KEEP RIGHT."], ["Reviewed November 8, 2017", 5.0, "Best Place for a Walk in Santa Cruz", "No matter where you start or end your walk on West Cliff Drive, you will enjoy it! With the Beach Boardwalk at one end and Natural Bridges State Park at the other, you can't go wrong. There are numerous places to stop and view the Bay, watch the surfers or look for wildlife in the sea. Bring a sweater or light jacket since the temperature can change quickly.\nShow less"], ["Reviewed November 8, 2017", 5.0, "best views", "love driving, riding a bike, walking along the cliffs, beautiful flowers and all scenic view from Natural Bridges to Best Dream hotel"], ["Reviewed November 7, 2017", 4.0, "Views", "We drove West Cliff drive several times on a Monday/Tuesday in November. Weather was beautiful, and we pulled off at one of the numerous pullouts and enjoyed the great views of the Pacific Ocean."], ["Reviewed November 6, 2017", 5.0, "A gorgeous place to walk, especially lovely at sunset..", "A beautiful walk along the coast to watch the sea, birds, occasionally sea otters and other marine life, we never tired of walking here..."], ["Reviewed November 5, 2017", 5.0, "Great Place for a Jog", "Watch talented surfers while enjoying a spectacular View at this short trail overlooking the bay. We’ve been here several times and even at its busiest, there is room for more people. The trail ends near some decent lunch places. This is not so much a place to drive as to take a walk. The traffic needs to move along. The trail itself is pretty flat, so wheeled people can do OK.\nShow less"], ["Reviewed November 2, 2017", 5.0, "Stunn8ng", "Beautiful drive all around Santa Cruz. The homes are spectacular and the view is amazing. You can basically walk all around. Great place to walk your dog or go for a jog."], ["Reviewed October 31, 2017", 5.0, "Impressive views", "This is a \"drive\" that can be driven, biked or walked, feeling safe. Lots of places to park if driving. The walk from the wharf up towards the Surfers Museum has many places to view the Monterey Bay -- some otters and many seals. Great sunset views. Off season is a great time to go.\nShow less"], ["Reviewed October 31, 2017", 4.0, "Lovely Walk", "Great walk along the sea front/cliffs. Stop and watch the Surfing or just chill and watch the sea. Very relaxing"], ["Reviewed October 27, 2017", 4.0, "great views", "great place to visit love the salt air smell the waves crashing into the shore line not on the beaten tourist trap area worth the visit and another place to see free"], ["Reviewed October 25, 2017", 5.0, "Great drive!", "Beautiful scenic drive along the coast. Found out about this route to Natural Bridges state park from a local, and so glad we did!"], ["Reviewed October 25, 2017", 5.0, "Just idyllic", "Beautiful, raw, relaxing, a wonderful auto or bike ride and scenic walk. Magical. View the surfers and relish nature. Love it."], ["Reviewed October 24, 2017", 5.0, "Spectacular views", "This can be a congested area, but it was so beautiful. There are tons of beautiful homes on one side and spectacular views of the ocean on the other. Be patient, go slow and enjoy the views."], ["Reviewed October 23, 2017", 5.0, "lovely long walk along the sea front", "lovely views of the ocean and rocks along this paved path. Seals and birds all along the walk.when we were there we were able to watch a surfing competition so lots going on."], ["Reviewed October 22, 2017", 5.0, "great walk along the ocean", "Nice path along the ocean. Lots of beaches, dog parks, benches to sit at. Watch the foot traffic. Stay to the right except to pass. Or you may be run'd over by bicyclist. Lots of dorks trying to drive fast on a 20 mph road."], ["Reviewed October 21, 2017", 5.0, "Worth the stop", "After reading the reviews about how good the views were, we decided to stop. I'm so glad we did. The drive is several miles long and the scenery at each place we stopped was exquisite. I can't say enough about this drive. You should definitely go there!\nShow less"], ["Reviewed October 19, 2017", 4.0, "A must see", "The lighthouse was very pretty and I thought it was so cool to see all the surfers! I can't wait to go back and walk around more!"], ["Reviewed October 17, 2017", 5.0, "So picturesque", "Every scenic drive we have made this week in CA has been so gorgeous yet each uniquely different. Unlike any we would find in Massachusetts. This was another example of spectacular!\nWe drove the short ride but did stop and park the car and stroll to watch all the surfers and the crashing waves and soak in the incredible views. A warm afternoon made it all the more enjoyable.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Glorious day for a walk with awesome waves!", "Was there in time to participate in Santa Cruz's Open Street day, so no traffic just bikers and walker out to enjoy the day and music"], ["Reviewed October 14, 2017", 5.0, "Incredible views", "This is just the loveliest walk/run along the front with a really wide shared use pavement and staggering Pacific views everywhere you look. It feels like everyone you pass is smiling because they are just so happy to be in such good place whether they are walking and chatting to friends, running, dog walking, on a Segway tour. We saw saw pelicans galore and one morning stood in awe watching a whale out in the bay - a slice of heaven.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Finally, some real California views", "This is what we expected in terms of the look of California...tall palm trees, picturesque beach fronts, sunset, surfers, seals, wharf, people, beachside Trail! This is the place to see when in Santa Cruz! Perhaps a little stinky and unrefined in places (seal poop versus hippy urine, still uncertain) but the vistas are far worth it!\nShow less"], ["Reviewed October 11, 2017", 5.0, "Beautiful Views to be had", "The place to take your dog and yourself for a walk. Plenty of good views and eclectic santa cruzans to see here."], ["Reviewed October 10, 2017", 5.0, "Crusie the Cliffs", "If you are visiting Santa Cruz then you need to cruise west cliff drive in Santa Cruz. Amazing views and cool houses to look view. Stop at the lighthouse and grab some selfies as this is a great photo spot."], ["Reviewed October 10, 2017", 5.0, "quietest place in santa cruze", "stay away from mission street, use the cliff drive beautiful..you'll see surfers, otter, sea lions, stop and see the monarchs at the state beach"], ["Reviewed October 9, 2017", 5.0, "refreshing!", "Peaceful and relaxing! Wish the sunset was better but that is out of human control. We enjoyed driving this drive and watching the waves and people."], ["Reviewed October 4, 2017", 5.0, "Just a wonderful drive along beautiful scenery", "Great plajce to take a leisurely drive or hop out and walk along the cliffs. Stop a the lighthouse to watch the surfers. Be sure it's a sunny day. Nice restroom across the street. Look back to see the Boardwalk and really nice homes."], ["Reviewed October 3, 2017", 5.0, "A beautiful walk along the ocean!", "I loved walking along the West Cliff drive! There's a lot of benches along the walking path, to stop and contemplate the gorgeous views it offers!"], ["Reviewed October 2, 2017", 5.0, "Great View of the Bay", "I run regularly along West Cliff and highly recommend driving, running or walking any portion of this very scenic route between Natural Bridges State Park and the Wharf. Great views of the bay often with views all the way to Monterey. Surfers are almost always in the water and people dot the beaches here. Lots of birds too.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Must see walk or bike ride.", "Such a beautiful wide walkway to run, walk or biker idea on. A must if you are in Santa Cruz. You might see a whale or two!"], ["Reviewed September 19, 2017", 5.0, "Wow", "We love to drive around towns to see the views and old houses. West Cliff Drive is the place to go in Santa Cruz. The ocean, surfers, light house, and beautiful houses are unbelievable. Drive slow or park and stroll down the street to take in all the history and beautiful views.\nShow less"], ["Reviewed September 17, 2017", 5.0, "Such a relaxation no stroll and great to watch the surfers", "We spent an enjoyable few hours strolling along from the Wharf to the lighthouse. The views across the bay are gorgeous and there are plenty of benches en route at which to stop and watch the world go by. The houses on the right lend class to the walk and watching the surfers at Steamer Lane was both relaxing and exciting at times. The car parks by the lighthouse are full of surfer cars, camper vans and such like, some battered and bruised with makeshift curtains at the windows. The surfers themselves ranged in age and some definitely looked like they had definitely bought into the lifestyle which all lent itself to a great atmosphere. It felt like I'd stepped into \" surfing USA\" without even putting on a wetsuit. Great afternoon.\nShow less"], ["Reviewed September 17, 2017", 4.0, "Still a great walk!", "Still a great walk! I recommend walking on a weekday, otherwise, nowadays, it is too crowed. Good walk in all seasons."], ["Reviewed September 16, 2017", 5.0, "Love this Drive!", "This drive is eye candy with spectacular views of the ocean and wildlife for the entire 15 minute drive. Lots of places to park and lots of benches to sit. Great place to walk, run or whatever!"], ["Reviewed September 13, 2017", 5.0, "Beautiful shoreline", "Some of the most beautiful shore in the country. A walking/running path runs a couple miles north and ends at Natural Bridges State Park. A beautiful walk."], ["Reviewed September 10, 2017", 5.0, "Lovely beach", "What a beautiful ride and stop along the coast!Love this place,the view was just gorgeous.For a day in september was very warm actually.The waves were calm and water was cold."], ["Reviewed September 7, 2017", 5.0, "A walk with my sweetheart", "My husband and I love walking along West Cliff drive with its gorgeous views of the Monterey bay and rugged coastline! It's a great place to view birds like the brown pelican as well as whales migrating up and down the coast! One thing you want to be aware of however is that in the late afternoon when the sun is lower in the sky, it can be blindingly bright if you're walking towards Natural Bridges! Also it is used by bicyclists and joggers so watch as you stroll along!\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great inexpensive way to enjoy the Santa Cruz Coast line", "Pack a picnic and drive West Cliff. You may park in the spaces available and walk or ride your bike. You can head to Natural Bridges and enjoy the beach."], ["Reviewed September 6, 2017", 5.0, "One of the best places in Santa Cruz", "This a beautiful road. One the one side are some very nice homes, on the other a wonderful coastline. Natural Bridges State Park is one great park as is Lighthouse Field State Beach. This is a great walk. I like to park at the wharf and walk to the light house with my dog. It's best after the tourist season when the weather is cool and the crowds are gone.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Can't beat the view", "A beautiful place to take a stroll, ride a bike or take a run. Park near Natural Bridges State Park and walk to the Dream Inn. Promise that you will not regret it."], ["Reviewed August 28, 2017", 5.0, "Pretty coastal views", "Drove this late evening and saw a gorgeous sunset. Beautiful Victorian houses mixed with chic modern looks make up interesting architecture. The drive is lined with walking trails and pull outs to view the beach and cliffs below. Also goes through a state park and by the surfers museum in the small lighthouse.\nShow less"], ["Reviewed August 27, 2017", 5.0, "A gorgeous walk", "The walk on West Cliff drive from Municipal wharf to the Natural Bridges Beach is beautiful. There are amazing ocean views on your left, with small detours you can take right down to the water. There are lovely houses on the right. Stop at Steamer Lane Supplies for some food on the way. The kimchi dog was good, though a bit salty.\nShow less"], ["Reviewed August 24, 2017", 4.0, "West coast beauty", "An amazing spot for a drive, or even a walk if you're feeling adventurous. Rugged coastline with a gorgeous outlook, can be pretty cold if a sea breeze is blowing."], ["Reviewed August 22, 2017", 5.0, "Great walking spot", "I come here frequently to walk. I park my car right along the water and you can walk for mules. They have one set of restrooms, so it makes it very convenient to get a good walk in. This area has a lot of surfers, so it's fun to watch on the cliffs. The wharf and Boatdwalk s about a half mile which also a nice walk from there.\nShow less"], ["Reviewed August 20, 2017", 5.0, "Beautiful walk or drive", "This place was packed on the weekend, but persistence finally landed a parking spot. The views are great, well worth it."], ["Reviewed August 20, 2017", 5.0, "Make the Drive", "This really is a beautiful drive that gives a wonderful view of the coast in Santa Cruz. Traffic can be kind of heavy depending on the season and day of the week (weekend being busier, of course)."], ["Reviewed August 19, 2017", 5.0, "Nice Walk and Beautiful Ocean Views - West Cliff Drive", "We went to West Cliff Drive area of Santa Cruz on an overcast mid August day. It was so nice to see the Pacific Ocean waves. Many others were out and about.\n\nIt is a scenic place to drive or take a walk, There are various areas to park along the drive.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Beautiful drive", "We drove from Natural Bridges SP into Santa Cruz along the drive oohing and aahing along the way. We were unable to find a parking spot to stop after leaving the 20 minute parking at the park. I would recommend getting out and walking along the path, it's both beautiful and fascinating.\nShow less"], ["Reviewed August 19, 2017", 5.0, "the best road as way out weat that there is- an old stagecoacj trail even", "there are places to ride bikes an also pleanty of parking that's free. there is a paved trail and a dirt one- there are benches and [laces that people like to go see if they are able to. one of the most seanic drives in the county of Santa cruz. Alfred Hitchcock had a home there at one time and he wrote his book \"the birds\" there- it is rich in history and a must go to place I'm my opinion. people are always walking or riding bikes there. it is usually a Quiet place in general.\nShow less"], ["Reviewed August 17, 2017", 5.0, "Great for drive or walk", "Park and go down to the water just past the lighthouse surfer museum. Beautiful natural arch and interesting rocks."], ["Reviewed August 16, 2017", 5.0, "A lovley drive", "If your at the beach in Santa Cruz ypu owe it to yourself to drive along West Cliff Drive. The architecture is amazing and of course the ocean front is a masterpiece ! Older or younger your eyes will dance !"], ["Reviewed August 14, 2017", 5.0, "Great place to walk", "Enjoyed our West Cliff walk. Overlooks the pier and Boardwalk. Surfers and sea lions. Small lighthouse/Surfing Museum is worth a stop. You can walk or drive to Natural Bridges beach."], ["Reviewed August 14, 2017", 5.0, "Truly joyful walk along the ocean", "Really enjoyed taking our grand-kids walking along West Cliff Drive. Went to the surfers museum at the lighthouse and took in beautiful sea air and views of Santa Cruz wharf and Boardwalk. I wish there was more available parking in the area and there was more security (due to the street people and drug dealers that hang out there).\nShow less"], ["Reviewed August 11, 2017", 5.0, "Great drive", "Beautiful drive along the cliffs or even a bike ride! Definitely worth a look. Great to go on a nice day"], ["Reviewed August 10, 2017", 5.0, "Great views of the bay and waterfront.", "I did a great afternoon cycle ride along West Cliff Drive. The weather was sunny and warm and a lot of walkers and cyclists were about. There is a walking and bike path along the cliff edge about 5 km from beach front to the Natural Bridges State Beach. Stopped at multiple points along the way to admire views of the beach and coves below the cliff.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Great walk to the Light House", "You just start walking up West Cliff Drive, beautiful walk, until you get to the light house. Make sure you stop and see the statue of the surfer. If you have a few minutes, drop by the Catholic Church, too. If you are adventuresome,hike down to the beaches. First time? bring you camera.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Beautiful Views", "This is a wonderful stretch of road that you can walk or ride your bike. Wonderful view and interesting people to see. Some of the Santa Cruz locals are a colorful bunch."], ["Reviewed August 3, 2017", 5.0, "Don't miss it!", "The views were absolutely stunning. We walked the trail on a Sunday afternoon in July. The weather was perfect and it wasn't too crowded. Plenty of places to sit on a bench and relax. Parking might be an issue at peak times."], ["Reviewed August 2, 2017", 5.0, "Gorgeous views and the occasional whale sighting!", "Have walked West Cliff so many times in my life. The traffic can be bad in summer. I recommend starting at the very far end and you might have luck finding a parking spot in one of the lots driving towards the wharf.\n\nLast visit - whales! Breaching and blowing, first they were far and you could only see the blowing but they drifted a little closer and we could see backs and tails.\n\nWhen the fog is off the coast, it's spectacular. When the fog is rolling in, just bundle up and enjoy the moisture wrapping around you.\n\nParking is free in any of the lots. No charge for walking. Pay attention to your fellow strollers, bikes, and dog walkers.\nShow less"], ["Reviewed July 31, 2017", 4.0, "Lovely ocean views", "There is a beautiful bike trail along West Cliff Drive that provides spectacular views of the ocean. We saw a number of seals and of course innumerable surfers. It can be quite busy in the summer. If you follow the trail nearly to the end, you end up at the UC Santa Cruz marine biology center where there are some impressive whale skeletons.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Gorgeous every day of the year", "Spectacular views - rain, fog or shine. Lots of free parking. Bring your camera. Get out of the car and walk! It can be windy so if cool bring a windbreaker or jacket. Nature, waves, glory and beauty all FREE"], ["Reviewed July 28, 2017", 5.0, "Half day stroll", "W. Cliff Dr. a fantastic multi use path right along the Ocean Shoreline. It's about 3 miles from the wharf to natural Bridge State Park. This is not a hike it is more of a pedestrian bicycle path and very crowded with Walker's, runners, strollers, and bicycles. Probably because it is an awesome place to run or ride or just kill time with one of your favorite people. Highly recommended!\nShow less"], ["Reviewed July 25, 2017", 5.0, "Looking for a nice drive along the beach? This is it!", "Enjoyed driving along W. Cliff Dr. The houses are lovely and the beach views are stunning. Numerous spots to stop and get out to snap pics or just get a closer look at the view."], ["Reviewed July 23, 2017", 4.0, "Beautiful", "Can drive along the coast and see homes and view or park and walk along trail.Definitely a relaxing and beautiful area"], ["Reviewed July 23, 2017", 4.0, "Very nice stroll", "It would be a shame to visit Santa Cruz and not walk West Cliff Drive. Enough has been said about this place. I can only add not to litter. We saw some people walking and they threw trash. It was unbelievable. You will not be sad you took the time to come down here.\nShow less"], ["Reviewed July 21, 2017", 5.0, "A 17 Mile Coastal Cliff Drive", "A lot of spots to stop & visit on the 17 Mile Drive. Drive from North towards South. Enjoy every stop with breathtaking views of the Pacific Coast not to miss."], ["Reviewed July 19, 2017", 5.0, "Very nice walk", "We walked from downtown Santa Cruz to the Natural Bridges State Park on a Monday in Summer. It took about two hours, including stops along the way to enjoy the surfing museum and the view along the way. It is a very easy walk on a paved path above a beautiful stretch of the coast. It was not too crowded. After the round-trip, we enjoyed an acai bowl at the Steamer Lane Supply co., near the surfing museum. An excellent way to spend a few hours.\nShow less"], ["Reviewed July 13, 2017", 4.0, "Very Nice indeed", "When in Santa Cruz you pd be bonkers not to give this a few hours of your time it's very beautiful indeed. We drive it then parked up and walked some of it watching the coast, surf and sunset. It's a very nice are and for me knocks spots of the hustle and bustle of the boardwalk.\n\nTake son beers and food over there and watch the the world go by, the rugged coastline or the surfers either way just chill on a spectacular stretch of coastline.\n\nA good solid 8 out of 10 for this.\nShow less"], ["Reviewed July 11, 2017", 4.0, "West Cliff Walk", "Great flat sidewalk that meanders along the coast. Please keep in mind this walkway is used by both pedestrians and bicyclists alike."], ["Reviewed July 10, 2017", 5.0, "I love living here", "Never gets old. Gorgeous, peaceful, surf, wildlife. I am undeniably blessed.\n\nThat said, PLEASE DO NOT LITTER HERE. Respect the wildlife, the inhabitants here, the precious ocean. Pick up dog poop and trash. Leave aquatic plants be. Enjoy this magical place, and try to get in the water.\n\n\nOh, and if you surf, please respect the surfers. Honor the lineup and abide by the etiquette. Cowell's Beach conveniently has a sign with basic surfing rules. Have fun out there.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Best dawn photographic opportunities", "Fog, sunrise, surf, large waves, cliffs, caves, rocky shores, surreal footage for early morning photographers"], ["Reviewed July 9, 2017", 4.0, "More rugged coastline", "Once you drive around the top end of the sweeping bay with a wide sandy beach and get on West Cliff Drive the scene changes to open ocean and a more rugged coastline with bluffs and rocks and thundering waves pounding on the shore. Private homes on one side and the ocean on the other, this is a quiet drive with great vistas, and it will take you to the Natural Bridges SP.\nShow less"], ["Reviewed July 8, 2017", 5.0, "Beautiful views, walk.", "Beautiful area. Nice place to walk and take pictures. Busy with traffic and people, but definitely worth visiting."], ["Reviewed July 3, 2017", 3.0, "Lots of people and some nice views", "This is an easy place to get to for a walk, bike ride or a run. It gets very crowded and can be tricky to navigate around the people and bikes. But there is beautiful scenery and you can watch some great surfing!"], ["Reviewed July 2, 2017", 5.0, "Very scenic", "We drove and also walked along portions of it and very much enjoyed the view. There are many places you can pull off in park and then get out and walk around. It really made for a nice Sunday morning."], ["Reviewed July 1, 2017", 5.0, "The best of Santa Cruz", "Stumbled upon this place trying to kill an hour before heading inland and was so pleasantly surprised by a beautiful walk along a fairly low oceanside cliff. All kinds of surfer memorials and dedications here, and lovely views. We listened to the waves crash, watched surfers, and even spotted sea otters out in the kelp! Perfect casual stroll for families, oldsters (it would be a great place to take my mother with bad knees, for example), romantic couples...\nShow less"], ["Reviewed July 1, 2017", 4.0, "A great place to walk/bike and see the sea life of Monterey Bay", "Running from near the Santa Cruz Wharf to Natural Bridges Park, Westcliff Drive is a great place to walk/bike. On a given day, you'll see sea lions, harbor seals, dolphins, whales, sea otters, surfers, and countless sea birds. In the fall, winter and spring, you'll have views all the way to Monterey and Pacific Grove across the Bay. Fog nights and mornings in the summer reduce visibility, but offers natural air-conditioning from inland heatwaves. One caution, certain areas, especially parking lots near Almar and Fair Avenues are frequently a haven for drug deals, in the later hours of the evening. Just before sunrise to an hour or so after sunset are the best times to visit.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Perfect 5-6 mile run!", "I'm not from here but an uber driver told me to check this spot out for running; perfect! It's a great running/walking path that can get a little busy, but the diversity of ages, races, genders, relationships, etc. always brings me so much joy and energy. People are living their lives and it's really cool to witness. The cement path is all along the beach so there's an endless supply of gorgeous views.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Gorgeous view", "This walk is perfect for a power walk, stroll, or run. Path is smooth and well maintained, the signage is perfect , and views fantastic."], ["Reviewed June 23, 2017", 5.0, "Park. Then walk along this beautiful drive!", "To see all the beauty of this exceptional area, both land and sea, you need to walk about a mile round-trip. Due to the popularity, avoid traffic and parking problems visiting by late morning. You'll see many styles of lovely homes along this drive. To see the ocean below the cliffs, turnouts allow you closer to the edge where you'll view an area for beginning surfers standing in the waist-high water waiting for the perfect wave. Farther up you'll note memorials for surfers who took their last wave, a Catholic church, a lighthouse turned into a surfer museum and expert surfers risking life closer to the cliffs for the big waves. Experience one of the most spectacular walks I've ever taken.\nShow less"], ["Reviewed June 23, 2017", 5.0, "Beautiful", "It really is just a beautiful drive. This is a must do when in Santa Cruz. We traveled on a weekday so everything was less busy."], ["Reviewed June 22, 2017", 5.0, "Simple drive with awesome views", "Beautiful Cliffs and a few small beaches with crashing waves, seals, otters and surfers. Defiantly a daylight (sunset) activity."], ["Reviewed June 22, 2017", 5.0, "Worth the extra few minutes", "I was just passing through and glad I took the detour to drive this road. I saw ribs if surfers abs beautiful cliffs. There are plenty of pull offs to park."], ["Reviewed June 21, 2017", 4.0, "Great bike path on a beautiful coastline", "Westcliff is pretty much the 17 Miile Drive of Santa Cruz. Great for bike riding, killer vistas, or a good place to kick back and watch the surfers. You can take the bike path all the way from Graham Hill to Westcliff Drive."], ["Reviewed June 21, 2017", 5.0, "A beautiful walk!", "It's a sidewalk along the Pacific. On one side you have multi-million dollar homes and on the other you have a cliff top view of the ocean and dozens of surfers. You have tide pools at Natural Bridges if you're into exploring, or just a pleasant walk near lighthouse field and the surfing museum. Take a walk with a loved one here and share a magnificent experience.\n\nP.S. Also a great place to play Pokemon GO\n\nShow less"], ["Reviewed June 20, 2017", 5.0, "Beautiful place for an escape!", "We drove to Santa Cruz all the way from San Francisco for an escape. It was an amazing drive, we parked car along the beach and took a walk along the drive.\n\nThe place was decently good with the ocean view and those beautiful houses on the other side of the road. It was a chill and relax escape trip.\nShow less"], ["Reviewed June 14, 2017", 5.0, "Such a beautiful cruz", "You start at the Boardwalk and take this winding road all the way to Natural Bridges. You can see surfers, bikers, and all other walks of life. There's plenty of parking in case you wanted to stop and take in the scenery. I have spent many hours here walking back and forth thinking about life and love.\nShow less"], ["Reviewed June 10, 2017", 4.0, "a short drive through some beautifully unique homes across from the water", "My husband and I visited Santa Cruz for 2 days and had read about the scenic drive. Although it was shorter than we expected, it was nice. The drive has beautiful, & very unique homes on one side of the road, while the ocean is on the other side. There is one area where you can park on the ocean side and get out. I did that and took photos (which I am posting here). We saw some people surfing, a seal swimming and walked down a small stairwell which led to some rocks which made for nice photos (nobody else was down there; the stairs were next to a large statue of a surfer). Worth 30 minutes of your time if you are in the area.\nShow less"], ["Reviewed June 9, 2017", 5.0, "Great views", "Took a drive from the Wharf to Natural Bridges. Very scenic. A few places to pull off, and get out and enjoy the view. We also really liked the houses on this road, as they were lovely and unique, without being the typical beachside mansion popular where we live.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Breathtaking views", "Park the car get out and walk the paths, smell the ocean, feel the spray of the surf. Watch the surfer, check out the lighthouse and the surfer statue, enjoy 😊"], ["Reviewed June 7, 2017", 5.0, "Refreshing views!", "Great views of the cliffs, beaches and wildlife. A little chilly and windy until you get down to the beach. The water was lukewarm and kelp tickled our toes as we posed for pics. Don't turn your back on the ocean because it likes to have a little fun with you! One pic we posed for where the tide came in ankle deep consistently, engulfed us up to the top of our legs! Had a lot of fun getting underwater footage in the tidal pools of crabs, clams, little fish, anemones and starfish.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Views, views, views!", "Views and more views and then even more views. Walk this, hire a bike and pedal it, get in your car and drive it. Every turn is a postcard! Easy access- it's just up from the wharf and boardwalk. Traffic on sunny weekends."], ["Reviewed June 6, 2017", 5.0, "Beautiful walk", "We spent hours walking beside the ocean and enjoyed the view and watched surfers doing their thing and all sorts of people doing many things."], ["Reviewed June 4, 2017", 5.0, "Walk, drive, bike--just come enjoy the view!", "You cannot come to Santa Cruz and not visit! The view is spectacular and it is best enjoyed walking or biking. If you must drive, you are easily distracted by the road and people watching which will lead to bad things. Parking will also be a little hard so it's best to pick one end or the other and be ok with walking. The view is worth it-I promise. If you enjoy looking at the ocean or people watching-there will be plenty to see. You could stay here for hours if you enjoy that kind of thing-like I do. Sunrises, sunsets, and midday are all good times to visit.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Beautiful", "Definitely some spots to grab pictures along He coast line! It was probably one of the prettiest parts of our Santa Cruz trip."], ["Reviewed June 2, 2017", 5.0, "Must Take a Walk", "If you're in Santa Cruz, you must take a walk along West Cliff Drive. There is ample parking from Steamer's Lane all the way to Natural Bridges Beach. Park anywhere and take a stroll. Take photos by the Surfer statue or at the Lighthouse near the Surfing Museum. Plenty of views of the beaches, ocean and surfers. Plenty of walkers, runners, strollers, dogs, surfers, skateboarders etc. But it's SCruz and everyone is polite, respectful and shares the path.\nShow less"], ["Reviewed June 2, 2017", 4.0, "Beautiful", "Gorgeous drive, free parking along beach....able to access beach too. We went to the fog beach and left because idiots were not watching their dog. Beautiful drive though!!"], ["Reviewed May 29, 2017", 5.0, "Beautiful", "The drive/walk is really beautiful. Somehow not very well-advertised. A cool refreshment close to Silicon Valley."], ["Reviewed May 29, 2017", 5.0, "Great place for the view, air, ocean and excersize", "I always walk down to Natural bridges from the Surf museum. 4 mile run or walk and the view is to die for"], ["Reviewed May 25, 2017", 5.0, "Hidden gem!", "Great place to surf huge waves Awesome view of the ocean. Not as much as the boardwalk, but it does get the attention it deserves. Roam around Santa Cruz to discover the place. Great great little paradise"], ["Reviewed May 24, 2017", 5.0, "A fun place to people watch while taking in surfing competion", "West cliff is delightful for watching the surf and surfers from the cliffs over looking the beautiful Monterey Bay. There is a small but interestinglight house turned surfing museum to visit and several miles of sidewalk to view the many beach coves. There is also a dog friendly beach to entertain mans best friend which is located just a short jaunt to Natural Bridges State Park where the Monarch Butterfly's rest on their journey. One caution, there can be a lot of visitors which so parking can be difficult sometimes and keep a careful eye out for tourists who may be more concerned about the spectacular views than the cars.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Great views", "Great place to go and see some great sites. Great for photos or relaxing with sea nearby. Happy I was able to visit"], ["Reviewed May 23, 2017", 5.0, "Stunning scenary", "West cliff drive is amazing to walk or bicycle (or even view via auto). The views of the ocean and cliffs are stunning. You can walk from Natural Bridges beach down to the Surf Museum, and down further to reach the boardwalk. Dog friendly. There are benches and spots to sit and soak in the view and watch for seals and otters.\nShow less"], ["Reviewed May 18, 2017", 4.0, "Time well spent!!", "Really enjoyed making my way along here. Lots of places to stop off & take in the awesome views & watch the surfers. I was a bit short of time so was mostly car based but I enjoyed my time!!"], ["Reviewed May 16, 2017", 5.0, "Beautiful", "The West Cliff Drive is just beautiful. You can observe Pelicans, Sea Eagles and if you are lucky you can even see Whales. We've spent a lot of time walking down the drive and it's really fun to observe nature.\nThere are also a lot of surfers that have fun along the coast.\nShow less"], ["Reviewed May 15, 2017", 5.0, "Beautiful walk, drive and biking in Santa Cruz", "If you are seeking a great place to walk, job, bike or drive this is an excellent choice. I walked part of this west cliff area followed by driving it at night. Both offer spectacular scenes to view. Excellent place to park and walk to clear your head after a long work day.\nShow less"], ["Reviewed May 15, 2017", 5.0, "A nice walk", "Stopped off here in the RV for a few hours and really enjoyed it. The water was full of surfers and the sidewalks full of people ambling along. Beautiful views as far as the eye can see with beautiful colours form the many flowers.The walking is easy but do take time stop and look as we saw several whales in the distance. A great place.\nShow less"], ["Reviewed May 11, 2017", 5.0, "Gorgeous!", "Definitely worth the drive! Get out of the car when you can, and watch the surf, the surfers and the beauty of Santa Cruz!"], ["Reviewed May 6, 2017", 5.0, "Noone time", "Beautiful, Love the sunshine, The Fresh air, And watching the surfers, Plus all the very pretty girls."], ["Reviewed May 4, 2017", 5.0, "WE & Mimi", "Tidal pools .... discoveries...muscles, starfish, sand crabs ....beautiful views . Stay there all day. Besutuful"], ["Reviewed April 28, 2017", 5.0, "A wonderful drive or walk along the ocean in Santa Cruz California", "A wonderful drive or walk along the ocean in Santa Cruz California.\nWest Cliff is a winding road with an ocean view. You can walk and relax\non benches taking in the sunshine and the blue blue ocean. Natural Bridges\nState Park is located at the north end of West Cliff and is also worth a visit.\nShow less"], ["Reviewed April 28, 2017", 5.0, "Amazingly Beautiful", "I live about a block from West Cliff and I must say, it never gets old. There is something quite magical about a walk along the cliffs, everyday something new. Some days I see dolphins, seals, otters and then there are days like yesterday where I watched a humpback whale playing about 200 yards of the cliff. Truley breathtaking. The round trip walk is around 5 miles. A great way to spend a part of your day. I have traveled the globe and seen stunning landscapes, but I am always happy to come home to this.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Fun place to run", "Have run here with our daughter and on my own several times while visiting. Breathtaking views. Fun to watch the many surfers in the water and tourists on the walkway."], ["Reviewed April 23, 2017", 5.0, "beautiful picturesque walk", "we had been visiting santa cruz beach boardwalk and wharf for more than 10 years, but never really knew about west cliff drive until last week. really glad we decided to talk a walk along this drive after seeing the recommendations on trip advisor. beautiful lookout points and surfing history along the way. would definitely make this a staple of all of our future santa cruz visits.\nShow less"], ["Reviewed April 22, 2017", 5.0, "Great views", "Great views down on the front ofSanta Cruz. A great coastline with parking all the way along so you can walk along and take in the views. Would recommend the walk and the views"], ["Reviewed April 11, 2017", 5.0, "Excellent Place for a Bike Ride", "It is an easy bike ride from the bike rental shop on Pacific and Front Street to the Natural Bridge State Park. You see surfers, wildlife, lighthouse, rock formations, beach areas, etc."], ["Reviewed April 10, 2017", 5.0, "Beautiful stroll to take in Santa Cruz Coastline", "Nice calming stroll along west cliff drive offers views of the monterey bay and the boardwalk. Flat and paved, its perfect for runners, bikers, strollers, wheelchairs - people of all mobilities!"], ["Reviewed April 10, 2017", 5.0, "Santa Cruz viewing spot", "You can walk, ride your bicycle, jog or meander in your vehicle for spectacular views. It's a wonderful place and sometimes you can even see whales!"], ["Reviewed April 9, 2017", 5.0, "Great views of the coast", "Well done! Great views! Well worth the time if u are in the area. Stop by the surf museum as they have a good look out area."], ["Reviewed April 7, 2017", 5.0, "A slice of beauty", "West Cliff Drive is such a great walk , bike, skate or if you have to- drive this beautiful stretch of coast on the Westside of town. Can be very crowded in the seasons but it's something to behold the beauty , power of the waves in the Monterey Bay crashing against the rocks. If you are fortunate you can often see lots of Marine Life such as whales migrating N or S , or lunging out of the water eating. Also a Monarch Butterfly habitat is at the State Park at the end of E Cliff Drive. If right season you see trees covered in Monarchs keeping warm and it's a sight when they all take off at once.\nShow less"], ["Reviewed April 2, 2017", 5.0, "Beautiful in the golden hour", "Drove up to lighthouse point just as the sun was beginning to set. So peaceful and beautiful. Loved watching the surfers too. Very relaxing. Wish we had left more time to cover more of it!"], ["Reviewed March 31, 2017", 4.0, "Great drive", "Great drive with lots of places nearby to take a long walk. Great views of the Pacific Ocean and great sunsets."], ["Reviewed March 30, 2017", 4.0, "Pretty drive", "Headed north from Santa Cruz to Half Moon Bay, a lovely way to go. Take your time and stop for the views!"], ["Reviewed March 28, 2017", 5.0, "Lovely views and relaxing....", "This does not take long. since you are there it is well worth the short drive. get a close up of the surfers and visit lighthouse surfer museum"], ["Reviewed March 25, 2017", 5.0, "Great people watching", "I remember moving up here from Los Angeles and walking West Cliff and people saying hi. People are active and happy on west cliff you get a mix of hoola hoopers at the light house Rasta didgeridooers runners surfers dog walkers really a slice of Santa Cruz and beautiful!\nShow less"], ["Reviewed March 23, 2017", 4.0, "Great Views", "Drove this and got out a couple of times for photos. Really terrific, breathtaking views. We were there on a Saturday and parking along the way was very limited. A great place to relax, chill and maybe have a picnic."], ["Reviewed March 21, 2017", 5.0, "Nice walk, plenty of benches to take breaks.", "We walked West Cliff Drive which is a walk along the ocean, one can walk from the Natural Bridges State Beach Park to Santa Cruz Wharf, and back again; there are plenty of benches along the path so taking frequent breaks to enjoy the view and watch what is going on is a must.\nShow less"], ["Reviewed March 21, 2017", 5.0, "Often see dolphins here in the early morning", "Wonderful to watch the sunrise from the Lighthouse or the sunset as you walk to Natural Bridges State Park. An excellent place to walk!"], ["Reviewed March 18, 2017", 5.0, "Great for a walk", "If you want to have a relaxing time - just walk the four+ miles round trip from wharf to Natural Bridges park and back. You will feel good!"], ["Reviewed March 14, 2017", 5.0, "Walk or Ride", "Very nice views and nice and long stretch for a long walk or a bike ride. There's lanes to be minded. Please respect them. Also, dogs are supposed to be on a leash, but some owners let them run around and they can be bothersome at times.\nShow less"], ["Reviewed March 9, 2017", 4.0, "Nice place to drive or walk", "Nice views, lots of early morning walkers and joggers but respectful of space and friendly. Good views, nice to hear and see the waves crashing. We walked a long section and then drove and parked at different spots. It was a weekday morning so plenty of spaces. Watched the surfers for a while at the Surfing Museum stop.\nShow less"], ["Reviewed March 6, 2017", 5.0, "this is the best place to walk in Santa Cruz", "particularly at sunset. but flowing with walkers, bikers, skaters all day long. easy walk, not challenging with the Pacific Ocean by your side all of the way"], ["Reviewed March 5, 2017", 5.0, "My favorite place in the world", "Walking, running, cycling, and socializing (particularly by dog walkers) happens rain or shine on West Cliff. Blustery windy days can be just as wonderful as sunny warm days (and easier to park). If you've having trouble parking, keep heading north and don't forget you can park on the side streets. The surf museum and watching the surfers on Steamer Lane are required stops, but the entire length of West Cliff Drive is well worth the walk or drive.\nShow less"], ["Reviewed March 4, 2017", 5.0, "Beautiful walk next to the ocean", "Scenic walk, run or ride bikes for several miles next to ocean, easy to see marine wildlife from path"], ["Reviewed February 17, 2017", 5.0, "a pretty view", "this is a great place to walk above the beach. you can see the lighthouse, enjoy the surfers below and just enjoy the wonderful scenery."], ["Reviewed February 15, 2017", 5.0, "Beautiful", "It was beautiful wonderful walk would be nice to ride bikes! Lots of gorgeous scenery! Great place to take pictures! We had a great time. Even saw a group on Sequeys."], ["Reviewed February 14, 2017", 5.0, "Magical and Inspiring", "When I lived in Santa Cruz, I walked West Cliff Drive at least 5 times a week. Walking West Cliff was the best exercise I ever did for myself. The path is nicely paved and is wide enough to walk two large dogs without being awkward.\n\nI highly recommend West Cliff Drive to anyone visiting Santa Cruz or anyone who is looking for a scenic path to walk their dog. West Cliff provides many outlooks to local surfers and wildlife.\n\nEnjoy~\nShow less"], ["Reviewed February 14, 2017", 5.0, "Beautiful Views and Plenty of Seating", "The walkway is paved and easy to navigate. There are beautiful views, plenty of benches and areas to sit. You can stand and watch surfers to view wildlife. We say whales and sea otters. It's just a nice way to view bay and California coast line.\nShow less"], ["Reviewed February 13, 2017", 5.0, "A scenic walk for tourists and locals!", "I live one block away from West Cliff Dr. and this area is one of the most beautiful places to take a walk. I sometimes fish from the cliffs, gather mussels, or just ride my bike. Great place to ride a bike, jog, or just go for a leisurely walk. Also a great place to watch world class surfers at Steamer's Lane.\nShow less"], ["Reviewed February 13, 2017", 5.0, "Best Walk in Santa Cruz and one of best in California", "The greatest walk in Santa Cruz is the walk from the wharf to Natural Bridges State Park. Any section of this walk is delightful. The crashing waves at each stage are mesmerizing. Often the walker is entertained by surfers trying to catch a wave. The West Cliff homes are visual delights from small cottages to elegant mansions. Catch the walk when the waves are especially high and you won't see anything more exciting.\nShow less"], ["Reviewed February 13, 2017", 4.0, "Walk in Westcliff", "Just walked Westcliff today. Absolutely beautiful. We are so very blessed to live in such a lovely area as Santa Cruz County."], ["Reviewed February 13, 2017", 5.0, "please go route 1 along this highway with no regrets", "We were simply thrilled to drive through this area.. we took number 1 highway back to Felton after our other activities.. the scenery was such a delight. amazing waves great place to surf and do water fun."], ["Reviewed February 11, 2017", 4.0, "Beutiful February Day on West Cliff Drive", "We went for a drive along West Cliff Drive. It was a gorgeous sunny day in February. After a lot of rain this winter, a lot of people were out walking, surfing, and enjoying the area. We took a walk and also went to the Surfer Museum.'\n\nThere are beautiful views of the Pacific Ocean.\nShow less"], ["Reviewed February 10, 2017", 5.0, "Great for tourists.", "The west cliff drive is a special treat if you visit Santa Cruz. Breathtaking ocean views, crisp and clean air, surfers and local characters to watch. Drive slowly, so you can let people cross everywhere or stop and enjoy a great walk all the way to the Monarch sanctuary. Excellent place to visit and live.\nShow less"], ["Reviewed February 8, 2017", 5.0, "Nice walk", "Nice walk with awesome view. I enjoyed the surfing museum as well as the lighthouse on the shore. Nice walk in the sun!"], ["Reviewed February 3, 2017", 5.0, "Surfer Watching", "It was cold but what a view. Lots of surfers were out in the water and there was a great sunrise. Got some great photos."], ["Reviewed February 2, 2017", 5.0, "Beautiful Walk", "Great place to walk on a path right next to the ocean. Benches along the way to sit and watch the surfers. Parking can be difficult on the weekends."], ["Reviewed January 26, 2017", 4.0, "Drive, walk, jog,...", "We dropped by at this great place in Santa Cruz, to rest for an hour or two while driving the iconic CA 1 hwy.\nWe first drove, saw the beauty of the area and then decided to park to have a walk.\nIt was a very pleasant time spent by the ocean watching surfers, walking among locals with their pets, seeing people jogging... and having great time in this sea side towm.\nShow less"], ["Reviewed January 19, 2017", 5.0, "Beautiful coastal walk!", "Spent several days in Santa Cruz before the holidays. This was my \"must do\" almost everyday. Beautiful views, loved the turn-outs with benches. Perfect place to watch the sunset."], ["Reviewed January 17, 2017", 5.0, "Beautiful place for a stroll..", "We take our dogs to lighthouse beach nearby. Parking can be a little difficult. But its always beautiful. I"], ["Reviewed January 16, 2017", 5.0, "Beautiful January stroll", "Watched surfers, chilled on the beach and walked the wharf. Lots of walkable sidewalks and potent of benches to sit on when you get tired. Food is all down by the wharf, so make sure you end up there at lunch time."], ["Reviewed January 15, 2017", 5.0, "Great Place for a walk, bike ride, or scenic drive", "We visit Santa Cruz quite often to surf. We have had the opportunity to walk, jog, or drive along the scenic road many times. It is beautiful. At one end are the surfing areas (Cowell's Beach, Steamer Lane, etc.), at the other end is Natural Bridges State Beach, and - in between - are great views of the ocean.\nShow less"], ["Reviewed January 9, 2017", 5.0, "Great views", "A great path to run/jog - (about 6miles return) or drive. Fun to watch the surfers and enjoy the views"], ["Reviewed January 8, 2017", 5.0, "Breathtaking Ocean View Walk", "This is an excellent place to enjoy Santa Cruz and its ocean. We loved smelling the ocean air and enjoying the ocean breeze."], ["Reviewed January 7, 2017", 4.0, "Awesome", "West Cliff Drive is a great attraction. Beautiful views of the ocean, great walking area. Good for couples or families to enjoy"], ["Reviewed January 4, 2017", 5.0, "The Westside is the Bestside!", "West Cliff Drive never disappoints. It is magnificent no matter where you start your walk. (assuming you're walking) I live off West Cliff, so I hop on about Fair Avenue. I often walk to Natural Bridges State Park, which is a whole different story, but very easy to walk to as well. The sights are unbelievable at this time of year. We've already seen whales, dolphins, otters, & sea lions to name a few. There are innumerable sea birds to watch as well.\nWalking the other direction you can walk to the lighthouse/Steamer's Lane surf spot where you can witness nature in all of her glory. The crashing waves, the beautiful rock formations, and those prodigious surfers doing what they do best!\nA little further along is the Dream Inn Hotel which has a fun bar/restaurant, Aquarius, where one could pop in for a libation/meal, with a window on the ocean.\nStep out, down the hill and you will find fun for everyone at the Santa Cruz Beach Boardwalk.\nShow less"], ["Reviewed January 2, 2017", 5.0, "Time to surf", "Its a beautiful walk or bike ride after a surf at Steamer Lane for those who know the scene. If not, act like a visitor and don't be pushy."], ["Reviewed January 2, 2017", 5.0, "Must-See Scenic Walk or Drive", "This is a gorgeous walk or drive along classic California coastal cliffs. You'll get to see surfers, a blowhole (if the waves are big enough), and if you're lucky some dolphins or seals.\n\nThe pathway is flat and well-paved, suitable for walking, running, biking, stroller pushing, and wheelchairs. There are many places to stop and park.\nShow less"], ["Reviewed December 31, 2016", 5.0, "A must-go and must-walk", "West Cliff Drive is a place I never get tired of, even when i lived near Santa Cruz. It's as beautiful as it gets for a town on the ocean (Monterey Bay). It's a relaxing place to take a car picnic, walk, ride bikes, jog, sit on a bench, watch surfers or nap in your car to the sounds of the ocean. The paved walkway is miles long from near Santa Cruz Wharf to Natural Bridges State Park, and is wheelchair accessible, with free parking pullouts scattered the entire length of the drive along the Drive. You can often see whales during certain times of the year. It gets very crowded during holidays and warm weather weekends, but it's always worth spending some time here if you are in Santa Cruz--any time of the year.\nShow less"], ["Reviewed December 31, 2016", 5.0, "Beautiful views", "Enjoy the views of the Pacific ocean and neat ocean front houses. Stop to take a few pictures. Great way out of town if you're heading north."], ["Reviewed December 30, 2016", 4.0, "Scenic drive from Natural Bridges Beach to Boardwalk", "Start your visit at the Natural Bridges State Beach and head east on West Cliff Drive along the coastline. Pretty homes, lots of joggers, dog walkers, and baby strollers on the sidewalk. End just past the wharf and park to see the famous boardwalk."], ["Reviewed December 28, 2016", 5.0, "My fav in SC!", "Absolutely love watching surfers here, great sunsets, great dog friendly beach! Love to drive or stroll here..."], ["Reviewed December 27, 2016", 4.0, "Scenic Walk or Drive", "This was a beautiful drive along the Santa Cruz coastline. It is a favorite place for locals and tourists to hit the seaside walking path. You will find plenty of places to park. In December, we needed to bundle-up as the air was crisp, even at midday. This is a perfect place to observe sunsets. The drive is very near to the Santa Cruz Boardwalk.\nShow less"], ["Reviewed December 22, 2016", 4.0, "Beautiful views", "In all fairness we ended up here on a hunt for beautiful Christmas lights. We saw many gorgeous homes overlooking the ocean. During the day it is an inspiring place for a walk."], ["Reviewed December 20, 2016", 5.0, "FANTASTIC views, Great People Watching, Cyclist and foot traffic friendly", "This is a wonderful place to go on a sunny day. It winds from the Boardwalk all the way to Natural Bridges Park. It is a easy ride with no large hills (Except at the very beginning, near the pier, there is one hill that can be a doozy).\n\nThe views are fantastic both ways. On one side you have gorgeous cliff/beach views and on the other you have a wonderful variety of architecture. If neither of those tickle your fancy, you can play fetch on the beach with your pet, or surf the waves. No still? How about fishing on the cliffs? Just sitting on a bench or in your car people watching? The choices are almost limitless here.\n\nTowards the beginning of the Drive, by the peer, there are great places to watch the surfers catch some waves or participate in competitions. There is also a small surf museum you can look around in.\n\nThis is good for cyclists, walkers, joggers, segueing, anything really. Great for families and people of all ages.\n\nBe sure to wear layers as the wind can get intense on the beach. Also, bring water and drink plenty of it. There are no real places to get food on the Drive, so make sure you eat before and bring some snacks. After you have worked up an appetite, make your way back to the pier and eat at one of the restaurants there.\n\nIt can get a bit crowded so be considerate and walk/jog/cycle to the right and keep your dogs close. There are alot of pets on the Drive.\nShow less"], ["Reviewed December 18, 2016", 5.0, "Great Drive , rent a jeep or convertible", "One of the best Drives on the West coast , make to stop and enjoy the secret hidden beaches, nobody was there when we got there, warm up by the fire Etc, great experience"], ["Reviewed December 15, 2016", 5.0, "Gorgeous drive", "This is a fabulous stretch of coast...from the Santa Cruz boardwalk up to natural bridges, it's just beautiful the whole way. There are plenty of places to stop and take pictures. If you're walking or biking, even better! Cute little lighthouses to stop at. Lots of people surfing gives you taste of the local culture. You can sometimes see sea lions on the rocks. Beautiful homes along the way. I definitely recommend this drive...on par with route 1!\nShow less"], ["Reviewed December 1, 2016", 5.0, "Beauty Beyond Words!", "This was a great way for the Seniors in our group to enjoy the beauty of California's beaches and scenic views. Lots of good places along roadway to pull over for photo opportunities. The drive was worth the time. It was awe inspiring. It was good that you can travel at your own pace and stop as often as you want to to view the scenes or to take pictures. This would also be great for families with smaller children because they can look for seals and otters along the way in the ocean.\nShow less"], ["Reviewed November 27, 2016", 5.0, "Coast Line Magic", "Perfect drive along the Bay Area coast. Secret beaches, including a nude beach, exist hidden along the coast. Only available by local pathways. You'll find the whale blow hole if the water swell is high enough."]]}}