{"Winchester Mystery House": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Winchester Mystery House", "url": "/Attraction_Review-g33020-d144412-Reviews-Winchester_Mystery_House-San_Jose_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/11/8f/c9/ac/sunset-at-the-winchester.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.0", "reviewCount": "2310"}, "address": {"@type": "PostalAddress", "streetAddress": "525 S Winchester Blvd North San Jose", "addressLocality": "San Jose", "addressRegion": "California", "postalCode": "95128-2588", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "So Cool!", "I love the Winchester Mystery House! If we hadn't had our young kids, I would've done the extended tour, but it was still amazing! I can't wait to go back."], ["Reviewed 2 days ago", 5.0, "39 bucks for 1 hour tour?!", "Was fascinated by the stories behind this place and so it was on my bucket list along with Alcatraz to go. Considering the visit to Alcatraz which includes the short 15 minute ferry ride to and from the island and costs $37.25, this $39 per person for a 1 hour mansion tour seemed a little expensive at first. But unlike Alcatraz, I found out that having your own group tour guide was actually nice, feeding you with interesting stories and guidiing you through the enormous house. If you had any questions he/she can answer them right on the spot. Without a guide, I think it would be impossible to tour on your own anyways because you can easily get lost! After the tour, of course I went to see the movie \"Winchester\", which made me want to go back again!\nTIPS: 1) If you know what time you'll be there, may be wiser to book ahead online. However, if you don't, you should still be able to buy tickets and tour once you get there if you can wait.\n2) Taking pictures is prohibited INSIDE the house, however once your tour is over, you can see the outside area on your own and stay to take pictures OUTSIDE as long as you want.\n3) Not suited for the physically challenged. Too many narrow hallways and stairs.\nShow less"], ["Reviewed 2 days ago", 3.0, "Better on the outside than inside", "Understand that this is not a well-furnished palatial place. Exposed 2x4s and open rafters dominate, as does the old-wood, musty smell. The guide was not very engaging. The lighting is dim, stairs many and uneven. Not recommended for people with poor vision. The few furnishings you see are not original to the house, just to the time period, as the niece of the widow carted away everything that was not nailed down, literally. How could anybody live in that maze of useless rooms and convoluted passageways is beyond me. At the end I felt only sadness over how much wealth in money and talent was wasted here. If Sara Winchester was so afraid of the ghosts of the people killed by her husband's weapons, she could have benefited the children and widows in a much more beneficial way and I'd bet the ghosts would have been happy and not hound her to her dying day. The sad part of today is the high price of admission.\nShow less"], ["Reviewed 4 days ago", 5.0, "As creepy, and cool as I’d hoped!!", "The place is amazing. You’ve really got to know the story behind it to fully appreciate its mystique.\n\nAs an avid ghost hunter, I totally felt a presence in the house. They were talking about all night ghost hunts they were going to host and I’d love to go back for one. I’m sure it’s haunted.\nShow less"], ["Reviewed 5 days ago", 5.0, "Third Visit - Still Fun", "This was my third time touring the Winchester Mystery house but each visit had a wide gap of many years between them. I’d gone once in elementary school with my brother, mother, and grandmother, and the other time with a group of friends for one of the October night time flashlight tours. Over six years later, I wanted to take another tour to see the costumes on display from the new film and experience the new Explore More Tour.\n\nThe Mansion Tour is definitely the better of the two. It’s longer and takes you through the most rooms. But luckily you have to take this tour if you want to do Explore More because it can only be bought as an add on.\n\nOur guide was great and we had a really fun group that was totally into the whole experience. You get to take pictures with Winchester rifles at the beginning of the tour (I think they’re real because they didn’t have the orange cap that fake guns have) which you can buy for $40 at the gift shop. That was really the only thing I didn’t like. I would’ve gladly paid $20 but $40 is waaaaay too steep which is disappointing because they were cool pics.\n\nOne thing that really impressed me is how much has been improved at the mansion since my last visits. The gift shop is nicely revamped, the tour now has sound effects to better transport you back to what the house would’ve felt like, and they added a great video introduction at the beginning of the tour. They have also restored some rooms beautifully that were completely empty and dilapidated last time I was there.\n\nThe Explore More tour felt really short but it was worth taking for me because I’ve always wanted to tour the notoriously haunted basement/boiler room. It is super creepy down there, particularly the hallway where some tour groups see the ghost of someone pushing a wheelbarrow. Sadly no such luck for us. I loved that this gives you access to more places in the house to where by the end of both tours you’ve seen about 98% of the 160 room mansion. You really feel like there isn’t much you could have missed.\n\nIf anyone was wondering about any paranormal experiences we might have had, my husband and I saw the chandelier shaking in the ballroom and the tour guide said a door that isn’t part of the tour was left open but none of these seemed definitively paranormal. I didn’t feel anything when touring other then extremely cold temperatures. However, the house has no heating system and it was 35 degrees in San Jose that morning (come prepared for the cold!). I do, however, believe the place is haunted because, on my flashlight tour years ago, a cabinet in the linen room opened by itself behind me. The guide saw it but I didn’t see or hear it happen - just noticed that it was closed when I walked in and when I turned around it was open.....hmmmmm....You can come decide for yourself if the place is haunted and for a limited time, I’m assuming, check out the costumes from the Winchester film. We got a free movie poster and the guide on the Explore More tour pointed out a lot of the props or rooms where filming took place which was fascinating because I had thought they had only done exterior shots. Definitely worth a visit if you’ve never been!\nShow less"], ["Reviewed 1 week ago", 2.0, "What mystery? Over-rated and over-priced.", "We've been curious about this place for years, and with the new movie coming out decided to check it out. It cost our family of 4 (2 kids/2 adults) $126 or the 1 hour mansion tour.\n\nThe tour starts with the guide, in a robotic tone, greeting the tour with \"Don't open any doors. Don't touch anything. No food. Don't lean on the walls.\" Okay...fair enough. The tour continues, and while the guide was informative, she seemed bored and just wanted to run through the motions of a memorized tour script. There was no mystery - just a sad story about Sara Winchester. The closest they got to mysterious was telling us that one of the deceased workers' is a ghost who lived at the house \"has been spotted.\"\n\nThe gouging of tourists with the extreme price here is what earns this place only 2 stars. The tour just shuttles around a large group of over 20 people for an hour. The employees seem bored and uninterested. It was a sad place.\n\nCheck out the Mystery Spot at Santa Cruz, about 45 mins south. Real mysteries (gravity defying...so crazy) and really interesting. This place, unfortunately, is over-hyped and taking advantage of tourists with their ridiculous prices.\nShow less"], ["Reviewed 1 week ago", 4.0, "California Vacation", "Though not nearly as glamorous as The Hearst Mansion this house is definitely different in more ways than one can count and worth an exercising visit as there is much walking and stairs to climb. But you will probably never go thru a weirder house unless you have visited the House on the Rock in Wisconsin which is much smaller and more of a weird museum. Can't wait to watch the newly released movie about it. No words to describe this house however--you have to experience it. My recommendation is to take both they \"Mansion\" AND the \"Explore More\"trips back to back if you can stand walking for 2+ hours. Best to go on a weekday when it is not as crowded.\nShow less"], ["Reviewed 1 week ago", 5.0, "This place is AMAZING!!!!!!!!", "The house was phenomenal!!! Went at night & felt I missed too much so I will be going again. SO COOL!"], ["Reviewed 1 week ago", 3.0, "Fascinating, but expensive and oddly restrictive", "This was our first return to the Winchester Mystery House for 20 years. It's amazing how much it is now surrounded by developments. But, the house and gardens retain their charm and fascination.\n\nFirst the good, the Winchester House is a peculiar and rich with history as ever. We took the standard tour and it is still thrilling to hear Sarah Winchester's sad story and see the extraordinary home she built.\n\nLess good. First, its very expensive for a 60 minute tour. The main entrance is poorly organized - we waited in line for 10 minutes before someone told us that with pre-booked tickets we should be in a different line. There is no signage to indicate that at all. Our guide was fine, but spoke really quickly, like she was anxious to get the tour over with, which made it hard to hear what she was saying.\n\nThe biggest disappointment was to be told that photography was not allowed inside the house. We were given the excuse that the production company of the new film \"Winchester\" had \"copyrighted\" the interior of the house. I know enough about copyright in my professional life to know this is utter nonsense. I'll bet the film company did not make this claim and the owners of the house are just trying to restrict photography with no legal basis. It's completely unacceptable. The Mystery House should be ashamed of trying to con their visitors like this.\nShow less"], ["Reviewed 1 week ago", 4.0, "House great- tour average", "I've been curious to see the Winchester Mystery House since I first learned about it. The house itself is fascinating, and although the furniture isn't original, they've done a nice job preserving the interiors in their various states of decay.\n\nThe tour itself was disappointing. While our tour guide seemed very nice, the tour itself was heavily scripted, and very impersonal, playing up the supernatural as opposed to some of the historical facts that are out there via various sources. Group size was large, but manageable, although you always ran the risk of running into other groups.\n\nWe pre-booked the regular tour- the extended one seems to get booked very quickly and we weren't able to get tickets. Parking is limited on site, but there is a parking lot right across the street. There are a few restaurants close by if you need to grab a bite- the cafe menu seemed limited.\n\nOverall, it was a beautiful home- I just wish it didn't feel so commercialized.\nShow less"], ["Reviewed 1 week ago", 4.0, "A glimpse into a part of San Jose's history", "I went there last night. I have lived in San Jose for many years, but had never actually been there myself. We took an out of town visitor. The rest of the family had just seen the movie \"Winchester\", so it was an appropriate time, even though the rest of the family had been there before.\nIt is an hour long tour, except if you book the \"extra time tour stating you will see parts of the house that are not generally shown.\nIt is a fairly large house and our tour guide was good, although she talked fairly fast. I kept asking questions, mainly to slow her down!\nIt isn't cheap and is heavily booked right now (because of the movie). It is a beautiful old house, but the tour,in my opinion, was way too expensive\nShow less"], ["Reviewed 1 week ago", 5.0, "Winchester Extension Tour", "Had visited a total of 3 times over the years but was glad to be able to take the extended tour. It actually explained a little more about some of the \"mystery\" to the house and possible reasons for the \"stairs that go nowhere\", etc. Actually got to go through the unused front door and up the grand staircase as well as some of the inner and unfinished room. I am certainly glad I didn't go in summer! Temperature would be way to warm for a Washingtonian.\nShow less"], ["Reviewed 1 week ago", 4.0, "Fascinating and Fun", "I finally made it to Winchester Mystery House; i’ve Wanted to visit since I was a kid. It is so very strange. I wish we were allowed to take photos inside the house, that is really my only complaint. So many oddities; doors that open up to a wall, doors that open up to a second story drop, a window in the floor and so on. It was a pleasant way to spend an afternoon. I didn’t have any paranormal experiences while there, but the tour guides have experienced things like locked doors opening suddenly and objects moving around on their own.\nShow less"], ["Reviewed 1 week ago", 5.0, "Winchester", "I visited this Winchester house many years ago and just brought back my kids. I totally recommend this place."], ["Reviewed 2 weeks ago", 4.0, "Interesting but strange", "Sarah Winchester’s famous home was a couple of different tours available. I was there on a weekday at 3 pm and the tour was not full. The gardens are beautiful and well marked. I found the house annoying with little quirky nooks and crannies that had no purpose. The stairs , some with 3” risers were difficult to walk on. My favorite room was Sarah’s bedroom where she was trapped in the 1906 earthquake. Good tour guide, good history facts. A little boring for the little ones attending.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Weird", "One of the most unusual attractions I have ever visited. Stairways going nowhere. Doors commisioned for thousands of dollars in the 19th centuary and never been opened. It is certainly worth a visit."], ["Reviewed 2 weeks ago", 2.0, "Not impressed", "I heard a lot about this place but I found it a dark collection of corridors with no brilliant feature [I was expecting an interesting architecture], a random building of small useless rooms with a uninteresting story! Also very expensive for what it is!"], ["Reviewed 3 weeks ago", 5.0, "Definite Must See at Least Once", "The tours were packed because of the movie so be sure to book ahead. The house is quite something and hard to explain. You have to see it. There are doors to nowhere because, my theory, is that she intended to add at those locations. She was always building during her whole life so since there was no master plan or design, the house is truly a mystery. Some of the ceilings are very short because she was under 5 feet tall. There is also an interesting museum you can go into for free. We took the bonus tour and it was tiring but I recommend it as they claim it will only be available for a year or two.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "History and Mystery", "This is a great place to take friends visiting from out of town/state. It's full of history, mystery and folklore. Now that the movie's out, you and your friends and family would enjoy exploring these grounds more! Try the Halloween tour, if you get a chance.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Strangest house ever", "We totally enjoyed our tour of the Winchester House. We were fascinated by the story of Mrs. Winchester and the continual building of the home. It included some of the most bizarre architecture and space that served no purpose. We could not imagine being in that house in the door is there were so many nooks and crannies for someone to hide. It's almost as if you felt Mrs. Winchester's fears. I was visiting with my family; that was not a choice for this review- it said family with children or families with teenagers and my children are grown.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Extraordinary Example of Over-the-Top Victorian Architecture", "I remember visiting the Mystery House when I was a kid (decades ago). The house is so big inside that I was exhausted afterward (It was very hot and no air conditioning). I can't wait to go see the house again as it's been updated, repainted, and certainly of more interest now nationally due to the new movie coming out about the mysterious house and the odd, superstitious, heiress to the Winchester rifle fortune. Mrs.Winchester (played by British actress, Helen Mirren) once widowed, became more eccentric and believed that if she never stopped building on the house that she would never die. There are all kinds of ghost stories about the house too. My big fascination with Mrs. Winchester was that she slept in a different bedroom every night and no one on staff knew which room it would be. The servants had to change ALL the bed linens on ALL the beds in the gigantic house each day---and only then would a servant discover which bedroom she'd slept in. Winchester did this to trick the ghost into not ever finding her. Can't wait to see the movie (although it may not be suitable for little kids since it's a bit of a horror story rather than a historical drama).\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Fabulous local place worth seeing!", "First went here in 4th grade and it was larger than life. Back 30 years later with my kids and they marveled at it. Just went last month and had equally great time. Wonderful story, guides are good and easy access/reasonable. If you are in the Bay and looking to do something, it’s alwsys a hit!\n\nHighly recommend!!\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Just for the Architecture...", "Great old building with a neat history. Wonderful crew keeping her in great shape and ready to share the interesting story of a psycho woman with money. And now there's the film...wait and see."], ["Reviewed 3 weeks ago", 4.0, "WOW !! ITS NO WONDER THEY CAPTURED THIS ON A MAJOR MOTION PICTURE", "A wonderful trip through the mind of a unique and fascinating woman. One of the most unusual and bizarre places that you will ever visit. You will not be disaipointed."], ["Reviewed 3 weeks ago", 5.0, "Winchester mystery house San Jose California - worth a visit", "This historical house is very interesting to visit. Several tours are held and prices do vary. Listed on the register of historical land marks the history of the house goes back to the original owners who built the house. After the death of her husband the owner Sarah kept building more rooms which eventually it became the size of a mansion. It is thought to be haunted by past ghosts and supernatural beings! I did not see any but I really liked the tour as I learnt so much about the house and the owners. It would be fun to have it used as a haunted house event on Halloween or as an escape room or a sleep over for more dynamic fun!! I really liked it but I did see it during the day!!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Favorite place to visit", "Been there 3 times and I love it every time. Great place to take the family for a little outing! Your is always funnn and to see a little price of history"], ["Reviewed 4 weeks ago", 5.0, "Not a tourist trap!", "It would be easy to see the billboards across Northern and Southern California and presume that the Winchester Mystery House is a tourist trap, but it's not. It is a designated California historical landmark and is listed on the National Register of Historic Places. The tour is interesting and filled with facts. Sara Winchester was a real person and this was her real home. The building is not airconditioned and the tour takes roughly an hour, so plan accordingly, dress appropriately, and use the restrooms before the tour starts! The only 'touristy' thing you'll encounter is the gift shop and you may even find a treasure there.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Loved it!", "Hubby and I visited today and took the main tour and the Explore More Tour right after! We had an amazing time! Yes, it’s a tad pricey, well worth it to us though!"], ["Reviewed 4 weeks ago", 4.0, "Ghosts Beware", "Even ghosts could get lost in all the twists and turns, nooks and crannies in this house. But they don't have to pay the hefty fees for admittance ($42 for a senior) for the house and extended tour.\nEven with that we felt it was well worth the visit. Nowhere else will you ever find anything as interesting and unique as this. We enjoyed all the oddities and surprises this site had to offer. Our guides were exceptional in their knowledge and presentations.\nTo us it was well worth the cost.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Historical Landmark Tour", "This historic landmark offers numerous daily tours with guides. The guided tours take a little over an hour, leaving every ten minutes. Then you are welcome to self tour the exterior grounds, at your leisure. There is a counter snack bar with inside or outside seating with expensive prices. The large gift store has numerous tokens and trophies to purchase. Interesting history, adventure and experience to partake in. Once is enough.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Interesting but overpriced", "Not much to do in San Jose so we opted for this. Have visited many historic homes around the world and found this one well preserved. The grounds are very well kept and the guides well trained. Nice family event. But the price is excessive and would have considered this a $15 to $20 per person experience rather than the $40.\n\nPros: lots of photo ops, interesting story.\nCons: high price\nTips: enjoy the grounds and gardens first, they are free.\nShow less"], ["Reviewed January 23, 2018", 4.0, "Interesting Place & History Worth Seeing", "Designed and built by the Winchester Rifle heiress Sarah Winchester, this Victorian mansion has 160 rooms, of which 110 is available to the public. Visited this place with a friend from Europe, and one of my local friends. It's a very interesting house and a must-see-for-yourself. The tour was great, although pricey, recommend doing it at night to add to the atmosphere. Definitely recommend for people with an interest in the supernatural. Brief spoiler: The owner built this on request from the ghosts (fallen victim to Winchester rifles), continuously adding new rooms and features from 1884 to her death in 1912.\nShow less"], ["Reviewed January 23, 2018", 5.0, "I love that creepy house.", "I love this place. Very unique and eerie. Love the grounds very well kept for as old as it is. The price is ok."], ["Reviewed January 21, 2018", 5.0, "Winchester Mystery House", "The 2 hour tour called explore more was definitely worth it. Got to see all 160 rooms in the Winchester Mystery house that lead to no where and see the bizarre attributes that give the mansion its name; a window built into the floor, stairs leading to ceilings, doors that open onto blank walls, a seeming obsession with the numeral “13,” cobweb motifs, etc.\n\nGreat history and my girls enjoyed the entire tour!\nShow less"], ["Reviewed January 21, 2018", 5.0, "Winchester Mystery House", "Today we took the tour of the Winchester Mystery House. We had a very informed and entertaining guide. Enjoyed and recommend this tour."], ["Reviewed January 19, 2018", 3.0, "VERY expensive", "Bring all your money, adults were $40 each to tour, $20 for kids with no family discount (we had 3 kids with us) - cost $140 for us all for just one hour!! The guide was good, sort of worn out and on auto pilot though. Couldn’t answer off the rack questions. The house doesn’t disappoint, very intriguing architecture and back story though. If we had checked price before driving out there, likely would have skipped it though.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Unusual house that must've visited", "This is truly a gem in the Bay area. Tells the tortured history of the Winchester gun maker family. Irrespective of your interest in guns or not, worth a visit to see the complex house built by troubled minds with lots of money. Easy access and parking.\nShow less"], ["Reviewed January 18, 2018", 5.0, "Fascinating!!!!!", "I had heard about this house several years ago and was totally fascinated with the story. The house did not disappoint. Great tours and learned a lot. Very interesting."], ["Reviewed January 15, 2018", 2.0, "overpriced and just not that interesting", "if this were half the price, I'd round up to three stars, but at $50 per adult, it's really not worth it (IMHO). it's an old house with 100 weird little rooms, that's it. very few of them have any furniture in them. you go on a guided tour with about 20 people. I've been here twice in 12 years. the first time the guide was so clearly bored by her job that it was painful for the whole group.\n\nI'd have to have a Winchester rifle pointed at my head to make me go through this again\nShow less"], ["Reviewed January 13, 2018", 4.0, "Amazing place to visit", "Everyone who visits San Jose must come to this site. It's a great story to tell. It's a bit expensive to get in. But Enjoy!"], ["Reviewed January 11, 2018", 5.0, "Thoroughly Entertaining", "The whole experience was amazing. I had seen the mansion featured on television specials before, so I knew a little about it going in. The tour did not disappoint. We opted for the less expensive one-hour tour, as opposed to the two-hour \"Explore More Tour.\" Our tour guide, Gene, was awesome. His retelling of Sarah Winchester's life was quite compelling. You could tell that he really loved being there and he knew his stuff about the Winchester family and the house. I only wish the tour could have been longer; there was so much to see in the house that I could have easily spent several hours just admiring the individual rooms, windows and furnishings (even though the furniture isn't original to the house, but rather period appropriate.) I can see where the Explore More Tour would be a worthwhile investment. Definitely take a look at the house from the front once the tour is over. It's really a beautiful house and I'm glad it's being preserved for future generations.\nShow less"], ["Reviewed January 7, 2018", 5.0, "One-of-a-kind House", "It's hard to believe that the house as it stands now is actually quite a bit smaller than it was before being taken out by the 1906 earthquake. Really interesting tour, and we were lucky enough to get the limited-edition Explore More tour. I would say the tour we took was geared towards adults as far as focusing on history and architecture- the kids in our group looked kind of bored, and due to having to keep the house preserved, there are rules you have to follow. The rifle mini-museum was cool too, and there are neat things like old slot machines and video viewers (and more) scattered around that you can activate for a quarter or two that were fun. Unless I took a nighttime tour, it's not something I feel like I'd have to go to again, but I thought it was definitely worth checking out.\nShow less"], ["Reviewed January 7, 2018", 4.0, "\"Explore More Tour\" pricey but worthwhile", "I really enjoyed my visit to the Winchester Mystery House. The $49 \"Explore More Tour\" includes the basic \"Mansion Tour\". Although you briefly pass through some of the same spaces on both tours, they are very different in focus. The grounds are also very well maintained and beautiful. The history of this house is utterly wacky, as are some of the rooms. I found it fascinating! I especially liked that many rooms/spaces are unfinished so you can clearly see the structure of the house and how it is built - if you are a builder or in the trade you will find this aspect very interesting. The tour guides were well versed and able to answer just about every question. You cannot take interior photos (many rooms are too dark anyway). Lots of stairs. Highly recommended!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Amazing and beautiful", "This home is quirky and also beautiful. For the time, there are innovations that made the servants’ lives easier. And the low rise steps were brilliant. The high-end decoration is gorgeous and the Ballroom is jaw-dropping. As are the gardens."], ["Reviewed January 7, 2018", 5.0, "Spooky loved it so much!!!", "This place was everything and more.\nI came to visit my sister in sun jose, she lives acrosse the street from the mension. It was before crismes. Im telling you its a must place. I took a ture. What i saw, the staires that leads to no were, the doors near the sealing, the siance room, her rooms, the story and the great guide, this house makes you\nthink. The mension is huge, the gardens are nice, the gift shop is cool.\nShow less"], ["Reviewed January 5, 2018", 5.0, "Spooky fun", "Extremely interesting tour. Mrs. Winchester obviously had some severe mental issues, but at least her obsession with building her house kept a lot of people in jobs over the years. Seeing her house and hearing her story made me feel very sympathetic for her. Poor women, she spent many years suffering. It's very sad.\nShow less"], ["Reviewed January 5, 2018", 4.0, "Fun Place to visit but pricey entrance", "We visited this attraction since it was on our way to Las Vegas from San Francisco. When we arrived by 11, we were able to get a tour booked at 1130AM and so it gave us time to eat lunch. It took so long for the food to be ready and we barely had time to eat when it was time for our guided tour. The girl who was our guide was very entertaining and informative. She was also very patient and accommodating. The tour was overall a fun family activity and we enjoyed it (although there were no photos allowed during the tour due to copyright with the upcoming movie). I was surprised that there were quite a handful of visitors on a weekday (although it was the day prior to the New Year's Eve). The place is well maintained and the tour is well done but still, I find the $27.50 entrance quite steep for a one-hour tour of the place.\nShow less"], ["Reviewed January 5, 2018", 3.0, "Interesting", "Very interesting place to visit. I do not recommend doing the full day tour or the extended tour. Not worth the money. Not cheap."], ["Reviewed January 5, 2018", 5.0, "My favourite place in my California trip", "I took 2 tours and they are absolutely amazing. The exploration tour really give you a lot knowledge and exciting about thd house. The further tour which cost $10 extra will give really the taste of every part of the house."], ["Reviewed January 4, 2018", 4.0, "Fun", "Take the tour, it was actually pretty interesting. The history of the house, the legends of ghosts, the life of the widow... it is well worth a few hours of time"], ["Reviewed January 3, 2018", 5.0, "Hum.....someone was Cray cray", "Great visit with my two not so young kids. This is a very unusual place. It is worth seeing at least once. Well manicured ground. Good lesson in history"], ["Reviewed January 3, 2018", 2.0, "Overpriced Entertainment", "The house may have been interesting once upon a time, if it wasn't under constant construction. For the price of admission, you'd think this place would offer a full viewing of the house, but many rooms are closed off to the public. The grounds are in better shape. Also, the guides who take you through the house, have their lines so memorized, it's animated. Spend your money elsewhere! I was there for the Halloween Haunt!\nShow less"], ["Reviewed January 3, 2018", 3.0, "The shrinking Winchester Mystery House", "I've been going to the Winchester Mystery House since my early teens. Each time I return, I find the tour a little shorter, fewer rooms, shown, etc. Its a shame because this really is a spectacular house. I'm not sure if the tours have changed due to the upkeep of the house or for cost savings but my last visit was disappointing.\n\nI definitely recommend the Halloween Night event. The nature of the house lends itself perfect for nighttime - -- specifically Halloween. If its spooky mood you want, you won't be disappointed.\n\nThe house has appeared on many ghost hunter shows. Although I've looked for haunted figures to appear in the numerous photos I've taken, I'm sad to say it has never happened.\nShow less"], ["Reviewed January 3, 2018", 3.0, "Nice", "I thought its was okay. Not something to build a day around maybe just a couple of hours at most. You can walk around the ground for free but the tours are pretty pricey if you ask me. We just walked around by ourselves. There is a place to eat but we had already ate. It was just okay for me. I’m sure if I would ha e paid the $40 the inside of house would have made it better but I wasnt that interested.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Just good old fun!", "Been here several times and often take out of town guests. Everyone always has fun. Be sure to get in the \"spirt\" when you go."], ["Reviewed January 3, 2018", 4.0, "Fun and interesting", "I really enjoyed the tour of the mansion and some of the grounds during the day. The tour guide was very nice and I enjoyed hearing about the house and its history. We went during the summer months, so it was beautiful outside! Photos are not allowed inside the property (can't remember about outside).\n\nThe gift shop has some neat stuff too! Parking is not a problem as they have a large lot, so that's super practical and makes life easier.\n\nWelcome staff and cashiers are not as friendly from the times we've visited, but tour guides have been excellent :)\nShow less"], ["Reviewed January 2, 2018", 5.0, "wow--what a place!", "This mansion has to be seen to be believed. The widow Winchester had an insane amount of money to spend and to keep the spirits away, construction went on 24/7 for 38 years. Stairs to nowhere, doors that open to a wall, and any other oddities.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Touristy but fun and interesting", "This is clearly touristy kitsch, but fun and well-done, and worth the visit. The mansion is crazy, as was the woman who built it. Staircases to nowhere, doors that open onto a 2-story drop to the ground. The tourguide was great and it sounded like a rehearsed script, so I assume all the guides will be just as good. The city has grown around the mansion so that now it's in the middle of the middle of a business and shopping district, which makes it stand out even more for its weirdness.\n\nDon't miss the display in the gift shop of Winchester's non-firearm products, including roller skates and ice skates, a lawnmower, kitchen knifes, and garden tools. And don't miss the rifle museum near the place where the tour begins. Neither are part of the tour (you can probably see those for free) and aren't emphasized, but are really interesting.\nShow less"], ["Reviewed January 1, 2018", 5.0, "Oldie but goodie", "Great little stop with the family! I recommend it at least once when visiting San Jose! Interesting historical site and insight into the Winchester family."], ["Reviewed December 28, 2017", 5.0, "Hurry to see before Feb 2, 2018", "Apparently Winchester House is one of the world's most famous haunted houses and has inspired a movie called Winchester, the house built by ghosts which will be released next year. The visit is $37 per person for an hour long mansion tour and worth every penny! You will see 110 out of 160 rooms and the story, the ambiance, the architecture of this labyrinth is fascinating. It is so nicely decorated for Christmas as well! Best time to visit. Widow Winchester had arthritis and the stairs were redesigned to suit her, so my 75 year old mother had no problems on that tour. Fantastic souvenir shop and there is a bistro to have a quick bite.\nShow less"], ["Reviewed December 28, 2017", 5.0, "Been here 3x, never get tired of the history", "Bought my 2 kids who are old enough to appreciate the history of this house for the 1st time. They enjoyed themselves. That's all I needed to hear :)"], ["Reviewed December 25, 2017", 5.0, "Go for the extended \"See More Tour\". It's a much better value.", "It's definitely worth visiting, for its uniqueness. But the quality of your experience will be affected by the outdoor temps (it's pretty open air) and who is your guide! The extended \"See More\" version takes you back, up and down to see the 'underside' of quite a few things. Plus, we benefited from the wisdom and humor a very entertaining guide (Jaimie). Our guide for the main tour was Matt, who was informative but perhaps a bit too rote in his presentation (we might all be after giving many tours...). The No Photos rule sucks!\nShow less"], ["Reviewed December 24, 2017", 4.0, "Interesting, but too pricey.", "Always wanted to go here, but it wasn't as a haunted house feel as it promotes.\nToo many \"set up\" sounds.\nOur host was lovely and informative, and answered any questions our group had.\nThe entry cost I thought was rather steep for what you get.\nOverall, I'm glad I have ticked this of my bucket list and enjoyed the house, gardens and story for what it is. It is a shame though you can't take photos of inside the house.\nI think the movie will be awesome when it's released. So can't wait to see that.\nShow less"], ["Reviewed December 21, 2017", 4.0, "Limited Visit", "A visit to the Winchester House was on my mother's bucket list. Due to the amount of stairs and her limited ability to do them we did not visit inside. We were welcome to tour the outside with a walking map which was very interesting."], ["Reviewed December 21, 2017", 4.0, "Interesting Architecture", "I've been to the Winchester Mystery House twice now and have enjoyed it very much. Most recently we visited in Nov 2017. I will say that the better tour guide (years ago) told more stories about the personal nature of Mrs. Winchester and her peculiar interaction with others, which made the tour much more interesting. This time they seemed to be more focused on the upcoming 2018 movie about the Winchester House, which is exciting, but not the same as hearing about the real Mrs. Winchester. If you go, ask the tour guide if they have any stories about her conversations or dealings with the hired help.\n\nThis house just screams \"money to burn\". Extravagance everywhere, but also pointless (? maybe not to Mrs. Winchester) constructions. But of course if she felt was being guided to do it.......who knows. 24/7 Construction for 39 years..... I will say that you will never see anything like this place ever again. We were going to take the extended tour, but didn't get there in enough time to do that and then catch our flight. The basic tour is expensive enough (but worth it if you're not sure that you'll pass that way ever again) and once is probably enough for that particular one. I would really like to have seen how the extended tour is different.\nShow less"], ["Reviewed December 19, 2017", 5.0, "Mystery is a bit over-promoted", "It is not a haunted house type tour which is a good thing. We took the hour long mansion tour and then the Explore More tour which was about $20 more, but surprisingly worth it. The tour guide (Bennett) was very good on the first one. Second guide just okay. They tend to hype the occult-aspect - known in Sara Winchester's time as Spirituality. However, they didn't give many facts to bear that out. Wikipedia and other web-based sources show a more balanced perspective that she was simply brilliant and inspired by Shakespeare, Sir Francis Bacon and numerology. Gift shop wasn't outstanding. Check out the gun collection and the gardens were very nice.\nShow less"], ["Reviewed December 16, 2017", 5.0, "Fun!", "I have watched shows on tv about this house. I had always wanted to visit. Finally got the chance. We did the regular tour plus the explore more which takes you thru parts of the house never before opened to public. Both tour guides were super informative and engaging. Really enjoyed the historic information and the ghostly side as well. Unfortunately we saw no ghosts. But it was really fun seeing the house and the eccentric quirks of the house. I would definitely go back. We didn't take time to explore the self guided and garden area as it was super windy and a bit chilly. Keep in mind the house is historic do not expect heat or AC. I was comfortable inside w my light sweater. I'm glad I got to go this time of year vs summer. The guide said it gets incredibly hot inside. Unfortunately we couldn't take any photos inside. I'm not sure if that rule is always in effect but our guide said that since Hollywood is making a horror thriller about the house they own the rights of photography and as a result we could not take any indoors. I didn't mind. It was fun regardless.\nShow less"], ["Reviewed December 16, 2017", 4.0, "Very cool!", "While in the San Francisco area, a must visit site. A great way to spend an hour! As a history buff, it was cool to learn about the family and the craziness behind the house. The architecture and maze that the house has become is a very neat experience.\nShow less"], ["Reviewed December 10, 2017", 4.0, "Good tour", "Its too bad we couldnt go with my neices (they were under the age limit at the time we went). Ok history. I think I had already seen a show on it so I wasnt surprised/did not learn anything new."], ["Reviewed December 6, 2017", 5.0, "Always a fun trip!", "Such a quirky place full of history and a lot of creep! Definitely a must visit when in Sam Jose, especially if you like eccentric things that are actual historical sites."], ["Reviewed December 3, 2017", 3.0, "Great Place for History Buff and Ghost Hunters, and Family", "Two different tours are offered, the Masion Tour (1 hrs) and the Explore More Tour (1 hr and 15 min).\n\nThe Explore More Tour started this May and will stop in December (not sure when it will restart) and takes visitors to explore a never-open-to-the-public part of the house that was largely destroyed after the 1905 earthquake. I would recommend both tours for people who are fascinated with history or ghost, but honestly the Masion Tour will provide all the information you'll want to know about the house, it's owner and why it looks like how it does today.\n\nInteresting fact: No photograhy allowed inside because there's a new movie about Sarah Winchester coming out in 2018 and part of it was shot at the house.\n\n\nTip:\n1) Get a Groupon for the Mansion Tour and pay extra $10 for the Explore tour. You will pay $40 for both tours.\n2) Grab a beer in the courtyard, but remember that you are not allowed to take any open-top beverages inside the house.\nShow less"], ["Reviewed December 3, 2017", 5.0, "Simply Outstanding", "I really can’t say enough about WMH. After a day of EVERYTHING going wrong, airline/airport SNAFU we finally made it to the Winchester house. Remember the SNAFU I mentioned? Yes, we had all of our luggage in tow. I figured they would think we were nuts for sure when I called and asked about “luggage storage”. Of course I got the liability disclaimer- totally understand that- but they were more than happy to accommodate us! Whew! All of the staff was super, duper helpful and assured us it was no trouble at all (even though I know it was!) We were SO excited to see WMH! My husband had visited as a child and was excited for the rest of us to experience this gem. The tour was OUTSTANDING! We did the 12:40 tour on 12/3 with a young lady that was super informative and helpful that had a dry, humorous wit. WMH IS Amazing and truly baffling at the same time. Such a strange but intriguing piece of history- I pray Sarah Winchester is Resting In eternal Peace and was able to rid herself of those demons. Definite must see in San Jose. Folks this is on the pricey side but just think-,about the costs to maintain, restore and employee folks in this expensive area. (Find a groupon) The grounds are meticulously maintained and beautiful! And honestly I live in a cold climate so I was pretty thrilled to see an orange tree up close and personal. Thank you WMH staff for rescuing our day full of unfortunate mishaps and showing us s real piece of strange/odd/baffling history.\nShow less"], ["Reviewed December 2, 2017", 4.0, "Interesting vertical maze", "We were visiting San Jose and went to the Winchester House. Interesting history and quite a walk going through all the rooms, large, small and hard to explain. A bit more hyped than the reality but apparently Hollywood is working on a haunted house story for release in a year or so. Good display of Winchester rifles and attractive gardens that are part of the tour. Somewhat overpriced, but it is California. Tours are timed, so arrive ahead of the schedule. Some groups are large and some smaller. We were there on a weekday and it worked out well.\nShow less"], ["Reviewed December 1, 2017", 4.0, "Fun Attraction", "Stopped by the WMH on our way to an event in San Jose. While most of the ghost story stuff is concocted, the house is a general weird place and the tour is entertaining. Despite the somewhat steep entry fee, we were both satisfied and are thinking of going back during Hallowe'en next year. I would add this to the list of Places I Would Not Like to Spend the Night.\nShow less"], ["Reviewed November 29, 2017", 4.0, "trip wedding anda fun day", "This was our first time and we went with several people who attended the wedding in San Jose, CA. most of the time we just laughed and joked, but my wife and I made a promise to return alone and pay more attention to this mysterious house.\nShow less"], ["Reviewed November 29, 2017", 5.0, "Highly entertaining and part of history", "Highly entertaining and part of history. Demonstrates the foible and quirkiness of perhaps having too much money. Enjoyed the tour."], ["Reviewed November 28, 2017", 5.0, "You Have to See to Really Believe", "This has always been on my must see list, and we finally got to go while visiting nearby. You do need to book an appointment time to ensure getting in a tour. This is by tour guide only until you get outside, and then you are on your own.\n\nThere are no pictures allowed inside the house itself, but you can take photos of the outside and gardens.\n\nIt is really hard to explain how amazing this completely quirky place is without just going yourself. We decided to purchase one of the many books with a brief history and lots of pictures of the rooms. If you have visited Biltmore House in Asheville, NC, this may remind you of that mansion in a few ways. Both were very innovative for their time.\n\nThere is a courtyard at the beginning of the tour with a café, gift shop, restrooms and a small museum that tells the history of the Winchester rifle. You will come back around to this area at the end as well. Parking was no charge and ample at the time we were there. A note of caution: this is not the place for those who do not like small spaces and those that cannot climb stairs. The stairs are easy riders but still stairs.\n\nWe really enjoyed the Winchester Mystery House. It really is worth every penny if you are anywhere near the area.\nShow less"], ["Reviewed November 27, 2017", 5.0, "Fun tour for teens", "I visited the Winchester Mystery House many years ago and went on a flashlight tour during Halloween- which was fun. However, I recommend the daytime tour so that you can see the house better. The story is fascinating and even kept our teens interested. We went the day before Thanksgiving and our tour was perfect size so that we could all ask our questions and not feel to crowded in the small rooms.\nShow less"], ["Reviewed November 26, 2017", 5.0, "Love it!", "it could be better if they train its staff better, and work on the customer trip and experience overall"], ["Reviewed November 25, 2017", 5.0, "Very interesting tour and entertaining afternoon!", "This historic house is a must-see for anyone visiting or new to the San Jose area. We really enjoyed our visit and were entertained by the trivia and stories of our guide. Highly recommend!"], ["Reviewed November 24, 2017", 5.0, "Bucket list item", "We enjoyed our visit to the Winchester House. The history of the house is very interesting! We did both tours and enjoyed them both. The guides enjoy what they do and it shows. I highly recommend visiting the home."], ["Reviewed November 21, 2017", 4.0, "Great Halloween night tour!", "We wanted to do something authentic to the San Fran area while in town for Halloween. Getting a candlelight tour of the Winchester House was just want we were looking for.\n\nThe candlelight tour is only offered leading up to Halloween. It didn't appear to be something you could do year round. It was a little scary. A few 'ghosts' jumped out at you. So I'm not sure I would recommend it for children.\n\nThey do offer year round day time tours of the house which seem to offer more of the history side of the home. We loved the candlelight tour so much, that we are eager to visit again next time we are in town to see it during the day.\n\nThe only down side was parking. There isn't much parking in their parking lot. So we had to park in the open area across the street. This area had no lighting and several cars were broken in to during our visit. So if you do go to a night tour, don't leave any valuables in the car. It is a prime target area.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Worth the time and price.", "I had seen this mansion on TV awhile back and was excited to get a chance to see it. It really is an amazing house. The guides are very knowledgeable and give a great tour."], ["Reviewed November 20, 2017", 4.0, "Fantastic Place to Visit!", "I want to say, first, I love the Winchester Mystery House. I've been here several times as a kid and as an adult. The fascination will never wear off. I love the history and the story of Mrs. Winchester's life, and the life of the house. I absolutely recommend this tour to everyone. The price is totally worth it if you think of how much money goes into maintaining the over 100 year old house. I also totally recommend the \"Explore More\" tour addition. You can really see the confusion of the design in the unfinished parts of the house.\n\nYou may ask, \"Why only 4 stars then?\" Well, it was going to be three, but I love this house so much I couldn't do it. However, I had to mark where I found the disappointment with this particular visit... the tour guides.\n\nWe visited on Saturday, 11/18/2017 and took the 1:10pm mansion tour and the 2:50pm \"Explore More\" tour. The 1:10pm tour was led by a friendly fellow that seemed like he was new and still learning the script, as he stumbled over his words quite a few times, trying to add a \"tour guide\" voice. It was a tad annoying as you lost some of the story through his many corrections, but that wasn't the part that I was most dissatisfied with. Since I have been to the house many times, I remember the key points of the most interesting parts of the house, like the stained glass window that never sees the sun. This was always a stopping point in the tour so you could revel in the beauty of the window. Our tour guide this time mentioned the window just before we passed through the room that it was in, then walked right past it. If I had never been there before, I would have been bummed that he didn't point it out. This was the first of many disappointments during the mansion tour. (He used the word \"Secluse\" to describe the type of person she was...*face palm*)\n\nFor the \"Explore More\" tour, we were met by a very different tour guide. While still nice, he spoke as though his mouth was wired shut. He had a lot of interesting knowledge about the different areas of the tour, but a lot of his words would trail off, miss some letters, and blend right into the next sentence. I'm not trying to sound like a snob, but a tour guide should speak loud enough for everyone to hear and enunciate their words.\n\nI would usually not let this stuff bother me, but when it comes to a place that I love and I want newcomers to have an amazing experience like I have in the past, it makes me sad. I hope that the Winchester staff will read this and quality check some of their tour guides so the mystery doesn't fade from the Winchester House.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Mystery House mysterious!", "We went through in a quick hours tour and managed to get a full story on this strangely interesting place. The guide was animated and full of information. So glad we made time for this huge house."], ["Reviewed November 18, 2017", 5.0, "Haunting Extended Tour", "During this first time visit to the Winchester Mystery House, we decided to also purchase admission to the newly added “Explore More Tour” that has recently become available as an option to the regular tour. While waiting for the main tour to begin we enjoyed a light lunch in the snack bar area adjacent to the gift shop. The quality of the food was refreshingly good and tasty. Our guide for the main tour was knowledgable in telling the interesting story of the mansion and it’s creator, Sarah Winchester. The tour led us on a confusing winding path through much of the house during which our guide pointed out insights and meanings behind curious oddities in the building architecture as well as the eccentric and psychologically tortured life of Mrs. Winchester. The highly detailed finishes and opulence of the interior spaces remain beautiful to contemplate the thought and care with which they were chosen. Following the main tour, we took some time to walk the manicured gardens before making our way to the front entrance of the house for the Explore More Tour. We were pleased to learn that we had purchased the only tickets for that time slot and were going to get an essentially private tour. Our friendly tour guide took us to several areas of the house that are not a part of the main tour and have not been previously open to the public such as the “Witches Cap” turrets at the upper floors of the house and the basement beneath. There is also chilling recorded imagery of a paranormal event displayed in an area of the house in which it occurred. It was well worth the additional admission price to learn even more historical details during this extended tour.\nShow less"], ["Reviewed November 14, 2017", 3.0, "Interesting House", "The house is worth a visit. But I am so glad that we bought a Groupon before hand because for the full price I would have been really disappointed. We had a great guide. Super energetic and lots of good ghost stories. These were my kids favorites, ages 10 and 13.\nI recommend seeing the house if you're in San Jose and have a couple of free hours.\nShow less"], ["Reviewed November 13, 2017", 5.0, "Amazing experience", "This has been on my bucket list for many years and after finally making it here I was honestly not disappointed.\n\nSo first of all you are not allowed to just wander the house, you go on a guided tour and as our guide said - think of the house itself as a museum piece so you are not allowed to touch things including the walls or furniture - so be prepared for this.\n\nYou are then guided through the house whilst being given some amazing information about its owner and the building of the house. I found the whole thing fascinating.\n\nYou are navigated from the bottom to the very top of the house and back down so you get to experience the full quirkiness of the building. There are no pictures allowed except the the final room.\n\nOur guide was brilliant, she knew the history inside out and was able to answer any of our questions\n\nIt was a great experience and I would certainly recommend it for anyone visiting the area\nShow less"], ["Reviewed November 9, 2017", 5.0, "Very Cool!", "Having been there multiple times through the years, I wasn't expecting it to be exciting. But I went with friends who hadn't been before. I really enjoyed it. I just wish there was a way to explore the rooms up close."], ["Reviewed November 5, 2017", 4.0, "Fun", "Came for Halloween night tour. It was expensive but fun. Did make me want to come back during daylight hours. Great for everyone including kids."], ["Reviewed November 5, 2017", 5.0, "Fun place to visit, a bit creepy and cool.", "Don't be shocked at the high admission price (37 for adults). The money is used to continually restore this one of a kind house. There is no stat funding so the admission fees have to cover it. This is a unique house built by an eccentric widow who inherited a vast amount of money from her husband who was president of the Winchester revolving gun corporation. There are oddities and mysteries throughout the house. They were just finishing taking down the Halloween decorations so we would come across and hanging ghost or skeleton here and there which added to the fun of the tour. There is a creepy movie coming out about it in February.\nShow less"], ["Reviewed November 4, 2017", 4.0, "Candlelight tour", "My boyfriend and I took the candlelight tour. The house is beautiful at night. The candlelight made the house look eerie and haunted. I love old houses so I was more interested in looking at the architecture then hearing the \"ghost stories\". Some parts of the tour was hooky but it is still worth it.\nShow less"], ["Reviewed November 3, 2017", 5.0, "Boo halloween haunt", "This year the candle light tour was excellent! They added plenty of props to go along with their Halloween tales. The outside and grounds area were all decorated for the festivites"], ["Reviewed November 2, 2017", 3.0, "Interesting but Weird", "This guide is well informed with this place and interesting, MYou come to the conclusion Ms Winchester was a bit crazy."], ["Reviewed November 1, 2017", 5.0, "Love this place!", "I grew up going to the Winchester Mystery house! I finally took my twin girls and they LOVED it! Such an amazing house and love all the stories that surround it. Must do in the Bay Area!"], ["Reviewed October 26, 2017", 5.0, "Great tour!", "My husband and I visited The Winchester House with our daughter while visiting her recently. What a fabulous house! I seldom wish guided tours lasted longer, but I could have roamed the house all day. Our tour guide, Stephanie, was extremely good. She was definitely knowledgeable about the house and she also connected with the tour group even though we were from all parts of the country.\nShow less"], ["Reviewed October 25, 2017", 2.0, "No reasonable priced motels in the area;", "This is a house I have always wanted to see. We put it on our list. When we get there it is around 4 in the afternoon. We thought we would check into a motel and tour the house the next day. We started looking for a room only to discover that a motel 6 will cost you over $100 a night. Then you will be spending at least $25 a person to take the tour. Add that up and it doesn't really seem worth it. We decided to try and find a motel outside of San Jose going toward Salinas. Well we ended up staying in Salinas at a reasonable rate. We were to far from the Winchester house to go back so we skipped it. If you want to tour the winchester house stay somewhere other than San Jose. The rates are over the top for that city.\nShow less"], ["Reviewed October 25, 2017", 5.0, "October Friday the 13th tour", "Maybe they made a lot of changes between last year and this year, but this year's tour was really good. There's still the guide that walks you from room to room, but in some of the room's there's an actor that pretends they're a servant or from that time period and acts out a little part of the story. In the end there's a seance that happens to drive out the evil spirit. In between all of this, the hallways are covered in black cloth, some of them have colored lighting that makes it spooky with skeletons or people that come out and grab at you. There's also sometimes a surprise a room that's pretty unexpected. The guide generally didn't have to speak above a low voice throughout the whole tour because we were generally all pretty quiet. If people did start lagging behind, they were prime targets for getting spooked by one of the actors hidden in the hallway. I felt like I thoroughly got my money's worth, the tour was about an hour long.\nShow less"], ["Reviewed October 22, 2017", 3.0, "Very Unusual But Maybe Not Worth All The Hype", "The tour is very interesting from a historical California point-of-view, but I'm not sure it's worth the somewhat hefty $37+ entry fee per person. If you've had grandparents or great-grandparents that lived on an old farm or in the rural Midwest you've likely seen places not that different that this place, although of course much smaller. The sheer size of this \"house\" is worth something in visiting, but I wouldn't go out of my way to visit it. And, if your vacation is in any way restricted to a budget I think there are much better ways to spend your hard-earned cash. Winchester is an interesting place though if you have lived in the big city all your life, or have a fascination with the oddity of Mrs. Winchester.\nShow less"], ["Reviewed October 22, 2017", 2.0, "House was very cool, tour guides...not so much", "Let me start by saying I’ve always wanted to see the Winchester Mystery House and since I was just in the San Jose area, it was a no brained to check it out. We did the standard tour and then the Explore More Tour which showed us some other parts of the house including some unfinished areas.\n\nOur tour started fine. The tour group was big but not too big. Our tour guide was to the point, mildly informative, and professional but was just lacking any sense of excitement. I realize that it’s impossible to be super excited when you give the same tour all the time, but for $47 a person, they could have tried to engage and charm us a little bit. I’m not saying it has to be a full on theater production each tour, but at least fake you like your job. Our second guide during the Explore More Tour which was a separate guide and tour was even worse. There was no energy, no excitement, and the deadpan way she delivered all the information made me incredibly bored in this amazingly weird house.\n\nI wanted to like this tour so much, but for spending almost $100 for two people I could’ve found much more enjoyment elsewhere.\n\nShow less"], ["Reviewed October 22, 2017", 5.0, "Intriguing Tour", "While visiting San Francisco, our original plan was to head to Napa to do some wine tasting, but due to the unfortunate fires that were occurring, we headed south toward San Jose instead. At the last minute we decided to check out Winchester Mystery House and I’m so glad we did! We were just in time to join a tour, and enjoyed ourselves immensely! Our tour guide’s name was Bennett and he was so informative and everything about him almost seemed to suit the era of when the house was built. In fact, I loved how all of the staff were dressed in styles from that time. Even the staff in the gift shop!\n\nI highly recommend stopping for a tour of this intriguing mystery house! I can’t wait to see the movie about Sarah Winchester in 2018!\nShow less"], ["Reviewed October 21, 2017", 3.0, "Interesting afternoon", "The Winchester House was recommended to us and we did both the Grand tour and the add on tour. Well worth the cost. Our guides were knowledgeable and entertaining. The house is truly unique and interesting. Did not find anything spooky about it. Lovely grounds you can meander for free.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Candlelight tour", "Great night time tour of the house. Perfect for Halloween. Be prepared to be frightened! About an hour long tour with a storyline. Had a great time with friends visiting the bay area from LA."], ["Reviewed October 20, 2017", 4.0, "Fun but expensive", "Have be been hearing about this place for many years and was very excited to visit. It didn’t quite meet my expectations and had the feel of a tourist trap. I wouldn’t hesitate to recommend it if it was half the cost."], ["Reviewed October 19, 2017", 5.0, "Way More Fun Than Anticipated", "You would think that, like most historical properties, the Winchester Mystery House would have a fairly normal tour. Maybe a little interesting but nothing out of the ordinary? Well in my experience, that’s just not true. Our guide (Gene) was very charming and funny and you could tell he loves his job and has been doing this for a long time.\n\nHe kept the pace moving quickly and gave us a lot of fun facts and anecdotes that kept us all laughing and engaged. My friends and I were all very impressed. We took the normal mansion tour because that’s all we had time for but would love to come back for the full experience. As of this posting it was $37 a piece for us adults plus tax of course. So for my husband and I it was about $74 after taxes. Pricey? Sure but everything in California is for the most part and honestly? It was worth every penny in my opinion. The house is super cool. Videos and photos just don’t do it justice.\n\nSpeaking of videos and photos, you can’t take any during the tour but you can take some of the front of the house, sides, etc. also there is free parking which is rare! Overall, I loved it and would definitely recommend this attraction!\n\nShow less"], ["Reviewed October 18, 2017", 4.0, "Fascinating and Fun History!", "I've wanted to come for years, and I wasn't disappointed. Sara Winchester was a troubled wealthy woman. We were not allowed to take pictures of the inside, so we snapped a couple outside. This wasn't a very expensive tour, and it was well worth the time and the money to see. We had a wonderful guide, who was super into it, so it made it even more fun. While we didn't encounter any ghosts, we did the extra tour of the unseen portions and were fascinated. With the movie coming out next year, we wanted to see it even more.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Spoooooky", "We went here with my girlfriend and 5 year old daughter. The tour was really neat and was slow enough that my daughter remained engaged. This is a super weird building that everyone should see"], ["Reviewed October 17, 2017", 3.0, "It was a fun tour but not worth the money", "The \"Explore More\" tour was much better than the initial average tour. We were able to see rooms that had not been shown before on the average tour. Of our group of 4, 3 voted for 2 stars and 1 voted for 3 stars."], ["Reviewed October 15, 2017", 2.0, "Do not recommend.", "0 friends\n1 review\n2.0 star rating 10/15/2017\nI have experienced much better house tours. The guide was irritating. She was trying hard, but it was evident. The condition of the house was a disappointment. For the amount of money we paid, the house was in a state of distress and showed signs of disrepair and many unfurnished rooms.\nThe size of the tour groups was too large for the small size of the rooms in the mansion. I was claustrophobic in many of the rooms.\nThe information given during the tour was trite and superfluous.\nAll in all, I can't recommend this tour. It was expensive and unfulfilling.\nShow less"], ["Reviewed October 14, 2017", 4.0, "Fun!", "We've seen lots of tv programs about this famous house so it was fun to see it in person. I suggest paying a little extra for the basement tour. The guide and staff was fun and entertaining. They all seem to love what they do which makes a huge difference. I would definitely recommend it.\nShow less"], ["Reviewed October 12, 2017", 4.0, "Interesting tour, amazing property, and a fun (though spendy) way to spend half a day", "I've had a visit to the Winchester House on my bucket list for years but never quite knew if it was worth the price. Cutting to the chase, as someone who likes history and buildings, it was totally worth a visit though far more controlled of an experience than I'd like.\n\nWe opted for their full package which ran about $10 more a person but let us see parts of the house not in the usual tour including a lot of areas that are clearly falling apart and not at all fully done up like the main rooms. That was well worth the addition and took the entire adventure from an hour to over two which made it feel that much more worthwhile.\n\nAs for the main tour, our guide was incredibly fun and enthusiastic with a lot of knowledge to share and clearly a lot of passion for what he does. The talking can drag on as you stop for the large groups to catch up but the house is pretty remarkable to wander around and certainly a unique experience for a one time visit (though I would go back for their halloween events I think.)\n\nThe main drawback, price aside, is that you can't take photos. This does help keep the tour moving along and certainly lets you focus on seeing things yourself but it is a bummer to not have any shots of the oddities of your own to share around in this social media happy world (and no, using your shots Winchester Mystery House people is not the same.) Perhaps one day they'll allow photos in a few rooms to balance that out.\n\nOf course you can take photos from the outside of the house and walk most of it for free which is pretty interesting all on its own.\nShow less"], ["Reviewed October 12, 2017", 2.0, "Put on your eclectic nostalic hat & avoid the ummer heat", "A fascinating Estate, but MANY questions left unanswered. It is bewildering that further research in the persona and character of Mary Winchester, her Family AND EMPLOYEES is unavailable. The fact that all the original furnishings have gone; and many of the rooms looked to have been stripped bare, is disappointing. The entrance fee does NOT do this justice! Unaware of what lay ahead we paid the @$40 for the regular tour, with high expectations. If we didn't pay the additional $10 for the extended tour, we would have been bitterly disappointed. I guess the young tour guides do their best with what resources they have. There is apparently going to be a movie about the place, with Helen Mirram playing Mary; I' supposing that it'll need to be a work of non-fiction to sell it at the box office. Apparently this was the reason you could not take photos - dumb copy write nonsense. Pfffft!\nAll that said, for any heritage, or period .... or just plain eclectic design student, it's worth saving up for the extended tour.\nWe visited in the middle of a heat wave - very bad idea, so carry water!\nThe retail portion is just crass, and does no service to the memory and historic value of the place.\nShow less"], ["Reviewed October 12, 2017", 5.0, "This house tour exceeded my expectations.", "This house tour exceeded my expectations. We paid a little extra to do the basement tour as well as the regular mansion tour. The whole place was decorated for Halloween which made it even more fun. We ended up spending a good four hours here and enjoyed every minute. I highly recommend this place. Our tour guides, Stephanie and Brenda, we're good fun and really enhanced the experience. Overall this tour was on the pricey side, though I think it's worth it to do once.\nShow less"], ["Reviewed October 11, 2017", 4.0, "No Ghosts were harmed", "This is a crazy fun tour to go on. Our tour guide was so knowledgeable. Would definitely recommend visiting this place. I would like to do this again but do the tour and more."], ["Reviewed October 9, 2017", 4.0, "Anniversary", "A very interesting tour & insight to the mind of the Winchester rifle widow. Beautiful home & gardens..."], ["Reviewed October 8, 2017", 4.0, "A unique historical place, Pros and Cons", "The house, the oddity, and the history behind the Winchester Mystery House are great to see if you are into California history, gun history, or architecture/interior design of the early 1900s. This is very worth a visit as the structure itself and many of the rooms inside are fantastic examples of the period. That being said, I don't think it's worth a second visit for several reasons. First, the tour is overpriced at around $40/per adult or $20/per child, and the \"Explore More Tour\" is an additional $10/per person on top of that, coupled with the fact that photography in the house is strictly not allowed, I feel that point eats away at the overall value of the visit. Second, the tour guides are very scripted, painfully so, and they seemed rather off-putting to me; we had one for the main tour, and one for the additional tour. Thirdly, the \"Explore more tour\" was rather lackluster after the main tour, it didn't seem to have a lot to offer in respect to new information or eye catching rooms; a few neat stops on the shorter tour but left me with an \"eh\", feeling and really tired feet. But When you're already about $80 in whats a few more bucks for the full package.\nThe property is very well kept, and has enjoyable additional features of a small antique gun museum, a laser gun shooting range, and a gift shop combined with a little deli. We were happy with our visit, and that even with all the negative aspects it is quite a spectacle to see. I just think it's something that doesn't demand a second visit.\nShow less"], ["Reviewed October 6, 2017", 4.0, "Very Interesting", "I was delighted to find the House open when I visited, but I did think the tour was a bit overpriced. The tour is very interesting and informative, but a bit on the rushed side. As we moved from room to room the guide would start explaining that room before everyone had come in. That said, it is a strange quirky place to visit and I would recommend it.\nShow less"], ["Reviewed October 6, 2017", 4.0, "A very unusual place", "I have always wanted to visit this place since I was a kid. The house is very unusual and the story behind it is great, you really could get lost in there if you're not careful. The tour felt a little rushed and the group sixes are too big, they need to do smaller groups on each tour to maximize the talking points. Our tour guide, Benny, was fabulous though and couldn't have been nicer. The grounds and the gardens are beautiful. They are making a movie about Sarah Winchester starring Helen Mirren so I can't wait to see it.\nShow less"], ["Reviewed October 5, 2017", 3.0, "Expensive but interesting", "The tours of the house are very expensive. The tour is setup to take you the longest way through the hodgepodge of rooms in the house. The tour narrative was interesting and gave you a good idea of what Sarah Winchester was like. Parking was minimal. It's not something I would go out of my way to see.\nShow less"], ["Reviewed October 4, 2017", 3.0, "Explore More Tour", "I have seen the Winchester house about 10 yrs ago loved it, this time we felt very rushed the tour guild states talking before everyone was in thw room, so if you were at the end you would miss whatever it was she didn't care either, after that we went on the explore more your with Tanner he was much better. It was in October so I knew it. Is haunted month but they had the most ridiculous Halloween decorations and fake pumpkins it looked like a cheap dollar store sale. I think it's a dishonor to Sarah Winchester.\nShow less"], ["Reviewed October 2, 2017", 5.0, "A Must Visit On Anyone's List", "Great story about the life of Sarah Winchester, the history of the Winchester rifle and Winchester Family. With a Movie coming out soon about Sarah Winchester the time to visit is now, before it gets Crazy Busy. The Estate Grounds are Beautiful!"], ["Reviewed October 2, 2017", 4.0, "Interesting to visit if in the area. Wouldn't go too far out of your way to see", "Quirky large timber built mansion House with myriad of interesting and unusual features. You are obliged to take a tour so can't self guide through the house. Some really beautiful Windows and features. Some just wacky. Bit pricey for what it is but I suppose it costs a lot for its upkeep. Thought shop a disappointment. all the souvenirs focused on making it seem spooky when the house itself had some beautiful features. I'd have bought something that reflected the stained glass windows for example. On balance glad I visited.\nShow less"], ["Reviewed October 2, 2017", 4.0, "Bizarre, but Unique", "We went in May to the Winchester Mystery House. It was so incredibly interesting to go through. I probably would not have to ever go back, but I am not sorry that I went. It is not scary whatsoever and it is very suitable for young children; however, I fear that they might find it rather boring. If you have trouble climbing stairs, I would definitely not recommend this adventure to anyone. I do wish we had had a better tour guide as it felt like ours was reciting a memorized script. And do not come prepared to ask questions. My grampa asked a question and her response was that she was going to be talking about that later in the tour and let's keep on task. I will say that I'm not sure it was worth the $40 per person that the tickets cost, but it was interesting experience to say the least. I was disappointed that most of the rooms were not even furnished....they are currently working on restoring the mansion back to what it would have looked like since the daughter sold everything in it when her mom (the lady who built the house) died. The rooms that did have period related pieces in them I found to be much more entertaining to view. The gardens are absolutely beautiful, if I did ever go back, I would want to do a garden tour.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Always something new", "I went with an old high school friend, and our granddaughters, both teenagers. We ALL had a wonderful time. It was the first for the three of them while I have gone many time. We all learned something new and the young women were never bored. With all the different rooms and our enthusiastic guide, they didn't realize how much exercise they were getting. A little word of advise - it's best to buy things after the tour so you don't have to carry a bag with you.\nShow less"], ["Reviewed October 2, 2017", 3.0, "Overpriced experience", "While the house was interesting and the tour guide was very informative, I don't believe it was worth the over $100 that we paid for the tour. I am a picture taker and was saddened to learn that you could not take pictures inside the house. Looking forward to the movie.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Interesting, but overpriced", "My husband and I purchased the standard tour and I was shocked that it was nearly $40/person. The tour guide was excellent (although scripted) and the house definitely has some interesting aspects. I was surprised that more of the rooms were not furnished, although some were. We also enjoyed the self-guided garden tour. The house tour took right at an hour and the gardens only took about 15-20 minutes to walk through and read the descriptions from the map. I'm glad we went, but the price is definitely too high for what you receive.\nShow less"], ["Reviewed September 28, 2017", 3.0, "For history lovers, otherwise over rated", "The house isn't spooky and the strange architecture is interesting...but not a must-see. San Jose doesn't have a ton of history preserved so it is interesting from that standpoint. Gift shop is pretty cool."], ["Reviewed September 27, 2017", 3.0, "No need to make a special trip", "So, after living in San Jose my entire life, I finally took my kids to the Winchester Mystery House. They were redoing the entrance at the time, and by the looks of things, it likely hadn't been done since the early 80's. It was an interesting story and bizarre house to walk through, but a lot smaller inside than it looks from the outside. My kids enjoyed all of the stories, but I didn't think it lived up to all the fuss. I can check it off the list, but see no need in going back. If you just want to walk around the grounds or see the Winchester gun collection, you don't need a ticket. You can just walk through the gift shop. Be sure to pack some snacks though, because the prices they charge for food there are ridiculous!!\nShow less"], ["Reviewed September 27, 2017", 4.0, "Always Something New", "This was my 4th visit over several years. I always learn something new from the different tour guides. We went the end of Sept and it was decorated for Halloween which was nice. A movie is coming out in early 2018 about Sarah Winchester and the house. I'm looking forward to it.\nShow less"], ["Reviewed September 24, 2017", 5.0, "Great tour, nice meeting area for our group.", "We had a 70th birthday party here with a bunch of classmates. It was a fun venue. Had never been here although we lived here until 45 years ago. The area in the garden for our group was just right. The tour we took together was fun. Interesting place\nShow less"], ["Reviewed September 23, 2017", 5.0, "Winchester Mystery House", "This is a well worth trip to make !!\nA very interesting house to visit .. a lot of history and the windows and wood workings inside are just beautiful!\nA added plus is all the Mysteries!!\nThey have several tours you can pick from :)\nShow less"], ["Reviewed September 22, 2017", 5.0, "'Explore MORE' is the best tour they've done!", "Yes, I've been to WMH many times...\n\nIn recent trips I've been slightly disappointed with the standard tour. Lackluster Young College Students who can barley remember the basic script with little mousy voices no one can hear.... BUT! This was an amazing experience!\n\nJack was our tour guide. While a little hokey and overzealous with some of his delivery, he was a wealth of knowledge! He gave an outstanding tour! Great vocal projection and enthusiasm. His knowledge of the WMH was above and beyond the standard script. He delve into the rarely mentioned 7/11 staircase. No one has mentioned that on a tour I've had in 10 years! A few other old school pieces of info made this fresh and informative... The Disney thing was true at all, Jack.... But we'll let ya slide.\n\nNOT to be overdone by the more veteran guide, Jack... Tanner was a young guy doing the Explore More part of our tour. He too was excellent!\n\nTanner's knowledge was also above a beyond the standards of past visits. The combo of new/old rooms and areas, along with the basement was a real treat. Great sights and info... I think we saw every elevator... The start of the tour is extra special... I won't ruin it for those who haven't been.,..\n\nBTW.. The Crystal room which used to be on the regular tour and included on the Explore More tour is great.. according to guide it was removed from tour due to damage of the Crystal Wallpaper... ? Why not just cover it with plexiglass like other parts of the house and call it good?\n\nBravo... Great tour.\nShow less"], ["Reviewed September 22, 2017", 5.0, "Enchanting House", "This is a place that has something for everyone. . .from the stairs that lead to nowhere, to the doors that open to nothing. People of all ages will enjoy touring this quirky, enchanting house."], ["Reviewed September 22, 2017", 5.0, "Awesome!", "We did both the 'house tour' and the 'more tour' WOW! If spooky old stuff is what you like....you'll love this place. Be advised there are hundreds of stairs, however, most are only about 4\" high per step or less. You'll see earthquake damage from the 1906 Great San Francisco Earthquake + so very much more. Hosts and staff are most informative and friendly. All I can say is if any of the above appeals to you - - - do it - Do It - - DO IT!\nShow less"], ["Reviewed September 22, 2017", 4.0, "Beautiful grounds and home", "I went here with my friend. It has been a bucket list item for quite some time.\n\nThe grounds are meticulously kept in pristine condition. Simply beautiful!\n\nThe house is gorgeous as well. It had many quirks to it. I didn't feel any ghosts, but did feel a lot of history within the walls.\n\nThe staff was friendly and knowledgeable. Our tour guide knew so much about the history of the house and the Winchester family. I would absolutely go for another visit if I visited San Jose again.\n\nI reduced my review by one star, because the gift shop was closed. I wanted to get some mementos for family members, but they were re-locating it.\nShow less"], ["Reviewed September 19, 2017", 5.0, "What a strange and wonderful historical site!", "Let the tales of ghosts and the little old lady they drove to insanity take you on a supernatural journey to the past. As you take in the confusing corridors and the sheer size of this project, you’ll be transported to a time when the ghosts of the people killed by the rifle that won the west, haunted Mrs. Winchester and demanded continuous construction to be appeased. A thousand doors, ten thousand windows, a staircase that leads to the ceiling and a door that opens to a two story drop will have you enchanted by the mystery that is the Winchester House. The craftsman style construction is beautiful and the grounds are a breathtaking garden that surrounds this architectural wonder complete with a haunted horse drawn carriage garage. When in San Jose, stop by the Winchester Mystery House and take one or all the tours and get haunted!\nShow less"], ["Reviewed September 17, 2017", 5.0, "Family with 12 and 8 year old - loved it!", "We really enjoyed our tours of the Winchester Mystery House. The kids were enthralled. We did the regular tour and the extended tour. Great tour guides."], ["Reviewed September 16, 2017", 4.0, "We took our 15 year old granddaughter who was visiting from Texas. It was enjoyable.", "Although enjoyable, we were not awestruck. Wear comfortable shoes, a lot of walking. The history of the Winchester Family and being in the mansion as it was being related, was the best part."], ["Reviewed September 16, 2017", 4.0, "Great Place, Okay Tour", "Came here with my girlfriend for their tour. The tour is a little over an hour long and it takes you through a variety of rooms in the house. The also offer an 'Explore More' tour, which we didn't do.\n\nPros: The grounds and house are beautiful and very interesting. The inside of the house is definitely worth taking a tour to see. It was also decorated for Halloween, which gave it a little more character.\n\nThere's a rifle museum showing a selection of Winchester rifles which was pretty cool.\n\nThe souvenir shop has a wide variety of items.\n\n\nCons: There wasn't much information provided other than what I'd consider common knowledge. It would've been cool to hear more about her or her husbands life, the workers/servants, the region, and the world at the time.\n\nOnly some of the rooms are furnished. Not necessarily their fault because I'm sure it's crazy expensive for authentic furniture.\n\nWe felt a little rushed going through the tour. I understand they have tours every 20 mins, but there's a ton to see in this house. Just a few extra minutes in between stops would've been appreciated.\n\n\nOverall it was definitely worth the time and money to come check it out. That said, we probably wouldn't return for a second visit in the near future.\nShow less"], ["Reviewed September 16, 2017", 5.0, "Fun place to visit! A little pricey though.", "Fun place to visit in San Jose. I like to bring guests there who are from out of town, so I've walked through it several times. I prefer the audio tour instead of the docent tour -- the audio tour is pretty well produced. My only complaint is that it is a little pricey, especially if you're bringing a bunch of people. Pro tip: it can get a little hot in the mansion on hot summer days.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Ghost!!", "First and foremost the STAFF!!! they are very knowledgeable, im a historian and every question i asked they answered correctly, and then there was the ghost tour my GOD that was amazing aswell if your ever in the san jose area visit this place entrance fee is very cheap :)\nShow less"], ["Reviewed September 14, 2017", 4.0, "Visit With An Open Mind", "This home is an interesting piece of architectural history. We wanted to visit, just to experience it for ourselves, after having seen the home and stories on the internet. It is a neat piece of property to tour. Take the folk lore for what it is - it may be true, it may not be true - it still makes for a fun day just to see a home that is this old and that has so many oddities. Of course, a lot of what you see inside is reproduction - lots was lost during earth quakes - but you still get the feel for what life was like back in that era and it's still an interesting stop on the \"tourist bucket list\". Myself, my husband and two grown kids enjoyed what we saw. We found the tour interesting and the stories something fun to ponder. Don't take it too serious and don't be hoping for a paranormal experience - just enjoy it for what it is. We loved looking at the property and can now check it off the list - Been there, done that! The best tip - don't carry a lot with you when you go in - the halls and stairwells are very narrow and small. We were there in July so it was a bit warm even with the fans blowing that are inside. We had a backpack with us which we ditched after the first half of the tour. You can't have a camera inside and you don't really need anything as you walk through the house. So travel light and leave what you can in the car. It's much easier to get through the property with nothing on your person.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Weird", "I've not been for over 12 years and the tour has definitely changed in that time, so it was worth a revisit. Do the extended tour which goes to extra places, you will not regret it!"], ["Reviewed September 13, 2017", 4.0, "Worth the visit", "Absolutely loved this. Tristen was our tour guide and she was worth 10 stars! She made the tour awesome. You need to know that you will sweat buckets! There is no air conditioning and few fans, to offer relief. I'd still go again."], ["Reviewed September 12, 2017", 5.0, "Worth a Visit", "Definitely worth a visit. Very unique house with beautiful architecture and a cool story behind it. Doors that opens to nothing and stairs that lead to the ceiling. Mrs Winchester had a creative mind. The explore more tour was great and took us into the basement and a few unique spots but wasn't as extensive and we had thought compared to the regular tour, but still worth it. A few hours well spent.\nShow less"], ["Reviewed September 11, 2017", 3.0, "RUSHED TOURS", "Tours group was too large (crowded in the small rooms), the tour guides rush you through so you can't really check the place out, we were bummed with our tour"], ["Reviewed September 9, 2017", 4.0, "Really interesting place!", "We really enjoyed the tour at this very strange and interesting place. Even though it's huge, it doesn't feel all that big since it's all small twists and turns and mostly small rooms. One warning: this is not for anyone who gets claustrophobic! And if you can't handle heat, don't go during a heatwave because there is no a/c. It's a historic house, so that isn't surprising. We happened to plan our trip with visiting relatives when it was 106 degrees out. They did have fans stationed here and there and provided us with water, so that helped. Still, a couple guests asked to be escorted out early on.\n\nThe gardens are pretty and you get a good view of the house from the outside. We weren't able to take the Explore More tour since we had a kid under 10 in our party. While I would like to do that in the future, I felt the regular tour allowed us to see plenty.\n\nLike most attractions, I found it kind of pricey. For two adults and two kids it was $120, so not a cheap day.\nShow less"], ["Reviewed September 9, 2017", 2.0, "Overrated pricing", "It is attractive to see from outside but the entry fee is too high. There is some good history apart from that it's not worth wasting valuable time and money at all."], ["Reviewed September 8, 2017", 5.0, "Tour was worth the money", "You have to like old houses and history to enjoy this tour. The guides did a good job of telling the story of the house. You can't take pictures inside but you can take as many pictures you want outside. We did the longer tour where you wear the hard hat. We had 3 people in our group and we found the tour to be entertaining and interesting and worth the money. It was the topic of discussion for the rest of the day. Some rooms were hot due to no a/c and wear comfortable shoes because you are standing the whole time.\nShow less"], ["Reviewed September 8, 2017", 4.0, "Must see for the history or supernatural enthusiast", "The tour-guide will make or break your experience. Aside from that, there is so much interesting architecture to see and stories to hear that just slowly wandering through the house with your tour is an amazing experience. Even after seeing it multiple times, I still enjoy visiting this piece of history!\nShow less"], ["Reviewed September 8, 2017", 5.0, "What a fantastic story this house tells!!", "So many quirky turns, with steps that go no where, stairs that are too small but anything but dainty feet and so interesting. Such a sad story really but what a great result for history to enjoy"], ["Reviewed September 7, 2017", 5.0, "Super cool - but can't take photos inside anymore!", "Enjoyed the last tour of the day when we visited. Guide was knowledgable and made the tour interesting - found out she was new to being a guide even - great job! (I think the kids who work in the gift shop graduate up to tour guides at some point?) It was nicer than I expected. I think I thought it would be a dumpy house that some crazy lady built long ago. It is in fact a beautiful mansion - and yes - some rooms are strange and doors and staircases that lead to no where - but it's really a beautiful place. Someone was having a teen birthday party in the front yard - complete with DJ while we were on the tour. Sadly, you can't take photos INSIDE the home while on the tour. There is some movie coming out soon that was filmed there and they have rights to images of the inside of the house for now. Bummer. Grounds are beautiful. Take time to walk around outside and take exterior shots. Gift shop is pretty large. All in all - glad to have visited finally.\nShow less"], ["Reviewed September 7, 2017", 5.0, "Interesting and Spooky Piece od American History", "If you are in to the strange, this place is for you! Built by the heiress to the Winchester Gun Company, this mansion and the surrounding property is full of unexpected architecture, twists and turns, all designed to keep the murdered ghosts of Winchester products away. A must see if you are in San Jose!\nShow less"], ["Reviewed September 6, 2017", 5.0, "I really enjoyed this place.", "I had wanted to visit the Winchester mystery house since I was a child. I really enjoyed the tour, and would love to go and do it again. Sarah Winchester was well ahead of her time when it came to certain aspects in the design of this house.\nShow less"], ["Reviewed September 6, 2017", 5.0, "One of the treasures in Sa Jose", "A place that sadly a lot of locals have never seen it. The history of the Winchester rifle company is here in all its grandeur. Visiting any day is great but they have flashlight nights, Halloween nights and many other special events. Not to mention just recently the museum opened up areas never seen before. Interesting, interesting place with lots of mystique, lots of history. And beautiful grounds.\nA must see for San Jose\nShow less"], ["Reviewed September 6, 2017", 5.0, "Obsession realized", "This tiny lady was obsessed by guilt and built this Victorian monument to it. 13 windows in the seance room. Thirteen steps that lead down, and then 7 steps that lead up. A stair that turns 90 degrees and then ends at the ceiling. The doorway to doom! Love it. Loved it when I was a kid (a few things are roped off now that I was able to explore in the fifties) and love it now. Think of the ongoing racket of building going on 24/7. Maybe she thought she deserved it, poor woman. Unique and fascinating.\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great place but spendy", "I really enjoyed the tour and visit. I did not enjoy spending almost $40 per person ($38 actually) to go on the tour. That price didn't even get you the whole tour of the place, they wanted to sell you an upgrade to see the rest. I have to say that for $38, you should be able to see everything. The guy doing the tour was bland to boot. The place itself was very cool and I did enjoy going through. I also really loved the gun museum too. The grounds were nice as well. I didn't buy anything in the gift shop but they did have a lot of fun stuff. As far as gift shops at attractions are concerned, they did a good job with selection and novelty. I did get a smashed penny! Saw the signs for a candlelight tour during Halloween time that was intriguing. I would love to do that as well.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Worth the trip!", "Great tour, even though it was very hot inside due to the heat wave they were having, it was still worth it."], ["Reviewed September 6, 2017", 4.0, "Fascinating!", "A real piece of American history from the turn of the century located in San Jose just off of the 280. A family fortune being spent on the direction of the spirit world. Wow. You can't make this stuff up. The house is a beautiful late 19th century mansion which started out as a farm house and took off from there. It's so well looked after, maintaining most the original details. The tour is led by well informed guides who can answer just about any question you throw at them about the Winchester house and the grounds. Keep your eye out for the doors, stairs and cupboards to nowhere! Strongly advise that you get there when the property opens as the parking lot fills up fast and there is limited parking nearby. There is a mall down the street you can park at if you don't mind walking a little. Note that you can't take any pictures inside the building. The tickets can seem steep but if kinda spooky history is your thing, it's well worth the admission.\nShow less"], ["Reviewed September 5, 2017", 4.0, "Good for a few hours", "Fun half day thing to do. kinda silly, but still fun. Kids enjoyed and it is interested. Definitely hot inside the house as there is no a/c"], ["Reviewed September 4, 2017", 4.0, "Wacky, interesting piece of local history", "This is something that definitely should be seen once, as it's just bizarre, and so much here is constantly being torn down and rebuilt - it's nice to see a real piece of local history.\n\nThe story behind it is fun. Definitely just a one-time visit, though.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Amazing!", "This is a fun, fun tour with an amazing story. The tickets seem a little pricy but well worth it. The Winchester family history is fascinating and the things they made that were not connected to guns and ammunition was eye opening."], ["Reviewed August 30, 2017", 5.0, "So much more than what you'd expect", "A must see- we were a little taken aback by the price of the tickets but was so worth it after seeing the house. I just wish more of it was open to the public. So insane looking though.\n\nRecommendations:\n-take the twilight tour\n-don't bother bringing a camera. No photos inside. But you can take pictures of the grounds.\nShow less"], ["Reviewed August 30, 2017", 4.0, "Quirky historical tourist attraction", "We were trying to find something to do and found this place on trip advisor and decided to go. It's a huge mansion. And you pay for a tour because there is no way you would find your way out of it on your own. The tours are kind of expensive, I think it was close to $30 a person, but the tour was very informative. The guide points out all the eccentricities of the house and tells you the story of the family that lived there along the way. After the tour you can explore the beautiful grounds and there is a small gun museum. There is also a huge gift shop. I think this is something fun to do at least once. They don't let you take photos inside the house, so make memories with your mind when you go in. Kind of touristy now, but still awesome to see. Seems out of place since the city is all around it.\nShow less"], ["Reviewed August 29, 2017", 4.0, "Quiet historical house", "When we advised our friends we were attending the Winchester Mystery House, not many had heard of the house, let alone it's history. I had booked online and received tour tickets and tickets for an Explorer More behind the scenes tour. Our first impression of the house was awe, it is huge, and located within the bustling metropolis of San Jose. I won't spoil the visit with history of the house, but it's well worth the price of admission. Our tour guides were informed and well versed on the mystery surrounding Ms. Winchester and her house. Unfortunately we were told the behind the scenes Explore More tour will be ending this year due to brainless tour attendees damaging some of the historic home. Sad. It's a must see house and Tour!\nShow less"], ["Reviewed August 28, 2017", 4.0, "Impressive", "Immense, rambling place. The guides cheerfully admitted that much of the mystique is hype and hokum, but the obsessive construction done by Mrs, Winchester created a very intriguing house. A movie shot partly in the house and starring Helen Mirren is due out early next year.\nShow less"], ["Reviewed August 26, 2017", 4.0, "Good tour of a really excentric old home", "A unique house to say the least. Over a 100 rooms in a \"haunted\" house that winds around. The tour took about an hour. The tour guide was friendly and knowledgeable. We went on the regular tour. There is an \"explore more\" tour that you can take to more of the house. There is an additional cost, of course. The kids really enjoyed the the tour and all the interesting history that goes with a very large, odd house that's over 100 years old. This is the type of tour that depends on a good tour guide and I think we got a good one. We went on a weekday (Tuesday) and our tour group wasn't very large. I could see problems if the group was larger; crowded rooms and longer waits for everyone to get from room to room before the tour guide covered the material at each stop along the way. Overall, an interesting tour but a bit pricey. Check groupon first; occasionally, they have discounted tickets.\nShow less"], ["Reviewed August 22, 2017", 4.0, "Explore More Tour Better Than Regular Tour", "I was excited to visit the Winchester house. Our entire family is familiar with Winchester firearms, so I thought it would be interesting. We enjoyed the Firearms Museum with several Winchester and other firearms.\nThe tour we took with Brenda, who is the same height of Sara Winchester, was very crowded. First of all our guide's \"script\" was just that. It was very choppy and not fluid like a normal person would speak. Second there were too many people on the tour. We either crammed into a tiny room or were so spread out you had to rush to catch up to the next room, you either missed information in the new room or you couldn't look at the things you walked by - like the staircase to nowhere, etc. That was a disappointment.\nThe second tour, the Explore More Tour, was much smaller and the guide was a much better presenter of the information and more personable. We got to spend more time in the rooms shown and got to see a part of the estate that no one had been able to see until this tour was offered.\nShow less"], ["Reviewed August 18, 2017", 5.0, "Amazing and quirky and lovely", "It really does feel like a spirit built the house... A very free spirit. Doors to nowhere, stairs zigzaging for what seems like 3 stories to rise only 9 feet, a stained glass window worth a years wages. Excellent examples of woodwork typical of the Victorian period. Regardless of the quirks and creaks inside the gardens and grounds are picturesque and lovely.\nShow less"], ["Reviewed August 18, 2017", 3.0, "Once is enough", "This is a really cool piece of local history but going as an adult it was a little boring. I am glad I went and heard about the history, but I probably wouldn't go again."], ["Reviewed August 16, 2017", 5.0, "So weird", "This place is weird, fun, interesting and unusual. The explore more tour which is new, was an added treat. The guides are very knowledgeable and fun. This was my second time here and I would return again. I just love it."], ["Reviewed August 16, 2017", 4.0, "Interesting place to visit", "Fun place to visit once but it is a little pricey to go often. Great history of the Winchester Family and particularly Sarah Winchester and her many rooms and doors that lead to nowhere."], ["Reviewed August 16, 2017", 5.0, "Interesting, but quick tour", "Second time I've gone - interestingly, I didn't remember much from the first tour, which was probably 15 years ago. The tour guide we had delivered her speech a bit too much like she had memorized it and was in a race to get the words out - quickly and without much emotion. But she did know interesting facts about the house, as demonstrated by the fact that she answered our questions when she slowed down enough to let us ask them! It would be nice if she could have slowed down a bit and let us examine things in the rooms - it felt like we were being rushed through in some places.\n\nOverall, a good experience. Glad we didn't sign up for the longer Explore More Tour, as you have to take a break (15 minutes, supposedly) and then go back and see other parts of the house. The other parts would have been interesting, but I wasn't ready for another hour of touring. Nice piece of San Jose history, not seen by many natives of the area, per my not-so-scientific research.\n\nProbably more fun for tourists at the price, but we have lived here for 20 years and enjoyed it. No photos inside, which is a bit disappointing, but what would you do with those photos, anyway?\nShow less"], ["Reviewed August 16, 2017", 4.0, "Winchester Mystery House visit", "I came here a few months back with the family. We were looking for something to do on a rainy day to do indoors and realized we have never been inside this place. What a great experience it was for all of us. My 10 year old, 8 year old and my husband and I. We learned a lot of history at this place. They have a cafe, a museum and shop for souvenirs, clean restrooms and a shooting area for kids and adults. Pretty cool place to visit. Not too pricey either.\nShow less"], ["Reviewed August 14, 2017", 4.0, "Weird and wonderful", "The guided tour was very good and should be for the price. The history of the house and Sara Winchester is very interesting, so is the ability of psychics over the gullible. A bit disappointing you can't take photos inside."], ["Reviewed August 12, 2017", 5.0, "Explore More Tour Very Unique - Important Historical Landmark of San Jose", "I recently took my team members of 8 to the Explore More Tour - which is a new tour of additional rooms that just opened up in May 2017. Being that we are an Estate Sale Company we visited the Winchester House to learn about the historical importance of Sara Winchester and how the house was built, add ons, and repairs done after the major San Francisco Earthquake. In our business we manage mini Winchester Mystery Houses, everything found in the home is a treasure and discovery of the past. With the movie coming up in 2018, it was of great importance to visit the house to connect to Sarah's life and mystery of her building obsession. She preserved history of architecture, moldings, engravings, the 1900's style, corner alcoves, tall open chambers and archways, and carved balasters, there were several open spaces and rooms never decorated, yet unfinished and soon to be restored. it is a step back in time, just like when we implement an Estate Sale and find treasures of the family and their life's importance in history and culture!! I highly recommend this wonderful Discovery, even if the price is high, it is well worth it. Can't wait to see the Movie and say, we Live here in San Jose! We toured it!!\nShow less"], ["Reviewed August 10, 2017", 4.0, "Interesting but pricey", "This was something I have always wanted to do - much research over the years online - the tour was not what I was expecting it to be ( we did the extended tour) the furniture was beautiful, the tour guide we had on the second round was funny, and loud enough to hear no matter your position in the lines - I enjoyed it for what it was\nShow less"], ["Reviewed August 9, 2017", 4.0, "Interesting US history for the wife for the founding family of the Winchester Rifle.", "Took my nieces for a visit to the Winchester Mystery House. They had never been there and they seems to enjoy all the strange rooms, and the doors to no where. They also liked the observation windows ad the narrow stairway way. The gift shop had things that thrilled all.\nShow less"], ["Reviewed August 8, 2017", 3.0, "Fun but expensive", "This was a fun tour and very interesting. Considering the upcoming movie it made it more interesting. I only gave it three stars for the price, I thought it was expensive for a quick tour through the rooms. If I did it again I would wait for Groupon or discounts.\nShow less"], ["Reviewed August 8, 2017", 5.0, "interesting architecture design and history behind it", "I joined explore more tours which includes mansion tour and additional new section that open after safety upgrades. Found more interesting facts behind the house and amazing experience to learn about technology incorporated in that house back in the days.\nRecommended if you like history, design and architecture.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Fun visit", "This has been one of those places I really wanted to see for a while. We made the stop on our way home from San Francisco. The house is close to the freeway. We spent a little longer than planned because the next available tour was later than we had planned. We did use the time before our tour to walk through the gardens and enjoy the crazy architecture from the outside. The tour was well done, I was hoping to get more history. You really get a feel for the patchwork structure of the. It is a fun visit.\nShow less"], ["Reviewed August 8, 2017", 4.0, "Great trip", "After reading reviews on various sites, we were uncertain if the tour would be worth the dollars. We were pleasantly surprised. My two adult children and I toured on a Monday late afternoon. The house tour was informative and interesting, however we found that the new \"Explore More Tour\" was great and well worth the extra $$. The tour took us into the attic space, the South Turret \"Acoustic\" Witches Cap, the Crystal Bedroom and the basement! I would take both tours again! Note: While it has a haunted reputation, we did not see any ghosts.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Birthday trip", "Very cool!! Have wanted to see this place since I first heard of it as a child ( in Canada, not super popular knowledge of it's existance.) Was a little disappointed at the 'no photos' rule (because architecture wow!!!) And I didn't feel like I got to look at everything before we moved on (Some of the other tour guests could have used etiquette lessons fyi) but I'd opt for the longer tour if/when I return.\nShow less"], ["Reviewed August 6, 2017", 4.0, "Great way to spend an hour or so", "We visited the Winchester Mystery House as we were in the area before driving to San Francisco. The house is fascinating having been built by the founder of the rifle, then being continuously extended by his widow. The tour guide was great and the whole experience was superb.\nShow less"], ["Reviewed August 5, 2017", 4.0, "\"Loved the architecture\"", "Our family decided to drive down from Sacramento to visit the house. We bought our tickets online and purchased the extended tour when we arrived. Parking was free.\n\nHouse was very unique with great architecture. Our tour group was not large and guide was knowledgeable when asked questions.\n\nI would recommend the tour but not necessarily the extended. Yes, with the extended tour you see other parts of the house but didn't think it was worth the added expense.\nShow less"], ["Reviewed August 4, 2017", 4.0, "Sarah Get Your Gun", "After years of viewing the Winchester Mystery House on countless spooky tv shows I placed it to my list of things that needed to be seen. The 'Explore More Tour' was newly added to the line up so I was excited to partake. The tours were a bit pricey but what are you gunna do if you really want to see something you just pay it.\nThe tour guides were engaging, knowledgeable, & showed concern about patron's safety during the tours since there were potential hazards in this colossal labyrinth.\nIt was thrilling to finally see this historical property in person & learn more about Sarah's personal life story. Surprisingly there were as many practical & efficient elements built with Sarah's foresight & ingenuity as there were nonsensical oddities. She actually seemed to be quit the visionary.\nWe were told interior mansion pictures weren't allowed until CBS Films concluded production of a 2018 movie about Sarah. I was disappointed but at least I can say I was there during this highly anticipated time period.\nThe gift shop didn't have many items of quality worth purchasing. We didn't visit the snack bar, but did stop by the shooting gallery for a little fun. Oh! Don't miss the small but packed Firearms Museum.\nShow less"], ["Reviewed August 1, 2017", 4.0, "Stop during family vacation", "While traveling on our family vacation we decided to stop at the Winchester House. We are glad we did, the boys loved it. In fact there was a new, additional tour you could take and my boys were bummed they couldn't. For some reason there is an age limit, 10 and over, my youngest missed it by a couple of months. We plan a trip back to take the additional tour. Tour group sizes were good, some of the rooms took a little squeezing into to get everyone in, but wasn't a problem. They do a good job of highlighting interesting information about the house and specific rooms. I would recommend a stop if you are in the area.\nShow less"], ["Reviewed August 1, 2017", 2.0, "Is it really a Mystery? Probably not...", "Shortly after we completed the extended tour, one of our party quipped that the real mystery was why he paid so much to visit this place.\n\nBut all jokes aside, the house does have its charms. Its 160 Victorian rooms are echoes of a bygone age ruled by the Gilded elite and served by large and loyal household staffs. However, a lot of the quirks such as a stairwell into the ceiling, doors that open into walls or even a door that opens into empty space from the second floor can easily be chalked up to too much money, incessant construction and poor planning and design. I was really hoping that there would be a few secret rooms or an inter-dimensional portal or two, but was sadly disappointed.\n\nOne also has to keep in mind that the house has been a tourist attraction since 1924, two years after the death of Sarah Winchester, its original owner and designer, in 1922. In 1924, it was appraised at a mere $5000, which might have been a lot in those days, but the $5000 could be redeemed just from the equipment in the pumphouse back then, and the rest of the house was valued as pretty much worthless, despite having cost hundreds of thousands to build. (This assessment is not revealed by the guides, but can be seen in the 1924 newspaper article in the Rifle Museum.)\n\nThe same family has owned the house since 1924, so they've had more than 90 years to build up mystique and mystery for what is essentially an eccentric heiress' private money pit. One has only to look to the gift shop, which is filled with lamentable tchotchkes (of which Mrs. Winchester would probably not have approved) to see how much the attraction owes to savvy marketing rather than historical or even hysterical significance. If the house is such a mystery, why is there only one book about it in the giftshop? Surely those with active imaginations could (and should) conjure more.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Nice but confusing", "Very massive and in a way beautiful home Worth a visit really the only thing to see in san jose The the extended tour better than the basic tour Melisa our guide was great Made it come aliive"], ["Reviewed July 29, 2017", 3.0, "Love the story but tour was too crowded", "This was our second visit to Winchester Mystery House. Our last visit was about 12 years ago. This time around the tour was so crowded you could not embrace the story. The tour guide was great however there was way too many people on the tour. Several of the rooms are very small so everyone had to cram into an area as the tour guide told the story. It's hard to absorb the story and look around the room when you are so crammed and staring at someone back. Then as we moved on we had to look around the room real quick and try to figure out what the tour guide was talking about.\nShow less"], ["Reviewed July 28, 2017", 3.0, "Keep Moving unless you Have a lot of Time to Kill", "Winchester Mystery House is really not named well. It is not a mystery, it is boring for kids and many adults. It is a house. It is cool house wit bizarre designs, some cool art and that is about it.\nYou take a tour which lasts about an hour. You will learn about the house, the previous owners and the Bay area in general.\nParking is free, but they get you with the price of the tour. The nice thing is that it tends not to be crowded and the staff is nice.\nIf you like off mansions, you will love it.\nShow less"], ["Reviewed July 27, 2017", 4.0, "Lots of fun", "Rainy day and time to kill before a flight. Hadn't taken the tour in 30 years. Really fun, tour guide certainly kept it interesting."], ["Reviewed July 27, 2017", 4.0, "Interesting and informative tour!", "We took the one hour tour and learned a lot of information not just about the house and the Winchester family but about the Bay Area as well. I've lived in the Bay Area for twenty years and can't believe it has taken me this long to see it. Definitely worth the experience.\nShow less"], ["Reviewed July 26, 2017", 4.0, "Interesting architecture, not much fun for kids", "As a builder and home inspector I loved the tour of this bizarre mansion. My daughter had asked to go see this as she had heard about it years ago, more as a spooky adventure. It's not. The tour and tour guide were excellent, the house bizarre, but it wasn't scary and the tour was a bit boring for our kids.\nGit shop and cafe were good, free parking but tour was costly.\nShow less"], ["Reviewed July 24, 2017", 5.0, "Great Tour", "The staff is very friendly and they really know what they're talking about. If you're looking for something scary this is not the place for you, but the history of the house is very interesting and the house structure, very particular. It's a nice tourist place.\nShow less"], ["Reviewed July 24, 2017", 3.0, "Good Tour", "We enjoyed the tour of this old mansion. It is interesting how the rich lived years ago. Interesting how some stairways went nowhere, on purpose! It is worth the money."], ["Reviewed July 23, 2017", 4.0, "Certainly worth your time!", "I have seen many reviews and TV documentaries about this place and finally had a chance to check it out. I did the regular tour, which was quite nice, but will be coming back for the new expanded version....just need to keep my receipt and for $10 they will 'upgrade' me to the other tour. The place is kids creepy and certainly, I had many questions and the building itself. Ensure you have time to walk around the grounds on your own...it's pretty nice. I could only wonder how cool this place must have been 80 years ago!\nShow less"], ["Reviewed July 23, 2017", 1.0, "Save your money and your the garden for free", "The outside is far better than the inside. It's claustrophobic and hot and not that exciting, sorry."], ["Reviewed July 23, 2017", 5.0, "Great place to visit, ghostly and lots of fun", "We went on the mansion tour and an extended tour of rooms recently open to the public as well as the basement. The tours were fun and informative about the house. There is a café on site as well as a gift shop. bathrooms are well kept and clean.\nThis is definitely a place worth visiting.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Loved this tour", "My husband saw a documentary about this house on Discovery Channel several years ago-- while planning this trip from our home in Fla- to 11 national parks, San Francisco, I made sure it was one of our stops-- was well worth it-- we bought our tickets about a week before we left on their website and also bought behind the scenes/extra rooms tour- there was about a 20 min break between the tours-- had great guides for both- gave lots of info about Winchester family, history of the house-- we loved the tours-- - You are not allowed to take any pictures inside house but can of the gardens and the outside buildings-- there is a big gift shop- small café for drinks/ snacks - has a few tables to sit at-- clean bathrooms, friendly staff- we stayed night before at a hotel about 10 miles from the mystery house-- not hard to find-- but he did put the address in his phone GPS before we went- highly recommend this tour\nShow less"]]}}