{"Yosemite Falls": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Yosemite Falls", "url": "/Attraction_Review-g61000-d483476-Reviews-Yosemite_Falls-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/06/10/16/yosemite-falls.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1977"}, "address": {"@type": "PostalAddress", "streetAddress": "", "addressLocality": "", "addressRegion": "California", "postalCode": "", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 1 week ago", 5.0, "Calves are still hurting after 4 days", "The wife and I did this on a Saturday in February with many other strangers haha. Both of us are in our 40s. It was a really really tough hike but definitely worth the views all along the trail and certainly at the top. Everyone was super nice along the trail. Although I will have a cranky old man moment and say that ppl hiking with portable speakers and sharing their music weren’t my fav ppl on the trail. Bring lots of water and fuel up along the way. Enjoy\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful place in Winter...", "Yosemite is like a 'Cheddar Gorge' with a waterfall. Don't get me wrong it's beautiful, but probably would not need four days (as we'd planned) to do the whole Yosemite trip."], ["Reviewed 1 week ago", 5.0, "Upper Falls Hike 7 hr round trip.", "We are both 61 and set out not knowing if we could make it. Starts with a bunch of switch backs, levels off to the base of the falls. Then steep climb to the top of the falls. Bring lunch, make a day of it. Fantastic. Check out hike on REI app first.\nShow less"], ["Reviewed 1 week ago", 5.0, "Love the Falls", "This is always crowded as it's a main attraction from the Valley Floor. When there is water ( no drought) these Falls are amazing. We don't get intimidated by the crowds as the view and splendid nature of the falls outweighs all the rest."], ["Reviewed 2 weeks ago", 5.0, "Stunning falls with an easy walk from the Yosemite Valley Lodge or carpark or bus", "The visit to these falls was our favourite. We kept going back. When we visited there had been a lot of rain and the falls were amazing with lots of spray and noise. The power of the falls was amazing."], ["Reviewed 4 weeks ago", 5.0, "Get there early and it's empty.", "Beautiful falls, really cool even in the heat of the day, so not a bad picnic spot- but anywhere in the valley by the river is a good picnic spot. Easy for all to get to as the path is concrete. If you want more of a hike, go to the top of Yosemite falls.\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazing!", "Went here for a day hike at the end of January. Snowed a few inches overnight and had a beautiful blue sky most of the day. Strenuous hike but doable if your active. Took me about 90 mins to get to the lower falls, another 20 mins to get to the middle falls.\n\nIt wasn't busy at all. Maybe 50-75 people for the 3ish hours I was there. Plenty of parking available.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Wonderful Falls", "One will never tire of taking the short walk to the falls. They are beautiful and during the winter offer beautiful rainbows when the sun is shining. See the upper Falls, see the lower falls and then walk the path back into the valley and take in both the upper and lower falls from a distance. During the winter listen for the sound of thawing ice that cracks like a rifle shot during the morning as it warms and the ice thaws and falls.\nShow less"], ["Reviewed January 6, 2018", 5.0, "Nature at her finest.", "These falls are the most wonderful ones I’ve ever seen. We stayed at the lodge and just needed to walk outside to see them. We took a twenty minute walk up the fully paved path to the bottom of the lower falls. We spent a lot of time at that spot taking photos and also helping the other tourists take their family photos. Lots of iPhones. The sound of the water is so relaxing and peaceful. We went in January so not many people. Very easy to get around.\nShow less"], ["Reviewed January 6, 2018", 4.0, "Nature at its insane best!!!", "We travelled with a three year old toddler in a stroller, took 3 small and easy hikes and reached the Yosemite Falls!! It's was a beautiful day with enough sunshine to get a glimpse of rainbow. It's best with strollers too and wheelchair facility. Every stop has a restroom stop, which is not so bad. Just immerse yourself in the nature!!\nShow less"], ["Reviewed January 1, 2018", 5.0, "Beautiful Waterfalls", "Visiting Upper and Lower Yosemite Falls is worth it. Both can be viewed easily by minimal hiking for those who don't have the stamina or time to do the entire Upper Yosemite Falls Hike. My sister and I did not have the time to to hike to Upper Yosemite Falls, as we had wanted to, but we still were regarded with good views of the Falls by hiking some of the short trails leading to viewpoints and areas around the falls.\nShow less"], ["Reviewed December 20, 2017", 5.0, "BEAUTIFUL", "We only allowed ourselves one day in Yosemite but I could have spent a whole week here! The only problem is the parking or lack of it ,we got there before 9 and it still took us almost 2 hours to find a spot."], ["Reviewed December 13, 2017", 5.0, "Magical Falls", "Beautiful 3 tier waterfall that is absolutely magical to behold.\n\nPlenty of photo opportunities at the base of the falls with fallen logs and rocks.\n\nThere's also a picnic area/restroom near the base that is positioned so perfectly that the falls are framed by trees which allows you a direct view of the falls as you have your picnic.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Great Ground Level hikes", "We hiked both the Falls view Trail and Lower Falls trail at Yosemite Falls. We had already done a more strenuous hike to the Vernal Falls that morning so we're looking for an easy hike to end our day, what a pleasant surprise the Lower Falls were. Great easy trail that gets you right up near the Falls for fantastic views and photos. A plus is that the trail is wheelchair accessible too!\nShow less"], ["Reviewed December 1, 2017", 5.0, "One of the best waterfalls in North America.", "I love this waterfall! The last time I visited Yosemite it was in Fall when the water fall was just a trickle from the drought. This time, I visited in March, after a record breaking snowfall in the higher mountains. This time, the fall was magnificent. There was snow still on the edges of the walk way and you were not allowed too far up the trail, but it didn't matter. The Falls were incredible. It is a must see.\nShow less"], ["Reviewed November 17, 2017", 5.0, "Hike to the top is difficult but worth it, view from the bottom beautiful", "We hiked to the top on our way to the top of El Capitan. It is almost 3.5 miles straight up so reasonably difficult both ways. Well worth it though for the views from the top and a few of the switchbacks."], ["Reviewed November 15, 2017", 3.0, "Lower falls: Very easy walk", "The walk was nice and easy. The falls were okay. I expected more of this place, but maybe it was to crowed to enjoy the beauty of the falls."], ["Reviewed November 14, 2017", 3.0, "Holiday", "When we went the falls wasn't flowing so there was hardly anything to see. But the place is so nice it didn't really matter."], ["Reviewed November 10, 2017", 5.0, "Fall 2017", "Absolutely gorgeous!! The walk was great with so much to see before you get to the falls!! Saw some folks swimming in the falls!!"], ["Reviewed November 10, 2017", 5.0, "Just a trickle in the fall", "The water flow is only a trickle with a few wisps of snow on the ledges at this point. This spring there was an epic flow because of heavy rains and snowmelt."], ["Reviewed November 9, 2017", 5.0, "Our Introduction to Yosemite", "After checking in at Half Dome Village we started the tour by walking around the valley until we reached the Yosemite Falls. You can already hear the sound of the mighty falls from a far and there are many vantage points where you can take a good shot of the fall. When we reached the Lower Yosemite Falls we were greeted with a strong mist that was refreshing. I can sit all day hearing and looking at this wonderful falls.\nShow less"], ["Reviewed November 9, 2017", 5.0, "World-famous very very tall falls in the Yoisemite", "An easy walk back to the falls is a must during a visit to Yosemite Valley. The trail is often crowded, but wide and paved. The view is spectacular; but this is not back country. It is often crowded."], ["Reviewed November 9, 2017", 5.0, "A bucket list visit", "An easy hike to lower Yosemite Falls. Yosemite Valley is a must see place for anyone. Hiking can be easy up to very hard."], ["Reviewed November 8, 2017", 5.0, "Great for families and hikers of all ages and physical fitness levels", "We did the Yosemite Falls hike which was awesome. They have installed a pathway to the lower Yosemite Falls viewing area which is perfect for young children, older people or people with disabiilities. The ramp is a very gradual grade up to the viewing area and it is not a long walk. You can also continue on to the top of Yosemite Falls if you are seeking a more rigorous hiking experience. Very nice!\nShow less"], ["Reviewed November 6, 2017", 5.0, "Really good adventure", "Really good adventure. As a family we climbed the rocks up to the fall. Fantastic! I am so glad I came here. This is something I will remember the rest of my life"], ["Reviewed October 29, 2017", 5.0, "Great Hike", "A great relatively easy hike to the base of the falls. But the fun part is climbing on the rocks when you get to the base. If you could have fun and explore."], ["Reviewed October 23, 2017", 4.0, "Upper and lower", "If you walk anticlockwise on the path, you can view both the upper and lower falls walking along. The path is shorter anticlockwise and if you don't continue the loop but return the way you came, it is much shorter than doing the loop. You don't miss anything by doing the loop, just wasting some time. Better for elderly or for the disabled.\n\nShow less"], ["Reviewed October 16, 2017", 5.0, "Upper and Lower Yosemite Fall(Strenuous and Easy Hike)", "The Upper Yosemite Fall is the highest waterfall in the park and can be visible from so many locations in the park.\nThere are No restroom anywhere on the trail as well as the top and remember to pack plenty of water because No Water Refill at the top.\nWe started the Hike from the back of Camp 4 (7.2 miles round trip)at 11am(not ideal !!)and reached the top just before 3pm,we spent an hour up there then hiked down,arrived at trailhead 7pm.That is 8 hours to do this hike including lots of picture and video stops and our actual stay at the top.\nUpper Yosemite Falls is a rough and difficult hike to the top involving a numerous steep challenging switchback,especially the last set of switchbacks ,full of rocks ,also the hike down is equally challenging ,especially on the knees,so Make Sure to wear good Hiking Boots when doing this trail and take with you a Hiking Poles to make your hike easier,there are shaded and sunny areas throughout the hike,also the trail is crowded with visitor where we met very kind Encouraging friendly People along the way.There are many stopping points along the trail where you can see the most beautiful views of Yosemite,the falls,the valley, and Half Dome.\nThe trail conditions is decent up to Columbia Rock viewpoint,which is about a mile and up a 1000 feet of elevation,and many people will return down from there.\nOnce you reach the top ,you cannot see the Falls at the summit,but there is a narrow steep staircase with a railing leads you to a view of the very top of the Falls and looking down into the valley.\nI would say this was the most challenging hike we did and our highlight of Yosemite! during our visit to USA this year.\nIt is Highly Recommended when visiting Yosemite National Park and if you're up to a strenuous hike.So Do Not Underrate this hike,be prepared to spend a day for hike and back (6-8 hours),and start Early and enjoy the Hike.\n\nThe Lower Falls trail was a very easy walk and easy to get to,this is a hike for most everyone,can be accessed by the Lower Yosemite Fall Trail, which is an easy, paved 1 mi/1.6 km loop.It's probably the easiest trail in the park, It is a great place to visit early in the day before the crowds.Parking available on the side of the street as you approach the falls.\nyou will walk across the bridge crossing the river at the base,that puts you directly in front on the falls,there are a restroom conveniently located after the bridge.\nIt was crowded when we arrive at the base of the waterfall,we went up onto the rocks near the falls to get a closer look and feel the water mist from the falls and took lots of great picture.\n\n\n\n\n\n\n\n\n\nShow less"], ["Reviewed October 15, 2017", 4.0, "Nice views, pretty walk, easy short hike", "We hiked to the lower falls and it was super cool. An easy hike that starts right off of one of the bus stops. Excellent scenery on the way up and the falls itself is beautiful. The flow isn't great in October but still very beautiful.\nShow less"], ["Reviewed October 12, 2017", 3.0, "short hike to lower falls", "we only walked short hike to the lower falls, it was very busy, the falls is stunning, still has a lot of water in the middle of august."], ["Reviewed October 11, 2017", 5.0, "Heart pounding", "This year was an awesome year for the falls. They got so much water this year, it was very powerful. We hiked up to the lower falls. It was pounding down so hard you could really feel it in your chest. We are average hikers. Not really in shape, but not really out of shape. Probably pretty average, it took us about 2 hours to hike up. Well worth it though!!\nShow less"], ["Reviewed October 7, 2017", 5.0, "Good view but takes a while", "We got told that this was 40 minutes. I think he meant to walk there! Took us 3 hours to get up and we are in good health. We ended up coming down in the pitch black.\n\nThe view is ace from the top but you don't see too much of a water fall. We did it in trainers and without water as we did think it was 40 minutes haha.\nShow less"], ["Reviewed October 6, 2017", 5.0, "Gorgeous waterfall", "Walked the .5 mile trail to see waterfall up close. Waterfall is beautiful and great to get some photos. Walk is very pretty and we saw several deer along the walk. Worth the effort to see it up close."], ["Reviewed October 3, 2017", 5.0, "Unbelievable scenery", "We went from SF wth Increbible Adventures, the early start was worth it! Great tour guide, very knowledgable. The trip there was so much more than I had expected, such changes in scenery - burnt forests, waterfalls, lakes and of course the mountain backdrop.\nThe park is very well organised, free shuttle buses, nice cafes and shops. It's impossible to describe the scenery - breathaking and a highlight of my life. The only regreet was that we didn't have long enough, I would recommend booking a lodge (or camping) and either cycling or drive to different areas.\nShow less"], ["Reviewed October 2, 2017", 5.0, "Great short little hike", "Did a bit of bouldering to get out to the pool at the base of the falls. Wow was it worth it. So beautiful."], ["Reviewed October 2, 2017", 5.0, "An Easy, Gorgeous Walk", "If you are in Yosemite you really should take the easy walk to this gorgeous waterfall. We visited in Septenber, and it was still great. We hear that in the spring its power is incredible, but if it is a dry year there might not be anything by fall.\nShow less"], ["Reviewed October 1, 2017", 4.0, "Loud and wonderful", "Had the pleasure to visit and listen to the falls while at the Valley. The falls are magnificient. There is a steep trail up to them; I did not take it. However, the view from The Valley Lodge was wonderful. I could hear the falls, morning and night, from my hotel room....truly lovely!\nShow less"], ["Reviewed October 1, 2017", 4.0, "Beautiful Views", "Hike the paved trail to the base and viewing platform at the base of Yosemite Falls. Amazing views of lower falls with easy access for strollers and those with limited mobility..."], ["Reviewed October 1, 2017", 5.0, "We lucked out!", "We lucked out - a very snowy winter, couples by snow a few days before we visited the park, meant that Yosemite Falls was flowing better than usual (or at all!) for our visit. A super easy walk to the lower Falls, we didn't do the hike to the upper Falls. The upper Falls are visible from many areas in the Valley. Definitely worth the visit!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Minnesota Nice", "We just did the lower viewing area. So many people ignore the signs and go in areas not safe. We were in the park when rocks fell and someone was killed."], ["Reviewed September 27, 2017", 5.0, "Very nice view from top!!!", "Lower and Upper Yosemite Falls were flowing with lots of water! They were so powerful it was unbelievable. I loved it. It almost killed me, with its beauty"], ["Reviewed September 25, 2017", 5.0, "Fantastic", "We only had time to walk to the lower falls, but it just gave us an appetite to explore more or this spectacular area"], ["Reviewed September 25, 2017", 5.0, "The view from the top is EPIC", "This was the first hike in the first day at Yosemite because we had heard about the great views and it did not disappoint. Allow lots of time, pretty much the entire day, to take in everything the hike has to offer. Stop along the way to view the falls and the valley. Columbia rock was an amazing view. When we stopped on the way back down from the top, there was a person that did a hand stand on the railing. Just watching it sent shivers down the spine. The view from the top was both incredible and scary. Awesome pictures of the falls and valley below. We didn't go to the highest point because we were running out of water and time but everyone along the trail that we ran into coming down said it was well worth it so plan to continue up to Yosemite point if you have the time and legs for it.\n\nMake sure you take lots of water. We saw people drinking from the streams but everything we have read says, DON'T DRINK FROM THE STREAMS.\n\nThis is an epic hike, enjoy!!\nShow less"], ["Reviewed September 23, 2017", 4.0, "Review: Upper Yosemite Falls and Yosemite Point", "This is a VERY challenging hike, 3.2 miles to the falls and nearly an additional mile to the Point. You can just climb the bottom half and get a good picture of the upper falls if you're not up for a grueling day. The climb from that first photo spot to the top is the most strenuous. This is tough on knees and thighs. It's not technical, tons of stairs, but it is strenuous. I highly recommend hiking sticks/poles. They will come in handy.\n\nTip: a great place to relax at the top is to start towards the Point but stop at the bridge and hang out down by the river. Also, if you've made it to the upper falls, you're doing yourself a disservice by not going to the Point, .8 miles further. It isn't as bad of a climb and the views are better but it's adding time to your total hike.\n\nTip: If you are considering either Nevada Falls or Upper Yosemite Falls, Nevada Falls is easier, especially if you use the John Muir trail and you get much closer to the water than Yosemite. Yosemite Falls is the same distance but much harder, more vertical, but the views of the valley are 10x better. You don't get nearly as close to the waters edge at Upper Yosemite. There's a lot of traffic on both trails.\nShow less"], ["Reviewed September 20, 2017", 5.0, "easiest of waterfall hikes", "A great one for small kids or older people. Short hike which isn't steep and you end up at the bottom of the falls with a great view of entire fall. Stunning!"], ["Reviewed September 13, 2017", 5.0, "Truly Majestic", "Yosemite Falls is a must see! The best time to visit is June, but we were there in July and due to the rainfall it was still flowing. There is a clear trail to get up close to the falls so you can enjoy their true beauty.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Great visit", "Went to the southern entrance from Oakhurst and saw The falls were flowing great and what a sight to see as far as they were away you could hear them like you were right on them beautiful sight I guess the precipitation this year had water flowing where it has not flowed for years.The trip getting there was wild with all the twist and turns in the roads so be aware of that and take your time.\nShow less"], ["Reviewed September 6, 2017", 5.0, "Iconic falls", "Get out and see the up close. Pave walkway to the bottom or a steep hike to the top. Which ever you choose just get and see the falls. You won't regret it when visiting Yosemite. The paved walkway is one of the easiest family friendly things to do in the park.\nShow less"], ["Reviewed September 4, 2017", 5.0, "The Jewel in the Yosemite Crown", "The paved path to the bottom of the lower falls is easy and short but the falls themselves are so dramatic this year that it's virtually impossible to actually see them from the bridge at the base of the falls. You'll get soaked, as we did! The best view, at least in May, was from the trail approaching from the west and from the Sentinel Bridge in the middle of the valley. You've seen these falls in countless photos, but nothing prepares you for their amazing power and beauty as you stand nearby and not only see but feel and hear them. Magical. .\nShow less"], ["Reviewed September 3, 2017", 5.0, "Worth the walk", "It was a short walk to take the loop to get a closer look. Well worth it as then you could view the stream and listen to the sound of the falls. We were there early Sep and it was still flowing."], ["Reviewed September 3, 2017", 4.0, "Great but tiring hike", "Yosemite Falls was a great hike but tiring. We did the hike up to Columbia point, then to the place where you can see Yosemite Falls. It was about 4 hours round trip, with most of the hike being climbing rocky switchbacks. It was a bit buggy when we went, so you might consider bringing bug nets for your face.\nShow less"], ["Reviewed September 2, 2017", 5.0, "Fantastic View", "We hiked up to the top of Yosemite Fall's. It was well worth the hike! The view of Yosemite Valley was spectacular. At the top was a pool where people swam and soaking their feet. This hike sure gave us a workout but ir is view we're glad we saw.\nShow less"], ["Reviewed August 31, 2017", 4.0, "Beautiful", "We enjoyed these waterfalls verymuch as they are quite central and beautiful to see. We are giving one point less simply because we loved the bridalveil falls more, but these waterfalls are also really stunning!"], ["Reviewed August 29, 2017", 5.0, "Worth the wait", "All the water with one place to go. Amazing show at the moment. All the surrounding greenery is truly breathtaking. Makes for a wonderful stroll to get to it."], ["Reviewed August 29, 2017", 5.0, "Must see in Yosemite", "Easy to walk to from the Valley. At the bottom of the falls the force of the water is so strong it chills the temperature a few degrees colder than the rest of the park\n\nBut it gets packed here. Took a while for us to get a decent photo.\n\nThis is just the bottom of the falls. If you want to see the top of the falls you need to trek up to the mid point which will take more than an hour.\n\nWorth seeing\nShow less"], ["Reviewed August 25, 2017", 5.0, "Upper Falls Trail to a Rainbow View", "My wife and I were unable to secure a permit to hike Half Dome, so we opted to attempt the Upper Yosemite Falls Trail instead. Due to a late start, we were unable to complete the hike, but we did manage to reach an excellent viewpoint of Upper Yosemite Falls, from which we could see both the falls and Half Dome in the distance. Best of all, there was a double rainbow in the spray of the water!\n\nWe brought plenty of food and water and set off on the hike from the Upper Yosemite Falls stop on the shuttle bus. We found the trail to be unrelenting in its vertical gains. The hike consisted of switchback after switchback, pretty much all uphill for the first 1.5 miles until Columbia Rock. This stretch really kicked our butts because there was no relief from the ascent. When we reached Columbia Rock, we noticed that almost everyone we had seen hiking up ended up turning around and heading back down. This is a real shame, as there are no Yosemite Falls views to be had from Columbia Rock. We took a quick break and then decided to head further along the trail.\n\nThe next part of the trail was a good deal less strenuous, and there were even some downhill parts. Eventually, we rounded a corner and could see Upper Yosemite Falls in all of its glory. We kept on for another 30 minutes or so and eventually came to the view described above. We could feel the spray from the waterfall as we took in the awesome views. At this point, the sun was just about to descend below the valley walls, and we still wanted to visit Glacier Point, so we decided to head back down. We were a little disappointed that we couldn't make it all the way to the top, but we enjoyed the up close views of the waterfall nevertheless.\n\nIf you are interested in a hike similar to ours, here are the details. The round trip hike covered about 5.5 miles and took us just over 5 hours. We arrived at the rainbow viewpoint around 3:30 PM, and we found that the rainbows were already starting to disappear around 4:00 PM (end of July). Had we arrived just an hour later, we wouldn't have gotten any rainbows. Along the way, there were plenty of expansive views over Yosemite Valley. We could not see Lower Yosemite Falls from any of the viewpoints, but Upper Yosemite Falls was a featured view several times.\n\nIf you start this hike and are tempted to turn around at Columbia Rock, try to talk yourself into a little more hiking so you can at least see Upper Yosemite Falls from the trail. You've worked so hard just to get to Columbia Rock, you might as well reward yourself with some waterfall action. You should know that the trail has limited amounts of shade, so it is important to bring sunscreen and lots of water. We carried about 5.5 liters between my wife and I, and we used almost all of it along the trail. The trail was a little slippery in places due to dust, so you might benefit from hiking poles. We saw several folks using them, but we made the hike without them just fine (although we did have our feet slip out from underneath us a few times).\nShow less"], ["Reviewed August 22, 2017", 5.0, "another fantastic part of the national park", "Easy walk to view, this one is accessible by wheel chair in dry weather with someone to assist. In mud it would be tricky. Love the sound of rushing water"], ["Reviewed August 21, 2017", 4.0, "Easy stroll to see falls", "Really short and easy flat walk to experience falls within the valley, ideal for those who aren't up to the Nevada falls loop"], ["Reviewed August 21, 2017", 5.0, "Flowing hard!", "With a 175% snow pack this year, these falls have an awesome amount of water to flow really spectacularly! Parking is a little tight though.\n\nWith the amount of snowmelt (temps in the 90's) the Merced is flowing so hard it is flooding the lower campgrounds :o.\n\nThe visitors centre in the valley is excellent too, with outstanding park films, rangers who know what they're talking about, and free lectures on various aspects of the park. Should not be missed! America still has the best national parks in the world :D\nShow less"], ["Reviewed August 21, 2017", 4.0, "Nice waterfall but super crowded!", "The falls are beautiful but get there early, they become very crowded which distracts from how beautiful they are. We were there at 9am and it was already very crowded. The lower falls walk is flat and disabled friendly."], ["Reviewed August 20, 2017", 5.0, "Nice simple hike", "This is the simplest hike which most people take. It wasn't overly crowded and is well worth it. The falls are great, with a lot of water this year due to big spring storms."], ["Reviewed August 19, 2017", 5.0, "Work the hike", "The Falls is beautiful and definitely worth the easy hike. It does get crowded as it's not a huge area to view it but definitely worth it. It's awesome!"], ["Reviewed August 18, 2017", 4.0, "Good hike", "You have got to have good legs to take this hike - but it is worth it. We only went to the \"mid-point\" and back (app. 3 hours) but that was both a good hike and a stunning view."], ["Reviewed August 17, 2017", 3.0, "Lower Falls Great, Upper Falls to Columbia Rock Disappointing", "Lower Falls were easy to get to, packed and beautiful! Upper Falls to Columbia Rock was very disappointing! No water views, so only take the Upper Falls trail if you can get to the top!"], ["Reviewed August 17, 2017", 3.0, "Experience nature", "You can experience nature although is a bit overcrowded with people during the weekend You have too find the exact place too see both falls When we stood there looking at the falls suddenly a dear with it's baby came really close It was amazing"], ["Reviewed August 17, 2017", 5.0, "Must see in Yosemite", "It is an easy hike to the bottom of the fall about 0.6mi but a moderate to difficult hike to Upper Yosemite depending on fitness..definite must though"], ["Reviewed August 15, 2017", 5.0, "OF Course a Yosemite Must", "Easy hike to the the base of the falls .5 miles paved and flat. Sun position will give you different perspectives. Summer of 2017 the falls were running hard into July at least.\n\nThe Lower and Upper Falls hikes are strenuous but Lower Yosemite Falls is #1 on a future visit.\nShow less"], ["Reviewed August 15, 2017", 4.0, "Easy then Strenuous", "Easy to the bottom of the falls but considerably more tricky to get to the top especially as there is a diversion to get round a rock fall. Enjoyable walk if a bit strenuous."], ["Reviewed August 15, 2017", 5.0, "Another great hike", "This hike is probably the second best hike in Yosemite. I always highly recommend doing these hikes in the spring when the waterfalls are at their peak."], ["Reviewed August 14, 2017", 5.0, "Beautiful and easy hike", "This is a short easy hike that lead to the bottom of the falls. The experience is magnificent as the views. The only thing it was so crowded it was almost impossible to take a photo without tons of strsngres photobombing from all angles"], ["Reviewed August 13, 2017", 3.0, "Easy hike to the bottom of the falls", "One of the many hikes we did while in the park, we road our bikes to the trail head and hiked about a mile to the bottom of the falls. There is a viewing bridge and you can climb to the pool at the base but you need to be in shape for that.\nEasy hike and take the view trail on the way back for the whole fall backdrop for a photo\nShow less"], ["Reviewed August 13, 2017", 5.0, "Best ever", "While the falls are always impressive , this year they were in their full glory thundering down the granite. It's an easy and pleasant walk to the lower falls with lots of photo ops on the way. But when you get to the bridge, it's truly an amazing sight. To avoid the crowds go early in the am....\nShow less"], ["Reviewed August 11, 2017", 5.0, "Fairly easy hike!", "This was the easiest fall to get to for us in our short time in the park. We didn't have a great deal of time for backwoods hiking but this fit the bill. Not true hiking unless you veer of the paved pathway which we did. We were able to free climb much further up the side of the falls for some awesome pictures. Would do this hike again!!\nShow less"], ["Reviewed August 11, 2017", 4.0, "Best visited early or late in the day", "Yosemite falls maybe the tallest and most visible fall in the park but not quite as memorable as Vernal or Bridal. Still it's a cool sight to see, the gush of water falling from a great height, with a break in the middle as it hits a ledge. Because of that break if you get too close you will only see the lower part of the falls as the higher section is a bit set back. Short walk to the base of falls, all paved.\n\nParking there could be a challenge as it's one of the first sights on the drive into the valley. We got there around 10 am and grabbed one of the last spaces on the road in front and just left the car there, using the free shuttle to get around the valley for the rest of the day.\nShow less"], ["Reviewed August 10, 2017", 5.0, "An Obvious Highlight of Yosemitie", "There's a reason why so many postcards and pictures of Yosemite feature the Yosemite Falls; it's absolutely stunning. We hiked both the Upper Yosemite Falls Trail and Lower Yosemite Falls trail, both of which start at the valley floor. The Lower Yosemite Falls trail was relaxing and scenic. The Upper Falls trail was relentless and grueling with seemingly endless switchbacks. The views were well worth the hike though. The trail has great views all the way up (such as Columbia Point) and you can get really great views of the falls right before you head up. We were going to take the extra 0.8 mile trail to Yosemite Point, however we encountered a bear and did not proceed on the trail. Bring plenty of water for this trail (0.5 L per person per hour). Afterwards, you can tell your friends you hiked atop one of the tallest waterfalls in North America (which is pretty cool).\nShow less"], ["Reviewed August 10, 2017", 5.0, "Beautiful -- handicap accessible", "Worth the hike. Short hike to lower Falls that is handicap accessible and a parking lot nearby with handicap placard or license plate. Longer steep hike to upper Falls not handicap accessible."], ["Reviewed August 10, 2017", 5.0, "Feel the mist", "The water fall are beautiful to hear the roar of the fall and the mist on your face is a lasting memory for sure."], ["Reviewed August 10, 2017", 5.0, "Excellent but challenging hike to the Top!", "Trail guide said Moderate 3.5 mile hike but this was really challenging and involved a lot of rock climbing. The view from the top was breathtaking and totally worth it - but bring food and lots of water."], ["Reviewed August 9, 2017", 5.0, "Hike Yosemite Valley to Upper Yosemite Falls", "A beautiful and demanding hike. I recommend you get an early start (7am or earlier) to limit exposure to sun and heat. It is worth to hike the extra bit to Yosemite Point."], ["Reviewed August 9, 2017", 5.0, "Awesome", "Well worth the short easy walk off the road to the base of the lower falls. The water crashes down on and the spray blows throw the air refreshing the bystanders. From further back on the path a spectacular view can be seen if both the upper and lower Yosemite falls\nShow less"], ["Reviewed August 8, 2017", 5.0, "Lower falls hike", "There are two trails to the lower falls. Don't go back the way you came. One of the trails has a great view of both the upper and lower falls together. If you don't see that on your way in, turn around to catch it on your way out. Both trails are easy and short.\nShow less"], ["Reviewed August 8, 2017", 5.0, "Spectacular", "On our visit to Yosemite for our dad's 90th BD, i thought the highlight was Yosemite Falls. Dad was pooped so we could make it to Half Dome, but we were all enthralled by the wonder of nature and the absolute beauty of Yosemite Falls"], ["Reviewed August 7, 2017", 5.0, "Hike to the top was a lot of work but well worth it!", "I hiked this trail on my first visit to Yosemite an couple years back. It was late May/Early June and the upper elevations still had a lot of snow cover. We started early from Camp 4 and followed switch back after switch back. People on the trail thinned out towards the top and the power of the river was impressive with all the snow melt.\nShow less"], ["Reviewed August 7, 2017", 5.0, "Easy walk worth the effort", "I was surpised how easy it was to get here. The falls are magnificent and well worth the visit if you come to Yosemite."], ["Reviewed August 6, 2017", 4.0, "Busy but beautiful", "Amazing to see Yosemite Falls, very beautiful however the park gets very busy and parking can be difficult. Avoid the toilets if at all possible."], ["Reviewed August 2, 2017", 4.0, "It's A Very Long Pour Over.", "You can climb to the top but it's quite taxing. You can also go part way up to a nice viewpoint. The combination of both the Upper and Lower Falls make this drop the fourth highest in the world. But most visitors just gather at the base and scamper around the rocks. There are also good views from the various access ways. Try to find a spot where you can see both the upper and lower falls together.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Easy walk to see the falls!", "The water was pouring over the falls. I have heard that it is a trickle by most Julys, but due to heavy snow fall this year, the falls we're going strong."], ["Reviewed July 31, 2017", 5.0, "The signs don't lie", "This is a must see hike/waterfall, but be careful. When we were there a teenage girl slipped on the rocks and was badly hurt. It's no fun explaining to your own kids why a helicopter comes to the park to airlift someone out. The Park Rangers were amazingly fast at getting to the scene and clearly the signs that warn hikers of scrambling and climbing on the rocks are there for a reason. The waterfall is incredible and changes every second--it's worth seeing from different vantage points around the hiking trail.\nShow less"], ["Reviewed July 31, 2017", 5.0, "Lower falls in early May", "With limited time, we just did the very easy lower falls walk. It is important to do the loop in a clockwise direction as this allows great views of the falls as you head towards them. At the bridge closest to the base of the falls you get a better impression of the power of the falls. The spray will get you quickly soaked if you linger.\nShow less"], ["Reviewed July 30, 2017", 5.0, "Stunning", "We only stayed one night at Yosemite Valley Lodge so time was at a premium but visiting the falls was a must do, simply stunning natural wonder"], ["Reviewed July 28, 2017", 4.0, "tallest waterfall in the U.S.", "Yosemite Falls are the tallest in the U.S. They are a pleasant and reasonable hike from the parking lot on a relatively level grade. Young boys love balancing on downed tree logs along the way.\n\nThe falls are spectacular. Looking at them from the bridge, most people climb the rocks on the right to get in the spray and a close picture. Be careful, spray makes large rocks slippery.\n\nFor the less bold or younger children, the approach to the left gets a decent view without climbing wet rocks, good for taking a young child.\nShow less"], ["Reviewed July 25, 2017", 5.0, "One of Our Highlights", "The lower falls trail was a very easy walk and easy to get to. They were impressive to us, and when you walked across the bridge, the breeze and waterfall spit felt so good during a heat wave. The rocks in the water in the area were also fun to walk around on.\nShow less"], ["Reviewed July 25, 2017", 5.0, "Go when there is water; easy trail", "Fabulous falls. Fifth highest in the world. Easy paved walkway gets you there past some cairns that people have built out of the rocks below."], ["Reviewed July 25, 2017", 4.0, "Beautiful!", "It's hard to know what stops to get off on in Yosemite. Especially if you're on the shuttle bus that seems to come when it wants. The Upper and Lower Falls are an easy hike to get to and are a beautiful sight! You get more up close and personal on the mist trail than these Falls, also wet! However, the Yosemite Falls are better for taking pictures.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Upper Falls trail", "Myself, partner and two teenage boys have three days in the park and spent a large portion of today hiking the upper Falls trail. Firstly it's spectacular in the middle and at the top. We began the trail at 8am and reached the top just before 11, the two boys coped better than myself who found it tough, we spent an hour up there then hiked down. The hike down was almost as tough due to the midday heat and I don't believe we'd have made it up if we were leaving at this time. The trail was quiet enough when ascending but the descent was busy, lots of people with little water and inappropriate clothing.\nIt's a fantastic way to spend half a day if you are fit enough and leave early to experience once in a lifetime views.\nShow less"], ["Reviewed July 23, 2017", 5.0, "Amazing!!", "We were told it is quite unusual for the Falls to be flowing this rapidly in mid July. Apparently, the snowfall last winter was quite heavy and they were beautiful. We stayed at the bottom of the falls as we didn't have the time to explore further, but they were spectacular. Many people had climbed out onto boulders closer to the falls.\nShow less"], ["Reviewed July 22, 2017", 5.0, "Impressive Falls", "We walked with our tour guide from Yosemite Family Adventures back to the falls and it was amazing and very impressive. We were there on July 3rd and the water was flowing with great force. I am a waterfall fan and these are on the top of my all time favorite. Beautiful and amazing to think it was all from melted snow!\nShow less"], ["Reviewed July 21, 2017", 5.0, "Put your feet in that freezing water", "It was great to have lunch there. Wirh the sound of the falls and the water falling near you. The freezing water that refresh us and our water. It was crowded but didn't matter. So beautiful and romantic..."], ["Reviewed July 20, 2017", 5.0, "Upper Yosemite Falls", "This is review is for the Upper Yosemite Falls hike. Everyone should do lower Yosemite Falls as it is very easy and accessible. However, the upper falls is a real, strenuous hike.\n\nI have been going to Yosemite every year for over three decades and I have hiked this trail two times and \"only\" made it to the point where you can see the falls, so I knew that it was not easy. It is 3.2 miles to the top and you climb about 2900 feet. We started on the trail at 6:15 a.m. and we were in the shade the entire time. Expected to see more people, but we didn't see another soul until a runner passed us mid-way. In fact we only saw five people on our way to the top, and three of them were backpackers heading down.\n\nIt took about 2 hours and 10 minutes to get to the top and we only stopped for a few photos along the way. There is a break/flat part when you get to the bottom of the upper falls and the view is spectacular. If you stop here and decide not to go for the top, I think you have the best view of the falls because it doesn't get any better than that.\n\nOnce at the top, you can go to the viewpoint and look down and you can also continue to Yosemite Point - where we stopped, had a snack and a short \"power nap.\"\n\nWe started to head back down on the trail around 10:30 and that is when we saw the crowds. Over the course of the trail, we must have seen a 100 people (if not more). The problem with starting on the trail later is that you are in the full, hot sun and in my humble opinion, it makes the hike that much harder.\n\nAlso, I feel that the first mile is the hardest and although not easy, I feel the second portion (after reaching the falls) is a tiny bit easier (not saying it is easy at all).\n\nIf you take anything from this review. . . .start on the trail as early as you can so you can be in the shade all the way up. Oh, and enjoy the view.\nShow less"], ["Reviewed July 20, 2017", 5.0, "Gorgeous Falls", "We walked the trail around the falls. You could feel the mist all along one side of the loop. We went in the morning before the crowds were heavy and we were able to get a lot of pictures at the base of the falls."], ["Reviewed July 19, 2017", 4.0, "Beautiful, if crowded", "Yosemite is full of things to see and do. The hike here, especially the lower falls, is crowded, but can be worth it. You will feel the spray from the falls and can add to the rock sculptures before you get there. Kids especially will enjoy this one.\nShow less"], ["Reviewed July 18, 2017", 5.0, "Amazing", "Another must see in Yosemite. The falls are beautiful and in spring, you will get sprayed with the water even far from the falls. If you are brave, make the 6 mile steep hike to the top of the fall !"], ["Reviewed July 17, 2017", 5.0, "Breathtaking!", "This should be your first stop in Yosemite. The falls are EPIC (especially in springtime after the winter melt). We did the small Yosemite Falls loop. It was super easy and really refreshing with the mist from the Lower Yosemite Falls. We went first thing in the morning on Memorial Day weekend and there was hardly anyone there. I imagine it gets very crowded in the afternoon though!\n\nIf you are feeling hardcore, you can do the strenuous hike all the way up to the top. I think that's more of an all-day type affair though, so if you are just visiting for a couple days I would recommend just doing the loop and observing the Falls at a distance.\nShow less"], ["Reviewed July 16, 2017", 4.0, "Difficult trail - not for the unprepared", "Fairly steep and difficult climbing. The views of the Falls near the 2 mile-ish mark are by far the best It took us 2.5 hours to climb up. We all expected to see the the Falls at the summit, but you cannot see them. Fairly flat and open at the top--not a good climb for young children. There are beautiful views of the mountains including Half Dome and the Sierra's. Some areas still had snow. .\nShow less"], ["Reviewed July 14, 2017", 5.0, "Yosemite Falls", "This two-tiered falls is awesome! Lower falls is an easy walk and great way to cool off from the water spray but does get crowded. Upper Yosemite Falls is a rough and difficult hike to the top. Didn't get passed the first mile of switchbacks, but still had great view of the valley below.\nShow less"], ["Reviewed July 13, 2017", 5.0, "West Coast road trip", "Visited from San Francisco on a very long daytrip with Extranomical tours......brilliant driver/guide knew how to get straight to the key areas ......as we only had one day we would have wasted most of it trying to find the best route!\nWhat an awesome place and the views of the mountains and falls were breathtaking....there had been heavy rain in the weeks before we went so the waterfalls were tremendous...we even managed to see a black bear at the roadside on the way back which capped off the day......totally recommend it,and if you have time,spend a few days there\n\n\nShow less"], ["Reviewed July 12, 2017", 4.0, "It was pretty", "The location made for excellent site seeing. We could have watched the falls for hours. Easily accessed, many good places for photo taking."], ["Reviewed July 11, 2017", 5.0, "The world's 10th highest falls - Upper Yosemite Falls", "At nearly 2000', Upper Yosemite Falls ranks as the world's tenth tallest waterfall. On June 14th, 2017 my wife and I revisited Yosemite National Park with the intention of hiking up Yosemite Falls Trail far enough to gain a scenic view of the Upper Yosemite Falls. I'm not certain how far we hiked, precisely, but a good guess was about 5 miles, round-trip, and it was worth every step!\n\nThe falls were magnificent, even in mid-June, thanks to heavy winter snows. Tioga Pass had yet to open, and many of the surrounding peaks were sporting coats of white at higher elevations.\n\nSince one picture is worth a thousand words, I've included several thousand words worth of images for you to enjoy.\nShow less"], ["Reviewed July 11, 2017", 5.0, "Nature's Splendor At the Falls!", "This year, in June, has to be one of the more spectacular scenes at Yosemite Falls for greenery, robust falls, clear skies, and granite mountain vistas. We spent about 2 hours shooting pics of this magnificent area.\n\nBe forewarned*: while the area is indeed picturesque and well worth your time, parking in the area is very limited and must be met with realistic, summer travel expectations i.e., arrive as early in the morning as soon as possible (the light is more dramatic, anyway).\nShow less"], ["Reviewed July 10, 2017", 5.0, "Just as beautiful now as it has bee4n for the last 40 years", "Wanted to see the falls at its fullest in June, but broke my foot and had to wait until now. I was hoping to see a nice full falls and I was not disappointed. While the falls were not crazy full they were quite spectacular. My granddaughter and I enjoyed standing on the bridge waiting for the winds to shift spraying us with cool water on a warm summer's day. Love thisplace and so will you.\nShow less"], ["Reviewed July 8, 2017", 5.0, "One of the best hikes from Yosemite Valley", "Hiked to the top of Yosemite Falls in late June this year, with my 13-year old grand-daughter. This is definitely a challenging, strenuous hike--9 miles total if you go up to Yosemite Point, on steep and rocky trails. We started early--7 am--and got back to our car about 4pm. Had lunch at the top of the falls, and took lots of pictures, but most of our time was just hiking.\nThe views of the falls, the valley, and Half Dome across the valley are fantastic--well worth the effort of the hike. Take note as some others have mentioned, that you need to be well prepared for this hike, with good shoes and plenty of water (or a filter so you can replenish along the way). Sunscreen and mosquito repellant are also a good idea.\nIf you don't want to do the whole thing, there is a good viewpoint about half way up that provides views of the falls, the valley below and Half Dome. A very easy walk to the lower falls is also available. But nothing beats standing on the edge of a 1500 foot drop with the roar of Yosemite Falls beside you!\nShow less"], ["Reviewed July 7, 2017", 5.0, "Awesomeness", "The waterfalls were amazing!! Sadly, we got to this one too late in the day and there was no parking whatsoever so we had to take pics from our car as we drove by. But it was awesome nonetheless! Please put this national park on your bucket list. You will love it!! I've never seen anything like it! So worth seeing once in your life\nShow less"], ["Reviewed July 7, 2017", 4.0, "Lovely falls with easy access to the lower falls viewing point", "Yosemite National Park is very popular in July and driving is a nightmare in some parts! But the falls are well worth the effort as they are quite spectacular and the lower falls are an easy walk from the parking areas near the start of the walk. The walk is largely shaded by the trees, so you won't overheat despite the typically mid-80s F temperature. Once at the viewing point people are very good about letting you set up the photo shots you want, so you can create wonderful memorable pictures with friends and family.\nShow less"], ["Reviewed July 7, 2017", 4.0, "Beautiful but crowded", "The falls are very easy to get to; it is a walk across flat terrain from the shuttle stop (stop 6). The falls themselves are spectacular right now; normally, they aren't really around this time of year but because of the snowpack they are still roaring. This area was very crowded though, which made it hard to get around while on the bridge at the base of the falls. I went up onto the rocks near the falls to get a closer look, and while this area was also crowded it wasn't as bad as the bridge. Definitely worth seeing!\nShow less"], ["Reviewed July 7, 2017", 3.0, "One of the easiest trail walk", "The lower falls trail is one of the easiest trail, so you can take the strollers, small children, as well as seniors. You fan feel the water mist from the falls; quite refreshing. Many huge rocks on the way."], ["Reviewed July 6, 2017", 4.0, "Roaring and Worth seeing", "Right across the street from Yosemite Lodge so we went every night to view it. Very crowded as the day trippers, non hikers can park at the Lodge and walk there so beware for large crowds at most times . I went when they left at 7 to 8 pm\nShow less"], ["Reviewed July 5, 2017", 5.0, "Stunning but crowded", "This year especially, the Falls are truly spectacular. You will not be disappointed. However, prepare yourself for crowds. There are a lot of them, including tour buses with hordes of people. So have some patience and enjoy the view. It is amazing."], ["Reviewed July 5, 2017", 5.0, "Sooooo Beautiful!!!", "With all the water from last winter's rains, these falls are overflowing. A walk along the river below was so picturesque - a must see!"], ["Reviewed July 5, 2017", 5.0, "The trial to the top could be harder than you expect", "We hiked to top of the Upper Yosemite Falls to the Yosemite Creek and Yosemite Point on July 2nd. Just a few tips:\n\n1. We lived in the city of Merced, 2 hours away from the NP. In order to get the trail done we waked up at 4:30am and started the hike at 7:30am. It took us about 8 hours round trip (we spent about 1 hour at the top playing around), hiking in a normal to relax pace.\n\n2. The trail could be more difficult than you expect. It's all about inclines and tough trail. I won't say it is impossible if you are not equipped (I saw teenagers hiking to the top with slippers, seriously) but prepare good hiking boots with protection to the ankle would be a great idea. This trail is just 3.2 miles but is rated as strenuous, there is a reason.\n\n3. No restroom anywhere on the trail as well as the top.\n\n4. No water refill anywhere on the tail and the top, unless you have the filter for the water from the creek. We carried 6L water all the way and it seems a little bit less than necessary (we ran out of water on the way back) given the time length, temperature and exposure to the sun lights.\n\nAt the top you will find the entire valley down there between you (the fall) and the stone (the Half Dome). This second worth everything.\nShow less"], ["Reviewed July 4, 2017", 4.0, "Refreshing Falls", "We parked in the parking lot near the bottom of the falls and walk around the area. Nice easy trail, tree shaded, not crowded until we got to the bottom of the falls. Wonderful view of the falls and the mist was refreshing since it was a very hot day. Easy path for those with walking difficulties or balance problems and lots of areas to sit and rest. We even saw a few people being pushed in wheel chairs. Great trail for little kids. We didn't take any of the paths off the main trail but there were several.\nShow less"], ["Reviewed July 4, 2017", 5.0, "Beautiful. Powerful. Easy to get too. Must see!", "Waterfall was very powerful in July. Short quick walk to the lower falls. Plenty of photo opportunities You can hike in much deeper or do the upper falls which is more of a day hike. Obviously a must see while in Yosemite."], ["Reviewed July 4, 2017", 5.0, "Breathtaking!", "When we visited in June the falls were in full flow due to the high snow fall during the winter. What an incredible sight. The sheer noise and power of the falls is incredible. The spray was unreal. Can't wait to return!"], ["Reviewed July 4, 2017", 5.0, "Stunning", "The falls are stunning and wonderful to look at. We happened to be there when the water was rushing through all the falls in Yosemite. What luck!"], ["Reviewed July 3, 2017", 5.0, "Our first hike to the wonder of Yosemite", "It only takes a short hike to put you before the tallest water fall in the US. We were blessed to see it in all of it's glory from a heavy snow melt. If you do nothing else in the valley, take this walk to wonder.\nShow less"], ["Reviewed July 3, 2017", 5.0, "The roar of the falls is awesome!!", "Yosemite is a must visit national park. We planned our visit for the first week of our kids' summer break because we had read that the falls are most impressive in the late spring/early summer and nearly dry in the fall. We were definitely not disappointed by the roar of the falls. There is a paved .5 mile walking path that leads to the Lower Falls. In a separate location, the Upper Falls can be accessed by hiking an intense 7.6 mile RT hike to the top of the falls. The Upper Falls hike features a 3,000' elevation gain and a serious work out through a series of switchbacks (think Walter's Wiggles at Zion multiplied by 10). Whether you choose the lower or upper falls, you will get to feel the awesome energy of the falls. If you climb to the top of the Upper Falls, you get the added bonus of incredible valley views.\nShow less"], ["Reviewed July 3, 2017", 5.0, "Wow the noise the size", "We were so lucky to go when the falls had such a huge amount of water coming over June 2017, the noise was deafening and we got very wet but it was a fabulous experience and how lucky were we to be there at the right time. We just walked up the lower falls, the upper falls trail is for people fitter than us. We were told by the rangers it is two and a half times the height of the Empire State Building , just massive. If you go try and visit in Maynor June when waterfalls are at their best.\nShow less"], ["Reviewed July 2, 2017", 3.0, "Too touristic fall", "This is the fall where everyone goes at Yosemite. It is in the middle and easy to reach, but very crowded. I would choose another fall which there are a few. In June 2017 there was enough water on the falls, so all of them looks awesome.\nShow less"], ["Reviewed July 2, 2017", 5.0, "In full flow in June", "An amazing spectacle which was the first site of the morning when we left our room at the valley lodge, fully paved pathways to the lower Falls viewing area which is only a few hundred yards from the parking area.\nThe upper Falls trail is longer with a steeper incline and can take a few hrs to complete, parking may be an issue at busy times so visitors may need to utilise the free park shuttle buses.\nShow less"], ["Reviewed July 2, 2017", 5.0, "Beautiful and powerful!", "We did the hike to the Upper Falls with the intention of stopping when we reached the location of an excellent view of the Falls. This is an excellent options. A very vigorous hike (1000 ft up over 1 mile) but not as difficult as going all the way to the top, while providing a special view and experience with the falls. The falls are awesome this year!\nShow less"], ["Reviewed June 29, 2017", 5.0, "Bring your camera!", "Incredible views of the falls this year! Everyone is enjoying this site. Don't miss it! You might get wet, but you'll be smiling!"], ["Reviewed June 29, 2017", 5.0, "Beautiful Gushing Falls", "The falls were amazing with fabulous water flow. I cannot believe how close you get to the lower falls. We were just bombarded with mist. When taking the easy lower falls trail make sure you start the loop on the right as you exit the shuttle. That way the incline portion is downhill instead of uphill. If you go this way, make sure to turn around after passing the viewing area as some of the best photo opportunities are as you are leaving the falls.\nShow less"], ["Reviewed June 29, 2017", 5.0, "Lots of water in late Spring", "Short hike with a great view of the falls. There is so much water from snow melt this June that the wind generated from the falls will almost knock you over. Could have stood there for an hour. Refreshing and beautiful."], ["Reviewed June 26, 2017", 5.0, "Lower Yosemite falls was magnificent", "We picked up this lhikeb coming out of the Majestic Hotel. On the right was a small sign that pointed to Lower Yosemite falls in 1 mile. It was a lovely hike in the woods. It was not difficult, only enjoyable. What I like about the hike is there is a large bridge that goes across. It felt very safe and there was a platform on the other side. We departed and went the other direction and ended up on the street. So you can enter it from the street or from the mountain hike like we did. The falls were glorious and I would highly recommend this hike. It was not strenuous, only enjoyable- the way I like it!\nShow less"], ["Reviewed June 26, 2017", 5.0, "Tallest, yes. Very powerful too.", "I bet other falls that are bigger can be more powerful but with the Yosemite Falls you can get close twice. First we went at night. Pitch black. Not afraid of wildlife as we had lights and know the defensive actions, yet we didn't have the ideal four. We didn't expect the wind gets stronger and how cold it got in the dark. That made for a special effect. Couldn't see the falls but the sounds became so much more the value of the visit. We went back the next day during daylight to stand on bridge and take the forceful wind and get wet! Plenty of pics and videos. In 2017, this site and all the falls are extra big due to excess snowfall. Would hate to arrive late summer or fall when the falls start to slow, drip or even stop. Beautiful sight! Did not enough time to go to Upper Falls.\nShow less"], ["Reviewed June 26, 2017", 4.0, "Beautiful fall", "Beautiful falls, there are many falls in Yosemite National Park. They all are beautiful against the backdrop of the surrounding scenery."], ["Reviewed June 24, 2017", 5.0, "Spectacular sight!", "The falls were just amazing! We were told due to the amount of rain over the past season the falls were especially beautiful and we were not left disappointed!"], ["Reviewed June 23, 2017", 5.0, "Spectacular this Year", "Last visit there was barely a falls due to the drought. This year the falls are back to their full glory and if you are at the bridge at the bottom you are sure to get the shower of a lifetime."], ["Reviewed June 23, 2017", 5.0, "Sight seeing", "This is an adventure a couple,a family,and seniors can do at the person own rate,hike,sit,picnic,take photos,just enjoy the day"], ["Reviewed June 21, 2017", 5.0, "A whim", "I had no idea these existed before we passed them and pulled over on a whim. They ended up being my favorite attraction. The winds at the bottom are super strong but I've never felt happier than when I'm standing there. It's well worth it to venture out onto the bridge at the bottom.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Fun!", "Cold visit in the evening with no crowds was lovely!!! We went about 7:45, very little people and we were freezing by the time we left. It was a treat!!! Love the hot hikes and cool waterfall mists of Yosemite.\nEasy walk, stroller friendly- prepare to get wet.\nWent in June with mass snow melt.\nShow less"], ["Reviewed June 20, 2017", 5.0, "Spectacular loved it", "Can't image such a beautiful place BUT it is packed.Travel mid week can't imagine a weekend. However it is breath taking."], ["Reviewed June 20, 2017", 5.0, "Thundering", "There is still quite a bit of snow melting above the falls so they are running strong. If nothing else, hike to the lower falls."], ["Reviewed June 18, 2017", 5.0, "Nice falls", "I went to lower falls. And it was easy and nice hike. Very flat. On a hot day. The cool water is a welcome relief."], ["Reviewed June 17, 2017", 5.0, "Strenuous hike to the top of Upper Yosemite Falls", "This premier hike in Yosemite Valley is accurately labeled as strenuous and takes you to the top of Upper Yosemite Falls, the highest falls in North America. You can do a much shorter, easier hike to Lower Yosemite Falls but the view cannot compare. It took us 3 1/2 hours to reach the top on a Saturday that saw the trail crawling with visitors. We wished we had waited for a weekday and lesser crowds. Upper '80s temperatures saw people stopped in most of the few shady areas along the trail, especially as we neared the top. For the last mile many pushed on exhausted, asking those coming down for a time estimate to the top. We did that too, not about to turn back after getting so close. The view of the valley and it's soaring granite walls is breathtaking, and Half Dome is one of the sights, but you can't see the falls. An excellent photo op of the falls occurs at about the halfway mark, so if you feel you can't do the whole trail, go halfway and get a picture postcard shot of the falls roaring like a locomotive while cooling you with fine spray. You should be moderately fit, have enough time and take the minimum three bottles of water that we did. Granola or other snacks too.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Easy walk, breathtaking views!", "This is a great, easy, 1 mile walk from the start of the trail head allowing you to get up close and personal with the lower Yosemite Falls. You walk through a gorgeous forest, and then you begin to feel the waterfall mist in the air, even before you see the falls, you feel and hear them.\n\nMy mom has mobility restrictions and she was able to easily walk up the trail. The falls offer a breathtaking view and a cool little sprinkle of refreshing water on your skin.\nShow less"], ["Reviewed June 16, 2017", 5.0, "Beautiful", "We were lucky to go at a time of year when there was actually water streaming down the falls. It is a sight you will not easily forget."], ["Reviewed June 16, 2017", 5.0, "Take the hike!", "It is a short hike and the view is magnificent. Stay on the trails! Be safe, don't leave on a stretcher. There will be a crowd. parking is an issue, but the free shuttles run often and take you wherever you want to go."], ["Reviewed June 16, 2017", 5.0, "Upper Yosemite Falls Trail", "Shuttle stop 7. This trail starts in the back of Camp 4. I should add that getting there early adds to your enjoyment of this trail. With the birds singing, the sun shining & minimal people. The views as you climb are beautiful. The flowers were in bloom while we were there in the Spring.\nYou hike up numerous switchbacks. Someone told me how many, but I've forgotten. 60 maybe? Active, fit people should have no problem. If you're an overweight, middle aged flatlander like myself, it took some time.\nLet's get this straight.\nThis is a strenuous trail. My hiking buddy & I made it to Columbia Rock. This is about 1.2 miles from the trailhead. It was tough. When we came down the trail was crowded with people. Some of them had no business trying the hike up this trail. Red faced, sweat pouring off them. Barely able to gasp out, \"Are we there yet?\"\nThink about it before you try it.\n\nFrom Columbia Rock (which isn't signed) You get an incredible birds eye view of the valley. What you don't get is a view of Upper Yosemite Falls!\nYou keep going. Up 2 more very steep spots on the trail. Then, the trail evens out for a while. After going downhill for a spell, you finally get a great view of Upper Yosemite Falls! This is about 1.7 miles from the trailhead. This is where I turned around & went back. The trail starts to switchback again taking you up to the brink of the falls (3.5 miles one way) & I knew better than to go on (middle aged, overweight flatlander).\n\n2 groups of people asked me if I found the Cryptic Junction. Supposedly, this is a 50 yard trail that gives you an uninterrupted view of the entire Yosemite Falls sequence. It's not signed. It's narrow & you could fall 2000 feet to your death if you slipped off. I might have found it. I didn't go the whole way, because it IS narrow & I was alone at that point. There were no other people around to tell me this was it. I turned back.\n\nBack to the crowded trail to go back down. The people were coming up relentlessly. It was hard to get by when the trail narrowed. This was a Saturday.\nGet there early!!!\nShow less"], ["Reviewed June 14, 2017", 5.0, "Falls are spectacular this year!", "With all the precipitation the region experienced this past winter the falls in Yosemite are running at full speed in mid-June. They should be going strong for another month or so, and then only the major falls (Yosemite and Bridal Veil) will likely be full."], ["Reviewed June 14, 2017", 5.0, "Easy walk with plenty of pictures", "I really recommend going to see this waterfall. It's probably the easiest trail in the park, and it provides many angles for pictures to be taken. You get wet going up close to the waterfall, but it feels nice on a hot day."], ["Reviewed June 14, 2017", 4.0, "Lower Fall Trail: crowded and misty; Upper Fall Trail: busy and steep", "Yosemite Falls consists of Upper Fall, Middle Cascade, and Lower Fall. The base of the Lower Fall can be accessed by the Lower Yosemite Fall Trail, which is an easy, paved 1 mi/1.6 km loop. The Upper Yosemite Fall Trail goes to the top of Upper Fall, is 7.2 mi/11.6 km roundtrip with an elevation gain of 2700 ft/825 m, and is rated strenuous. Since the trail descends about 200 ft after Columbia Rock, the total elevation change is 3100 ft/945 m.\n\nWe did both trails on the Tuesday after Memorial Day. We stayed at the Yosemite Valley Lodge, which is conveniently located next to the trailheads. We did the Lower Fall Trail around 11:30AM, and it was very crowded. There was a lot of spray at the base of the waterfall so bring a rain jacket or poncho. You will need it on other hikes as well - Mist Trail, Bridalveil Fall Trail. Do the loop in clockwise direction to maximize view of the falls.\n\nWe started the Upper Yosemite Fall Trail around noon and finished at 5PM. We recommend starting earlier because the trail has very little shade and gets very hot. We're young and avid hikers and found this trail tough (more difficult than the Four Mile Trail, Panorama Trail, or Mist Trail). The switchbacks are incredibly steep, especially near the top. We found ourselves stopping to catch our breaths after each switchback. The trail condition is decent up to Columbia Rock - a mix of soil and gravel - but very rocky afterwards. We brought 5 L of water for 2 people, which was barely sufficient on a sunny day.\n\nWe were surprised by the number of hikers on this trail; we encountered more than 50 people. Among the strenuous hikes, this one seems to be the most popular. The view is wonderful - Upper Yosemite Fall, Glacier Point, Half Dome, El Capitan, and Sentinel Meadow. The view from Columbia Rock was particularly memorable. There was not too much spray from Upper Yosemite Fall so no need to pack a rain jacket or poncho. The little amount of spray was actually quite refreshing and welcoming on a hot and tiring hike.\nShow less"], ["Reviewed June 13, 2017", 5.0, "Great place", "Spring is the time to go. The snow is melting and the falls are huge and it's not that crowded. I loved it."], ["Reviewed June 13, 2017", 5.0, "Heavy rain Heavy Falls!", "After 6 years of drought in California and a very rainy winter, the falls were at their best! You cannot miss the view of Yosemite Falls!"], ["Reviewed June 12, 2017", 5.0, "Thunderous and spectacular in late spring", "I know every season will give you something different to marvel at in Yosemite but in May it was definitely the waterfalls, of which this is undeniably the most spectacular. The falls can be also viewed from many different locations across the valley as well as the trails that surround it.\n\nWe walked the lower part of the trail which is a relaxed stroll really and was well signposted. It was extremely hot by mid morning and it was nice to get under the shade of the trees for a while. The noise and spray from the falls was incredible - be prepared to get wet at the base!\n\nLook out for wildlife, we saw several different types of birds, dragonfly, squirrels and deer.\n\nAs with other key sights in the valley it gets very busy so make the effort and get there early (8am) to miss the crowds.\nShow less"], ["Reviewed June 11, 2017", 5.0, "Thunderous", "We were fortunate enough to see this fall after a large snowfall season. Be prepared to get wet when crossing bridge below fall. Again the park system has made this wheelchair accessible. Just a small loop but well worth the walk to the base"], ["Reviewed June 10, 2017", 5.0, "BEAUTIFUL!!!", "This is an amazing sight - don't miss it! Walk to the base of the falls, it is breathtaking! Be prepared to get a little wet from the mist at the bottom of the water falls. SO BEAUTIFUL - Don't skip it!!!"], ["Reviewed June 10, 2017", 5.0, "Beautiful Waterfall", "Since we were at Yosemite late May, the waterfalls were full. Yosemite Falls are located right behind Yosemite Valley Lodge where we stayed. It is a paved trail that you take to see the lower falls, a very short walk, and it is amazing. They have a bridge you can walk across that puts you directly in front on the falls. We loved it and walked to it everyday we were there.\nShow less"], ["Reviewed June 10, 2017", 5.0, "Outstanding - but a difficult hike!", "We hiked to the top of Yosemite Falls on our second day in Yosemite. I would say this was the most challenging hike we did during our week there - but boy is it worth it when the falls are in full swing like they were that week! It is incredible - after about a mile on the trail you start to hear this thundering sound and then you come around that bend and there it is - what an amazing waterfall! The power of it all took our breath away. We continued on and started to head up to the top of the waterfall - which in some part, goes alongside the waterfall. You continue to have great views as well as the cooling effects of the mist. But be careful - there are lots and lots of slippery rocks. Later on the trail, you hit switchbacks but you are out in the full sun and it is a long hot trek to the top of the falls. But don't turn back - the views at the top are spectacular! We took our time at the top to have a snack and soak in the amazing scenery in front of us. The hike down is equally challenging -especially on the knees. We had hiking poles and put them to good use. It is a long strenuous hike but we loved it! Bring lots and lots of water!!\nShow less"], ["Reviewed June 9, 2017", 5.0, "Breathtaking", "On your visit to the park this is a must see so much to see and do! It can get very busy. Use the shuttle bus to get around again this can get busy."], ["Reviewed June 8, 2017", 4.0, "Upper Yosemite Falls trail", "We hiked a portion of the Upper Yosemite Falls trail, up to the base of the falls. This is a steep but rewarding hike if you go when the waterfalls are still flowing, in spring or early summer; plus you get expansive views of the valley and Half Dome on the way.\n\nThe trail starts behind the Camp 4 campground, and begins with steep switchbacks under dappled shade. After hiking about a mile and up a 1000 feet of elevation, we were standing on Columbia Rock, which is distinguished by a metal guard rail on the right. From here we had gorgeous views of the valley and Half Dome, and could look directly down on Yosemite Valley Lodge. (The line of sight to the lodge was so direct, as guests of the lodge we briefly got wi-fi standing here).\n\nIf you reach this point, it’s definitely worth continuing on to the base of Upper Yosemite Falls. It’s only about another ½ mile, with perhaps 200 feet of elevation up and then down. The trail doesn’t get as close to the base of the falls as Lower Yosemite Trail Falls does, but we had a good view of the entire waterfall as well as the water hitting the rocks below, with a little bit of spray. We continued on, but when the trail started going up rather than getting closer to the falls, we decided to turn around rather than hike to the top.\n\nThe trail coming down was slippery because of the sand on the rocks; I recommend bringing trekking poles. It also got very hot and more crowded as the day when on. With a lot of stops and a short break for lunch, we finished the hike in four hours.\nShow less"], ["Reviewed June 7, 2017", 5.0, "Spectacular!!", "What a year--and time of year--to visit Yosemite! The falls were amazing! So powerful! So much water! The falls are visible from so many locations in the park. From Yosemite Valley Lodge it is an easy walk to the lower falls. And we were sprayed quite a bit when getting there!\nThe roar of the falls could be heard near the lodge and from our room on the second floor. How fortunate for us to have been there when the falls were so spectacular.\nShow less"], ["Reviewed June 7, 2017", 4.0, "The lower falls were extremely busy", "By about 8 or 9am the lower falls were already super crowded. We hiked a little past Columbia Point (~1000 ft elevation gain) to get to the upper falls viewpoint."], ["Reviewed June 4, 2017", 5.0, "Can't Miss It!", "You don't want to miss the three levels of Yosemite Falls ... and you won't. The upper falls are visible from almost everywhere in the valley. The Lower Falls are an easy stroll, and exciting to hear the power of this natural wonder. Deafening and drenching.\nShow less"], ["Reviewed June 4, 2017", 4.0, "Seen from various", "Eye popping vistas, these Falls are iconic. We were lucky to visi at a time when they were at their thundering best."], ["Reviewed June 4, 2017", 3.0, "No falls in late September 2016", "Easy short hike to the base of the lower falls. Would recommend for all ages and fitness. Unfortunately, when we were there at the end of September, there was little, if any, water falling. All we could see was a darker spot in the rock where water would normally fall.\nShow less"], ["Reviewed June 3, 2017", 5.0, "Many ways to enjoy Yosemite Falls", "Yosemite Falls offers a lot of options for experiencing this centerpiece of the park. Visitors can take the paved, easy walk up to the Lower Falls and experience the glorious spray and raging beauty of Lower Yosemite as well as viewing the Upper Falls. On our first day in the park we chose to make the full hike to the top of Upper Yosemite Falls -- 7.2 miles round trip and 2600 ft elevation gain, this is for healthy individuals in decent shape. The first portion of the hike, about 1.5 miles leads to a stunning view of Upper Yosemite Falls with excellent photo opportunities. As you pass this point there are some even closer views for photos but also opportunity to get wet from the spray of the mist. One could chose to stop and turn back here or continue up the steep switch backs to make it to the top. At the top a narrow, steep staircase with a railing leads you to a view of the very top of the Falls and looking down into the valley. This is NOT for the faint of heart nor those with vertigo. It is excellent for adventurers. We spent about 90 minutes taking in the view of the valley from the top before heading back down. For us, the hike down was brutal since it was the first hike we had ever done at this altitude. Exhausted and sore, we were happy to have completed the journey but it is not necessary to make the entire trip to the top to take in the best parts of Yosemite Falls.\nShow less"], ["Reviewed June 1, 2017", 5.0, "What a waterfall!", "You have to pay for parking, $30 for a week pass or $60 for a yearly membership. They give you maps and pamphlets in the entrance showing all of the trails you can hike, the restaurants and main attractions. I hiked the Yosemite falls it's a shorter hike if you don't go all the way up to where you are looking down at the waterfall. I made it to the point where I got a good view of the waterfall, the waterfall view is about 3 miles in but you can continue after that for about 3 more miles. The trail is rated hard, but If you are in shape or can withstand incline I wouldn't rate it as hard since there are many steps only a few spots with just sand and the incline isn't too bad. I on the other hand never hike and am 50 pounds overweight so I had to stop every while to catch my breath. I went On a Thursday and it was very busy, many people coming up and down so I had to move out of the way. Regardless it's a nice hike the view is worth it!\nShow less"], ["Reviewed May 31, 2017", 3.0, "Too many people!", "Stop advertising (completely!) and try to reduce the number of visitors to the park. It's just not very enjoyable when you are fighting crowds in every single foot of the park!"], ["Reviewed May 31, 2017", 5.0, "Must see it!!! 5th Waterfall in North America - 6th in the World", "This is a short/easy hike along the river until you reach the Lower Yosemite Falls - No additional hiking trails are available to go higher - Must see from far to get the full view but getting close to the lower is a great experience"], ["Reviewed May 30, 2017", 5.0, "The most impressive water falls I have ever seen", "With the heavy rains in this region this year the Yosemite waterfalls was gushing with water and the spray could be felt from quite a distance.Never got tired of looking at it. Really impressive and beautiful."], ["Reviewed May 29, 2017", 5.0, "No words to say!!!!", "One of the amazing place I have ever visited. Perfect place to see the glory of mother earth. Entire Yosemite national park trip was an memorable experience"], ["Reviewed May 29, 2017", 5.0, "Upper Falls Bucket List Hike", "The round trip distance was 7.5 miles. The elevation gain is roughly 2,700 feet, however the total ascent is 3,100 feet because there are a few descents as you climb. The ascent is quite steep at times.\n\nViews, first as you pass the bottom of the upper falls and than at the top are astounding.\n\nAfter you spend time at the top of the falls and before you start down, do yourself a favor and take the glacier point trail for about 1/4 mile to the bridge that crosses the river just before it plummets to the valley.\n\nTips:\n\nThere are numerous times where small streams flow near the trail. Take a small cloth to dip into the streams to cool yourself on the way up. I am not sure if the streams still flow in the summer.\n\nThere are places that are slippery on the way down, either from sand or wet mist on the rocks. Trekking poles saved me from falling more than once.\n\nEnjoy!\nShow less"], ["Reviewed May 27, 2017", 5.0, "Great hike to upper Yosemite falls", "It was a great hike to upper Yosemite falls and Yosemite point which offered a great view over the valley. Also the view of the falls about half way to the top is fantastic. I was in Yosemite on a busy and sunny weekend in May. Fortunately I started the climb early so there were not so many people yet on the trail. I found the hike rather strenuous but doable. The descend I found the most difficult part because of the many slippery stones. I had to keep my eyes on the track about the whole time and still I slipped several times. Make sure to wear good hiking-boots when doing this trail! Also it was quite busy on the trail when I descended.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Park Namesake Easy Trail", "Once you find a place to park the trail is easy, about a quarter mile long & paved up to the bridge at the base of the falls. In May the water roars over the lower falls creating a mist and wind. Bring a jacket and a cloth to wipe your camera lens off frequently. Also quite beautiful from across the valley on Southside Dr East of Swinging Bridge. Photographers a long lens will bring it in, a wider lens will catch reflections in the meadow when it floods during the Spring runoff.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Very Strenuous Hike to the top of the Upper Falls", "Wear hiking boots or really good tennis shoes. This is a very strenuous hike if you take it all the way to the top of the upper falls. Bring LOTS of water. I see people suffer because they have little or no water. You need at least 2 liters and more if it is hot or sunny. The ascent to the top of the lower falls is strenuous with many steep switchbacks. It is mostly amongst the trees, which keep you cool. If you continue past the lower fall to the top of the upper falls, the switchbacks are mostly in the sun and it is a difficult climb. You will need to drink lots of water! Bring something to eat to refuel your body. It is a great sense of accomplishment when you summit with spectacular views. There is a small viewing platform where you can look down over the falls. Be safe, respect nature, stay out of the river!! People have been swept over after slipping on wet granite. Keep an eye on your children and teach them to respect nature and stay away from the water.\nShow less"], ["Reviewed May 26, 2017", 5.0, "Pools above lower yosemite falls are amazing!", "When we were on a recent climbing trip to Yosemite, we decided to take a day and climb up to see the pools above the Lower Yosemite falls. We had heard from friends that the pools up there were great to relax and get away from the crowds on a hot day in the summer. So we climbed up the Sunny Side Bench route next to the falls to the access trail to get to the pools. The climb was very easy and straight forward. It was mid July so when we got to the pools, the flow of water coming down from the upper Yosemite falls had dropped so the pools were definitely accessible. We scrambled down to the first of several pools. The first was definitely the largest and deepest. We skinny dipped and sunbathed for a few hours up there. You can access all the pools starting at the base of the upper yosemite falls and work your way down from pool to pool to the lower section of pools that we were at, but its a canyoneering route. You would definitely need static canyon ropes to safely descend that way. A few climbers came through as we were soaking but no one minded that we were nude. Actually a few even stripped down to join us for a while. Since we had double dry ropes with us, we decided to rappel the length of the lower Yosemite Falls to get down vs walking down the Sunny Side Bench descent route. The rappel is definitely not for the faint of heart. Its a 400 ft double rope free hanging rappel. We did it in two raps and there are mid way anchor stations about 200 ft down from the top. The cool part about the rappel is that you end in the large pool at the base of the Lower yosemite falls where all the tourists are and undoubtedly get a lot of questions. We would definitely go back up there again on for a down day in Yosemite.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Great time to see it now", "If you're coming just to see this waterfall May is the perfect time, it's flowing as best as it ever gets. If you don't mind crowds go on the short walk to the lower part of the falls listen to the sounds and smell the great air here. The last few years August & September the fall was totally dry..hopefully not this year. but if so there's just so many different things to do down here in the Valley just expect big crowds and you won't get disappointed.\nShow less"], ["Reviewed May 25, 2017", 5.0, "Great views and one of the best in the park", "Even in the height of summer when it's busy the falls are a great location to visit in the park. It's a relatively short walk from Yosemite Village to get to them and the scenery is breathtaking with the calm sounds of the waterfalls and imposing landscape around you.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Great falls from many view points, so amazing!", "This had to be one of the best years to go see the park and all the falls flowing with such large volumes of snow melt. It's amazing and breathtaking! There is a short easy walk up the the bottom of the falls and over a bridge where the water currently is violently rushing under it due to all the extra snow to melt.\nShow less"], ["Reviewed May 23, 2017", 5.0, "Hurry - Don't Wait!", "Yosemite Falls is flowing in all it's glory now due to the snow melt. It is a blast to walk through the mist at the Lower Falls and look for rainbows. The water is flowing everywhere and the Dogwoods are amazing. The sooner you go, the better to see it at high flow.\nShow less"], ["Reviewed May 23, 2017", 5.0, "One of the BEST!!!", "One of the best places in Yosemite National Park... It's worth walking to the falls!The scenery is unique! I loved this place for the view...I got some excellent photos from there... You can feel the calmness even if you are among a lot of people!"], ["Reviewed May 22, 2017", 5.0, "Springtime in Yosemite - SPECTACULAR!", "Waterfalls are abundant! As you enter the park (from the south entrance), don't miss the lovely falls around some of the bends in the road on your way to the valley floor. Alder Falls was flowing with lots of water above and below the road. Parking can be found just past the falls. We stopped at two more falls prior to entering the tunnel. Bridal Veil was so powerful, that pictures could not be taken up close - TOO MUCH WATER! Walk across the three bridges below the falls to view the rushing river. Yosemite Falls was a superb sight! A nice walk from the base or from the meadow will provide you with some fantastic pictures. Vernal Falls can be accessed via the shuttle and then about a 35 minute hike UP to the bridge. Bring water as it is a pretty steep hike but well worth the exercise. You will be rewarded with a wonderful view and cold drinking water provided at the bridge. Crowds increase in the afternoon, so plan your trip to begin early in the morning. We left from Bass Lake and it only took 25 minutes to get to the south entrance. Enjoy your day at this Outstanding National Park!\nShow less"], ["Reviewed May 22, 2017", 5.0, "Upper and lower Yosemite falls", "The pictures say it all with the increased rainfall in California this year and the snow melt the Yosemite waterfalls are the most beautiful they have been in the Last 5 Years. There are waterfalls which don't usually exist."], ["Reviewed May 21, 2017", 5.0, "Put in the yards and check it out", "A magnificent walk. We only walked about 1/2 way, to where the trail went close to the bottom of the upper falls. It is fairly strenuous, but well and truly worth the effort. See as much as you can and enjoy."], ["Reviewed May 19, 2017", 2.0, "Not too exciting", "To start with, due to bad signage, these can be difficult to find. Even after finding\nthem, they don't seem to be that great. However, I read that they are one of the top\nfalls in the world in terms of the height - really ??\nShow less"], ["Reviewed May 19, 2017", 5.0, "Yosemite Falls", "The power of the falls is seeing and feeling it. It appears dropping over the top of mountain in a great decent, then another, and another ending in a stupendous splash of water and mist. A must see."], ["Reviewed May 18, 2017", 5.0, "Please go", "Nothing short of majestic. Simply a must see. Short relatively level hike to lower falls. The sound and spray is titanic. Awesome. Highly recommend you visit before Memorial Day when the flow of water is at it's peak and the crowds are not. In mid Summer the trail is so crowded it can almost seem you are in an airport concourse, except for the view, of course. If you can't visit in May it is best to wait until late September or early October. The flow is less but the crowds are gone and the falls look beautiful surrounded by Autumn color\nShow less"], ["Reviewed May 17, 2017", 5.0, "Wow wow wow", "A must to do, if you can start at the lower falls early one to miss the rush and two if the sun is shining you will see a rainbow coming off the lower falls. This is a very easy straight line walk from the car park. After that if you can go to the higher falls, a much harder and strenuous walk up a mountain with some hard uncomfortable climb. Wear walking boats and be prepared for some wow views of the valley and the falls. We walked to the falls only as was recommended and it took 2 hours slow but steady pace\nShow less"], ["Reviewed May 17, 2017", 5.0, "Beautiful in April", "Tallest falls in the United States. Easily accessible even for the handicapped. Exceptional during the Spring thaw with maximum water flow. I've seen it in August (dry month) when it was just a trickle. If you can manage it, go now."], ["Reviewed May 16, 2017", 5.0, "Two different options for viewing", "You have two trails that will take you to view the falls: the Lower Yosemite Falls trail is an easy hike; the Upper Yosemite Falls trail is a strenuous hike that takes 6-8 hours. Both views and trails are worth the climbs!"], ["Reviewed May 16, 2017", 5.0, "Must do!", "The falls are spectacular and the lower falls are a must do for everyone. It is an easy hike up to the lower fall and you can get a great view once you get up to the falls. We also took the trail farther into the woods and back by where the horses are kept. Very nice walk - about 4 miles.\nShow less"], ["Reviewed May 14, 2017", 5.0, "Nice, easy walk and beautiful scenery", "A great walk to begin or end the day. Can get a little wet on the bridge crossing the fall but that is part of the fun/experience :)"], ["Reviewed May 14, 2017", 5.0, "Amazing place. Great waterfalls", "We visited after some of the heavy rains had passed causing some of the roads and falls to be \"flooded\". One of the falls that we visited had about 4\" of water on the trail leading to the falls.\nWe visited in the morning during the week and it wasn't too crowded. However as the day went on, it began to get crowded in some of the parking lots. They were doing construction in some of the areas adding to some of the congestion. I would think that during the weekend, it would be very busy and hard to enjoy.\nTake some time to visit our National Parks before the protection for these areas goes away.\nShow less"], ["Reviewed May 13, 2017", 5.0, "Spectacular day!", "With good rainfall (early 2017), all the falls and streams flowing heavy. The forest was happy. The sun was out. Yosemite Nat'l Park is an awesome place. Preserve our National Parks!"], ["Reviewed May 11, 2017", 5.0, "Wear the right shoes an plan an extra day", "We have to return because we did not plan enough time for this awesome hike. I thought we could at least make it to the base of the falls but there was so much snow and running water that it was not possible because my daughter wore her Sanuks instead of hiking boots. Plan to get your feet wet unless you are prepared. There is a bathroom and signage at the entrance to the walkway to Yosemite Falls. We have to return so that we have hike the Upper Yosemite Falls Trail. Stunning and mesmerizing are inadequate descriptors.\nShow less"], ["Reviewed May 10, 2017", 5.0, "The most specular falls in the park", "The Yosemite falls is a grand creation. It is the most spectacular fall in the park in my opinion. The size and magnitude of the fall makes it emercive"], ["Reviewed May 2, 2017", 5.0, "Beyond Description", "You have to see this in person to fully appreciate its grandeur and power. People are drawn to it like bugs are drawn to a night light. They want to feel the experience."], ["Reviewed May 1, 2017", 5.0, "Upper Yosemite Falls", "This is an epic hike to say the least. Yosemite Valley, with so many iconic views, can be a little intimidating to the inexperienced visitor. What's best to do? What's best to see? What's best to hike? The hike to Upper Yosemite Falls satisfies most of those questions. First off, do not be lulled into a false sense of security when you learn that it's not as strenuous a hike as Half Dome - it will crush the unprepared. Keep the basics in mind; sleep the night before, bring water and food, sunscreen, hat, etc...basics for hiking are usually the same - use your head. That being said, if you want to have a good time on this hike instead of \"making it through\", you need to prepare for it. 1. get in shape. Spend a few months in the gym doing cardio and the stair climber. 2. Invest in some decent gear. Convertible pants, a good hat, a CamelBak, and trekking poles will make the journey easier and more enjoyable.\nThe trail itself is well maintained, scenic, enjoyable, and punishing at times. The switchbacks can be difficult if your not used to them, out of shape, or loaded down with to much gear. Keep an eye on the weather (a couple of days beforehand!) and adjust your wardrobe and gear appropriately. The trail can be quite exposed at times, and if its hot, it can sap the motivation to climb right out of you! As you go along, you will be rewarded with amazing views - really amazing views - and it gets better the higher you go. Great photo opportunities of the falls and valley are found most everywhere along the trail, so you will have to mind how often you stop to take pics if your going up and down in the same day (I was more mindful of this as I completed my hike in May when daylight hours are not as plentiful). After the switchbacks, you start to walk through a beautiful pine grove as you get to the top - which provides very welcome shade. Take your time, because your almost at the lookout. Once there, take off your pack and enjoy the epic view - you've earned it!! There is a short \"trail\" down to a precarious lookout of the Upper Falls which allows you to look down where it falls of the edge - you hiked this far - don't leave without seeing this. If your legs are shaky from the hike, take a minute and relax, you'll need sure footing while walking around up there. After you've seen the lookout and taken a billion pics, follow the trail to the bridge that straddles the river. Many people take their lunch here in this setting - lots of shade, and the sounds of the river are peaceful. I am not promoting this in ANY way, however, I've seen many people take a swim in some of the shallow spots in the river....and I can't blame them!\nAfter you've had your fill, it's time to go back down. For many people, going down is worse than going up - and for this trail, I have to agree. This trail is especially difficult on the return due to the large amount of scree. I was slipping a LOT. And I've got some very good boots...just be careful and take it slow and purposefully. There are some great spots to sit and relax along this trail, so try to linger and soak it up. Your not going to get lost or need to post anything on FB, so put your phone in airplane mode to conserve battery - you'll want to use every last iota of power to take pics! Yosemite Valley shuttle system is great - take it to the trailhead located at the backside of Camp4 to start your hike. Afterwards, go eat and drink something you love and reflect.\nShow less"], ["Reviewed May 1, 2017", 5.0, "Visit upper and lower falls", "Don't be content with what you can see from afar. Walk up to the place where the Upper Falls stops and the Lower Falls come out. It's pretty cool to see the scope of this waterfall, and to take pictures from so many vantage points."], ["Reviewed April 30, 2017", 5.0, "More than I expected", "We saw the falls in April so they were very strong. I could hear the booming of them before I could see them. The power of the water is quite amazing. The path is paved and very wide. Not to be missed."]]}}