{"Yosemite Valley": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Yosemite Valley", "url": "/Attraction_Review-g61000-d489919-Reviews-Yosemite_Valley-Yosemite_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/24/d5/58/merced-river.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "5655"}, "address": {"@type": "PostalAddress", "streetAddress": "9035 Village Dr", "addressLocality": "", "addressRegion": "California", "postalCode": "95389-9912", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed 2 days ago", 5.0, "Photos Do Not Do It Justice!", "We've seen the popular photos, but were not prepared for the \"real thing\" - as with many scenic locations, photos just cannot do justice to actually being there! Admittedly, we visited during the winter (February) when crowds were down, but the Valley was a wonderful experience. We were only there two days, and hope to return for a deeper experience, with more hiking and immersion.\nShow less"], ["Reviewed 4 days ago", 5.0, "Yes to Yosemite in February!", "I was a little leary of visiting yosemite in February and thought we'd have the place to ourselves, but it was packed and I can't even imagine it being 1/2 as beautiful in the summer. However, a couple things that I hope can be helpful to someone...the park had flurries all day, so I guess with the prediction of snow showers they were at R1, which requires you to carry snow chains unless you are over 6000 pounds and have all weather snow tires. After deciding we had proper tires and under 6000 pounds we paid to enter. Then, a mile into the park a sham artist is trying to sell chains for $96 and is telling us it's against the law for us not to carry chains in our vehicle. We proceed to tell him it clearly says that they are only required to carry UNLESS you are over 6000 pounds or don't have snow tires, and he got extremely defensive , raised his voice, and told us not to tell him the law and that we would be breaking the law. Thank goodness, we didn't buy them and listen to the con-artist selling snow chains inside the park. We did have flurries all 6 hours in the park. The snow plows were plowing the gravel on the road as there was no snow to plow. I highly recommend Yosemite, even if it's R1, but I can't speak to worse except to buy chains before getting ripped off by the con-artist in the park. As we were exiting the park, it was heavier snow, higher elevation and became R2, and then the snow chains were only $68 in the presence of the park ranger-but he could of also been a different vender-we didn't see the vender as we just decided to exit the park via the low, less snowy road. Just seemed sketch, and then not as sketch when the ranger was present. Get the restrictions ahead of time, if possible, and be educated as to if you need chains or not, and purchase them in town ahead of time.\nShow less"], ["Reviewed 4 days ago", 3.0, "Gunshow Guru", "Went in mid February ! Was cold ! Don't recommend this time of year ! They charge $30 per car ! Pass Good for 7 days ! Is very beautiful and scenic ! Would enjoy going back in May to summer time !"], ["Reviewed 5 days ago", 5.0, "Absolutely Stunning", "We were not expecting to be left speechless by the beauty of the park. We spent a whole day walking through the valley and it was definitely worth the money of the ticket."], ["Reviewed 1 week ago", 4.0, "Beauty....", "We'd planned for four days to do Yosemite, but it would have been possible (in January) to do it in two. A few parts were shut to the public due to weather conditions (understandably so). So we were left with just schmoozing around."], ["Reviewed 1 week ago", 5.0, "Stopped by for the day to see the mountains", "My wife and I were traveling back to Texas from Sacramento and we decided to take a detour to Yosemite to see the sights. It was a little cold in the canyon this time of year but it wasn’t so crowded. Need to stay for a night or two if you want to really explore all the falls and do some hiking. We had a nice time. Have to go back again.\nShow less"], ["Reviewed 1 week ago", 3.0, "Gorgeous & Crowded", "We love Yosemite and the Valley Floor is the most accessible point in the park for everyone. It can be extremely crowded most of the year - congestion and lines - feels like the Disneyland of National Parks. If you can get past the crowds - the views are impressive and absolutely worth the trip: Half Dome, Yosemite & Bridal Veil Falls, Mirror Lake, the Merced River.\nYosemite does need to limit numbers of visitors so the beauty does not get destroyed and all the visitors can have a quality experience.\nReviews here on TA won't effect change - writing to the Department of Agriculture is the way to go.\nShow less"], ["Reviewed 1 week ago", 5.0, "Beautiful but no parking", "We have been going to Yosemite for years and this day visit was bittersweet. We got there late morning and there was absolutely no parking - traffic was circling at 5 miles an hour. We wanted to take shuttle but there was no where to park (even if you wanted to walk a distance). There was no place to stop for lunch until you left the valley. I understand that at some point the entrance will have a sign that there is no parking, but when we entered there was no sign. If you go do not go on weekends or go VERY early. I understand it is like this every day in the summer, but did not expect it in February. Take food with you. I have given it excellent rating as the park itself is spectacular.\nShow less"], ["Reviewed 1 week ago", 4.0, "well worth seeing,", "well worth seeing,some of the climbs are hard,in summer bring lots of water,the valley foor r is easy but parking\n\nif your fit do some hikes,with all the bear warnings I did not see any bears,even in the high country,i went when the fires were going so some of the air was bad,the 2 open big tree areas were disappointing.the other onemn is ment to open in june but they keep moving it forward it was novemvber 2017 before\nShow less"], ["Reviewed 2 weeks ago", 2.0, "If not well traveled you will be impressed otherwords avoid... tourist trap worst in summer", "If you are not well traveled it is ok.... i am from the usa. And would never go again. If i had to give advice for Real adventure travelers... is to skip or do yartes Bus. Hikes are a joke. From the valley. It is more a destination for little kids, grandparents, handicapped individuals . Hicking boots are NOT necessary. Most all are paved. Skip especially in summer way more busy. Overall should not be considered a national park it has been ruined thanks to California . I am dissappointed in the USA for allowing this atrocity\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Picture perfect", "I was awestruck by this beauty! I was just standing by seeing the nature and the valley for hours together.Must visit in lifetime, took thousands of photos, since it was raining on the day we went there had to return a little early"], ["Reviewed 2 weeks ago", 4.0, "Hubbies, bday", "This place is as beautiful as any picture, however DO NOT GO during holidays...the lines (in cars) were long. I plan to go again on an off season in the Spring or Summer to see more"], ["Reviewed 2 weeks ago", 4.0, "Breath taking. Watch weather. Except crowds.", "Beautiful place with the giant granite mountains rising around you and the crystal flowing river. Water falls all around. Weather changes quickly. Expect crowds."], ["Reviewed 2 weeks ago", 5.0, "Crowded and Intimidating - But So Beautiful", "Our first day was very frustrating, because it is very crowded and if you dno't know your way around, it can be intimidating to find parking, food, even the sites. But once we got our bearings, we had a great time and enjoyed the sights and the trails. One thing we found helpful was parking the car and renting a bike to get around the valley.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Great place but wow, crowded!", "Obviously the valley and massive rocks are the reason for the Park. However on our visit this area was a traffic jam of buses, vans and cars. Thought October was off season, but obviously there isn't one! Parking was a real headache would think you were going to a concert!!\nYou have to go and see, but for us we were glad there are lots of other areas in the park to relax.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "off season visits", "We go to Upper Pines Campground every November. No crowds, hiking is great, campground fairly quiet. (We have learned not to be there over the Thanksgiving weekend or any other holiday...very heavy crowds and you can't drive at all.). Brought our new dog this past November. The dog can only go on paved pathways which limited any hiking up to the high country. But you can still go on many walks as there is a great paved path system throughout the valley. The store is well stocked if you need anything. We always have a great time.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "What a beautiful place!", "We rented a car from San Francisco airport ( with 4x4) in winter to drive 3 hrs to the Park. When going in winter , it is good to watch the weather forecasts and to be aware of the road closures. Wintertime restricts you to Yosemite Valley. The drive is nice and a bit curvy as you approach the park. Always good to go prepared with food and snacks because there is not much around. The park itself has a well stocked market, and you can get prepared sandwiches and coffee at a store close to the market and visitor center. There is a shuttle bus within the park along the valley so you can park the car in visitor parking and take the shuttle to where you need ( they come every 20 minutes). Always good to go to the visitor center and talk to the ranger about what types of things you want to do and experience or what type of trails or sites you want to see with time frame involved. Good to dress in layers as we experienced a variety of temperatures.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "Beautiful", "Yosemite is beautiful in every direction and the valley is included. Looking up and seeing all the mountains and waterfalls is one of the best spots in nature."], ["Reviewed 4 weeks ago", 5.0, "Aaesome", "I never understand why these kinds d places are up for review. If you do Yosemite you obviously do Yosemite valley.\nAnyway. Beautiful picnic places along the river and the valley loop is accessible and a good day. Views everywhere. Yosemite is great as there are hard hikes but also very accessible areas. Good for everyone!\nShow less"], ["Reviewed 4 weeks ago", 5.0, "Amazingly beautiful!", "Pictures do no justice to yosemite valley. It was truly one of the most beautiful and idyllic placed i have seen - green lush valleys, flowing rivers and waterfalls. Definitely recommend"], ["Reviewed January 24, 2018", 5.0, "One of a kind", "Having lived in California my whole life, I have always wanted to visit the Yosemite. Pictures, as beautiful as they may be, do not do it justice. Once inside the park, you are reminded of how small you are as your jaw drops in awe. After doing a few hikes here, my girlfriend and I have decided we are still amateurs. Many of the hikes have safe routes to lead you to the specific attractions but many people disregard the safe routes. As they ignore the \"Danger. You can die past this point\" signs, they attempt to get closer to one of the many waterfalls. I was one of these people and luckily I made it down safe. I do warn that it is treacherous and serious injury or death can occur whether or not you use caution. My plan for when I return is to finish the upper Yosemite falls hike. It is 8 hours round trip and takes you to the very top, allowing you to get a panoramic view of the whole park.\nShow less"], ["Reviewed January 22, 2018", 5.0, "What more can be said", "Words don’t really do this wonderful place justice. Absolutely stunning. We had the tour we booked cancelled due to the forest fires, but managed to get on another (Valley Floor tour). Our guide was thoroughly interesting and insightful, but kept it light with a few laughs here and there. You can’t take a bad photo here.\n\nOne of my favourite places on earth, would return in a heartbeat.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Concessionaire weak player in over-all experience", "With a few exceptions, the glory of the valley and the stunning experience that is Yosemite, is poorly delivered to the public via the parks concessionaire. They were more concerned about their employees comfort than the comfort of the their guests. We spent four days in the valley and we were amazed at the lack of hospitality. Restaurants were closed and the ones opened were reminiscent of a school cafeteria. For example, the main restaurant at the lodge did not have water. Instead they gave us a paper cup and told us to fill it up, using the fountain by the bathrooms in the lobby. Temperatures were cold and yet generally they would not build a fire in the fireplaces. The only feed back we got was that kindling was expensive and the wood was frozen. However there was a decorative fire at the deli and ice skating rink. The Awahnee had a deceit fire with a place to seat and enjoy the ambiance. They missed an opportunity to offer warmth and hospitality to the guest by lighting a fire in the game room and ice skating rink in Curry Village. Also at Degnan Deli their larger fireplace remained unused. Only the concessionaire’s convenience was taken into account when they required skaters to walk from the rink to the front desk at Curry Village to buy skating tickets. Then later, when you want the hot cocoa at the warming hut, you have to walk back to the front desk, approximately between 200-300 yards. This sounds petty but we have been coming to this park at the same time each year for 20+ years. This has been the poorest level of service we have experience in this time.\nShow less"], ["Reviewed January 21, 2018", 5.0, "Perfect Getaway!", "Getting there is half the fun, but once you track over the mountains and keeping saying to yourself \"are we there yet\" low and behold there it is!! An Awesome inspiring capture in time!!"], ["Reviewed January 21, 2018", 5.0, "Amazing Place", "One of the most outstanding places I've ever visited.\nIf you're touring the West Coast make sure you spend some time in Yosemite and if you've only got one day - make it a long one.\nThere's so much walking to do to see all of the sights you need to get here early (just to miss the traffic) and plan to be here all day and into the evening.\nThe views are sensational from the valley floor and once you get into the centre you'll want to be climbing up into the mountains to get some of the spectacular waterfall views. Each of these climbs is 3-4 hours so choose carefully. If you fancy staying on the flat then its easy to see lower Yosemite falls and walk all around Mirror Lake.\nHowever:\nThe Park is poorly organised - there's a shuttle bus to get around on but we ended up walking everywhere as the bus was always full. Signs said the park was full all weekend but it wasn't. We didn't see any of the Park Rangers and there is a lack of good places in the Valley to eat - take your own food as it can be a long way between stops. There are lots of places to refill water bottles though.\nThe tourist map is not very good and doesn't give much of an indication of the elevations on several walks or the distances/time involved - do your research first.\nIn April to June there are spectacular waterfalls but I've also been in August when Yosemite Falls was dry and Mirror Lake was a puddle.\nWe were there at the end of May and saw a Mother bear and her cub on the walk beyond Mirror Lake.\nGo prepared and have an excellent time.\nShow less"], ["Reviewed January 16, 2018", 5.0, "Amazing!", "Yosemite National Park is so beautiful.... words can't describe it! It's definitely worth a visit, to see the amazing scenery everywhere you look! It's nice to take the shuttle, and stop at various sights around the park."], ["Reviewed January 14, 2018", 5.0, "Like few places on earth", "The first thing you've got to do is watch the Youtube and read up on the geology of the Yosemite Valley. Then, drive into the valley and you'll be SHOCKED. There's nowhere on earth where you've 1000-foot got walls on 3 of 4 sides almost always.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Great Views", "The valley floor offers a multitude of views, endless really to see all the sights within the valley. The valley offers a loop trail that you can walk for any length or time depending on your endurance. The total walk would be a little over 13 miles but is convenient for shorter stints depending on your desires. For those who enjoy photography this is a gem of nature.\nShow less"], ["Reviewed January 14, 2018", 5.0, "Splendid Views!", "This place is magical and calming. The valley has many trails and stopping points for picnic lunches and photo opportunities. Due to the congestion of tour buses I would suggest parking near the village and walking along the trails or renting a bike and take in the views at a slower pace.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Nature at its best!", "This is such an amazing place to visit. The views in every direction are incredible and very accessible to all ages and abilities. Once you’re in the valley, there are short walks to waterfalls and the surrounds and the information centre gives you great information on longer walks available to do. We had two young boys (6&7 year olds) and we had a great time walking around the valley, as well as frolicking in the snow and having hot chocolates by the fire. Such a gorgeous place to show nature’s wonders.\nShow less"], ["Reviewed January 9, 2018", 5.0, "AWE Inspiring", "This place is definitely worth a visit. Lots and Lots of hiking trails. But it is great to spend a day in the Valley even if you are not a \"Treker/Walker\"\nThe mountains around you are AWE inspiring. The river has the clearest water that I have ever seen.\nThis Valley can be viewed from the seat of you car, by parking at the car photo stops and strolling around or by hiking the Trails.\nA must See!!\nShow less"], ["Reviewed January 7, 2018", 5.0, "Breathtaking", "We drive 300 miles out of our way to visit this place and every travel minute was worth it. Spectacular is an understatement. What an experience, the scenery, the hikes, the waterfalls and the facilities are fantastic. We saw lots of pets and children but we were thankful it was just us as pets and children don’t value the experience.\nShow less"], ["Reviewed January 3, 2018", 5.0, "Pretty!!!", "This is a beautiful area! If you go to Yosemite, you must stop here! You get great pics of all of the surrounding mountain ranges!"], ["Reviewed January 2, 2018", 5.0, "Stunning view", "Easily a wonder of the world type of view. Makes me want more land put aside in the midst of suburban sprawl for future generations."], ["Reviewed December 29, 2017", 5.0, "Sun Set is amazing!", "We did not plan enough time here as there are wonderful paved hiking trails all rated as to increase the experience with some trails are for seasoned hikers and others for casual walkers. You can shuttle to your trail head, do your hike and then shuttle to next, all included in your admission. Parking and road congestion is here as they do get a large volume of visitors. There is a place to get eats in the park but it was very crowded so plan ahead. Do not leave before sunset or you will miss the most amazing sunset of your life. Yes, it is that good. We viewed it from the tunnel on the way out, as did a couple of hundred others. Overall, spend a few days in the park, chill out, do trails & enjoy nature at it's best!\nShow less"], ["Reviewed December 26, 2017", 5.0, "One of the most gorgeous places", "It is a beautiful place. It was my second time in the Yosemite and enjoyed it very much. It is a huge National Park with lots of wilderness, the perfect place for nature lovers. Even in two or three days you will see only a little. The 3-day camping adventure was fantastic and I enjoyed every minutes in the park. In the valley it is often very busy. If you have more time try to escape and to enjoy the longer hikes which are more away from the tourists as we did. There are also many walks in the valley and with the free shuttle service it is easy to go around. The end of September we could still see all waterfalls, that was just wonderful. Not to forget all the viewpoints were you can stop for a few minutes to enjoy the spectacular view. Wear comfortable shoes and clothes which for warm and cold weather condition. It can change quickly. It is a must see if you travel around in California.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Took the floor tour", "It is amazing that we waited so long to visit - words cannot do the views justice - just an awe inspiring place. The best national park and we will return in 2019!!"], ["Reviewed December 24, 2017", 5.0, "Crystal Clear Stream beneath Majestic Rock Face", "This stream was beginning to freeze as winter was approaching. Although about 18 inches deep, it was crystal clear like fine glass. The stream meandered along at a slow pace with no sign on animal life.\nThe view and walk along the stream is so relaxing and as inspiring as you look up at the majestic rock formations. Nothing like it.\nShow less"], ["Reviewed December 24, 2017", 5.0, "Allow two or more days", "The park is huge and has many sights to see, so you must allow at least two days/ one overnight at the park to visit some of it. Bring your tire chains because they sell for around 60 dollars a par. Also learn how to put it because they charge 40 bucks to set it.\nShow less"], ["Reviewed December 23, 2017", 5.0, "Awe inspiring views", "A gorgeous national park with so many places to hike. I would recommend taking a guided tour on your first visit. Didn’t expect the traffic and crowds of tourists that get worse throughout the day. Go early for a more peaceful and inspiring visit."], ["Reviewed December 23, 2017", 5.0, "Yosemite mountains", "Amazing drive through the mountains , awsome water falls , hikes , mountain climbing , mountain biking area . Really loved the area , and would recommend to travel there , and to stay there and wake up to snow wow breathless"], ["Reviewed December 21, 2017", 5.0, "One of the most spectacular places in California", "A must see for anyone interested in history and spectacular scenery. It is very crowded in summer. Less so the rest of the year."], ["Reviewed December 14, 2017", 5.0, "One of the most beautiful places on earth!", "I have been here multiple times and will never tire of this place. The waterfalls, hikes, bike rides, rock formations, camping and so much more. Best way to get around is a bike, either bring one or rent one. Find a favorite spot on a trail, meadow or by the river and you can't go wrong. The only crime would be to have only one day in this little slice of heaven.\nShow less"], ["Reviewed December 13, 2017", 5.0, "So much to see, so little time", "In order to explore Yosemite properly, you would need a lifetime as it's ever changing and there is so much to see.\n\nWe did a one day tour which gave us a quick overview of the park, but it certainly did not come anywhere to being close to enough.\n\nWe've been enchanted by the magic of the park and we're already making plans for an extended return visit in the future.\nShow less"], ["Reviewed December 10, 2017", 5.0, "Very Special", "Yosemite Valley is also an essential place to visit while here. So many photographic opportunities to get."], ["Reviewed December 7, 2017", 5.0, "Tour with Gray Line", "Excellent tour! Our driver and guide Chablis was wonderful; making a number of photo opportunity pit-stops for us and great recommendations of what areas within Yosemite we should visit in out spre time. If you can, hop on a tour he is running. As for Yosemite National Park, stunning! With Gray Line we had ~3 hours to do our own thing and with the free shuttle bus service within Yosemite, it was so easy to get around. No black bears on the day but there was a family of deer and a bobcat who was too fast for my to snap a photo of. Amazing scenery and plenty of places to rest your tired feet.\n\nShow less"], ["Reviewed December 7, 2017", 4.0, "Full of awesomeness", "It’s an amazing place to visit in summer. All the falls views are breathtaking. Specially the Glacier Point is a perfect travel goal for nature lovers."], ["Reviewed December 3, 2017", 5.0, "Loved every minute", "I loved Yosemite. The scenery is absolutely phenomenal. One of the most beautiful places I have ever visited. We went end of November and there were NO crowds. We basically had the park to ourselves. If you can manage the cold I would recommend doing that. The only snag is that glacier point road is closed from mid November.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Words cannot des....", "The past 2 years I spent working and traveling the USA, spending my summers as a counselor at a camp; looking after amazing children in the Adirondack mountain range in NY; then traveling around before and afterwards. I've seen alot, experienced alot and had my fair share of awesome adventures in the world but this.....\n\nThis place is by far the highlight of it all. Yosemite Valley is beautiful, you have so much to see when you visit this place; the views will literally stun you and send chills through your body.\n\nBe wary though, all the wildlife is protected and even attempting to feed an adorable local critter could see you with a hefty fine, so appreciate with your eyes and shoot with your camera, nothing else.\n\nMake sure you don't miss tunnel view, it's superb and don't worry if you can't find camping spots in the area, there are areas at the end of the park when you drive down the scarily steep mountainside.\nShow less"], ["Reviewed December 2, 2017", 5.0, "Exquisite place", "dont you leave california without seeing this place.. this is so so beautiful,, you go with family or friends you got all the ambience you need.. please do stay there for at least 4 days.. its worth it.."], ["Reviewed December 2, 2017", 5.0, "Stunning", "Yosemite was the saviour of my trip to America, I did not really enjoy the cities at all but when I arrived in Yosemite I was completely dumbfounded at the sheer vastness and beauty of this national park.\n\nIt too was a blessing to see a family of deer pass by.\n\nIf ever I am to return to the states it would surely be for places like this, national parks, because this is the true beauty of the land\nShow less"], ["Reviewed November 30, 2017", 5.0, "Beautiful place, gorgeous views", "My very first visit to Yosemite Valley while in the Bay area on business. Such a beautiful beautiful place. Immediately upon entering Yosemite Village, saw Bridal Veil Falls and El Capitan. Took shuttle to Half Dome. Parking was not a problem with an 8am arrival. Will definitely go back.\nShow less"], ["Reviewed November 28, 2017", 5.0, "Very beautiful and nice.", "Very beautiful and nice.Very nice views.The best was the view before the tunnel, from there you can see the whole valley. Easy to drive around the valley by car. Good signs."], ["Reviewed November 26, 2017", 5.0, "Great", "Yosemite Valley was beautiful! Very busy but not so much that we could not see what we wanted to see. Definitely worth a look!"], ["Reviewed November 26, 2017", 5.0, "Wonderful in late fall", "I went during Thanksgiving. Yes, it was still crowded. But knowing this would be the case made me plan accordingly. I got to the park each day at DAWN. Perfect. Was able to enjoy views and hikes w/o a ton of people.\nThe valley changes with the seasons so do your research.\nThis is still one of the most beautiful places on the planet. I am already planning a return trip for Spring.\nShow less"], ["Reviewed November 25, 2017", 4.0, "Beautiful among the beautifeul", "When we reached the area the road was wet and we came to know that it was raining the whole of yesterday. There we was a waterfall in the Park. In dry season the waterfall never existed. It is wonder to see the waterfall. The mountains were also beautiful to see and to take pictures.\nCareful when you drive as the were some repairs going on along the Yosemite valley. . After having lunch in the restaurant. we walked in the forest for about half an hour. The park is very beautiful and maintained in a beautiful manner. I must thank the people who took care to keep the area beautiful.\nShow less"], ["Reviewed November 25, 2017", 5.0, "Amazing!!!!", "This was a truly amazing place to visit! The geology is awesome and the landscape can only be described and awe inspiring. Many of the walks are very easy and have a big pay off so I can only imagine the longer more difficult one would be sooo worth the effort! I will definitely be going back again one day! The facilities available in Yosemite village are comprehensive and helpful.\nShow less"], ["Reviewed November 22, 2017", 4.0, "One of the best in Ca", "Last time I came to Yosemite was over 25 years ago and it’s still as beautiful then as it is now with the exception of the ton of people going into the park with cars. It was very difficult to find parking when in the Valley. If you find parking, consider yourself lucky...best advice is to get there when the park opens if ur staying outside.\n\nThe views are amazing and awe inspiring.\nShow less"], ["Reviewed November 21, 2017", 5.0, "Just nature!", "This place is a must for everyone who wants to discover California's treasure! In November there are still waterfalls, colorful trails, all around the valley and up to the mountains for who likes hiking! Let's do it!!"], ["Reviewed November 20, 2017", 4.0, "Nature Beauty", "It was the Grandness of the National park and the prestine beauty that makes your heart skip a beat!! Its a glorious place of wonder and if you love nature its a must visit!"], ["Reviewed November 18, 2017", 5.0, "BEAUTIFUL", "place was so beautiful went with my whole family waterfalls were so cool we got amazing pictures a lot of people were there which was the worst thing about it but other than that it was amazing"], ["Reviewed November 17, 2017", 5.0, "yosemite valley - nature's gift", "we visited yosemite valley from santa clara by drive. started at early morning 6.30am and reached around 10am. driving adjacent to merced river is wonderful experience. we stopped at every scenic view while driving in and around yosemite. if you want to cover everything i do suggest to stay over night and experience the nature. perfect to start at bay area saturday morning and return back sunday sunset at yosemite.\nShow less"], ["Reviewed November 16, 2017", 5.0, "You don't want to miss this!", "One of my favorite places on earth! The magnificence and beauty is breath taking!!!!! Plan to spend some time there. You won't regret it."], ["Reviewed November 15, 2017", 5.0, "Spactacular views", "I was surprised how well they managed traffic during peak season. It wasn't too hot either, but plan on bringing drinking water. Cell signal is hit or miss throughout the park."], ["Reviewed November 15, 2017", 5.0, "This Place is Simply Incredible", "What a National Treasure! Yosemite is stunning, beautiful, awesome. You really have to go see and experience it in person. No picture(s) can do it justice. Just to stand and take in the beauty, scenery, and vistas is to know it's magnificence. The cliffs, valleys, streams, forests, wildlife. Everything is there. Great roads, and exhibits. You just have to go and see for yourself. Spellbinding place. Cannot wait to return in a different season.\nShow less"], ["Reviewed November 15, 2017", 5.0, "Stunning place", "This place, you may not skipp if you visite Yosemite NP. It's an amazing place to enjoy the fabulous scenery/nature, take good walks/hikes and relax. Loved every minute we've spend here."], ["Reviewed November 14, 2017", 5.0, "Mesmerising 😍", "We booked a guided tour of this beautiful place through trip advisor. And it was worth every penny! It’s located outside of San Francisco which gives you a chance to soak in the Californian country side which was beautiful! Our guide ‘PHIL’ made it a memory of lifetime with his charismatic personality and informative interactions throughout this whole trip. Not even single full moment with this guy! Got to know sooooo much about San Francisco and it’s neighbouring towns. It was autumn time and beauty at its best with leaves in varied hues creating a visual impact so mesmerising as if you have entered some fairyland with red giant trees and greens and yellows and pinks everywhere!\nShow less"], ["Reviewed November 14, 2017", 5.0, "Beautiful and peaceful", "Very beautiful place. We had gone in the fall season (Oct 2016), and some of the falls had dried off. But then it rained overnight and there were small \"falls\" all over the place. So beautiful, never seen anything like it !"], ["Reviewed November 13, 2017", 4.0, "Brilliant scenery - but a couple of niggles", "Totally worth going, at least one whole day or more. Take a spare battery for camera.\nTiny moans - carparking (we used YARTS; but why do they allow more cars in than there are parking? we saw some people circling for ages trying to park, and the queu to leave would have ruined my day). Also the seasonal closure and signing is rather lax. We trekked across the valley to a cafe, which had open signs but had shut (the info at Visitor Centre should be correct)\nShow less"], ["Reviewed November 10, 2017", 5.0, "Absolutely amazing!", "This park is so beautiful and it offers so many different types of scenery. I enjoyed my time here very much. Also for smaller children they have a junior ranger challenge which was fun to be a witness of. The views are absolutely magnificent. If you can, go for more than one day, but if you cannot, like i had, still go for that one day. It will be worth your while! The park rangers are super friendly and helpful too, which made the experience even better.\nShow less"], ["Reviewed November 10, 2017", 5.0, "Fall 2017", "You could spend days down in there he valley!! And become one with nature for real!! So much to see, beauty all around you!! The weather was great!!"], ["Reviewed November 10, 2017", 5.0, "It's Yosemite", "What a wonderful place. A beautiful valley in a park that is one of the most amazing places there is. Get out of your car and walk. It can be horribly crowded most of the time."], ["Reviewed November 9, 2017", 5.0, "The Lovely Yosemite Valley", "Though it gets crowded sometimes, staying in Yosemite Valley is a must for a short visit in Yosemite. A walk along the valley is more than enough to savor the beauty that is Yosemite. Would love to be back!"], ["Reviewed November 9, 2017", 5.0, "Busy even in the off season", "This was a three day two night trip to miss the summer rush. It was still busy midweek in late September but not bumper to bumper. We hoped the falls would still be flowing and weren’t disappointed. Nice and relaxing quick getaway."], ["Reviewed November 9, 2017", 5.0, "One of the most beautiful places on Earth!", "The views are stellar, the walks and hiking magnificent, and the wildlife amazing. This is a must-see destination. Plan carefully or get stuck in terrible valley traffic, though."], ["Reviewed November 9, 2017", 5.0, "An absolute highlight!!", "We loved our 2 days spent exploring Yosemite - you think you have just seen the most amazing sight and then you turn a corner and an even better one appears!! I agree with some of the other reviewers, that this should be designated as the 8th Wonder of the World!!\nShow less"], ["Reviewed November 8, 2017", 5.0, "Never fails to amaze", "There are many sites around the world that truly need to be experienced. You will be compelled to take photos, but even Ansel Adams can’t capture to breathtaking beauty and scale of this place.\nIconic formations like Half Dome, El Capitan, Bridalveil Falls and Yosemite Falls are must sees. Also take time to take in the history of Yosemite.\nCosts $30 a car to come in to the park. The park runs shuttle busses to most areas, which alleviates some of the parking pains while visiting\nShow less"], ["Reviewed November 8, 2017", 5.0, "CA Trip 2017", "Beautiful National Park without the crowds. Beautiful scenery and weather was perfect! From the waterfalls to massive rock formations and massive trees. Best time to visit"], ["Reviewed November 8, 2017", 5.0, "One of the wonders of the world", "Lives up to its reputation - truly beautiful and magnificent. We were there in fall - and the colours were simply amazing. Luckily had great weather - despite predictions of rain and snow. Stunning vistas, great walks - the free shuttle service gave us access to do much of the valley and the helpful park services gave us good advice on walks. Simply Amazing!!!\nShow less"], ["Reviewed November 7, 2017", 5.0, "Yosemite", "It’s one of the beautiful national park in the USA.\n\nIt’s would be a nice family vacation. Just looking at the el capital is enjoyable. It’s for everyone one to see, child, adults, and yes seniors, u don’t have to leave the car to see, you see for side of the road. Try to take road 41 to Yosemite National Park.\nShow less"], ["Reviewed November 4, 2017", 5.0, "Stunning natural beauty", "The landacape is so dramatic. Love the way it changes with the different light and clouds. I highly recommend a couple of days in the valley. Pictures cannot do it justice. You have to go and see it for yourself!"], ["Reviewed November 1, 2017", 5.0, "Nature at its best", "This is absolutely the most beautiful place I have ever been to. Amazing views everywhere. Spectacular waterfalls. We got there very early by 7.30 am and there was no problem in finding parking space. Once we parked the car, we took the shuttle to get around the valley. Avoid driving inside the valley as you will not be moving for hours. We did the valley floor tour in the morning which is a two hour tour in an open tram that will take you to some of the viewpoints in the park and took the park shuttle in the afternoon. Got to see the Tunnel view, Yosemite falls, Valley view, El Capitan, Half dome, Mirror lake, Cook's meadow, Vernal falls and Glacier point.\nShow less"], ["Reviewed November 1, 2017", 5.0, "I would live here if I could", "Yosemite valley is very much geared for tourists and things see to work really well. We were there a little outside of the tourist season but nonetheless the park was full but buses make it easy to get around and of course there are some great walks. It's really one of the most beautiful places on the planet.\nShow less"], ["Reviewed October 31, 2017", 5.0, "It's like nothing you've seen before...", "Coming from England I would consider myself lucky when it comes to \"National Parks\" and greeny... but Yosemite...\n\nI was really looking forward to coming here as my friend had been in the year before and his photos looked amazing.\n\nIt was fantastic !!! We spent a few hours here arrived at around 10am left at 4ish, my only regret is that We couldn't spend more time, (I was on a tour )\n\nThere was a choice of two trails a beginner type one and a more intense one, we choose the more intense one....\n\nNot gonna lie it was intense ! We hiked a 3 mile walk (there and back) to the top of the waterfall on the way down there was times that were terrifying for me but it's like nothing I have ever done before !!\nThe views were spectacular,\n\nYou need to make sure you have enough liquids and snacks for your walk, us girls are fit 27-31 year olds and had to stop\nA few times to catch our breath... plus I mean your in California it's not exactly cold.\n\nThere is a little shuttle bus that transports you around the park, and you can get off at lots of different stops, there is places to buy gifts and places to eat, it's such a huge place you could easily spend two days here, I only touched on some of the park but as mentioned was on a time constraint,\n\nDefiantly a tick bucket list, a beautiful place to get back to nature so glad I've seen it with my own eyes.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Beautiful and Unique", "We were passing through the park, entering through the tioga pass, from there you can see the exuberant nature of the Californian forest, animals, and a sky that does not end. Stunning stone towers in the midst of vegetation, and the water falling bridalveil is imponent.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Awe-Inspiring", "Yosemite Valley is awe inspiring, unique, beautiful, spectacular – yes, I was impressed. There cannot be many places on this planet as gorgeous, from a pure scenery perspective, as this valley. Although the national park is huge, the valley itself is relatively compact and fairly easy to see in a few hours if you want the quick version. Private cars are still allowed her so you can drive it yourself, although open-seating buses (really a truck pulling a wagon with about 30 seats) will take you around for a narrated, guided tour. We opted not to do this, visiting in mid-October, partly because it was already getting cool but mostly due to the smoke in the air due to many fires burning in Northern California. Even this late in the season the valley is crowded, and we sat in lines of cars, hardly moving, for over 30 minutes twice. The situation was not helped by road construction, but hotel staff told us it is always this congested; worse at the height of the season. Despite the crowds and the congestion, this place is a must-see experience. Take LOTS of pictures. Another reviewer commented that no matter how many pictures you take, you will wish you had taken more – and I agree. I regret not being able to get to see the view from Glacier Point which overlooks the valley – during our visit the visibility was very poor due to the smoke. I intend to go back soon and fill this square.\nShow less"], ["Reviewed October 29, 2017", 5.0, "A wonderful experience in fall", "The autumn landscape may not match the legendary fall colours of New England but the light is fabulous and crowds thinning so would be an excellent time to visit for hikers and photographers alike."], ["Reviewed October 29, 2017", 5.0, "Stunning views that are easy to see", "You can still drive your car here & the park has made it fairly easy to get around & see all of the sights. There was a lot of road construction while we were there that made some places hard to get to, but you can quickly drive the entire valley again if you miss something the first time. However it us best to get there early in the morning to avoid the crowds.\nShow less"], ["Reviewed October 29, 2017", 5.0, "Amazing visit to Yosemite", "We drove from Sonora and entered at Big Oak Flat Road gate. The ride from Sonora to the gate was beautiful and very windy. We took turns driving so we could both enjoy the scenery on the way to the park and inside the park. The driver needs to fully concentrate on the road at all times.Every so often when I was the driver, my guy would exclaim \"look at that!\" I responded that \"I would love to, but really can't\".\nWe drove to the park each morning for three days. We had a plan and a back-up plan for each day's activity. That turned out to be good planning because the day we wanted to hike part of the John Muir Trail to Cathedral Lake, the Tioga Pass was closed due to snow. We went the next day and were rewarded with a gorgeous Alpine lake to sit beside and eat our packed lunch. It is very hard to \"review\" one of the most beautiful places in the United States. To say that we were awed doesn't even begin to express the wonder we felt. I wish that every American could experience this national park.\nShow less"], ["Reviewed October 28, 2017", 5.0, "Stunning landscapes", "The most amazing place I have ever visited. We took the Amtrak from San Francisco to Merced. There we were met by the YARTS bus to take us to the Yosemite valley lodge. It stops at the towns and other hotels on the way so there are a variety of accomodation choices which we were unaware of when booking.\nOnce in the valley there is a continuous shuttle service to places of interest so you do not need to hire a car. Bicycle hire is also available and a great way to get around.\nFirst impressions are the massive vertical cliffs lining the valley filled with meadows, tall trees and creeks on the valley floor. There are many hikes that are well sign posted but unfortunately we didn't plan sufficient time to do them. Instead we did a self guided photographic tour of the easily accessible sites using the shuttle service and free maps. We also took a 4hr guided tour to Glacier point where the moon surface like scenery is spectacular. Hikes can also be done from here to the valley floor below.\nAnimal life was in abundance with numerous birds, squirrels, deer and a wildcat seen. We saw bear sign but no bears which I was hoping to see.\nI'm already planning my next trip back where I will spend 1 week.\nThe location is popular with locals so I would not recommend staying during US school holidays. Be aware that the weather can change dramatically and the day I left (27 degrees Celsius) there was snow overnight.\nShow less"], ["Reviewed October 27, 2017", 5.0, "Breathtaking", "It takes a good 30 minutes to get from the park entrance to the valley floor. The sign posts along the route are very clear. Once you are on the Valley Floor you'll see El Capitan on the main road - follow this road and you go on a one-way loop around the main attractions. There are separate tracks to other famous sights - again these are well sign posted.\n\nIt gets very busy but there is plenty of parking dotted around - so you'll be able to get the shots you need.\n\nAt the heart of the Valley Floor there is a lodge and a close by a giftshop and restaurant. There are also a number of large camp sites.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Holiday", "We visited Yosemite in September it is an amazing place. You have to pay to enter the national park so it is best to pay for all national parks as it works out cheaper. There is lots to do we only stayed for 2 nights but you could do longer. There are many places to stay we stayed in a home we got off home away It was amazing.\nShow less"], ["Reviewed October 26, 2017", 4.0, "The heart of the park; lots of good things to see here", "This is the heart of the park, and you will certainly end driving through and stopping in the valley given the large number of sites to see, from El Capitan to the various falls, to getting something to eat, etc. It is nice and generally scenic, but in some ways it is poorly laid out. Parking is a bit of a hike from the visitor’s center, and generally it seems like things could have just been planned better. However, there are plenty of great things to see in the valley, nice hikes to go on, and some great waterfalls, so it remains on the must see list when you visit the part.\nShow less"], ["Reviewed October 26, 2017", 5.0, "Document the Amazing - Follow this advise, Thank me later.", "Breathtaking!\nAwe Inspiring!\nIncredible!\nFirstly, purchase yourself an external backup charger for your cell phone, You won't regret having the ability to better document this experience.\nSecondly, My next best advise would be to . . .Take your time!\nBegin early as you ascend to the crest, stopping at the various scenic parking areas to document via video or photo as much as possible.\nTake your time!\nUpon arrival at the venerable El Capitan stop and breathe in,\nAgain document!\nExit your car and explore the beautiful Tuolumne Meadows\nTake your time!\nSee the Half Dome, Valley View, Tunnel View, Yosemite Falls and Cathedral Peak\nDocument!\nWrite a poem!\nTake your time!\nNo matter how many photos and video you have, I promise you that you will want for more.\nAs you descend the valley, continue the recommended procedure.\nTake your time\nDocument the scenery, yourself,friends,family and loved ones.\nThank me later\nShow less"], ["Reviewed October 25, 2017", 3.0, "A Victim of Its Popularity", "Yes, there are some very impressive and iconic things to see, but the crowds and traffic, even during the week, significantly impact the experience. In addition, when we went (September) a couple main park areas were inaccessible due to renovations, and road work made getting into the valley and visitor center arduous. It's worth spending a day or two there, but we felt our time was much better spent at Sequoia/Kings Canyon, and, in driving across the top of Yosemite to the Tioga Pass.\nShow less"], ["Reviewed October 24, 2017", 5.0, "Breathtaking", "Yosemite was amazing. It was like being somewhere surreal. The scenery and views were amazing . We stayed at tenaya lodge and found out how lucky we were to get booked as accommodation does get snapped up early here. If you don't mind tents then leave planning your trip until last minute but I like my comforts. Yosemite isn't supposed be the height of luxury but instead, getting back to nature and enjoying what the greater source created. The lakes and mountains really took my breath away. The hotel was very nice and had everything we needed. The food was good and the wine was divine. If you're up in San Francisco then Yosemite is well worth the visit. We stayed three nights which was enough but you could easily stay a week. It's great if you want to drive around with maps and do your own tour or if you wAnt planned organised routes with guides. It's a real outdoor retreat for walkers and hikers. Campers and climbers. Great for families and couples and groups. You can also hire cycles to ride around on and there's a train to take you to and from and around the village which hosts a convenience store. There is also a petrol station in the village. Everywhere I've visited in California has been different for all sorts of reasons and this place shouldn't be missed. If you are planning somewhere else afterwards then I recommend a trip to napa or Lake Tahoe.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Wow! Just wow!", "This was my first visit to Yosemite and it won't be my last! The views were amazing.\nWe were high up on the trails and it wasn't that congested, but on the Valley floor it was bedlam.\nDO NOT count on the shuttle bus, they were just awful.!\nAlso don't bother going up to Bridalvail Falls. You can see it from the road. The viewing area is very tiny and there are hundreds of people trying to squeeze in, all competing for the best place to shoot their pictures.\nDo take time to go hiking. What a treat!!\nShow less"], ["Reviewed October 23, 2017", 3.0, "Road works. What a mess", "The valley has many road works and wait periods this time of year. Many shops are also closed for the season. The valley itself is not very big but traffic is slow."], ["Reviewed October 23, 2017", 4.0, "Grand, but busy", "This was a first visit to Yosemite, on a weekday in October. The Valley was full of tourist busses and crowded. Excursions out of the Valley were virtually unoccupied."], ["Reviewed October 23, 2017", 4.0, "Great place to visit", "Difficulty parking an RV, eventually parked at Yosemite Valley Lodge, car park 7, if you come in the summer months I would definitely advise a shuttle in, if one is available. Or get in early or,you could risk not being able to park. Shuttle buses are free inside the park, ask for a shuttle map which is much better than the map they give you when you go in to the park.\nWe visited the Bridal veil Falls, only a short easy walk, not much water at this time of the year. Also visited Lower Yosemite Falls, again not so much water but certainly a site to see. Lastly we walked up to Mirror Lake and came back down the Valley Loop route, quite uneven but no people on it and about 3 miles.\nShow less"], ["Reviewed October 23, 2017", 5.0, "Awesome", "We have been here before but it never fails to take our breaths away. Spent a whole day doing the Tioga pass road, as it had been closed when we travelled in from the east. Shame that they decided to open it at 8-45 but did not update their messages for at least half an hour. Hate to think how many hundreds of gallons of gas were burned by people like us driving an extra 200 miles round the south of the mountains!\nShow less"], ["Reviewed October 22, 2017", 4.0, "4.5 stars!", "Did Yosemite as a day trip from San Fran which was never going to give enough time but gave a good taster. It’s a long way but worth it. Beautiful views! Loses half a star as could do with better signs and maps, I found it hard to work out where to go then which way to go and know how far I could go in the time I had. I didn’t dare go too far for fear of getting lost and/or being left behind! But I did find a quiet spot and 2 deer came really close!\n\nWish we could have stopped at more points higher up but sitting on the right of the bus I did get some good glimpses of more magnificent views as we worked our way down to the valley.\nShow less"], ["Reviewed October 21, 2017", 5.0, "Absolutely breathtaking!", "I couldn't write enough to even come ckose to describe the beauty of this park! The wow factor was in every turn, every blink of my eyes.\nIf time is limited there's a great driving / walking / cycle around where the village is situated. It takes you to some magnificent places. Park your car, take a walk the drive a bit further and do the same.\nOf only we could have spent more time there....\nShow less"], ["Reviewed October 20, 2017", 5.0, "Incredible", "This was the trip I had put off for several years and feel so blessed I finally got to go.\n\nNothing prepares you for that first glimpse of El Capitan and Half Dome rising from the valley floor. No photo, video, live cam can do it justice. It was a spiritual experience for me. GOD is AWESOME.\n\nI've been to many National Parks across the U.S. Nothing compares in scope and stark beauty. Waterfalls were at peak flow in the first week of June. Incredible in beauty and raw power. They thunder down the mountains and cool a wide area around the falls. Melting snow pack.\n\nThe main trails are well maintained and marked. There are dangers, this is the wilderness, but for the most part hazards are identified. Visitors are warned with graphic visuals and signs about deaths that have occurred when rules and restrictions are violated by the public.\n\nSome of the Rangers are very rude, especially when you are driving cautiously to avoid hitting pedestrians who might dart out in front of you. They want you to hurry past walkways to keep traffic moving because children are going to obey their hand signals. Since when?\n\nA blade of grass is precious to the Rangers, but the feelings of a little elderly woman will be visciously and publically stepped on when they stray from a path. Paths that, in the Village, are poorly marked, contradictory and downright confusing.\n\nGet to the park at 5:00 a.m. to avoid traffic and find parking. Period. Any later and it's first come, first serve. And you don't have to pay to go in at that hour, so sleep in and you lose out.\n\nA great experience, absent the rude, impatient, unprofessional and short tempered park rangers.\nShow less"], ["Reviewed October 20, 2017", 4.0, "Beautiful but touristy", "Beautiful valley offering stunning views on all the mountains. During the day it is very crowded. You can drive around and there a plenty campgrounds and parking spots."], ["Reviewed October 20, 2017", 5.0, "Scale & Beauty Beyond Description!!", "Whilst Yosemite was always on the California Trip list none of the photographs could prepare us for the sheer scale, beauty and quiet of Yosemite Valley. Whether you look at Half Dome, El Capitan or Mirror Lake you will be totally smitten, your camera won't do the place justice and you'll be lost for words with this wonder of the natural world.\n\nWhat is odd is that despite the number of people in the valley it still retains the sense of being in a church and being surrounded by quiet.\n\nWe only managed to spend a day and a night here and wish that we could have spent longer (especially as the views change dramatically with the light). We chose to camp in Lower Pines (the smaller of the two camp sites) in a tent and it was perfect for feeling close to nature.\n\nNeed to know:\n1. Cost: It costs $30 per car to enter the National Park.\n2. Bears: You need to keep food in the bear proof containers provided (in camp sites and parking lots) for safety and to avoid a fine.\n3. Transportation:There is a free shuttle bus that rounds around the valley. So hop on and leave the car behind.\n4. Accommodation: Make sure that you book well in advance (camp sites and lodges tend to be booked a year in advance by most so be prepared to plan well ahead).\n\nTip: Don't forget to visit the sequoia trees whilst you are in the park. Mariposa Grove is a great favourite (to the south of the park) but this was closed when we were there. We visited Tuolumne Grove instead and were blown away by their sheer size.\n\nCalifornia boasts a glorious coastline but it would be a mistake not to visit Yosemite Valley!\nShow less"], ["Reviewed October 19, 2017", 5.0, "A must-visit place!", "Yosemite Valley is such a stunningly beautiful place that you can spend a week down there and never get bored or see the same thing twice (although you may want to). Make sure to visit at least once in your life!"], ["Reviewed October 18, 2017", 5.0, "Fantastic", "A trip to Yosemite Valley is great for everyone. There are fabulous views of mountains, waterfalls, trees, grass, a pond, a lake, and the Merced river. There are many beautiful hikes ranging from ones that are challenging to ones that are wheelchair accessible. There are also many different kinds of lodging from a luxurious hotel with a golf course to back woods camping. There are several intermediate types of lodging Food is also available from the hotel restaurants, a food court, a pizzeria, fast food place, deli, and a convenience store for those who wish to prepare their own food. There are gift shops in several valley locations and don’t skip the Ansel Adams gallery. There are so many things available for travelers to the Yosemite Valley, which is also a destination for climbers who come from all over to climb El Capitan. We were there just as the trees were changing from summer greenery to autumn splendor. Make your reservation early as this is a popular destination.\nShow less"], ["Reviewed October 17, 2017", 5.0, "Make sure to put Yosemite on you Bucket List", "I live in Alaska so I’m very biased about most places I visit- but Yosemite is definitely a place worth seeing!!!!\nWe brought our kids here for a short 2 day getaway- It is extremely difficult to describe a place that is so massive and leaves you in awe!\nI’ve seen pictures (lots of pictures) but it doesn’t fully complete the image as does seeing a place in person! I never realized how massive EL Capitan and Half Dome are until today! Can I say WOW!!!\n\nI was also impressed from the areas that I saw as to how clean this park is - and how much of the natural habitat is still in place- I do know this is a National Park so there is extra care taken in preserving the natural beauty of the landscape.\n\nWe’re already planning another trip here so we can spend more time. I would recommend spending the night in some of the accommodations inside the park or camping in the campgrounds inside the park- seeming as it takes a least 1-2 hours to drive into the park (depending on road maintenance projects, thousands of people, winding roads and steep hills etc.)Best $30 I’ve spent in a long time!\nShow less"], ["Reviewed October 17, 2017", 4.0, "Glad I visited - not my favorite National park", "We recently spent a day in Yosemite. The highlights are of course, Half Dome from Glacier Point , El Capitan & Yosemite Falls. All are spectacular although managed fires near Glacier Point made vistas unremarkable. The bonus to mid October is the crowds are thinner and except at Yosemite Falls, it di not seem overwhelming. The negative is the waterfalls are at low flow - still wonderful - but not as magnificent. If I were to rate recent National Parks I have visited, I would say there is more diversity of landscape & great animal viewing at Yellowstone & the Grand Tetons (no animal sightings at Yosemite). The distance between the highlights are upwards of an hour through pine forests that are static in landscape. We did not hike here but at elevation, even a walk up to Bridal Falls had us puffing a bit so be prepared. We ate at the Majestic Yosemite Hotel - meal was average but a historic lodge and nice spot for a break. Definitely glad to have visited but do watch the managed fire warning online. They really impact the beauty of the area and hiking ability where set.\nShow less"], ["Reviewed October 17, 2017", 4.0, "Gorgeous but packed", "It's busy, it was way more busy than we expected but it's understandable. Once your out of the car and able to walk around it's easy to see why it's hard to find a parking spot. The place is just stunning, there are lots of people about but it's easy to find quieter spots.\nShow less"], ["Reviewed October 16, 2017", 5.0, "Hiking in Yosemite", "Amazing place to hike. We went after Labor Day. I highly recommend going after the summer rush as crowds are negligible. If you hike Clouds Rest keep an eye out for lightning. We got caught at the top and had to hurry off the summit."], ["Reviewed October 15, 2017", 5.0, "It's a cliche, but...", "It seems daft reviewing Yosemite. It's not like it needs the publicity. But I do feel I need to add to the general \"wow\". I was looking forward to my trip here, but it is genuinely one of the few places that has managed to exceed my already fairly high expectations. We camped a few nights and walked the Panorama trail down from Glacier point. Mind boggling. Go.\nShow less"], ["Reviewed October 15, 2017", 4.0, "Better in Summer", "We stay here only 3 days and we find it is not enough. We hope come here next time in summer and at least stay one week."], ["Reviewed October 15, 2017", 5.0, "What an amazing place, a true marvel of nature", "Just an awesome place to be and enjoy nature. So beautiful and peaceful despite the crowds. So many things to do and see. We can't wait to come back in the spring to see the waterfalls under high flow."], ["Reviewed October 14, 2017", 5.0, "Sooo Impressive!", "We had a friend from Scotland with us. We all couldn't get enough of the views and photo opportunities. We were able to take some fairly easy walks and see many of the wonderful sights available in this amazing place. Fall is a great time to go as the days are still often warm and crowds perhaps a bit thinner. Parking can be a challenge, but with some patience we usually found a place near enough to walk to where we wished to go.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Only one word - AWESOME", "Superlatives are easily bounded around these days but this has to be one of the most awe inspiring places in the USA. At one point I almost cried as I came upon a Sequoia that literally took my breath away. If this place is not on your bucket list you have no soul.\nShow less"], ["Reviewed October 14, 2017", 5.0, "Wonderful Vistas, Diverse Activities", "Loved our recent visit here. Yosemite Valley is more complicated than what you might think at first glance. One of the top 3 most popular national parks in the U.S., naturally there are times and places where you find yourself in a crush of humanity - competing for parking, waiting in a traffic jam, grappling for a spot in one of the restaurants, swarmed by people piling out of a tour bus, etc. Yes, at the Visitors Center or the Village, people are swarming all around. And true, unfortunately, the valley filled with smoke quite frequently this past summer. Consider it an adventure. If you are looking for solitude, you might need to take advantage of one of the many long hikes or rock climbs that are not so easy for most folks to do. My wife and I, being older folks now, are pretty much limited to driving and taking easy mile or two hikes, catching a ride on a shuttle. And yet, somehow, we found ourselves standing in meadows, strolling along riverbanks, admiring waterfalls, studying wonderful rock formations, and enjoying the peaceful aspects of nature. Early in the morning and later in the evening are best; the place can sometimes feel empty. You can hear a bear in the bushes, an owl in a tree, the river flowing over rocks. Concentrate the sight, sound, and feel of natural beauty and you will find it here. And as for the many people that seem to share the place at times, there are many worth meeting from everywhere in the world. It's all good unless you are one of those people who want everything to yourself. In which case, by an island and best of luck to you. Yosemite Valley is great, and it offers something to every one of us who is fortunate to visit.\nShow less"], ["Reviewed October 14, 2017", 5.0, "My favourite place ever", "Recently I visited Yosemite and did the trail around the valley and then went up sentinel dome afterwards. I generally don't like exercising much as I find it boring (I am an 50 year old man with a bit of a belly, you get the picture) however I was drawn in by the beauty of Yosemite and just kept on walking all day as I wanted to see all of its wonders. Did about 11 miles of hiking that day and didn't feel tired at all, this place is amazing and it will inspire your inner frontier man to come out, recommend you put it on your to do list\nShow less"], ["Reviewed October 13, 2017", 5.0, "Spectacular! Verdant lush glacial valley, birdwatching Mecca!", "A photographer's paradise! A beautiful deep lush and verdant oasis surrounded by granite cliffs. Streams, meadows, waterfalls, creeks, afford breathtaking views. Wildflowers abound: buttercups, milkweed, wild poppies, Indian pink, starflowers .....\n\nFor the birdwatcher in me, I was in heaven, as are they! Chickadees, Juncos, grosbeaks, woodpeckers, Dippers and Jays... wow!\n\nMany species of trees including pine, cedar, popular, laurel, alder and many maple trees.\n\nEvery step I took filled me with jaw dropping awe.\n\nEnjoy!\nShow less"], ["Reviewed October 13, 2017", 1.0, "T.E.R.R.I.B.L.E.", "Is the only word that can describe this so called \"park\".\nIt is as busy as downtown New York's Times Square.\nSkip it and see other parks and forests. You will not find any peace here. And parkings are all full.\nThey should remove at least half the number people allowed inside.\nShow less"], ["Reviewed October 12, 2017", 4.0, "busy tourist destination", "it si a busy place, parking is limited, you will need to get there early. a lot of trails start from there. a free shuttle service go around to get where you want to go."], ["Reviewed October 11, 2017", 5.0, "USA road trip", "Amazing breathtaking scenery and fabulous walks in lovely peaceful surrounding . Highly recommend staying in a lodge inside the park to avoid the queues ."], ["Reviewed October 11, 2017", 4.0, "A Grand View", "Surrounded by magnificent rock walls and peaks, staying at one of the valley lodges provides an excellent base camp for hiking the various trails that start from the valley floor. After several days of hiking the more aggressive trails, you may want to enjoy a hike along the 13+/- mile valley floor trail which meanders around the valley and is a very easy hike through woods, along the river and open meadows. Stop to admire the scenery at every opportunity. Enjoy a packed lunch along the way. Recharge yourself for another day of more aggressive trails. It is a beautiful stroll that should not be missed. Granted, there are other trails that are more spectacular but the valley trail is great for a leisurely day outing.\nShow less"], ["Reviewed October 11, 2017", 5.0, "Fantastic experience", "One of the most beautiful places I have ever been. Be sure to take the hiking trails if you are able, very few people there and you can take in all the views in peace."], ["Reviewed October 9, 2017", 5.0, "Plan on spending at least one full day here", "This is the heart of Yosemite and you could spend days just in the Valley. From hiking trails, waterfalls, meadows, rivers and abundant wildlife this is what you think of when you picture Yosemite. It does get crowded, so go early, find a place to park and use the free park shuttles to get around.\nShow less"], ["Reviewed October 9, 2017", 5.0, "crowded!", "we were here on a free entry weekend. Even after the weekend was over it was still crowded. But worth it, it is one of the most beautiful parks in all of the USA. The traffic is insane. They were also doing construction on the roads and traffic was backed up. It could take over 30 minutes just to go one mile. And parking is hard to come by.\nShow less"], ["Reviewed October 8, 2017", 5.0, "Peaceful", "The Valley in Yosemite National Park is beautiful anytime of the year. I think my wife and I are very fortunate for living a few hours away. You can't get tired of this park, there's some thing new every time. Just remember, during the summer time the water levels might be low. So NO big waterfalls. Instagram #Manwithanappetite\nShow less"], ["Reviewed October 8, 2017", 5.0, "Oh Wow", "We took a four hour bus tour from Valley Lodge which took in Glacier Point, El Capitan and Bridal Veil Falls. The bus driver gave us interesting and relevant information and had a good personality. The park itself is stunning. Spectacular rock formations and vistas. Beautiful forests. It was breathtaking. Well done America for preserving such an area.\nShow less"], ["Reviewed October 7, 2017", 5.0, "Outstanding", "We spent one day in the park. Definitely not enough time but for getting an overview ok. If you are interested in hiking you should reserve more time. It was in September and snow was already present. The atmosphere in the park was great because of that but be prepared with warm clothes...\nShow less"], ["Reviewed October 5, 2017", 5.0, "Breath taking", "Breathtaking and absolutely beautiful. Definitely worth the trip would definitely do it again. There’s a lot of construction going on on the south entrance, and the park is so immensely big, it takes a couple hours to get anywhere but worth the trip."], ["Reviewed October 5, 2017", 5.0, "Disconnect from Technology and Reconnect with your Love", "My wife and I celebrated our 15th Anniversary on a wonderful road trip through Yosemite and South Lake Tahoe (youtu.be/KNe7oKkJsUs). Words, photos and videos cannot do justice to the beauty of Yosemite. We spent 4 nights in the Yosemite Valley Lodge. Kathy at the reception desk (she normally works at the back office) was very patient and helped us find a great room. She also surprised us with a plate of fruits, crackers and cheese for our anniversary. We picked supplies for our hikes at Yosemite's Village store. We found easy parking near the trailhead of all the hikes. Our longest hike was the day we went through Mist Trail and part of the John Muir Trail where we were awed with the beauty of Vernal and Nevada falls.\nShow less"], ["Reviewed October 5, 2017", 5.0, "There's a reason it is crowded", "Yep, believe the stories about the crowds in the Yosemite Valley. But don't let that keep you away. There is a reason this place is so crowded. I recommend renting a bike for at least a couple of hours (there's enough to do to rent all day if you like), watching the two films at the Visitor's Center, and going on any number of hikes. I only spent two days in the Valley but could have easily spent more.\nShow less"], ["Reviewed October 5, 2017", 5.0, "A national treasure", "Even just walking the valley floor is breathtaking. Never stay out of the valley: The traffic, parking and hassle of coming into the park is considerable. Planning way in advance and using the shuttle buses makes it more like a vacation and less like being stuck in traffic on the way to work.\nShow less"], ["Reviewed October 5, 2017", 5.0, "Yosemite National Park, Nature at its best!", "Nearing the end of our coach tour which actually finished one day later in San Francisco, we found ourselves at the beautiful Yosemite National park. Our first view was looking down Yosemite Valley towards the ‘Half-Dome’ and ‘El Capitan’, which are the most famous mountains in this area. What a fabulous view, of which we took many photographs; the best of which we had enlarged and printed on canvas when we got back home in the UK. We were here for approx. 5 hours, which gave us plenty of time to see the other famous sight ‘Yosemite Falls’, which is a double water-fall that is extremely high up, in fact we found out that the height from the upper falls to the lower falls is approx. 2,400 feet (732 metres). Now that’s impressive! We walked up to the base of the falls and then around to Yosemite Village which was about a mile or so further on. Museum, gift shops, cafés and of course the much-appreciated rest rooms. The time we had here was comfortable for what we did and what we saw, with of course short rests in between. If ever you find yourselves within driving distance of Yosemite National Park, you must try to go, just to see it for yourselves; this truly is nature at its best!\nShow less"], ["Reviewed October 4, 2017", 5.0, "Simply amazing and well organised", "This is a great place, where by contrast with the Sequoia and Kings Canyon park, there are lots of trailers and parking lots where people stay for days camping, there are hundreds of people hiking and naturally there will be a petrol station, unlike the above mentioned.\n\nIt is a great drive, although it can get packed at some times but everything seems to be safe if you stick to the road: even so in different areas there are stones falling, so you never can be careful enough.\nShow less"], ["Reviewed October 3, 2017", 5.0, "INCREDIBLE", "You must go there if you have time. So incredibly beautiful & majestic. Mother Nature at her greatest. Don't forget your camera & definitely got to Glacier Point at sunset. Just wow everywhere you look."], ["Reviewed October 3, 2017", 5.0, "Amazing park", "This is the most amazing park we've ever visiting. A must on everyone's to do list. We need to thank John Muir and others who gave us this park and other national parks. Heaven on earth. Breathtakingly and truly awesome."], ["Reviewed October 3, 2017", 5.0, "BREATHINH TAKING!!", "A must do for every person that enjoys nature and being outdoors!\nBe sure to plan and book your stay at one of the Loges or campsite!\nYou will thank me and make your stay even more memorable!\nSo of the best viewing are done when those that did not plan on staying inside the park leave.\nShow less"], ["Reviewed October 2, 2017", 5.0, "This place is a post card every where you turn", "We came to do Half Dome Hike. We discovered the most beautiful National Park we have been in yet. So much beauty in such a small area."], ["Reviewed October 2, 2017", 4.0, "It is great, but...", "Yosemite Valley is spectacular, there is no denying it. The views are outstanding. We hiked up the Vernal falls trail, which is a reasonably strenuous climb but definitely worth it. Note that the \"easier\" route down is not easier, as the path is eroded and slippery! We also went to Mirror Lake/Meadow, which I'd recommend doing. Happy Isles was stated as a \"must-see\" in our guidebook, however it didn't seem anything too special to us. On the other hand, Yosemite falls are every bit a must-see.\n\nHowever, the traffic is a serious problem. We queued over an hour to leave the park (in October) - the road system is pretty bad and just can't handle the volume of traffic. Just park near the exit and use the shuttle all day (it'd be best if they actually made this compulsory except I guess for campers to be honest).\n\nI'd also add that, as a European, Yosemite is spectacular, but we have similar areas in Europe that in my view are every bit as good, if not better (Dolomites, Pyrenees) - from the hype, you might not think this would be the case. Personally, we preferred the wonderful Arizona/Utah parks - Bryce, Zion and Grand Canyons - and Death Valley, which are really unique.\nShow less"], ["Reviewed October 2, 2017", 5.0, "WOW!! This place is GREAT!", "We were in Yosemite for a vacation! My mother-in-law's had her 90th birthday, so we went! She had never been to Yosemite. What a view!"], ["Reviewed October 2, 2017", 5.0, "Amazing place to be!!", "Love Yosemite!! There's so much to do that even 2 days won't be enough. My bf and I hike Verna fall and it was an amazing experience!!! Will definitely be back! One of the most amazing place to visit and explore."], ["Reviewed October 1, 2017", 5.0, "Beautiful!", "Yosemite Valley is perfect. Was late June and it was hot. Crowded but not overly, yet. Lots of amenities - restaurants. shops, information, etc. Also lots of trails, accommodating all levels of skill. Was about 92 degrees end of June."], ["Reviewed October 1, 2017", 5.0, "Spectacular!", "Words cannot describe the awesome beauty of this place! We drove in through the west gate from Groveland. The scenery started getting more and more dramatic and we went through several tunnels and came out awestruck! Huge rocks so tall you almost can't see the tops of them. Stopped several times to get out and walk around and take photos of the waterfall(not sure which one it was). Still fairly busy in September but the weather was nice. Couldn't go to Glacier point and to some other places in the park due to fires. But there was plenty to see in the Valley. We literally hugged a tree in the spot marked where John Muir and Teddy Roosevelt had sat and talked about how to preserve the natural wonder of places like this. It makes you feel humble. Just gives you such a feeling you don't often feel. I could go on and on. Put this on your to do list, it is amazing!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Must see for a Yosemite Trip!", "The Valley was wonderful, despite the crowds of people and fleet of tourist busses. Yosemite Falls, Bridalveil Falls, and the Vernal/Nevada Falls hiking loop were amazing. We found it helpful to park in the very last parking lot before leaving the Valley (across from Camp 4). This put us first on the shuttle to the Mist Trail, a shuttle which was very, very full by the time we reached the stop. And it was easy to leave because you were close to the Valley's exits.\nShow less"], ["Reviewed October 1, 2017", 5.0, "Beautiful", "We drove through in August, stopping at viewing points but unfortunately were forced to shorten our visit due to heavy rain. However all places where we stopped were fantastic and we all agreed to visit it again."], ["Reviewed September 30, 2017", 5.0, "Breathtaking Natural Wonder.", "Around every corner is another breathtaking view of nature at its best. Going in late September, and on a weekday proved to be smart as the traffic was not bad nor the trails crowded. We enjoyed ourselves and had a wonderful day taking in all the landmarks.\nShow less"], ["Reviewed September 30, 2017", 5.0, "Impressive", "Towering experience. Nature at its best. You do have to arrive early to get anywhere. It was September and then even around 12:30 there was such a jam to go up Glacier point that I turned back.\nVisited Vernal falls which was again impressive.\nAlthough I am not really a hiker I enjoyed it very much.\nOne thing I can't see me doing is stay at one of those tent camps in the valley. Great for scouts groups maybe but not really my thing. Well, each to its own.\nI visited 2 days. One day I drove back out following the Merced river.\nBoy, what a drive ... Mustang ... top down ... windy mountain roads.\nYou need to stay attentive though. Some of those hairpin bends are treacherous.\nShow less"], ["Reviewed September 29, 2017", 4.0, "Great but sad", "Unfirtunately our visit fell just after the dreadful fires they have had and it is heartbreaking to see the devastation of the beautiful trees. Nonetheless it is a stunning part of the Country and well worth the visit. Just sorry we missed its best."], ["Reviewed September 29, 2017", 5.0, "One of America’s Best National Parks that everyone should see at least once in a lifetime. Fall is a wonderful time.", "Worth every moment. Spend at least two full days in the park including Tioga Pass road and in Yosemite Valley."], ["Reviewed September 28, 2017", 5.0, "Beautiful", "We spent 2 days in the park and it was wonderful. There were so many wonderful sights. You could see the same site each day and it was just as beautiful."], ["Reviewed September 28, 2017", 5.0, "Meadows, rivers, flowers in springtime, trees and all around you what John Muir called the Mountains of Light", "The title says it --try to avoid high season, take time to stroll as well as hike, get up early to avoid Disneyland type crowds of those who have come to admire the park that Robert Redford says is loved too much."], ["Reviewed September 28, 2017", 5.0, "Get There Early!", "We got there around 9 am on a weekend in September, and the parking lot was filling up fast. We used the shuttle for the rest of the day, so we didn't have to move our car. The shuttle takes you around the valley with stops at the Visitor's Center and trail heads.\nShow less"], ["Reviewed September 28, 2017", 5.0, "Beautiful National Park - Obviously very popular - can be crowded", "Yosemite is one of the Nation's most popular National Parks, and it is easy to understand why. The falls are beautiful, and there are dramatic and striking viewpoints throughout. Go early in the morning to get ahead of the crowds."], ["Reviewed September 28, 2017", 5.0, "Beautiful", "What a beautiful place, very clean, signposted and the free shuttle to help you get around easier. One of those place that you would never tire of."], ["Reviewed September 27, 2017", 5.0, "what a place!!!", "A most enchanting place watch the climbers on el cap spot deer in the meadows take a stroll to the foot of El Cap. and marvel at the vertical mile. We saw nature raw in tooth and claw with coyote's hunting young deer! and the weather was just perfect\nShow less"], ["Reviewed September 27, 2017", 5.0, "Pleasant view and mind peace", "No fee to park. You'll pay your entrance fee of $25 or so. But parking is tough in the valley in summer. Arrive early or prepare to walk."], ["Reviewed September 26, 2017", 5.0, "bucket list", "Yosemite is a must visit! valley has easy and hard hikes. every step is a photo op. stayed just outside park in El Portal. very convenient."], ["Reviewed September 26, 2017", 5.0, "Gorgeous views!", "Do the trail and walk around rather than drive your car. Very beautiful valley with easy walking for all ages."], ["Reviewed September 25, 2017", 5.0, "Awesome", "A gorgeous national park. You really have to see it in person to appreciate the grandeur of it! And it's very large- so check your gas tank and be sure to fill up before entering as gas is not available inside the park. Glacier Point is a must see. It's the general overview of the Valley and shows the main highlights. The free shuttle runs all day long, so find a parking spot anywhere you can and hop on! It's the best way to get around the Valley. We loved all of it!\nShow less"], ["Reviewed September 25, 2017", 3.0, "It is beautiful, but.....", "It is truly a beautiful place, but even in a weekend in september, you had to stand in line to start a hike. We did take a shuttle bus, which is very convenient. We wouldnt be able to park our RV anywhere."], ["Reviewed September 25, 2017", 5.0, "Incredible", "First time visitor and I was awed by the spectacular and incredible views, I will return to further explore the beauty there"], ["Reviewed September 24, 2017", 4.0, "Beautiful but hard to enjoy", "When I think of going to a national park, words like serene and peaceful come to mind. You want to be one with nature but it's hard to do that when there are hundreds of people everywhere and tons of traffic. After going to Banff/Jasper in Canada, we were very disappointed in Yosemite. The views/hikes were nice but the crowds made it hard to enjoy. The public facilities (i.e. bathrooms) were so poorly kept compared to the national parks in Canada. The signage on hikes was also poor compared to other parks. The food was mediocre as well\nShow less"], ["Reviewed September 24, 2017", 5.0, "Breathtaking", "Everything about Yosemite was breathtaking. The huge mountains and this tranquil stream in the valley."], ["Reviewed September 24, 2017", 5.0, "Simply beautiful", "We drove thru the park and there were some amazing views. We didn't do any hiking. It took about an hour to get thru the park. It's a great day trip and not far from kings canyon and Sequoia national parks too!"], ["Reviewed September 22, 2017", 5.0, "Paradise", "Fantastic place to visit - 2nd time here for me! Lots of great hiking trails and all in good condition for all abilities. Rangers always helpful and lots going on."], ["Reviewed September 22, 2017", 5.0, "Spectacular", "Very busy but the scenery was spectacular - unfortunately there is a lot of road maintenance work being undertaken so a lot of stop start driving. Need to make an early start to get ahead of the crowds."], ["Reviewed September 21, 2017", 5.0, "Amazing Place to Visit", "Traveled to Yosemite national park in late September. Camped outside Yosemite Valley. Even this late in the season, it's hard to get campsite reservations in Yosemite Valley.\n\nI stayed in Toulumne meadows. It was cold at night. Some nights his 32F. So bring your warm clothes if you intend to camp.\n\nThe photos are from morning and evening light around some of the attractions at the park. The air was hazy in the mornings owing to forest fires in the area. Hopefully next year, there will be no fires.\nShow less"], ["Reviewed September 20, 2017", 5.0, "50 Shades of Grey", "Granite is all that exists in the valley and grey is all you see, from light to dark due to spalling of the rock creating a new face, to dark on faces that were never glaciated. Every change in direction of the roads or trails provides new vistas as you are at the bottom of the canyon looking up at the sides. It is also very wide compared to many of the parks with the Merced River cutting downward through the sediment left by the glaciers. There is a variety of wildlife in the park, but bears are the only large fauna and there a few of them. We were able to spot a number of bird species, including 2 young owls, who didn't know better than to perch on a log 3' off the ground, and a buck mule deer who was unimpressed by our presence and just kept browsing. We were also fortunate that last year's snow pack and rains this spring and summer kept Bridal Vail and Yosemite Falls flowing this late. We were able to spend a week in the park and environs and each day was memorable, but even if you only have a day, drive in and take the shuttle around to get a view of its magnificence. Be aware, parking is limited and you may find yourself on the side of the road, far from where you hoped to be. The best bet then is to find a shuttle stop.\nShow less"], ["Reviewed September 20, 2017", 5.0, "Yosemite Valley", "The valley is awe inspiring. The views are amazing. Everything is so beautiful and you can walk and hike everywhere."], ["Reviewed September 20, 2017", 5.0, "Serene and beautiful", "A very special incredibly gorgeous valley. Especially lovely in spring or summer when all the summer crowds are gone"], ["Reviewed September 20, 2017", 5.0, "Incredible scenery", "Just walked around in some of the meadows in the valley with true amazement. Attached are a couple of my photos."], ["Reviewed September 19, 2017", 5.0, "Arrive early for Max enjoyment.", "This is an absolutely beautiful park.Stunning views around every corner.. please arrive early to avoid congestion..traffic will be a problem if you attempt to enter later in the morning.."], ["Reviewed September 18, 2017", 5.0, "Yosemite", "The ever changing landscapes and colors are spectacular. Make your way down to Yosemite village for the early evening and mingle with the crowds. Don't miss the sunset."], ["Reviewed September 17, 2017", 5.0, "Awesome!", "Yosemite is absolutely awesome in every way - stunning views and trails, and so photogenic. We spent three days here and felt we could have easily filled another week with new walks - we will be back to do more!\nMake use of the info points and visitor centres, they were invaluable in helping us choose walks that suited us, our fitness level, and our timescales. They can also fill you in on walks that are not available due to the damage from recent forest fires. Glacier point road and Mariposa grove were both closed when we were there this week due to renovations following fires, but we were able to find alternate activities that still had our jaws dropping. I find it odd when people moan about this - fires are part of life in national parks like this and we should be complementing the firefighters who manage to control them, and the staff who work so hard to get back to normal as soon as possible, as well as thanking the visitor centres who help us find alternates when necessary. This place is huge, there's no reason not to see absolutely amazing things because a couple of small areas are not accessible...go, as soon as you can!!\nTotally awesome!\nShow less"], ["Reviewed September 17, 2017", 5.0, "Amazing !", "The best place we have ever been to. Staggering views and loads to do. Best to stay in the valley Rent cycles"], ["Reviewed September 16, 2017", 5.0, "Wow!!!", "Fulfilled one of the things on my bucket list, as well as taking my parents who have always wanted to see the park. A dream come true."], ["Reviewed September 16, 2017", 4.0, "Wish I Had More Time", "Came here on a day bus tour. I really need to come back and actually stay overnight and take my time exploring as much as I can.\nThis is a beautiful National Park. I walked thru one of the small hiking trails, and it's so wonderful to see how much has been preserved.\nThere is a small restaurant and a souvenir shop. The Hotel also has a water refill station outside the restrooms (Make sure you hydrate while hiking).\nThere is so much to see but so little time. Take it all in, and enjoy it while you are here.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Fire caused closures and poor visibility", "Unfortunately large wild fires closed Glacier Point Road, blocking access to many of the best short hikes. Still got a breathtaking view from the tunnel view lookout, and a nice view of the nearby falls. View of el cap from the road at its base is impressive, photos to be taken throughout the valley. Much can be done just from roadside without any hiking. Crowds are not ideal, but unavoidable when such scenery is so easily accessible.\nShow less"], ["Reviewed September 15, 2017", 5.0, "Even more amazing then I thought", "The scenery is beautiful and it almost feels like you're living in a painting. The Ansel Adams gallery is great. Lots of wonderful prints and one of a kind artisan pieces. I got a wonderful hand blown glass vase which is a real work of art. Everything in the park is navigated with busses. If you want to hike the trails I'd say to stay in the park and not take the tour to and from which is about 4 hours each way from San Francisco. There just isn't enough time.\nShow less"], ["Reviewed September 14, 2017", 5.0, "Wonderful National Park, but not dog-friendly", "This park is a must see because it so stunningly beautiful. Just don't be fooled into thinking it is easy to bring a dog. The handout says that dogs are allowed on the paths and in one outdoor restaurant, but not in the hotels and shops or the trails. Fine. But we assumed we could get around in the shuttle buses with the dog, but they aren't allowed. We had a very difficult time getting around. Because parking is so hard to find, you want to stay wherever you find a place and then use the shuttles to go all over. We couldn't do that and ended up just leaving. I never would have brought the dog if I new it would be such a bummer.\nShow less"], ["Reviewed September 13, 2017", 5.0, "A must!", "If you are going anywhere Yosemite, it is an absolute must to go and enjoy this marvellous place. Peaceful truly enjoyable."], ["Reviewed September 13, 2017", 5.0, "A M A Z I N G", "We spent a day here exploring and loved it! We werent sure what to expect but after speaking to a lady who lived locally she gave us the heads up on everything. She advised us to leave at 7.30am and head down which would take about an hours drive from Tenaya Lodge.\n\nWe headed down and paid the $30 fee to get through to the park which was valid for 7 days.\n\nWe are glad we headed down so early as it was so busy by the time we arrived. We parked at half dome village which was advised to us and we got one of the past parking spaces.\n\nWe jumped the free shuttle and done our first hike to Vernals Fall which took about an hour to get to the top it was very steer and slippery so be careful as we saw a few people slip and trip!\n\nWe also done Mirror Lake and another walk which I believe was on stop 6. The shuttle was great and arrived frequently. We had a great day and saw the most amazing sights.\n\nIt was so busy though and we are glad we left early!!\nShow less"], ["Reviewed September 13, 2017", 5.0, "Stunning", "We spent two days in Yosemite, walking up Vernal Falls and part way to Nevada Falls. Saw Bridalveil Falls, Half Dome and El Capitan. The walk up Vernal Falls and Nevada Falls was very busy, it wad hot day and very congested made worse with people wanting to stop very 5 second to take a picture . On top of that the rocks were wet from the spray of the waterfall. Wear walking boots. Sandals, flip flops, trainers are no good and prepared to get wet. The views from the top are stunning. In the valley the restaurants get busy but the food is good and reasonably priced.\nShow less"], ["Reviewed September 13, 2017", 5.0, "Nature at its best", "Majestic beauty . If you've been wanting to go here what are you waiting for ? Unless there's fires or the roads are closed . I wish I went sooner , such a gorgeous place . I went in august . Drove up on a Sunday later in day when park started to clear out some which was nice because I did not experience any excessive traffic or crowds . First day was perfect , only disappointment was wildfires in the distant made for hazy skies and lesser air quality\nShow less"], ["Reviewed September 13, 2017", 5.0, "National treasure", "Visiting Yosemite Valley was a truly amazing experience. The National Park Service keeps everything very clean, and the staff was very pleasant and helpful. The Park itself was beautiful with so much to do. There are nice restaurants and some very nice hotels within the Valley.\nShow less"], ["Reviewed September 12, 2017", 4.0, "A must, still amazin", "In spite a being a real crowdy area the Valley offers each and every visitor opportunities to find her own way to visit and discover what all the efforts put in safeguarding the natural park have managed to achieve. Amazing environment, very informative volunteers, reasonable places to eat, although nothing fancy. And above all fascinating sceneries.\nI would recommend the bike tour. Rentals are reasonably priced at about $33 for the day. It allows you to visit the whole valley at your pace in the day. Bikes are bulky, but the Valley is more or less flat.\nNext advice is the scenery from Road 120, especially the Olmsted point.\nShow less"], ["Reviewed September 12, 2017", 5.0, "Beautiful", "This national treasure us certainly worth a visit. So much to see and enjoy. Our boys took a dip in the water while we sat and enjoyed them and the scenary. Pity the road to the sequoias was closed."], ["Reviewed September 12, 2017", 5.0, "A special place to visit.", "Yosemite is a special place. We booked our campsite months ahead of time. My favorite hike is up Vernal falls and Nevada Falls. They have three main parking areas and a shuttle to take you around. As we camped outside the Valley we usual got a parking place in the Valley by 8:30 AM and seemed to get the last ones available. When we were ready to leave there were people waiting for the spots. The shuttles worked well for us. There were wildfires in other parts of the park. Because of that there was a lots smoke in the Valley so ti was her dot see some of the normal sights. The clearest areas were Nevada Falls, Vernal Falls and Mirror lake. The trail to lower Yosemite Falls is easy. There is food and a good store in Yosemite Village. A well as a good visitor center. We got hot showers at Half Dome Village, formerly called Curry Village. The Ahwahnee hotel has changed its name to The Majestic Yosemite Hotel.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Pretty awesome", "We went via the south entrance from Fresno. You need to set off early as theres quite a few miles through winding roads once youve paid your $30 entrance fee.\nYou will incline to around 6000 feet with stop off's along the way, take packed lunches and plenty of water. Stop at the Belvedere falls, you can take pushchairs as tarmac path takes you to a viewing area, most of the paths are pretty ok for kids in prams. The visitors centre is extremely busy, rarely anywhere to park, we got there around 1pm, it was choc a block. Anyhow theres a one way system that loops around El Capitain and the falls, the map they provide is pretty basic, youl see signs that are not on the map so if you fancy a good recky get a good map. Take your camera and be sure to stop off at all the viewing points, its well worth it. Your ticket lasts a week too, so if you get chance to go back, also take swim stuff especially for the kids, theres a few lovely places to stop and play in the river, its really slow and low in places this time of year, crisp, crystal clear water as is the air! Well worth a visit, a great day out.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Yosemite Excellence!", "After over 32 years living in California the trip to Yosemite National Park was certainly historic. The panoramic views, the drive, and the waterfall area were magnificent! The timing was very good before the late summer fires became an issue. Words to the wise, if you want to camp or stay at one of the area lodges, reserve well ahead of time and arrive early. If you are taking a day trip, plan to arrive extra early or the wait to enter the park will be extremely long. In any event, taking to the time to visit the park is well worth it!\nShow less"], ["Reviewed September 10, 2017", 5.0, "Unlike anywhere else", "This place is magic and unlike anywhere else I've ever seen. We did the 4 1/2 mile hike up to Glacier point. It was tough going but spectacular. One of the great days of my life."], ["Reviewed September 10, 2017", 1.0, "Bad manners everywhere", "Crowed, bad signage and high prices. Nothing special. Should have stayed home. Worst park of all the National Parks."], ["Reviewed September 9, 2017", 5.0, "THIS is Yosemite.", "This is the view of all views in Yosemite for me, and it truly is majestic. It can be quite overcrowded at the viewing platform at times, but hiking through the valley is a much better way of seeing it anyway! Smoke can be an issue but it's a natural process and in many ways demonstrates how the local ecosystem works- if you are a city-dweller with no knowledge of forest-ecology I guess that could be annoying, but otherwise, suck it up!\n\nIt's just an amazing view, one of those must-see sights. The physical Geography is incredible!\nShow less"], ["Reviewed September 9, 2017", 5.0, "So near and yet so far!", "Yosemite Valley with its majestic peaks especially the distinctive \"Half Dome\" was formed millions of years ago by a massive glacier which covered North America and when it receeded, it left in place a remarkably tranquil and peaceful valley carved by the Tuolome river. It is so far from the hustling, bustling Silicon Valley of Northern California and yet only a short drive away. Consequently it is a popular destination for San Francisco and the Bay area to re-charge their batteries. Just avoid the peak summer months especially weekends when it is over-crowded.\nShow less"], ["Reviewed September 9, 2017", 5.0, "Newbie, not disappointed, despite the smoke", "As a first time visitor to Yosemite, I didn't know exactly what to expect, especially being familiar with the place so well from photographs. I was worried that in the flesh it might be a let down. However, Yosemite does not disappoint: the place is stunning and rivals any other natural scenery I have ever visited. This despite the fact that I missed many of the famous views, as most of the valley was (completely) enveloped in smoke from nearby wildfires.\n\nThe place is large: you really need a car to get there and to get around, as the shuttle buses do not go everywhere. It is 50 minutes drive from the valley to Glacier Point, for example, then the same back. Note that not all roads are open all year.\n\nWorking out the layout of the park and how it operates can also be a bit baffling for the first time visitor: the National Parks Service website is not 100% clear. Also finding a good map is hard (there don't seem to be any maps that come up to Ordnance Survey standard). You need to research hard on the internet to work out what's going on, find a good trail to follow, etc.\n\nA lot of people visit. Even in September, during school term, it was packed. It doesn't matter though: the scenery overwhelms any crowd issues. Don't be wary of going to the popular places: they are popular for good reason.\n\nWe drove to Glacier Point: fantastic view of the smoke! Also walked to the top of Sentinel: easy 20 minutes each way; smokey again. Looked at Bridalveil falls: 5 minutes from carpark, with water even in September. Had food at the Visitor Centre: basic burger but quite tasty and cheap. Got bus to Mirror Lake trail: longer walk, 30 minutes each way, but very scenic spot. Then drove around the valley stopping at the various carparks to take in the classic views.\n\nEntry fee is cheap and they do take credit cards. There is no mobile phone coverage anywhere that I could find - so don't rely on google maps for navigation.\n\nOnly on a day trip from SF: a long drive there and back (on terrible urban highways), but worth every minute. Next time we will take 4 days, if we can find accomodation.\nShow less"], ["Reviewed September 7, 2017", 3.0, "To overcrowded!", "We had really looked forward to see Yosemite!\nBut was really disappointed: nearly nowhere in The Valley you could have an uninterrupted view without seeing lost of parked cars or tent/ camper areas. The busses was totally overcrowded too!\nWe came early - but it did not help - and through the day it got worse!\nThe park plans was not very informative, only showed hotels, visitor centers and camp sites.\nA description of what to see at each stop would have been usefull.\nWe certainly recommend Zion or Bryce as much better!\nShow less"], ["Reviewed September 6, 2017", 5.0, "Many Gorgeous Sites", "Many places to see and view. You can hike around or take a shuttle bus. Driving from place to place when it's crowded is a mistake. Park the car and walk, ride bikes or take the shuttle.\nGreat views.\n(First of all, don't go on a holiday. Second don't go on a holiday weekend when there is a fire! We drove 7 hours on Labor Day weekend. We noticed that highway 41 was closed due to a fire, thus we drove in via highway 140. The line to get into the park was 4 hours long! Yes 4 hours!!!! The valley was full of smoke from a fire 36 miles away. It took us so long we were there for an hour or so. We went back the next day and we're thrilled that it only took us 2 hours to go in. We had elderly parents and young kids with us and couldn't get there before 10, but we were told that there was no wait at 7 am. Once we got there it was so crowded it was hard to get around. I recommend to avoid summer holidays and weekends. Nevertheless the sites are beautiful to see.)\nShow less"], ["Reviewed September 6, 2017", 5.0, "the winning of nature", "We spent 2 full days in the Yosemite National Park. the distance are very huge from the closer hotel and main town, but driving on the yosemite road was the first positive experience. All the several attractions of the valley are very busy but I suggest the visit of this area for all nature lovers.\nShow less"]]}}