{"Yuma Territorial Prison State Historic Park": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Yuma Territorial Prison State Historic Park", "url": "/Attraction_Review-g31418-d109585-Reviews-Yuma_Territorial_Prison_State_Historic_Park-Yuma_Arizona.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d5/fb/ca/historic-structure-that.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "1089"}, "address": {"@type": "PostalAddress", "streetAddress": "1 Prison Hill Rd", "addressLocality": "Yuma", "addressRegion": "Arizona", "postalCode": "85364", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Great place to visit the museum was great.", "Very interesting place to visit. Beautiful park. A bit of walking. It shows prisons back in the day when they weren’t so kind!"], ["Reviewed 6 days ago", 5.0, "Yuma Prison Must See", "Very educational and interesting. Good for all ages. Fascinating to see living conditions, cells, etc."], ["Reviewed 6 days ago", 4.0, "Good visit if you’re in Yuma", "If you’re staying in Yuma, this is a fun visit, but I wouldn’t make a special trip for it.\n\nVery educational. My 6,9,10 year olds learned a lot. Even about polygamy (I wasn’t prepared for that?!?). The museum part was really well done though. The artifacts that have been preserved were really interesting to see, and I loved the big posters highlighting various criminals housed in the jail.\n\nThe kids loved the cells and the prison bell.\nShow less"], ["Reviewed 1 week ago", 4.0, "Good visit", "This place is well worth the visit.\nGives you a really good understanding of what it was like to be in prison in the 1880s .\nMaybe if our prisons now where just a little bit closer to this kind of punishment the crime rate would be less.\nShow less"], ["Reviewed 1 week ago", 5.0, "Very interesting", "My grand children really enjoyed the tour of the prison. There is a lot of very historical information in the visitor center."], ["Reviewed 1 week ago", 4.0, "Very Interesting Place!", "I can’t imagine being in this place in the middle of the Summer. Now I know why my uncle’s father escaped from here in 1890. The admission price is a little HUGH, but the grounds are well maintained. Worth seeing, to understand more about the Wild West!\nShow less"], ["Reviewed 1 week ago", 5.0, "Yuma Prison Tour", "Toured the prison in Jan 2018. Found the tour very interesting and informative. Seeing the cells, walls, spaces, and environment in which the prisoners lived was enlightening and interesting. Guide was very knowledgeable and informative. Highly recommend it."], ["Reviewed 1 week ago", 4.0, "Great to explore with friends", "Fascinating to see what has changed here since the prison was first inhabited -- a taste of the old west still lives here. Great tidbits about individual prisoners and the place of the structures through Yuma's history in the museum (look for info about the Depression era and why the local high school teams are called \"the Crims\"). Be sure to take part in a guided tour for even more flavor. The prison just won the \"Yuma's Best\" award for \"Best Place to Take Tourists\" from the readers of the Yuma Sun...as a repeat tourist, I realized I'd better make a visit! Glad we did.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "First time", "Very interesting place to visit and find out history on Yuma. Very friendly staff, gift shop in the premises. Cost to enter is reasonable. One can see scenery also as there is a look out point. I will visit again."], ["Reviewed 2 weeks ago", 5.0, "Very interesting", "What an interesting way to spend a few hours in Yuma! The old west skit was entertaining. The museum is very well done, followed by the chilling cell blocks just as they were in the 1800’s. A great value. The narrations in the cell block made the era come alive. You could spend an hour or three.\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Great history", "Great information! Self guided tour. Spent a couple of hours lots and lots to read. You are outside some so go when it is cooler so you don’t rush through it. Everyone told us this was something we wouldn’t want to miss WELL it was okay a lot of history. I don’t need to go back. Would I recommend it: I would say if you are interested in the history of Yuma then this would be a must.\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Great history", "The last I visited was 38 years ago and it was just as good now as then. This was an interesting era with so much history & the people had such hard lives. The park does a great job of preserving and making this interesting. Much recommended.\nShow less"], ["Reviewed 3 weeks ago", 4.0, "A neat little experience", "While visiting family, my folks recommended we go the this prison (in the good way, though my mother did close the cell doors on me...). All in all it was an interesting little experience. You can see what's left of the prison (not much actually), and walk a few steps in the prisoners shoes. There's even some basic interactive prison cells where you can hear the prisoner's stories.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "If your into the past you will live it", "Applaud Yuma crims and citizens for keeping this open and sharing with us A lot of history so take your time Guided tours of you don’t want to read everything yourself"], ["Reviewed 3 weeks ago", 4.0, "A glimpse at history", "The Yuma Territorial Prison is a step back in time. It accurately depicts what life inside was like if they did a crime...men and women. There is also a prison graveyard."], ["Reviewed 3 weeks ago", 4.0, "Great Place", "Interesting place. Well laid out and informative. The tour guide was awesome. Only negative is the museum workers were not very friendly. They brought the rating down."], ["Reviewed 3 weeks ago", 4.0, "Nice place to see what it was like", "The 9:10 to Yuma a was true. The prison was very interesting to walk through. A must see if you are any kind of history buff."], ["Reviewed 4 weeks ago", 4.0, "History of the area", "Enjoyed our visit and learned a little more about the area. We started on the tour and decided to go on ourself. The tour guide was very knowledgeable, but the audio was bad and hard to hear."], ["Reviewed 4 weeks ago", 4.0, "Excellent tour guide", "Our tour of the prison was enhanced by the excellent tour guide, who shared a multitude of stories about the prison and the people who worked at, and who were incarcerated here. Excellent history lesson."], ["Reviewed 4 weeks ago", 4.0, "Great look at penal history in the Southwest", "I’m a history nut and a retired attorney and have a natural affinity for sites such as the Yuma Territorial Prison sometimes to my wife’s dismay. And, while I was naturally very pleased with our choice to visit the prison , my wife was too. Much of the prison is gone but what remains provides an interesting insight to prison life in the 19th and early 20th century. This prison was surprisingly progressive for its time. If you visit you will have the opportunity to experience the dark (solitary) cell. Great fun. We enjoyed the visit , found it educational, historical and generally interesting. Good value too.\nShow less"], ["Reviewed 4 weeks ago", 4.0, "Interesting—", "Not much to do here if you missed the Imperial Sand Dunes in CA. But this held the interest enough. A decent stop - not a necessity - but ok. Interesting. The treatment back then was tough."], ["Reviewed 4 weeks ago", 5.0, "Worth the time", "We spent several hours touring the prison and it was definitely worth the money ($5 seniors) and the time. Loved reading about all the prisoners, their histories and seeing their pictures. The cells were creepy for anyone that's claustrophobic!\nThere's a nice walk/ bike path along the wetlands with a view of the Colorado river just down from the prison.\nShow less"], ["Reviewed 4 weeks ago", 3.0, "Only thing to do in Yuma", "There is really not much to see in Yuma. If you’re passing through on the freeway and you want an hour break, stop at the prison. When I went it was very crowded. It’s just some cellblocks and a lot of history to read. I would never go out of my way to visit this place. But since there’s nothing else to see in Yuma -everyone rates the prison highly. If you want to see an incredible present – go to the prison Museum in Deer Lodge Montana. That can take half a day but this you my site\n\nThere is a nice walking path directly below the territorial prison. If you want some exercise this is a great place to just go walking alongside the river. There is no charge just to take a walk beside the river.\nShow less"], ["Reviewed January 24, 2018", 5.0, "Tour a jail? Very interesting history", "I had never seen a jail before. This was a trip through history and was well worth the time. It is cheap. $6 each. Tour guides are sometimes available, but we just walked thru at our own pace and I am glad we did. There are lots of signs to read and photos to look at. Lots and lots of walking. Steep stairs to tower, but take your time and go up. It is very pretty in places and great views of river and wet lands. It can be windy and chilly in the winter. The gift shop didn't seem like much. Close to many hotels and easy to find restaurants near by. Suggest you allow about 2 hours for going thru the whole place.\nShow less"], ["Reviewed January 22, 2018", 5.0, "Family visit", "We walked in not really knowing what to expect but was pleasantly surprised. We looked, read, listened, watched and touched everything we could."], ["Reviewed January 22, 2018", 3.0, "Thanksgiving", "We go or try to go every year to visit family.. And we always look for somthing new.. So prisons n librays seem to be are thing!! And we discoverd this prison was definetly worth the experience.. If your into history n prisons stop here next time you visit yuma\nShow less"], ["Reviewed January 22, 2018", 5.0, "Good place to visit wouldn't want to stay", "Good place to visit wouldn't want to stay. Lots of history and interesting place to visit rich in history. Facilities clean and staff friendly entry reasonably priced."], ["Reviewed January 21, 2018", 4.0, "Took my husband to prison for his birthday!", "We really enjoyed our time at this historical prison / museum. The tour guide was very knowledgeable and full of information. It's a must do in Yuma!"], ["Reviewed January 21, 2018", 4.0, "Eerie but interesting", "Snowbirding in Arizona desert, so stopped here while in town shopping. It is very interesting to visit. We self toured but overheard tour guide and wished we gad done that. Crummy cells. Can't imagine how hard it was to be sent there. Or even work there. Great gift shop. No dogs allowed inside. Lots of walking in dirt. Was glad we went.\nShow less"], ["Reviewed January 21, 2018", 4.0, "Well done and interesting museum", "Stopped in Yuma for a couple of days and saw this museum as a option to visit. Nice museum. We were so happy for the reasonable entry fee ($8 for a adult.) Informative signs, well put together museum. Clean and easy to navigate."], ["Reviewed January 18, 2018", 4.0, "Yuma territorial prison", "My first visit to the prison was about 6 years ago. This visit was a very pleasant surprise with huge improvements from parking to tour. You now have refurbished buildings, grounds and volunteers telling you about the history of the prison. Nice tour interesting history."], ["Reviewed January 14, 2018", 5.0, "Fascinating place, interesting history", "Nicely done Museum and prison cell block. Very informative signage. Really well-done. On the Colorado River, with the Colorado Crossing site close-by. I really enjoyed my time at the Prison State Park."], ["Reviewed January 9, 2018", 5.0, "A bit of history", "Great place to take someone whatever age to show a bit of history. Some of the displays inside the museum very enlightening"], ["Reviewed January 9, 2018", 4.0, "Adventure", "Prison life then is deffinately harder than prison life now. Dang. Very interesting. Well worth seeing."], ["Reviewed January 3, 2018", 5.0, "Great stories and tour guide", "A very interesting place to see up close. Our tour guide was very pleasant and a great storyteller! Too bad more of the original buildings/walls could not have been preserved."], ["Reviewed January 2, 2018", 5.0, "Clean, Informative, Well Done", "Entrance to the Territorial Prison area filters you through the Admission building. A cost of $8 for adults will be collected here. You will receive a guide map can work your way around the park area working your way to Sally Port, the Museum and the Cell Block area. The Sally Port is one of the last remaining original abode structures of the 1876 Yuma Territorial Prison and served as the check point through which prisoners entered and left the prison. The museum offers a brief but very informative 8 minute video on the prison. Stroll through the digital displays on Bad Girls of the Old West and Mormon Prisoners. See a reconstruction of one of the many Guard Towers. It offers a commanding view of the area and is situated atop the Prison's original water supply. If you are a history buff be sure to take the 30-minute Cell Block tour. You can even step inside the infamous \"Dark Cell\" used for incorrigible prisons. Allow a couple hours to complete this great tour. The area is extremely clean and well maintained and has some great views.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Vacation", "Interesting place and lots of history. Beautiful over view from the grounds of the area. Nice and friendly people to help and answer questions."], ["Reviewed December 30, 2017", 5.0, "Sight seeing", "Beautiful park and museum. Very thought provoking display. Not like you have seen in the movie depiction. You must see it."], ["Reviewed December 29, 2017", 5.0, "Great park", "I don't know why we haven't visited this before today! Great place to stop and learn about some Arizona history in beautiful setting. The grounds are well kept and the exhibits are are good and the prison is fascinating!"], ["Reviewed December 23, 2017", 5.0, "Great history lesson", "From the moment we entered through into the front store we were greeted with enthusiasm and warmth. Everything was well documented, telling the most amazing stories! A must visit for all who visit Yuma."], ["Reviewed December 22, 2017", 5.0, "A great place to learn some history.", "You can learn a lot about a key piece of Yuma's history by visiting. I enjoyed seeing the exhibits, a worthwhile place visit."], ["Reviewed December 22, 2017", 5.0, "Pretty neat place", "Definitely worth visiting here, lots of history. My son loved it. I recommend anyone going here to see this."], ["Reviewed December 21, 2017", 5.0, "Must visit in yuma", "Verry nice Historical visit sowing you the way prisonners in those days were incarcerated and the conditions they lived in"], ["Reviewed December 6, 2017", 5.0, "Great historical Value", "Interesting..Spend the day look around. The tour guide was pretty good but seemed some what short with his interaction with the patrons"], ["Reviewed December 6, 2017", 3.0, "Historical signicance", "Take your time and look back at how life was then. Too many native Americans, particularly our Apache cousins, I'm half Navajo, were incarcerated and many died of consumption or escaped and recaptured by we Quechans. Sad and regrettable."], ["Reviewed December 3, 2017", 5.0, "A real historical experience", "What a fabulous experience. The grounds a beautiful, the guides are excellent and the site really makes you feel that you have gone back 150 years in history. Absolutely worth the time. Easy parking, attached to a museum, wonderful artifacts. And.....movies have used this historical site for their locations. Amazing\nShow less"], ["Reviewed November 24, 2017", 5.0, "Awesome Yuma History", "We have been to Territorial Prison twice. Each time we discover historic events we previously missed. This is a fantastic place to take fun and historic pics. Throw on prison garb, grab a prison number, hold it up and take your pic. Great Memories! Also, prison cells come alive and one's understanding of what prison life was really like comes alive.\nShow less"], ["Reviewed November 20, 2017", 5.0, "Very interesting", "The prison cells are very dungeon like and my kids enjoyed walking in the dark cave but unfortunately there were not bats in the dark cave at the time. The town close by in Yuma is very nice and has decent restaurants."], ["Reviewed November 20, 2017", 4.0, "Interesting afternoon", "I was shocked to learn there were about as many women bandits held here as there were men. Desperate times. The museum it’s self is very interesting and holds lots of artifacts from back in the day ( worth the price although the amount escapes me ). Make sure you tour the cell area, you’ll be shocked to see the size of them. Also do yourself a favour and climb the steps of the watchtower. The view is quite good. We’ve been there a few times, taking company who’ve visited us at our winter home over the years. The facility is well kept and you’ll enjoy your afternoon learning a little history along the way. Cheers.\nShow less"], ["Reviewed November 15, 2017", 4.0, "Only a small portion remains", "This is only a small portion of the large territorial prison that was built in 1875. We had an excellent and knowledgeable tour guide who shared many stories and facts about the prison.\nThe view from the top of the guard tower is spectacular. The Colorado River runs next to and the mountain backdrop is awesome. If you are in Yuma, you don’t want to miss it. It’s just too bad that so much of it was not preserved.\nThere is a prison cemetery at the bottom of the hill, but only one of the headstones survived the floods and climate and is now housed in the museum.\n\nCost is $8.00 for adults. Seniors are $6.00. With a tour guide it took about 2 hours, but you can also go through at your own pace which would be significantly shorter.\n\nShow less"], ["Reviewed November 13, 2017", 3.0, "Neat", "This was a neat museum but I wouldn't go again. Neat to see all the old guns and artifacts and the old jail cells but not much to it it was cheap"], ["Reviewed November 10, 2017", 4.0, "Family visits", "I particularly liked the stories about the inmates and their handmade items on display. The kids enjoyed dressing in the inmate shirt and taking photos."], ["Reviewed November 9, 2017", 5.0, "Visitor", "I have been to this place many times and every single time is a different and positive learning opportunity.\n\nEverything here is so real and has a detail and a story to narrate to its visitors.\n\nThis is a place for both young and old to learn art, culture, history and many other aspects of our culture and customs.\n\nI will continue to visit this amazing place to feel like if I am in a trace and transport myself mentally to a different environment and times.\nShow less"], ["Reviewed November 8, 2017", 4.0, "Interesting , beautiful view from there! - great history !", "Had to stop and visit this place while in Yuma.\nVery well kept place. Great story !\nReally enjoy this attraction. A nice movie.\nVery good exhibition museum.\nLike very much to see the jail.\nTake time to walk around and rad the \"stories\" from this place.\nShow less"], ["Reviewed November 8, 2017", 5.0, "Interesting Visit", "I did not know this was right in town and that I had driven by it many times. What an interesting visit, particularly reading about the women who were prisoners there."], ["Reviewed November 8, 2017", 4.0, "Interesting historical facility", "I was not aware of the existence of the prison until my visit to Yuma. The history of the territory and the importance of the prison go hand in hand. It is a shame that part of the prison was destroyed to make room for railroad tracks many years ago, but they have done a great preserving it and allowing visitors to see the conditions of the the prisons of the old west.\nShow less"], ["Reviewed November 6, 2017", 3.0, "Nice afternoon getaway", "We enjoyed an afternoon trip to the prison. It was a fun history lesson and they had interesting museum exhibits. We wouldn't necessarily have gone out of our way to see it, but enjoyed it all the same."], ["Reviewed November 4, 2017", 5.0, "Worth the visit", "The history of the prison is very well described across the different displays. A very interesting museum stands at the middle of the prison. It gives us an idea about life in the prison and how it was to be a prisoner in such a place!\nShow less"], ["Reviewed October 26, 2017", 4.0, "Great place if you love history!", "This is a fascinating place to see actual artifacts straight out of history. You can walk through the prison yard and see into cells that held prisoners in the late 1800's. It is easy to imagine what the prisoners of the Old West felt like! There is a short video of the history of the prison or you can take a self-guided walking tour. (Ground is level and easy to negotiate. It is not a large area so not a lot of walking.) I would not recommend this for very young children. Most of the prison is outdoors - Winter months are a good time for a visit.\nShow less"], ["Reviewed October 23, 2017", 5.0, "\" Well let me tell ya \"", "This is a great place to visit and very interesting. Lots of interesting history for the whole family."], ["Reviewed October 22, 2017", 4.0, "So much to learn- quite the \"real feel\"", "It isn't hard to imagine the conditions of the prison to the former prisoners- especially when you visit in July.\n\nSo worth a stop, lots to learn, great videos, stories- and so powerful to actually walk into the cells and around the grounds, guard tower and all.\n\nDon't forget water and be grateful you aren't locked up in those cells!\nShow less"], ["Reviewed October 22, 2017", 4.0, "Interesting", "This tour of the prison is self directed but you learn a lot about what it was like at that time, pretty Grimm there is a short movie inside along with more items from antiquity well worth a stop!"], ["Reviewed October 21, 2017", 3.0, "It was OK", "It's not a bad way to kill an hour or so. You'll get a nice history lesson about early Arizona times. There is really not much left of the original prison, but you get a taste of what it must have been like."], ["Reviewed October 17, 2017", 5.0, "Interesting History Spot, Lots to Learn here", "We spen the morning visiting here after seeing the road signage and ads in magazines. Have heard of it for years and was glad to be close enough while traveling to see it. It is a state park and nicely organized. Being on a hill you can see the countryside and river as you go in. Parking is easy. Read about the environmental changes on signs as you walk up the sidewalk. Go into the gift shop and pay admission ($6) into the park. Some good souvenirs and books to peruse. Enter the park/prison itself and see it has been well kept in recent years. It was heartbreaking to read about the abandoned years and abuse. Sad to know it is about half the size it used to be because of the railroad expansion. There is enough left to get the point though. The museum is well-done. Lots to see, including a new video explaining its use and history. Walk out the other side of the museum and see up close the cells and walls the prisoners endured. Really nice opportunity and if you are thinking about stopping here, go ahead. The staff we talked with were outstanding in their knowledge and interaction with us. Thank you Arizona for keeping this for your visitors!\nShow less"], ["Reviewed October 16, 2017", 4.0, "Fun place", "We visited here mainly because my wife saw it on the Ghost Adventures. It turned out to be a great time. Saw the prison, cemetery, and walked by the river near by. All in all very happy we went. If you are in the area stop by snd see what-a tough prison used to look like. Then take a walk down by the river.\nShow less"], ["Reviewed October 15, 2017", 5.0, "Love this place", "I have been here multiple times over the years. Since my last visit they have added a section for the women prisoners. Always fun to go through the old cell area. If you’re looking for something new to visit in Yuma, give this place a try. Oh BTW $8.00 entrance fee and $4.00 for military.\nShow less"], ["Reviewed October 13, 2017", 4.0, "Piece of Southwest History", "If you are a history buff you will love the tour of the old prison and its mammoth walls. Its hard to imagine a life of confinement in the hot, dry climate of Yuma. This is a piece of \"have to see history\" of the southwest's place for bad guys and gals!\nShow less"], ["Reviewed October 12, 2017", 4.0, "Very nice museum and piece of history", "Very nicely maintained museum. The exhibits were updated and well put together. There was a movie. Also, the grounds seemed fairly wheelchair accessible. I'm thankful that the community of Yuma has stepped up to try to keep this important piece of history alive."], ["Reviewed October 11, 2017", 4.0, "Interesting to see", "The old Yuma Prison is well maintained and interesting to see how AZ handled prisoners way back. The area is kept well, there is an inside gallery with photos, artifacts and a video that tells the story of the prison. Definitely worth the visit, just off I 8, so easy to get on and off if you are only going through.\nShow less"], ["Reviewed October 10, 2017", 5.0, "Must see when in Yuma", "It is very interesting. A lot of history about this place which looks like an oasis in the middle of the dessert."], ["Reviewed September 27, 2017", 5.0, "GREAT place if you love history", "HUBBY LOVES HISTORY so he spent several hours wandering around.. the views are great, it's horrible to imagine prison life back then, and YES, GO, if you are into examining the past. FYI, Hubby could spend 24 hours at Alcatraz and I had to drag him away from this although I believe he saw everything.. history!\nShow less"], ["Reviewed September 24, 2017", 3.0, "Day of exploring Yuma", "This park was recommended to us by someone at the restaurant we ate breakfast at. The best part about it is the museum. It was interesting to see pictures of and read about those that was incarcerated there. The rest of the grounds wasn't as interesting.\nShow less"], ["Reviewed September 22, 2017", 4.0, "Cool place to visit", "If you have an hour or so, it's a cool place to visit. The views alone make it worthwhile. The prison has a high vantage point over the Colorado River. The guard tower is a great place for pictures.\n\nVisitors get to see what prison was like in the old west. Open air cells with iron gates at 120 degrees in the summer must have been great! The museum has artifacts and prisoner profiles.\n\nAfter it officially closed, Yuma High School used the space. They are still known as the Yuma Criminals.\nShow less"], ["Reviewed September 21, 2017", 5.0, "Good", "It's awesome, cheap, a must go place in yuma, arizona. We went in September 2017, really good at my opinion."], ["Reviewed September 20, 2017", 5.0, "interesting look at past", "Though originally a residence for criminals, my visit was enjoyable. Trivia information abounded and all places were easily accessible."], ["Reviewed September 14, 2017", 1.0, "Temporarily closed for maintenance.", "We drove the 2 1/2 hours here based on this websites listed hours. The prison is closed from September 5-20th. Not given an option to edit. Please be advised"], ["Reviewed September 6, 2017", 5.0, "prison used for many things", "this is a very interesting place its to bad that they let it deteriorate so far before putting it to use the visit is very interesting when it stopped being a prison it became the high school then when uma got a high school the kitche was used for home eck and the mascot for yuma is the criminals\nShow less"], ["Reviewed September 6, 2017", 4.0, "Great way to lock-down some local history.", "Good museum area with artifacts and exhibits... The banners showing convicts and various aspects of the prison are very interesting. Walk the yard and see the old stone and iron grate cells.... Very cool outlook over the Colorado River."], ["Reviewed September 6, 2017", 5.0, "3:10 to Yuma", "Go there every time we have visitors to Yuma. A well done restoration of a part of the Yuma territory. Also, after it was abandoned it served as the high school when the first one burned. Since then, their mascot has been the \"Criminals\""], ["Reviewed September 5, 2017", 5.0, "Back in Time for Prison", "Very interesting place, well worth a stop, so much history, and take the time to tour the grounds and the cemetery. Then is you have a little more time, explore old town Yuma."], ["Reviewed September 4, 2017", 5.0, "3:10 to Yuma", "This is nice to visit as the former prision has been made famous from movies and some the inmates that once stayed behind these wall. a guided tour ofters a lot of info into the history of this place even the time it was used as a high school. right next to the Colorado River and easy to get there. A must do when in Yuma.\nShow less"], ["Reviewed September 3, 2017", 5.0, "Taking Aunt Eppie", "Showing my Aunt what a territorial prison in Yuma look like as well as the history of Yuma. What a pleasant tour. I have been in the territorial prison a dozen times. Every time I visit, there's always something new."], ["Reviewed August 31, 2017", 5.0, "Very interesting museum", "Of course it's stinkin' hot in Yuma in July but well worth a stop here. Walk through the prison/cell area for 15-20 minutes then back in the air conditioned museum that is packed full of information. A short film about the prison itself. Plan to spend at least an hour here.\nShow less"], ["Reviewed August 31, 2017", 5.0, "Historical", "Very interesting tour The tour guides were very informative,friendly and helpful Interesting how prisons operated back in territorial days"], ["Reviewed August 22, 2017", 4.0, "Great to see if bored in Yuma", "It's so hot in Yuma in August you can't hike or ride ATVs so we took an hour to visit the prison. Very cool to see, cheap, and since we had an active duty Marine with us, we got in for $3/person."], ["Reviewed August 16, 2017", 4.0, "Awesome", "I loved it. This was a great time out for my family and I. The only down side was the heat, but that's not something that can be escaped during yuma summers. It was a history packed trip that we loved. There was even interactive things that we were able to do! I highly recommend this!\nShow less"], ["Reviewed August 8, 2017", 2.0, "------", "We were in Yuma for two days and the prison is closed two days a week and those days where of cause the two days we were there, Tuesday and Wednesday so remember to visit Yuma Monday ore Thursday- Sunday.\nWe saw it from the outside and it didn't look like there were that much to see.\nShow less"], ["Reviewed July 29, 2017", 5.0, "Prison visit", "Great history of Yuma Territory and old prison they filmed movies here 310 to Yuma, there is a small museum with a lot of history about the surrounding territories, unbelievable how the prisoners were kept inside those cells!"], ["Reviewed July 22, 2017", 4.0, "Definitely Worth a Visit", "Was passing through Yuma between 2 business meetings and wasn't expecting it to be anything other than an overnight stop. But decided to visit the prison before leaving in the morning. Found it very interesting, although only a small site there was a lot to see and a very well presented museum, just glad I wasn't one of the inmates and could leave after a couple of hours!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Historic hell hole", "This is a very well preserved historic site with pictures, artifacts, and actual cells to give you a feel for what life was really like for the prisoners. Well worth the time to visit!"], ["Reviewed July 10, 2017", 5.0, "Great Slice of History", "Overlooking the river and Yuma is this amazing old prison! So much history in this one location. A great way to spend a few hours and learn a good deal of the local history!"], ["Reviewed July 9, 2017", 5.0, "Great spot to visit! Beware of the bats in the dark room!", "We just visited here! Despite the incredible heat, we had a wonderful time. Very interesting place. I appreciated the short movie on the prison's background. So many cool items on display, and it was fun, though on the hot side!, to walk around the cells outside. I was definitely startled a few times! For instance, I walked up to one cell, and a man's voice started talking to me! I definitely wasn't expecting that! Also, we went to the dark, isolation cell and suddenly bats were flying overhead! I admit I did a little bit of a scream and raced out! :). We loved chatting with the two gentlemen who were in the gift shop!! They taught me everything I need to know about dust storms! :) I hope to never hit one, but if I do I will now know what to do if I'm driving! All in all, we had a great visit, and I highly recommend this place!\nShow less"], ["Reviewed July 4, 2017", 5.0, "Yuma Prison Museum", "Employment transfer has brought me here and I have learned about the great sightseeing spots located in and around Yuma from co-workers. I consider a MUST DO event while deployed or employed to Yuma. It’s a small museum and reading can be done in one visit, but good to go at least couple times. The Yuma Territorial prison museum is such a great history lesson and amazing. I have taken my family and grandkids we all had such a blast! I recommend the museum but best to go during cooler weather, however, I noticed some cells are closed off during cooler and “winter” months- not sure why? Make it a point to visit the dark cell where bats habitat during summer, if going during summer time. Military and Veteran discounts apply only with a Yuma local resident address. Museum is cute with fair and interesting gifts.\nShow less"], ["Reviewed July 2, 2017", 5.0, "Must see", "Super interessting place to see. When we arrived we got welcomed by the staff and received information about the place. This time of the year it is very hot, but still worth going. This gives a good view about the circumstances the prisoners used to be in. The museum inside is very cool aswell with fascinating stories. Totally recommend this to everyone !\nShow less"], ["Reviewed July 2, 2017", 4.0, "Old west history", "My husband and I always watch old westerns Yuma Territorial Prison is mentioned in many ,so we decided to add it to our must visit list. Very interesting place, showed the harshness of the old west prison system. Enjoy looking at the old photos ,weapons, etc. We took our grandchildren 8 and 10 they loved going into the prison cells. Would recommend to families but not with toddlers.\nShow less"], ["Reviewed June 27, 2017", 4.0, "Interesting History", "Definitely worth seeing if you are in the area. Lots of history and stories regarding the inmates. Allow about 2 hours to tour the grounds, cells and museum."], ["Reviewed June 25, 2017", 5.0, "Rich in History!", "I visited this place with family a few months back and wasn't quite sure what to make of it at first. I didn't really know much history about Yuma or it's prison for that matter, but coming here, I realized there was more to this place than what I had first assumed.\n\nWalking through history in this powerful place, you feel a sense of pain and despair for the souls that were imprisoned here so long ago. There's informational posts and artifacts from that time in the building leading up to the cells outside and you get a first-hand look at the type of people that were placed here.\n\nI know a ghost show filmed an episode in this place a while back, whether or not there's spirits here is up to those who've walked through this place. Although I can say from personal experience, there's definitely some sort of negative energy emanating from the Dark Cell, I felt uncomfortable being in there for too long, just adding to the overall experience of this place.\n\nDefinitely recommend to anyone coming through Yuma!\nShow less"], ["Reviewed June 21, 2017", 5.0, "Family vacay", "Very interesting and informative. Temperature was warm but not too hot to handle. There's a 45 minute tour where they tell you the history. Good, safe parking. Plenty of shade and views of the town."], ["Reviewed June 21, 2017", 4.0, "A lil bit of western history", "On our way to San Diego, my husband and I had to stop and explore the prison just because of all the western movies with the Yuma prison in them. A very impressive display of the old west, how Yuma was a steamboat stop and just the territories of California and Arizona and how they came into existence. Maybe we need to bring back the Yuma prison as a deterrent? Just a thought\nShow less"], ["Reviewed June 11, 2017", 5.0, "Very Eye-Opening", "Seeing the prison cells and especially the \"dark cell\" was scary. No wonder prisoners never wanted to be kept there. Well worth seeing. Many pictures, personal items, and stories in \"museum\" area."], ["Reviewed June 3, 2017", 5.0, "Very Interesting", "Got to see how people lived a long time ago when in prison. After seeing this, I can't believe anyone survived in this environment."], ["Reviewed May 30, 2017", 5.0, "Interesting", "The old cells are dark and spooky and you wonder how they survived compared to how prisoners are treated now. The grounds and information was really interesting. Recommend this place."], ["Reviewed May 29, 2017", 5.0, "Excellent tour", "Our tour guide was very good. He really explained everything well. The museum had excellent displays. I enjoyed reading about some of the inmates. Very, very interesting.\nShow less"], ["Reviewed May 29, 2017", 5.0, "Thanks to volunteer Dan Perez", "On a recent return visit to Yuma with my husband, I had to show him the old prison. Dan Perez offered us his tour, as he is a volunteer. That is what made this trip great! His stories and reenactments made for a great tour. Thank you.\nShow less"], ["Reviewed May 26, 2017", 5.0, "loved it", "it was a amazing site to see.. lots to look at there and see great history for young children and teens to know about yuma"], ["Reviewed May 24, 2017", 5.0, "Definitely need to see!", "You can learn so much. Also, they have taken great care to set things up for your enjoyment. It is at least a one time stop if not more."], ["Reviewed May 24, 2017", 5.0, "Fantasticexperience", "Missed out on our visit because of daylight saving time after driving from Palm Springs, so we decided to stay overnight and check out the prison in the morning.\nExpected a quick visit but had an absolute ball going through the place.\nSelf guided tour but everything was explained perfectly.\nAnyone visiting the US should place this on their list.\nMaybe not as good as Alcatraz but runs a very close second.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Interesting Visit", "This is a nice place to bring visitors. There is lots of cool information. Bring your camera for some fun photo opportunities. ."], ["Reviewed May 21, 2017", 5.0, "Great that this history has been saved", "Very interesting to hear the stories & see the prison. I appreciated that we were allowed to wander on our own at our own rate. Definitely worth seeing."], ["Reviewed May 20, 2017", 5.0, "Yuma Territorial Prison - Part of the Old West history", "Yuma Territorial Prison is part of the Old West history. While Arizona was still a territory in 1875, the Yuma Territory Prison opened and accepted its first inmate in 1876. The prison was in operation for 33 years up until 1909 when a new prison was built in Florence, Arizona. Some of the prominent inmates included: Frank Leslie – gunfighter and killer of Billy Claiborne, Pete Spence – outlaw involved in the Earp Clanton feud, Burt Alvord – Cochise County lawman and train robber, Pearl Hart – stagecoach robber and William Jordan Flake – Mormon pioneer who violated the Edmunds Act. This historic prison now transformed into a museum is extremely well done and a very interesting place to visit for an hour or so. I am glad we stopped there on our trip back from San Diego, California.\nShow less"], ["Reviewed May 12, 2017", 5.0, "\" Great decision to visit\"", "We were going to mexico, but it was a bit to cold on may 9th, 17, so we decided to do this. Great decision, so much fun and history, half off retired military, and with disability, mine was free, Thanks for doing that. But the regular fee is not bad at all $6.00. We had a fun time touring on our own, checking it all out, i think we were there over a good two hours or more, we took it all in, but we love history about our state, etc, Worth it, a dont miss, the grounds and cemetery were awesome also, fun for whole family, with interest in history\nShow less"], ["Reviewed May 10, 2017", 4.0, "Interesting and detailed museum of items and facts about the prison.", "This is a great place to visit if you're into historical events. The prison's founding, operations and progressive approach to prisoner rehabilitation is fascinating. It was ahead of it's time. There are many exhibits within the main building, a short video, a guard tower [which you see in the photo] grounds to tour, views with story boards to explore as well as a hilltop cemetery of unmarked graves.\nShow less"], ["Reviewed May 9, 2017", 4.0, "worth the stop!", "I stop in yuma for gas every trip to San Diego from Phoenix, usually it is gas n go.. finally we stopped at the museum.. very interesting piece of history! I'd say its a good stop for kids of all ages when the weather is cool enough... I wouldn't stop in july! Very well preserved... inexpensive, interesting and worth the stop.. allow a good 2 hours. Then go to the brewery!!\nShow less"], ["Reviewed May 7, 2017", 5.0, "An excellent way of spending a morning", "Before we visited Yuma, we didn't even know there was an old prison. We took the leaflet it was in which gave us a dollar off each, The total admission cost was $5 each.\nBest to go early morning (opens at 0900) before it gets too hot. What fun the prisoners, in their cells, must have had.\nThe short video, in the cinema was very informative and the entire exhibition was great.\nWell worth a visit.\nShow less"], ["Reviewed May 3, 2017", 5.0, "A closer look behind the bars and old west justice.", "Excellent stop in Yuma, great representation of the early criminal justice system, take the kids too!"], ["Reviewed May 2, 2017", 4.0, "excellent especially if you are western buff", "We spent about four hours at this place, hats off to the folks of Yuma for making this possible. A great job of explaining back in the days and how it was to be imprisoned here."], ["Reviewed April 29, 2017", 5.0, "Great historical location", "I grew up in Yuma, so have visited the prison on many occasions. I did not visit on my last trip to Yuma, but would highly recommend taking the time to see it. Very interesting and well worth the time."], ["Reviewed April 26, 2017", 5.0, "Interesting History", "Very interesting learning about the history of the prison. We had a good time stepping into the old cells and imagining the conversations of the prisoners who were once housed there."], ["Reviewed April 26, 2017", 5.0, "An unexpected delight", "We were looking for something to do on our overnight stay in Yuma. We 'settled' for a quick look at the old jail, but came away 4 hours later absolutely thrilled with our visit. The grounds are lovely, the jail is largely intact, the museum is very interesting, and well set out . The talk/tour was great, taken by a volunteer, he made it such fun. All in all what started out as a 'something to fill in an hour or so' turned out to be one of the highlights of our entire trip! Most enjoyable!\nShow less"], ["Reviewed April 24, 2017", 4.0, "Great way to spend an hour in history.", "Much of the prison was re-purposed for other things in later times, but some has been preserved and/or restored. Read the plaques and see the film to get the fullest experience."], ["Reviewed April 22, 2017", 3.0, "Worth a brief stop", "We were on our way to San Diego, and Yuma was on the way. If you've ever been to a historic jail (i.e. Alcatraz) then you know what to expect. The rangers have done a fine job at making all of the exhibits interesting including \"ghosts\" who tell their tale from beyond. The entry fee is $6, so not a budget breaker, but as one might expect, dogs are not allowed (although we saw a woman holding her \"service\" dog). The view is pretty darn good, and there's a nice spot for a picnic, and trees if it's too hot.\nShow less"], ["Reviewed April 21, 2017", 4.0, "An interesting stop", "This was one of many stops we made during our family road trip in April 2017. I was happy that we did. The staff was friendly and helpful and the prison was very interesting to tour through. The cost was reasonable for what you get to see.\nShow less"], ["Reviewed April 21, 2017", 4.0, "Break the law? Not in that heat!", "Another great historic park with lots of information and displays to demonstrate prison life in the heat of Yuma. Watch the video to learn about the prison history and how it evolved from hell hole to almost resort like status. One piece of the video mentions how the guard would torment the prisoners in the dark cell by tossing in tarantulas, scorpions and snakes into the cell. Wow!! Many interesting displays inside the museum. Then take a walk outside to see the prison grounds including the cell blocks, guard tower, prison yard, dark cell, and one cell, well, prisoner could work on their tan. Some of the cell even speak to you! No ghost sightings for me this time around, but maybe next time? Check out the park website for seasonal hours and closures. It is an easy walk, but do bring water, a hat and sunscreen, because it can be really hot in the spring and summer months. Great park for history buffs.\nShow less"], ["Reviewed April 14, 2017", 4.0, "\"Great, but wanted to see all as it once was\".", "See the short film about the prison first, then explore the fascinating museum.\nYou will read about and see photos of some of the 3069 men and women imprisoned here.\nThey all existed here in a crucible of hell of inhuman cruelty and suffering.\nA few managed to escape, never heard from again. They probably died in the desert or nearby quicksand. Some committed suicide. 100 are buried on a nearby hill.\nLater, the prisoners were treated better, having life better than the locals.\nSo much of the land and many buildings are gone and even the once mighty and majestic Colorado river has been reduced to mere creek below.\nWell worth $6 admission fee.\n\nShow less"], ["Reviewed April 14, 2017", 5.0, "Interesting place", "I was in Yuma last summer to meet up with a friend and decided to go here for a visit. This is a great place to go if you are in the area and it offers a number of wonderful picture opportunities as well as historical insight.\nShow less"], ["Reviewed April 12, 2017", 5.0, "Didn't think I would be interested, but I was!", "My husband wanted to visit the prison so I \"went along.\" The gift shop was amazing. We took the guided tour with Dan, who was extremely knowledgeable and friendly. I found myself wanting to research the prison because it fascinated me so after the guided tour. A must see if you're in Yuma.\n\nThere are picnic areas close by the river.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great Visit Back in time!", "Yuma is a great place to take your kids. Very educational. Lots of kids there getting tour. What was so amazing was to see all the snowbirds there too."], ["Reviewed April 10, 2017", 5.0, "A Real Reality Show", "Read about the history of Arizona. Everything the history books say about this place is TRUE. No one brought up the ghosts. Let's leave them alone.\n\nAs you tour the grounds, you get a feel for life here. Not very nice. The artifacts were well displayed. Add the actual prison cells and you have one heck of a time. Then, you get to imagine a few days in the Dark Cell. No thanks!\n\nIf you get to west Arizona, this is a MUST stop.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Must see in Yuma!", "This museum exceeded expectations. We are the type of travelers who try to make the most of every stop...we settled on the Territorial prison after reading the reviews. The reviews were right on. The grounds are beautiful and the history is plentiful. They have used technology well here, with stories told in a way that takes you back in time. The artifacts and photos leave you pondering the lives and life styles of many famous an infamous people and towns.\nShow less"], ["Reviewed April 10, 2017", 5.0, "Great Staff", "Really interesting glimpse into the the regions history. The staff was very friendly and helpful. I really enjoyed reading some of the graffiti found on the prison wall. Some of it dated back the the very early 1900s. Our six year old was very interested in the well organized museum. Well worth the visit for sure.\nShow less"], ["Reviewed April 9, 2017", 5.0, "need this kind of jail for criminals now", "very interesting to see, prices are very reasonable 6$ a person, this is the kind of jail the criminals need today, the would think about crime twice i am sure of it, but if in Yuma go check it out, it's worth your time for sure\nShow less"], ["Reviewed April 7, 2017", 4.0, "Interesting", "Fascinating place, great tour guide. Very enjoyable few hours. Very hot day and a fair bit is in the open but we managed. Recommended."], ["Reviewed April 6, 2017", 5.0, "Great attraction", "We have visited here twice and it never disappoints. Very interesting and the staff is knowledgeable and friendly. Great gift shop too."], ["Reviewed April 5, 2017", 5.0, "Great day trip", "My husband and I had a great experience walking through the prison. There was a lot to look at and learn. I love how some of the cells are original structures. Its not big enough to be overwhelmed by information or things to look at. Definitely a cool experience. Active military discount is offered.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Yuma Territorial Prison", "A lot of history in the old prison. Tours are very informative of the life of a prisoner and their living quarters"], ["Reviewed April 4, 2017", 5.0, "Facinating", "Spent a good 4 hours here. Although some of the original prison does not exist any longer, what is left is fascinating. There is a lot of history here and well worth the visit."], ["Reviewed March 31, 2017", 4.0, "You will enjoy your time behind bars", "The Yuma Territorial Prison State Historic Park offers a view back in time to Arizona's early Anglo pioneer period. A museum offers in depth information about the prisoners, administrators and history of the site. Visitors can stroll through the remaining cell blocs, visit the cemetery and stand in darkness in solitary confinement. The location of the prison is spectacular, on one of two granite outcroppings that straddle the Colorado River, one side on California, the other Arizona. Many famous Old West characters from Arizona's history passed through here and their stories are told in the museum. History buffs will enjoy this place immensely, but less interested adults and children will like walking around and into the historic jail cells. It is easy to find yourself transported back to the days when this was an active prison. The staff is friendly; it is clean, well organized and attractive. Highly recommended. Hint: best to visit during the cooler times of the year.\nShow less"], ["Reviewed March 30, 2017", 5.0, "Great place to tpur", "Plan on spending a couple of hours here to take everything in. Full of history and the exhibits are well done. There is also a movie to watch. Gift shop is very nice - offering a few souvenirs. Entrance fee is reasonably priced at $6. Really enjoyed this place\nShow less"], ["Reviewed March 29, 2017", 4.0, "Worth the time", "We weren't sure what to expect here, but it seemed to be one of the more important places in the area. There was lots of Arizona history and history about the Colorado River, which used to be quite wide before damming up years ago. The museum documents a lot of interesting information.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Yuma Terr. Prison", "Great place to see how it was back in the day. Kids loved it and learned a lot. Will go back again. It is a great place to visit while in Yuma."], ["Reviewed March 26, 2017", 4.0, "a part of the past that is worth keeping in the future.", "Absolutely loved this trip, spent 3 hours here. recommend you leave yourself at least two hours to read and visit it. Closes early."], ["Reviewed March 26, 2017", 5.0, "Interesting piece of Arizona History", "Very interesting display with lots of information about the prison, wardens and prisoners. Even though it was \"state of art\" in its day, the conditions were harsh. Great view from the guard tower. Cost was $6 per person and worth the price."], ["Reviewed March 25, 2017", 4.0, "Very Interesting", "We really enjoyed our visit to the prison. Lots of interesting facts told by a volunteer guide. A museum with lots of artifacts and a short video of the history of the prison. The crew running the gift shop were knowledgeable and friendly. A good experience and would recommend this to anyone passing through Yuma.\nShow less"], ["Reviewed March 23, 2017", 4.0, "If you're in Yuma, worth going to", "Interesting look at the penal system in the territorial west at the turn of the last century. There is a volunteer tour guide but we didn't think he added much and left after 10 minutes. What is perhaps most interesting is reading the short stories of the various inmates. It gives you a picture of that day's society. Adulterers, I think all women in this jail, received as harsh a sentence as those who were convicted of manslaughter!\nShow less"], ["Reviewed March 22, 2017", 5.0, "Very Interesting!", "We truly enjoyed the tour and learned a lot! There was a lot of information, pictures, and artifacts in the main building, plus actually seeing the prison and cells brought everything into perspective!"], ["Reviewed March 18, 2017", 5.0, "Visit to State Park", "Our tour guide was very knowledgeadle and showed us a great museum with many exhibits .The story of all the well known people. The museum was well look after."], ["Reviewed March 17, 2017", 4.0, "don't miss this if you are in Yuma", "This historic old prison is very well done. We love to visit these types of old history exhibits and thi9s is well done and really interesting. Admission is reasonable and parking and access is easy. Interesting to learn that even though it was a prison, for its time it was modern in many aspects. Prisoners had access to a library, and could learn trades that they could put to use once they were freed. Some very hard time could be served in the \"Dark Cell\" if they did not follow the rules.\nShow less"], ["Reviewed March 16, 2017", 5.0, "Road trip", "The Yuma territory Prison was interesting to visit\nShowed how the prisoners were treated. They were treated very good\nThey grew vegetables, they worked on the prison building walls and buildings, Had a library. The superintendents at this prison want to better the prisoners with education, work and responsibilities\nA lot of history. A must see!!\nShow less"], ["Reviewed March 16, 2017", 5.0, "Great tour", "Loved seeing the old prison and all it had to tell the guest. Very informational. Loved seeing, reading and learning the history."], ["Reviewed March 15, 2017", 5.0, "Educational and Interesting!", "This is a truly amazing piece of history. There is a short introductory movie, many wonderful exhibits and information about the prison and its occupants, and a great tour. Do not miss the tour!! The guide we had (Bob, I think) was so well-informed and had many stories and fun anecdotes about the prisoners, their escape attempts, etc. The grounds are well maintained and you can go into some of the cells to imagine what it was like. My husband and I learned a lot and really enjoyed our visit.\nShow less"], ["Reviewed March 15, 2017", 4.0, "Well worth a couple hours", "Husband really enjoyed this as much as he enjoys watching old west movies. I also found it interesting and educational even though i am not normally an old-west fan. The docent/volunteer was very interesting, presenting many stories about the many inmates that were housed here, including several women.\nShow less"], ["Reviewed March 15, 2017", 4.0, "Old Yuma Prison", "Gosh, to think that people really lived and went through that place. Fascinating and creepy at the same time. Good to take the family through this.."], ["Reviewed March 13, 2017", 5.0, "Very interesting", "This is a very well kept piece of history. Grounds are immaculate and the actual cells and yards are are spooky because you can feel the souls of the people that were jailed there. The cells are very well kept. I would say this is a place to see\nShow less"], ["Reviewed March 13, 2017", 5.0, "Yuma prison", "This is very interesting history. Enjoyed wandering around the prison, looking in the cells and listening to the recordings of \"prisoners\" talking about themselves. The museum and film were informative you could even take a prison photo of yourself or someone in your party"], ["Reviewed March 13, 2017", 5.0, "Yuma Territorial Prison", "Prison was a part of growing up in Yuma. First high school classes were taught in prison facilities after it was closed as a prison. There has been quite a bit of restoration over the years and the current facility provides a great view of what prison life was like - not good.\nShow less"], ["Reviewed March 13, 2017", 4.0, "Nice for a few minutes, but thats about all the time you will spend", "This a very nice way to spend a few minutes in Yuma. I dropped it and enjoyed the 30 minutes it took to see everything. I was there in Feb and the weather was very nice. there is a few things to see in some of the cells, but most are empty. If this is the number 1 attraction in Yuma, then you must see it.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Worth the visit", "We visited the prison while we were visiting the Quartermaster Depot. All within walking distance of each other. Very interesting with a knowledgeable guide who could put you back there in that time. Interesting fact was that the original prisoners had to build their own cells. A lot of history there. We also went for a nice 2 mile walk along the river side. Very enjoyable time.\nShow less"], ["Reviewed March 12, 2017", 5.0, "Awesome", "So enjoyed viewing the Yuma territorial prison. The history, the displays, were all so interesting. Wish there was more of the original structures left but was well worth going and I'll go back again. Only $6.00 per adult. So much fun for so little. The gift shop was reasonably priced too! If you haven't been, you need to make this place a priority.\nShow less"], ["Reviewed March 11, 2017", 5.0, "Glory Run to Cali", "Parking is free and wide open. Cost was 6 bucks but many discounts could be redeemed. Did not have my VA disabled ID. Their is a mini theater to watch a movie about the prison. Enjoyed it. Many displays to read. You also can walk in a cell and even the dark one. Life was much different then. I schooled myself about some inmates. Historical significance of the prison was great. I should have visited this a long time ago. Not far from San Diego. For military their is a marine base for lodging. 60 bucks was a steal. I thoroughly enjoyed the day at prison. Recommend for us history guys.\nShow less"], ["Reviewed March 11, 2017", 5.0, "a prison that you won't forget soon", "We had Bob as our guide. He told us that he was a volunteer and loved this job. This was easy to tell as he gave us lots of information in a friendly way. He gave us the history of the prison; how it was started; some of the prisoners and a piece of their background; some stories about the female prisoners; etc. He also told us how it was used as a school for a while and also how it was used by the homeless for a while. He gave us the opportunity to experience the dark room. We would have not enjoyed this prison visit without our guide Bob. Thanks Bob, you were great.\nShow less"], ["Reviewed March 9, 2017", 5.0, "Wonderful place in history", "Make sure to take a tour with GARY! Gary was the best tour guide we have ever had. He was very knowledgeable and entertaining in giving us the history of the jail. He is the best person to ask questions about the jail. I really hope he gets rewarded well for his great job. The facts we found out on the jail we would of never know without Gary.\nShow less"], ["Reviewed March 8, 2017", 5.0, "So much fun!", "This is a great little state park. It teaches some of the history of our great state. You get an up close view of what prison life was like. It is unusual to get to actually touch history!! Great place to let kids run and be kids. Has nice grass area and a few tables to resting. The staff were great. Very informative, helpful & friendly!! Lucinda you ROCK!!!\nShow less"], ["Reviewed March 5, 2017", 5.0, "Country Club on the Colorado", "An interesting look into the world of prisons and how they were reformed by women such as Madora Ingalls. The actual cells are disturbing in that they were crowded, dark, dank and \"self\" constructed by the first inmates in 1876. Experience the infamous \"dark cell\" for uncontrollable prisoners. The museum is filled with fascinating information about who resided at the prison, such as \"Bad Girls of the Old West\". Watch the brief video of the prison before you venture around the self guided displays. Docents are available at set times for a guided tour. Ask: Why Yuma Union High School is Proud Home of the Criminals?\nShow less"], ["Reviewed March 5, 2017", 5.0, "Mysterious", "I don't know if mysterious is the right word. The prison is full of history. The museum was interesting especially the history of the woman that were there. It is a must to read all the historical information on them. The walk through the cells was creepy they felt haunted. The dark cell was musty I never want to be locked in one. A must see when visiting Yuma.\nShow less"], ["Reviewed March 5, 2017", 5.0, "Been here many times always amazes me", "Haven't been here in 4 years and it's still a place I'd see over and over again, it's a bit of a drive from scottsdale but it's worth the drive to Yuma and see all that's here"], ["Reviewed March 4, 2017", 4.0, "Historical and interesting", "It's not very big, but big on information and history. It was a unique experience that I am glad to have experienced. If in Yuma, give yourself an hour or so to check out all the memorabilia, short video and self guided tour of the grounds.\nShow less"], ["Reviewed March 2, 2017", 4.0, "Interesting", "We really enjoyed our time here. It was fun and very interesting. The dark cell was creepy. Definitely worth the time to stop."], ["Reviewed March 2, 2017", 5.0, "Awesome", "Awesome preservation of history and a must see when in Yuma. Credit to those who saved what was left of the prison."], ["Reviewed March 1, 2017", 4.0, "A Great Slice of History", "It's too bad that the entire prison wasn't saved from the railway construction but what remains is still very impressive.\n\nAuthentic to the point that it is somewhat disturbing but the life and times of Yuma Territorial Prison are clearly portrayed because of the excellent efforts of restorers, the museum displays, the tour guides, and the prison walls that speak so loudly to bring the past right in front of us.\n\nAdmission was cheap, the experience invaluable, and our visit was a complete treasure.\n\nDon't bother to stop in if history isn't your thing because this is the real thing and it's fascinatingly brutal.\n\nThe staff match are exceptional so exactly match the experience.\n\nA small gift shop comes up short of potential reading material but perhaps this reflects the demands of the visitors.\n\nParking is a bit unfair as RV units have to park somewhat away from the entrance even though RV occupants tend to be a bit older and really don't need the extra grief.\n\nWhile most areas are on level ground there is good easy stair access to elevated places.\n\nGreat site signage with historical references to surrounding territory.\n\nOverall a real winner - but only if history is of interest to you.\nShow less"], ["Reviewed February 28, 2017", 4.0, "Interesting place", "This is very interesting place. They have done a nice job of restoration and there are lots of interesting facts. Stories. Women prisoners."], ["Reviewed February 28, 2017", 4.0, "need to see", "very interesting museum--took grandsons, and they really enjoyed it--it nearly closed some years back from lack of funding, but the citizens of yuma raised money to keep it opened. only thing I can really fault is the restroom facilities--need more for the size of the park, and the number of people visiting--\nShow less"], ["Reviewed February 27, 2017", 3.0, "Small but perfectly formed", "Stopped here on our way across the I-8. Nice little museum and site to stretch your legs. Interesting information about the prisoners and the prison."], ["Reviewed February 25, 2017", 4.0, "Harsh Pridoner Conditions", "Great Yuma history. Intetesting displays with actual photos & write-ups of prisoners. Take the tour & you will learn even more facts. Our friends had taken the tour & said it was very enjoyable. Our bad to not have done so.\nWorth the $6 entry fee.\nShow less"], ["Reviewed February 25, 2017", 4.0, "Small but worth a look", "We toured this several years ago and it used to be bigger but due to construction the grounds and museum have gotten smaller. It's still very informative and neat to see the old prison cells and hear about how they ran the prison and what type of criminals would be kept there. At only 6 dollars you can't go wrong.\nShow less"], ["Reviewed February 24, 2017", 3.0, "An OK attraction but overpriced", "We had been through Yuma so many times and never visited the prison so this time we made it happen. I saw the site fees on the entrance door and notice a half-off discount for military. OK, I thought, this is a great deal. However, when I presented my military ID to the park agent, he asked if I was an AZ resident. I told him no and he said \"Only AZ military residents qualify for this discount.\" That soured our outlook right away. AZ state parks folks should change this rule to admit ALL military ID holders at the discounted price.\n\nThe smallish museum, which includes a short film documentary on the area and prison, was interesting and can be inspected in about 30-45 minutes depending on how much you wish to read.\n\nThe prison cells and yards offer a view of the not-so-plush life the convicts endured. Don't miss the \"dark hole\" solitary cell dug into one of the embankments.\n\nI am glad we finally visited the prison site but still harbor disappointment at their discount rules.\nShow less"], ["Reviewed February 23, 2017", 5.0, "Great place", "This was our second visit. The tour guide BOB is excellent, had him both years. He is very knowledgeable. If you have kids or would just like the history this is a great place to visit. The video is very informative. Would go back again."], ["Reviewed February 22, 2017", 5.0, "Great historic attraction. Take the guided tour", "A bit of AZ history you can relive. Guided tour makes this the best experience. Great stories told by someone with a passion for the prison. Learn about the first female inmate and how she was handled.\nModest entry fee. Easy walking nice ability to self guide if you miss the tour\nShow less"], ["Reviewed February 22, 2017", 4.0, "Nice place to VISIT. . . . .", "Toured the Yuma Territorial Prison. Modern prisoners are absolutely coddled compared to the brutal conditions that these men and women had. Some of the original buildings are well preserved and maintained as well as many artifacts. Displays inside the air conditioned building were very interesting and informative. The outside buildings were also 'sobering'. We opted for a self paced tour instead of the guided tour, but noted many seemed to be enjoying the guided tour offered by the docents. Take your time and experience the prison.\nShow less"], ["Reviewed February 19, 2017", 5.0, "Excellent and informative", "An excellent destination, reasonable cost. Make sure you time your arrival to join one of the guide's groups, the guides are very informative. The museum has lots of interesting displays, and you can dress yourself up in a striped outfit for pictures. This is about a 1-2 hour activity, and is an easy stroll with relatively easy access.\nShow less"], ["Reviewed February 17, 2017", 4.0, "A pleasant surprise", "We stopped here with no expectations but enjoyed immensely. The tour guide was great. It was very informative and rich in history. Some of the stories were crazy what the prisoners endured. This doesn't take long so check it out."], ["Reviewed February 17, 2017", 5.0, "Jail time", "I have visited the prison on several occasions with friends and family. If you enjoy history about the West, or just have an afternoon to fill; it is definitely worth a visit. The tour is self guided which let's you go at your own pace and makes it easy to explore. The signage is pretty good and has a lot of interesting information. The staff is knowledgeable and will answer any questions you have. They will even give you a tour if you ask. Lots of displays and artifacts. Several cells remain open which let's you fully embrace the experience. Several interactive exhibits and a photo booth. Suvineer shop at the main entrance. No restaurant on site. Close to downtown, Yuma Palms, parks, and dining. Mostly outdoor so, I don't advise visiting mid summer.\nShow less"], ["Reviewed February 15, 2017", 5.0, "Glad I wasn't a prisoner!", "Wow! Nicely restored, good artifacts, and pretty good signage. Really, really glad I didn't have to do time there...hot, hot, hoy!"], ["Reviewed February 15, 2017", 4.0, "Family trip", "Had a family reunion last November. Went thru the old prison and found it very interesting. We really liked the fact that it was self-guiding and easy to understand how life was like. We did find it a little creepy that it was also the high school at one time, but at the same time they became part of the history.\nShow less"], ["Reviewed February 15, 2017", 4.0, "Time off from work", "I've seen movie about the prison and I've been coming down here for years so I finally decided to go see it for myself. It was interesting and the fact that so many people put in a very small place. And I had no idea that women were also at this person. The one thing that struck me was that the walls were so thick in the cells that was actually cool in the cell that it was outside. So if you get a chance it's a place to go see so you can say you've been there.\nShow less"], ["Reviewed February 14, 2017", 5.0, "If you love the Wild West and history...", "... this is for you! Perfect place to stop for an hour we thought mid way through a 500 mile drive, and so it was, except we spent almost two hours there... but it was well worth it and the entrance fee of 6 USD a steal! Very well done and we now know a great deal more about the prison of \"3:10 to Tuma\" fame...\nShow less"], ["Reviewed February 14, 2017", 3.0, "Okay but a little disappointed.", "From reading , I really did expect a more gruesome setting, but to be honest, it was the remnants of what once was. A lot has been destroyed by time and weather. Yuma in an summer has to be incredible so I'm sure it was hell.\nShow less"], ["Reviewed February 14, 2017", 4.0, "Lots of history", "Friendly clerks, tour guides and interesting Yuma and prison history here. Enjoyed our guided tour and the museum."], ["Reviewed February 13, 2017", 5.0, "Amazing piece of history", "My wife and another couple went here and we absolutely had a gantastic time. It does not require alot of time to go through but you can spend hours if you enjoy history as much as we do. The Staff is first rate and engaging"], ["Reviewed February 13, 2017", 5.0, "Great historical visit!", "This is a small but interesting bit of history. Great for something to do for 2 to 3 hours and good for families and adults alike."], ["Reviewed February 13, 2017", 5.0, "Wonderful history", "The prison is a wonderful history lesson that you might not hear about anywhere else. Expect to spend a couple of hours there."], ["Reviewed February 12, 2017", 5.0, "Great tour", "We visited on Tuesday which is the same day the tour guide volunteers. He had a lot of great information to share which we would not have received with a self guided tour. One of Yuma's must see attractions!"], ["Reviewed February 11, 2017", 4.0, "Very interesting. We enjoyed it.", "We visited in February, so it was a nice 75 degrees, perfect for walking around outside in a 100 year old prison!\n\nWe enjoyed the museum. My wife is not a museum person, so for her to say she enjoyed it was great!\n\nWe saw a segment on the TV show \"Mysteries At The Museum\" about Pearl Hart, who was imprisoned there, so it was cool seeing her pistol there at the museum.\n\nI would definitely recommend checking this place out at least once. Try to go on a day when it's under 80 degrees.\n\nShow less"], ["Reviewed February 8, 2017", 5.0, "Extremely interesting", "I had a few hours to kill off so I took in the prison museum. I enjoyed every minute of the tour, plaques, cells... every part was informative and interesting.\n\nWell worth taking the time to go thru and take in the museum\n\nOverall rating out of 5\n4 location\n4 access to Museum\n4 entrance fee\n4.5 tour guide\n4.5 information provided\n4 bathrooms\n5 cleanliness\n5 interesting\nShow less"], ["Reviewed February 7, 2017", 5.0, "An interesting bit of the old west open to tour", "My husband and I were in Yuma visiting with friends. After watching \"3:10 to Yuma\" numerous times with my son, we felt a visit to the Territorial Prison might be just the ticket. Fortunately I think the most famous thing about Yuma is perhaps that movie's title. The same applies to the Territorial Prison. I was disappointed to find out that no one famous was ever housed there. In fact many of the inmates were there for very bizarre reasons, including several ladies. The prison is actually famous for having been such a miserable place to be housed. Of course during that time, incarceration was very different than now. The accommodations were extremely primitive and generally exposed to the extreme weather conditions that occur in Yuma approximately six to eight months out of the year. I can certainly understand why offenders did not want to be sent to the Territorial Prison. It was a great place to repent for your crimes as you suffered in the sun and extremely high temperatures. That being said, visiting the Territorial Prison is worth your while. The prison itself is interesting to walk through with cells that you can view, as well as an attached informational Center with artifacts and stories all about the history of the prison. If you happen to be in the Yuma area I would say it is a must visit. You won't find Christian Bale or Russell Crowe, but it is a very interesting place to go!\nShow less"], ["Reviewed February 6, 2017", 5.0, "Make sure to stop and see", "I have been in Yuma numerous times and never stopped. I had my 12 year old with me and it was a spur of the moment, type of action. We self guided the grounds, cells, and the museum. If we had more time, it would have been a blast to done on tour with a guide. We enjoyed it, with the little time we had available. It was worth it\nShow less"], ["Reviewed February 6, 2017", 4.0, "Yuma Prison", "too bad so much of the original had been destroyed. But nice that they saved what they could and redo."], ["Reviewed February 5, 2017", 4.0, "Territorial Prioson", "The staff was great and very informative. Enjoyed all the history and the artifacts. Interesting to see that they also had women prisoners. Liked seeing the facts about those who they pardoned and those who served their entire sentence."], ["Reviewed February 5, 2017", 5.0, "Must See", "If your in Yuma and have about a hour to due you must see the prison. Great for the whole family and all ages."], ["Reviewed February 4, 2017", 5.0, "Sobering", "Fascinating place to visit to get a taste of what prison was like long ago. The tour is self-guiding, so you take as much or as little time as you want to wander the grounds."], ["Reviewed February 3, 2017", 5.0, "Yuma Territorial Prison", "We really enjoyed our visit. The tour guide was very knowledgeable about the prison, it's \"visitors\" and it's history."]]}}