{"Zabriskie Point": {"@context": "http://schema.org", "@type": "LocalBusiness", "name": "Zabriskie Point", "url": "/Attraction_Review-g143021-d116978-Reviews-Zabriskie_Point-Death_Valley_National_Park_California.html", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/37/16/84/die-erhebungen-sehen.jpg", "aggregateRating": {"@type": "AggregateRating", "ratingValue": "4.5", "reviewCount": "2195"}, "address": {"@type": "PostalAddress", "streetAddress": "Route 190", "addressLocality": "", "addressRegion": "California", "postalCode": "92328", "addressCountry": {"@type": "Country", "name": "United States"}}, "reviews": [["Reviewed yesterday", 5.0, "Great Landscape and Views", "Stunning landscape. We were told that Marlin Brando has a portion of his ashes spread here at this site. He did direct a movie here in 1961 called One Eyed Jacks?"], ["Reviewed 3 days ago", 5.0, "Different world", "This is a definite attraction to visit. Looks like you're not on Earth. Very dynamic formations that are really interesting and can keep you staring for a long time. Amazing!"], ["Reviewed 5 days ago", 4.0, "Great views", "Two views can be had - take the blacktop Trail up to out look point or be a little braver and to the right is a natural Trail to the top of the rocks that is higher and spectacular! Bathrooms and plenty of parking - named after the mine manager that ran the mine then converted it to tourism ! Worth a stop !\nShow less"], ["Reviewed 6 days ago", 5.0, "Go for sunrise", "If you are in Death Valley the night before .......get up before sunrise and go her to see all the colors in the morning Bundle up if need be .It gets cold in the winter"], ["Reviewed 1 week ago", 5.0, "Awesome Views in Late Afternoon", "Zabriskie Point was our next stop after the Furnace Creek Visitor Center since it is located approximately 4 miles to the south. We visited this beautiful viewpoint in late afternoon and experienced some amazing lighting/colors/and Death Valley-Magnificence!!\n\nAs a hiker, I typically like to \"earn\" my views....but this one was a \"gimmee\" that could be enjoyed by all (including physically impaired) with an easy stop in the parking lot.\n\nRecommend a sunset viewing...or late late afternoon in order to enjoy the beautiful colors.\nShow less"], ["Reviewed 1 week ago", 5.0, "Lunar landscape", "Experience the unforgettable views of that erosional landscape famous for its unique colors and texture of the rocks. Don't miss it when visiting Death Valley National Park. You can walk around for a while or just enjoy the views standing in one place. Every part of that area is gorgeous!\nShow less"], ["Reviewed 1 week ago", 5.0, "Views not to be missed!", "360 degrees of great views, an easy walk from the parking lot. If you can be there at sunset, don't expect anything exceptional immediately after the sun goes down -- wait until the clouds light up."], ["Reviewed 1 week ago", 5.0, "Great sunset views and colors", "It's an easy walk from the parking lot next to th east entrance road, and not far from the Furnace Creek Visitor Center. Often crowded, but don't let that deter you. Go and enjoy the colors and views."], ["Reviewed 1 week ago", 5.0, "One of my favorites in DVNP", "Well worth the journey. It was the northern end of out day trip. Try to visit just after a windy night so there wont be as many foot prints in the sand. Very warm. Great site for photo ops."], ["Reviewed 2 weeks ago", 5.0, "Amazing views of valley, canyons, badlands", "This is a wonderful site to visit, large parking lot, uphill walk on pavement to the viewing area, and worth it!\nTo one side are the badlands that look like golden hills of mud (really rock), in front is a view of Golden Canyon, and the valley floor in the distance. A \"don't miss\" attraction that doesn't require hiking boots & a quart of water! Nearby is the \"20-Mule Team Canyon drive through the badland hills, another short drive for anyone, in-shape or couch potato ;-))\nShow less"], ["Reviewed 2 weeks ago", 4.0, "Unbelievable views", "Headed into Death Valley np off route 190/127. The views going in are also great. Kiosk machines to pay for entry along the way and at visitors center. Zabeiskie point has restrooms and a paved trail to point—not dog friendly. Temps mid 60’s this day. Great. Other trails in and around area\nShow less"], ["Reviewed 2 weeks ago", 5.0, "Beautiful view", "Overlook of the death valley badlands, with a trail leading into golden Canyon. View is spectacular. Walk from parking to the point is uphill and moderately steep, making it a bit of a challenge for those using assistive devices."], ["Reviewed 3 weeks ago", 3.0, "Crowded and not as scenic as the trail", "Zabriskie Point is an overlook on Hwy 190 just south of Furnace Creek. It has a good view of the badlands in Death Valley NP. There is a decent-sized parking lot and a 0.2 mi/0.3 km trail from the parking lot to the viewpoint.\n\nWe visited Zabriskie Point as part of the Golden Canyon - Red Cathedral - Badlands - Zabriskie Point - Gower Gulch loop trail. After seeing the incredible panoramic views of badlands from the trail underneath Manly Beacon, Zabriskie Point paled in comparison. We got there around 10am, and it was very crowded. If you're not a hiker, this viewpoint is for you, but it's nowhere close to hiking in the badlands.\nShow less"], ["Reviewed 3 weeks ago", 5.0, "Wow! So special!", "Possibly one of my favorite places in the world...easy to access from Furnace Creek. Lovely views of all the neutral colors God created from the beginning...easy to see His artistry without driving very far in the park."], ["Reviewed 3 weeks ago", 4.0, "Good View of Bad Lands", "This area was busier than some of the other places we went but you get an excellent 360 degree view of the badlands in the park with good signage to explain what you are seeing."], ["Reviewed 3 weeks ago", 5.0, "What a view at Death Valley!", "This spot is just beautiful- the contours and textures in the mountains are just beautiful , especially with the sunrise. It's located very close to Furnace Creek."], ["Reviewed 3 weeks ago", 5.0, "Family Trip", "Zabriskie Point Death Valley National Park, beautiful views, easy drive and short walk to view point, worth to stop there"], ["Reviewed 3 weeks ago", 5.0, "Beautiful outlook", "Very easy drive and short walk to this beautiful lookout point. You see the lovely colors of the sedimentary hills and valleys. This is a must do."], ["Reviewed 4 weeks ago", 5.0, "Get up early for sunrise", "If you go midday, it's just OK. the real beauty is to be there from pre dawn to sunrise. There was an entire photography class there taking photos. The play of the light on the rocks is what you are getting up for."], ["Reviewed 4 weeks ago", 5.0, "Gorgeous overlooks with easy access", "Beautiful views of the rocks from the viewing point. It's a bit of an uphill walk to access the viewing point from the parking lot, but nothing too difficult. As opposed to Racetrack or Father Crowley, Zabriskie Point is right in the mix and easy to access. Highly recommended.\nShow less"], ["Reviewed 5 weeks ago", 5.0, "Magical", "Just a wonderful place to spend some time this was our first call of the day of our road trip from furnace creek and well worth the scenic drive we were there at 6.30 am to see the sunrise amazing !!"], ["Reviewed 5 weeks ago", 5.0, "The best view in the park", "We hiked to Zabriskie Point, rather than drive up to it. We started in Golden Canyon and hiked 3-4 miles to the point, than back out (3-4 miles) to our car. This was a 7 mile loop trail, very beautiful terrain looking over sand dunes and mountains. Temps in January were in the 60's.\nShow less"], ["Reviewed January 20, 2018", 4.0, "One of the best views in the park", "The shapes and colours of the rocks here are pretty amazing. You can do a few walks through the canyons but I think the best views are from above looking down (good news for those who either don’t want or don’t have time for a hike).\n\nIt was very windy when we were there, so even if it’s a warm day I’d take a jacket of some sort and hold onto your hat!\nShow less"], ["Reviewed January 14, 2018", 5.0, "Amazing terrain", "Great place to visit. Easy stopover right off the road into, or out of the park, on the eastern side. Beautifully eroded hills ranging from yellow to brown. It's a bit of a walk to the top (~5 minutes?) on a gently sloping path. If you are in a wheelchair, you can probably make it if your companion is in decent shape and can push you.\nShow less"], ["Reviewed January 13, 2018", 5.0, "Perfect short hike, great views", "We decided to go to death valley while I was in my third trimester of pregnancy. My husband swore up and down this would be an easy hike for me, and he was right. I took my time, and the whole loops took us about an hour and a half. The sites were beautiful. Pack yourself some water, and be ready to take lots of pictures. There's a look out at the parking lot, but its pretty crowded. we were shocked that almost no one who visited actually did the hike.\nShow less"], ["Reviewed January 9, 2018", 5.0, "It so different and amazing", "We do not had much hopes about Death valley, but this NP very pleasantly surprised us. Zabriskie point is nothing similar what you expect to see and it's landscape is so amazing. Take a look at the pictures and you will understand."], ["Reviewed January 4, 2018", 5.0, "Great view and easy walk with kids", "This was the kids favorite stop. Beautiful views. Short incline walk. You can also hike there from Golden Canyon - 2.5 miles."], ["Reviewed January 3, 2018", 5.0, "Brilliant land formations and colours", "This point is very popular among tourist and can be crowded during high season ( December). You could choose to hike down as well. Beautiful view of the formations and lovely colours. Definitely go. Very easily accessible from the main road with rest rooms in the parking lot.\nShow less"], ["Reviewed January 1, 2018", 4.0, "Colorful View", "Hike to the side trail is a little challenge but the view on the top is well worth the effort. Although it's not the perfect lighting condition, the view is still pretty amazing, given the vast size of Death Valley."], ["Reviewed December 30, 2017", 5.0, "Magnificent", "Very special place with great views in nearly every direction. It is even more impressive you you could walk outside the observation space. It is bet to visit either in am or during subset."], ["Reviewed December 22, 2017", 5.0, "Sunset beauty", "This is an oft visited site in the late afternoon and early evening so expect there to be lots of people taking in the view and taking photos, but definitely go!"], ["Reviewed December 18, 2017", 4.0, "Great views", "Great views of the Valley and badlands from this location. Its proximity to the main road into the park, and the short hike up to the point, make it accessible."], ["Reviewed December 17, 2017", 5.0, "go there for sunrise sunset views", "Went for Sunrise in December. There is a steep (but short)walk from parking lot, so if you have health issues , may be difficult Sunrise was gorgeous, cold awaiting it."], ["Reviewed December 17, 2017", 5.0, "Awesome view!", "There are trails off the main point. I wish I would have followed one but we didn't go off the main path. Really great views. I am visiting again with my husband so he can take in these breath taking views himself"], ["Reviewed December 15, 2017", 5.0, "Incredible!", "Like never before seen rock formations. From the colour to form, Zabriskie is one amazing view point!"], ["Reviewed December 14, 2017", 5.0, "Extraordinary View", "We were wary of driving through Death Valley because we thought there would be nothing to see. We were really impressed with the scenery and changing landscape - it is quite beautiful in a very different way than most natural things we have seen. The Point has a parking lot with rest rooms near the road and a short walk up a bit of a steep hill which provides a wide view. The steepness of the hill may give you pause if you are not in a little bit of walking shape - doable with a stroller or wheelchair if the person behind it has a little muscle. You look out to a 'sea' of undulating sand and rock in varying colors and textures that is really quite impressive, across a flat 'valley' with the mountains providing a dramatic backdrop. Very serene and starkly beautiful. There is a trail to the left that allows you to walk out among the rock to get a better picture of its beauty. A very worthwhile stop.\nShow less"], ["Reviewed December 7, 2017", 5.0, "Amazing...", "When you reach the overlook...your body feels the rush of energy, it's a magical place...shapes and forms, colors and textures...is a mix of emotions."], ["Reviewed November 30, 2017", 5.0, "Unforgettable View", "A fantastic lookout with an unforgettable view of the colored badlands. There is a short uphill hike before gazing upon a panoramic view of hills and gullies. A true sight to see."], ["Reviewed November 29, 2017", 5.0, "Great place", "This outlook area is a must see in the Death Valley. It's an amazing view with an amazing geology. Very interesting point!"], ["Reviewed November 28, 2017", 5.0, "Stroller friendly to moderate", "This place is great for everyone: families with babies can do the short paved hike/walk from the parking lot to the vista platform (5-10 minutes). More challenging hikes are available below the paved road."], ["Reviewed November 28, 2017", 5.0, "What a view!!", "A short but steep climb. The view is more than worth the climb if you look over the left side of the trail near the to you will see a green hat with a burgundy bill. It blew off my husband’s head in a gust of wind!\nShow less"], ["Reviewed November 24, 2017", 4.0, "Interesting view", "Lots of different looking rocks/peaks locate at this place. Overall, the death valley should be the heaven for people who love geology, and the Zabriskie Point is one of the \"must see\" place. We have been here twice - one in the morning and the other in the late afternoon. I guess this place should look even better with the beautiful sunset.\nShow less"], ["Reviewed November 24, 2017", 4.0, "Great Lookout Area", "Zabriskie Point was an easy drive to get to and see a view of some geological activity. I love reading all the signs at the stops to help me know what happened there years ago. Take it to the next level and drive up to Dante's View too.\nShow less"], ["Reviewed November 20, 2017", 4.0, "Great Photo Op!", "Depending on the light, this place serves up some excellent photo opportunities. It's a definite \"must see\" in Death Valley."], ["Reviewed November 16, 2017", 5.0, "Great Hike!", "Great hike from the parking viewing area through the sandstone and wash! Bring plenty of water and fluids. It was warm even in early November, so be prepared before setting out on the four mile loop. Bring a map which you can pick up at the visitors center!\nShow less"], ["Reviewed November 15, 2017", 5.0, "Mesmerizing Sandstone Mountain Views", "One of my favorite locations here. Most visitors just park, walk uphill to the overlook, take selfies and such, and then leave, Then there's the group who show for the sunrises and sets. I, myself, like to drink in some blended sandstone views and then hike down the wash to the basin and badlands. From there you can roam for half a day and actually hike out to Badwater Road, if you like. The trails are marked for the most part. If you select to do this you might want to arrange a car shuttle. Or you can take a full day and hike back up. The Visitor Center can provide you with a map. Then stay for the sunset. Take care at night if you are driving back to Vegas. Not too many lights on the roadways until you get close to the Strip.\nShow less"], ["Reviewed November 12, 2017", 5.0, "Stark beauty", "We were traveling with National Geographic and the leader of our tour gave us a chance to see this location and absorb the beauty, and the harshness - I couldn't have more respect for the brave souls who crossed this terrain in the 19th century. My only suggestion for improving the experience would be for the Park Service to provide some material on how they managed that amazing accomplishment\nShow less"], ["Reviewed November 10, 2017", 2.0, "Confused what the fuss is about", "I will discuss the positive to this destination, which was the placards. It was cool to have a placard from the late 1920s showing people in the exact same spot at Zabriskie Point.\nIt was also good to learn about what created the terrain.\nOtherwise, the terrain itself was unimpressive in terms of scale or color, especially in comparison to the Badlands of South Dakota.\nShow less"], ["Reviewed November 9, 2017", 5.0, "Badlands are Breathtaking", "After Dante’s View we visited Zabriskie. Again spectacular views! I had no idea what to expect when we reached Death Valley. Not disappointed! Remember your camera or phone!"], ["Reviewed November 8, 2017", 5.0, "AWWWW", "again this place is amazing, I want to come back. there is a hike that goes down into it we did not take but when we bring the kids well do it."], ["Reviewed November 5, 2017", 5.0, "Great view", "Another must see when visiting DV. A bit of and uphill climb on wide paved path.Best seen before mid afternoon due to sun angle."], ["Reviewed November 5, 2017", 5.0, "Cool...", "If you are driving from LV to Furnace Creek, then you pass this just before you get to the hotel - it's just at the side of the road, so definitely have a look. Amazing rock formations..."], ["Reviewed November 4, 2017", 5.0, "Breathtaking views", "We visited Zabriskie point on a road trip that took us through Death Valley, the views are breathtaking and we fell in love with Death Valley.\n\nThe scenery is awe inspiring and the whole wilderness feel really appealed to us, seeing wild coyote's and also tarantula's in search of a mate were bonuses which you can never predict.\n\nWe will definitely be putting Death Valley on our list of places to re-visit.\nShow less"], ["Reviewed November 3, 2017", 5.0, "great views at sunrise and sunset", "If you want to take interesting photos, go at sunrise or sunset to get the best views. Good for hiking around"], ["Reviewed November 2, 2017", 4.0, "Easy Access. Cool Sunset. Should Do the Walk.", "Zabriskie Point with its golden brown colored badlands were unique and easy to access. Big parking space and a short walk up to the viewing area. You can also stroll down to get closer to the formations. We stopped during sunset and got lovely photos. Hard to imagine that this arid land used to be a lake 3 - 5 million years ago and that the otherworldly terrains and swirl of colors were the results of volcanic and erosion activities. Next time we would take the walk from the point around Badlands Loop. Should be awesome. It was our last stop in Death Valley before driving on to Amargosa Valley to stay the night.\nShow less"], ["Reviewed October 31, 2017", 5.0, "Worth the detour.", "You have to talk the slight detour and walk up, it's almost like a more accessible Dantes view for those travellers who don't want to hike up to Dantes view. Amazing view just can't quite see as much as D view."], ["Reviewed October 30, 2017", 5.0, "Stunning place to make your first stop", "Absolutely breathtaking views. It also serves as the trail head for several great hiking trails. DO NOT MISS THIS STOP!"], ["Reviewed October 26, 2017", 4.0, "Be careful in the heat", "Walk to the View point Zabriskie Point. We decided to do a short walk as it was getting hot and we did the Badlands loop, the volumes and rock formations were stunning. If you want to do a longer walk either go early or later in the day. The view from Zabriskie Point was very good.\nShow less"], ["Reviewed October 25, 2017", 4.0, "Walk the loop", "Standing on the platform short distance from the parking lot is nice but walking the 2,7mi/4km hike of \"Badwater Loop\" is much more fun and interesting cause you walk small canyons and pass by different colours of rock. There is a longer path to Badwater Valley via Golden Canyon and Gower Gulch as well. But mind the heat!\nShow less"], ["Reviewed October 20, 2017", 4.0, "Too busy", "The big tour buses stop here so it was crowded. No big buses at dantes View. A short walk up to the viewing platform for a lovely view."], ["Reviewed October 19, 2017", 5.0, "Amazing!", "One of the best place I have ever visited! It looks like an other planet. The car parking is not so far from the amazing view point. The weather was just great in October. There was 35 C degree, which is convenient. Seriously, i loved that place :)\nShow less"], ["Reviewed October 17, 2017", 5.0, "Great stop", "It was roasting but it was good getting out of the car to stretch our legs. Glad I wore hiking boots most of our trip, it was a short walk up but the view was amazing."], ["Reviewed October 16, 2017", 5.0, "Fave Spot", "This was my favorite spot in the entire park. A lovely spot for a quick stop off and a photo op. Amazing scenery."], ["Reviewed October 15, 2017", 5.0, "Interesting facts about Borax mining", "As a U2 fan we had to stop here since part of the pictures for their album Joshua Tree were taken here. The info boards on site provide interesting facts about the Borax mining and the scenic view is priceless."], ["Reviewed October 13, 2017", 5.0, "Very cool views", "You can either just hike to the top and look at view, or follow one of the trails deeper into the park."], ["Reviewed October 12, 2017", 5.0, "Great View And Colorful", "Been a while since I was here. There have been a lot of improvements to the parking area and you can actually find a spot to park. There is a short hike to the top of the view point that overlooks the area. It is really a wonderful spot for photography at the right time of the day. There are trails that you can take into the valley below.\nShow less"], ["Reviewed October 11, 2017", 5.0, "One of the major viewpoints in Death Valley Park", "This is another spectacular viewpoint in Death Valley Nation Park. Although my only reference to this spot is the not very successful Antonioni film by the same name, this viewpoint is a not-miss if you are going through the park."], ["Reviewed October 10, 2017", 5.0, "Awesome views", "Along with the rest of death valley, this is a place of stunning natural beauty. Very close to Furnace Creek. Wander round it for as long as you can stand the heat!"], ["Reviewed October 5, 2017", 5.0, "Breathtaking landscape full of strange geologic features!", "Before leaving the park bound to Las Vegas and visiting Dante's View, there is this wonderful place. You will not believe nature did all that.\nIt is very close to the main road (CA190) and after parking the car at the lot, there is a short while a little steep climb to the overlook.\nIt was warm but I guess in cooler days you will want to stay longer and enjoy the scenery.\nShow less"], ["Reviewed October 5, 2017", 4.0, "Unique landscapes!", "The walk from the free car park is about 200 metres - long enough to justify taking a bottle of water.\nThe views are definitely camera-worthy, especially the unique rock formations. We stayed for the sunset which wasn't that spectacular - the sun is dropping behind a mountain ridge rather than below the horizon - but worth being there to see the light gradually fading from the surrounding rock faces.\nIt's free, it's easy to find, and you won't see anything quite like it anywhere else!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Surreal!", "This is another “Do Not Miss” stop on your “What To See” list for Death Valley. Some say that Dante’s View is better, but I say it’s beautiful in a very different way. The views from here are just surreal. Very unique looking rock formations and the view is nothing like Dante’s View. Don’t miss either one!\n\nThis is a viewpoint that is best experienced early in the day. The early morning shadows photograph beautifully and are just stunning. But also, from a practical aspect, the walk up to Zabriskie Point may be relatively short, but it is pretty steep. My husband and I stopped a couple times along the way, snapping pictures, and resting. It would have been a lot harder in the heat of the day since it was 108 later in the afternoon. We visited in mid-September, so it gets even hotter than that in the summer. Don’t forget your water!\nShow less"], ["Reviewed October 1, 2017", 5.0, "Views to die for!", "The climb to the top is steep, but worth every step. The views of the badlands are awe inspiring and will stay with me forever."], ["Reviewed September 26, 2017", 5.0, "Family Vacation", "This was the most beautiful spot in the entire valley and, if you are in the park anyway, you really should go. Being from Maine, the landscape was really quite breath-taking, but so was the air. We visited in August and it was very, very hot. Be sure to wear light clothing, bring water, and take breaks when walking up the hill if you need to. The best views are from the top (always!).\nShow less"], ["Reviewed September 25, 2017", 4.0, "Zabriskie Point Death Valley visit", "We stopped here for an hour to see the main areas of Death valley on our way to Yosemite and it's hard to put into words how desolate this place really is. The views are amazing and it's hard to believe anyone could survive out here for too long. The names give a clue to how hot it can become. Furnace Creek ,Dante's view, Devils golf course, just sums up this unusual place.\nShow less"], ["Reviewed September 25, 2017", 5.0, "Zabriskie point", "Yet another beautiful landscape to visit , worth the time and effort to get a glimpse of something special :)"], ["Reviewed September 20, 2017", 5.0, "Good sunrise spot", "This is a beautiful place to watch the sun come up. It looked as if the sun was laying blanket of light down over the mountains. This was one of my favorite views in the entire park."], ["Reviewed September 19, 2017", 5.0, "Amazing landscape starting right in front of you", "Amazing spot in the middle of the landscape. Do not hesitate to walk the river bed remembering the scenes of the film right around you."], ["Reviewed September 10, 2017", 4.0, "Beautiful views but take care in the heat", "It's just a 200m walk from the car park (restrooms available) to get to the views but I saw people in flip flops and vest tops looking ripe for sunburn and heatstroke.\n\nWithout getting all Grandma on people, please ensure you wear long pants, use an umbrella to shade yourself and drink 1 litre of water an hour.\n\nCombine with Dante's View for a great morning, then head to Furnace Creek Visitor Centre to cool off in the air con and check out the fascinating exhibits to learn about the area.\n\nIn my opinion this is too hot to see after 12 noon in the summer months. Get here early! Dante's Peak is a little cooler so maybe do this one, Badwater and Artist Drive first.\nShow less"], ["Reviewed September 10, 2017", 5.0, "Great place to view - especially the sunsets.", "This is about 3/4 miles from Furnace Creek ranch and is worth the trip. Good car park (free) and a short uphill walk to the point itself. Take binoculars as all sorts of wildlife comes out as the temperatures start to drop."], ["Reviewed September 9, 2017", 4.0, "Short walk with great view", "The walk from the parking is only 200 m and the views were stunning. Recommend combining with \"Artists Palette\" and \"Artist´s Drive\"."], ["Reviewed September 8, 2017", 5.0, "Rare mountain formations", "Apart from the fact that it was way too hot to hike, the formations was worth the battle in the heat. Do carry sun protection and plenty of water. We spent the day exploring Death Valley and I'm glad we did so."], ["Reviewed September 6, 2017", 4.0, "Great views", "This viewpoint offers great views of the valley, but it can't really beat Dante's view, which is much higher up."], ["Reviewed September 4, 2017", 5.0, "Great view - steep climb up paved path", "It's just another great place to stop and see Death Valley. All of the stops in the park are worthwhile because they are all so different and it's all fascinating."], ["Reviewed August 28, 2017", 5.0, "You just have to see a sunset there", "We were lucky to arrive at Zabriskie Point at the sunset. The views were just amazing and the evening temperature allowed us to enjoy them from the outside of our car."], ["Reviewed August 27, 2017", 4.0, "Great star gazing", "Zabriskie is a great place to go star gazing. Very little ambient light so you can see the milky way and thousands of stars."], ["Reviewed August 25, 2017", 5.0, "You have to check it out.", "You can read the reviews and all basically say the same thing; breathtaking, awesome, amazing. You just have to take the time to come out and do it yourself and check it out because it’s kind of indescribable how beautiful it is."], ["Reviewed August 22, 2017", 5.0, "A beaut!", "Driving around Death Valley, each area was so different to the other that you are just left in amazement at this natural wonder. Zabrinskie Point is best visited at Sunset, which is what we did and were well rewarded. On the day we were there 2 days ago it was 115°F at Badlands area.\nShow less"], ["Reviewed August 22, 2017", 5.0, "very nice views", "We went here on our way to Las Vegas after having spent 3 days in the Valley. We stayed in Furnace Creek and we felt the distance was too much to just drive there for this sight, however, when driving there anyway, then stop and visit. It is really, really nice here! Take your time to enjoy the views.\nShow less"], ["Reviewed August 19, 2017", 5.0, "Short, but unforgettable stop", "Breathtaking view that appears \"fake\" not just on the pictures, but even when you are looking at it with your own eyes. I feel like I have to mention over and over again that exploring the Death Valley requires appropriate attire. What I mean, please wear and dress your children in light color cotton long sleeve shirt, long pants, wide brim hats and comfortable shoes (if you want to be really ready: shemagh works amazingly, when hiking there).\nShow less"], ["Reviewed August 18, 2017", 5.0, "Superb view. Worth the little walk to viewpoint.", "The walk from the carpark up to the viewpoint is short but in the desert heat still quite an ordeal. But the views are worth it!"], ["Reviewed August 17, 2017", 5.0, "Good Views from Zabriske Point, Death Valley National Park", "We drove in from Pahrump to Death Valley National Park. Zabriske Point is the first good view of the national park. There is a parking area and then a walk uphill to see some nice panoramic views."], ["Reviewed August 17, 2017", 5.0, "Multiple Return visits- always fantastic!", "Every time I visit Death Valley I visit Zabriskie Point. It's my most favorite spot in this national park.\n\nAs others mentioned, there is a short steep incline to walk up before you see the \"goods\". And yes, it can get very hot, as it does anywhere else in The Valley. Time your visit to arrive before sunrise. Sunrise at Zabriskie is truly worth getting up for! You can arrive a good 20-30 minutes after the officially listed sunrise in Death Valley as the sun has to clear some mountains before illuminating Zabriskie Point.\n\nStaying in a hotel in Death Valley is your best bet. During late spring, summer, and through late fall try to get any hiking in before 10 AM. After that time the temperature can get very unpleasant.\n\nWe stayed at the BW in Pahrump, Nevada. The drive to Zabriskie Point from Pahrump is about 1 hour.\nShow less"], ["Reviewed August 16, 2017", 4.0, "Great views of the salt flats", "Car park is immediately off the main road through Death Valley so an easy stop to make, although quite a steep climb up a paved ramp to get the views."], ["Reviewed August 15, 2017", 5.0, "Very good", "This was a very hot place it was worth walking up the short hill to take some photos we will not be going back as it's too hot"], ["Reviewed August 14, 2017", 5.0, "Great First Stop in Death Valley", "Take a short, uphill walk on a paved path to see a great view. I was there mid-afternoon in April and the sun was hot, but bearable."], ["Reviewed August 13, 2017", 5.0, "Drive through from Las Vegas", "Came across the pull in for this attraction directly off the road whilst driving through Death Valley Park. Plenty of parking for visitor numbers, toilets and a short paved walkway to a lookout point with good views and information boards. Worth pulling over to check out. Stunning scenery and interesting information.\nShow less"], ["Reviewed August 12, 2017", 5.0, "Inspiring Viewpoint--- Not to be missed!", "Recently, the NPS improved the parking area and walkway up to the viewpoint. There is an incline, but worth every step. One of the best viewpoints within Death Valley."], ["Reviewed August 10, 2017", 4.0, "Nice views, easily accessible", "A short walk from the car park up a paved path. Nice views of the valley and worth a visit. Not much else to say really."], ["Reviewed August 9, 2017", 4.0, "Welcome to the 7th gate of hell", "This place is very convenient compared to some of the other attractions in death Valley. It is very hot! The walk to the viewing point is easy enough but be careful with the heat. It's a very photogenic location that obviously is Photoshop and photo filtered on most social media. There's not a lot of cell phone service in this area and there are no gas stations. Make sure you have water and other supplies in case you run into complications. Please be very careful if you have small pets or children.\nShow less"], ["Reviewed August 9, 2017", 5.0, "Short hike, but worth it", "This was a great stop on our tour of Death Valley. The scenery is great. It is a short hike, but worth it. If it is really hot outside, it feels like you are getting blasted by a furnace on the way up. The overall park is fantastic to visit!\nShow less"], ["Reviewed August 7, 2017", 5.0, "unbelievable view of the desert", "Stopped here on the way to the badwater basin where our hotel was.\nPlenty of parking and a gentle climb to an observation point.\nFantastic views of the desert and rocks you can really see the different colours and pigments, even better as the desert was in bloom but the barren parts were also unbelievably beautiful.\nDefinite must if you are passing, even just for 30-40 minutes.\nSunblock, appropriate clothing and water essential\nShow less"], ["Reviewed August 6, 2017", 4.0, "Try the path less travelled GO RIGHT", "My son and my doggie and I arrived it was just turning 10am and it was already passing 100 deg. f. We say a lot of people who had followed the paved path to the point, but we saw a path less traveled to the right. We ended up walking up about twice the elevation of the paved path and we really enjoyed the secluded feeling that gave us.\nShow less"], ["Reviewed July 31, 2017", 3.0, "A disappointment after Dante's View", "We stopped here after coming down the hill from Dante's View. After taking in that magnificent view, Zabriskie Point is really rather underwhelming. There is certainly an interest to the place and it is worth a quick look, but if it wasn't on the main route it wouldn't be something worth detouring for,\nShow less"], ["Reviewed July 30, 2017", 5.0, "Get to the point", "This ended up being our favorite spot in Death Valley. The view was amazing and the walk short. It's before you get Into the heart of DV or visitor center too. Make sure you have plenty of water and walking shoes..."], ["Reviewed July 29, 2017", 5.0, "One of My DV Favourites", "Great view and photo opportunities, but what I like best is hiking through the area down below. The lookout is usually packed with people but the trail below has been completely empty when I've been there."], ["Reviewed July 28, 2017", 4.0, "Pretty view", "Stopped at this overlook on our way out of the park. It was so hot so just walking up the short hill took a lot of effort. It was a nice view though when we got there."], ["Reviewed July 19, 2017", 5.0, "Similar to the Badlands--gorgeous", "The sights here are very different than other places in the park, much more like the Badlands in South Dakota. It was 127 degrees when we were there, but we still trekked up the hill to the viewpoint to take in the sights. Beautiful!"], ["Reviewed July 19, 2017", 5.0, "Great sunrise spot", "Get there early and watch the sun rise over the valley. As the sun gets higher in the sky the sharks tooth starts to light up a beautiful golden color. Hang around after sunrise and watch the canyon below you become a palate of shadows and highlights\nShow less"], ["Reviewed July 19, 2017", 5.0, "Very easy walk", "Short walk from car park. Interesting view. Nice place for sunset. See it as the last point if you drive direction Las Vegas as close to exit from the national park."], ["Reviewed July 19, 2017", 5.0, "Interesting, a short hike!", "This hike is a shorter one off the main road, and interesting to boot. Don't miss it! It's worth the stop!"], ["Reviewed July 17, 2017", 4.0, "Visit at dawn or dusk for best experience", "This is a really great place to get some perspective on death valley. My opinion go there during the dusk or dawn to see the different colors, it actually gives you a great shot. From the car upto the end it's about 20-255 mins to walk/hike, so it's quite easy. I think it's definitely worth a view.\nShow less"], ["Reviewed July 17, 2017", 5.0, "Breathtaking", "Went for sunrise from our Ranch night stop. It was unbelievably peaceful and serene! The colours of the desert change with every minute prior to the sun becoming visage from the east. A must do if you can!"], ["Reviewed July 15, 2017", 5.0, "Eery experience!", "I visited Zabriskie Point Death Valley in June 2017. It is such an eery experience, desert like terrain, dunes, little vegetation around and to add to the experience, the heat was absolutely intense, about 46 degrees C. We could not stand out in it and the coach had to move off quickly.\nShow less"], ["Reviewed July 13, 2017", 5.0, "Easy way to see Death Valley", "If you do t have enough time to go to Dante's View, Zabriskie Point is an excellent place to get some perspective on the valley. Just a quick walk up the path to the lookout with a great view. Definitely worth the 30 minutes out of your car.\nShow less"], ["Reviewed July 11, 2017", 4.0, "Nothingness", "Walked to the point Saw sand. Then more sand. Scattered rocks but tells the story of an unforgiving place"], ["Reviewed July 11, 2017", 5.0, "Desert delight", "Sensational parched desert landscape in ferocious 124f heat in late June.\nYou have to experience it to appreciate it fully but it really is one of those must do's if you're in this region.The heat and glare take your breath away before you even make the short walk from the parking area up to Zabriskie Point.The landscape and views from Zabriskie Point itself are like nothing you've seen before yet they are so accessible by well maintained highway as you drive through Death Valley. One of life's great experiences!\nShow less"], ["Reviewed July 10, 2017", 5.0, "Windy & sandy", "This sight is right next the 190 road with expeptionally cool erosional lanscape. The viewpoint is a 3-4 minutes walk away from the parking lot. There is also a longer path if you are up for a hike but remember to bring enough water and shelter from the sun. During our visit, the wind was so strong that you had difficulties in standing on the viepoint barrier and people kept loosing their hats. Recommended.\nShow less"], ["Reviewed July 10, 2017", 5.0, "Fantastic!", "Fantastic, otherworldly view (especially if you are from the lush green terrain of the eastern US! Sweeping views are utterly beautiful!"], ["Reviewed July 9, 2017", 5.0, "Spectacular Sunsets", "Don't miss this opportunity to see beautiful sunsets over the Sierras. Handicap accessible. If driving from Stovepipe Wells leave enough time to capture the beautiful shadows on the Sand Dunes along the way."], ["Reviewed July 7, 2017", 5.0, "Incredible!", "We stopped here having driven from Lone Pine. The views from the vista point is incredible and the heat was something else. Truly wonderful to experience!"], ["Reviewed July 7, 2017", 5.0, "Must stop for photography", "Unbelievable view all the way to Yosemite Valley. Short walk up a paved way gives you great photos. Close to both Badwater and Artists Pallet"], ["Reviewed July 6, 2017", 5.0, "A nice 1st stop before the Visitor Center.", "My daughter and I visited Zabriskie Point on June 2nd, arriving around 10am. This was our 1st stop in DVNP. It is an easy, uphill paved path. But a very cool first impression of the park. I am glad that we stopped and took in the sights. A good spot to take a photo too. It was not too busy when we were there. Next stop, Furnace Creek Visitor Center.\nShow less"], ["Reviewed July 5, 2017", 4.0, "Excellent views and easy access", "There are some amazing views at Zabriskie Point. It is easy access off of the main road. It is worth the visit, but it does not compete with the experience at Dante's View."], ["Reviewed July 3, 2017", 5.0, "Popular stop but worth it", "There were a lot of people! We pulled in to a packed parking lot. Lots of tour buses. We had to walk uphill a bit, but the pathway was paved and easy. When we got to to the top the view was awesome. It doesn't take a long time to see the site and it's worth it. If you are in the area then pull over!! You'll be glad you did.\nShow less"], ["Reviewed June 27, 2017", 5.0, "Beautiful Landscape", "This is a must-visit spot if you're at Death Valley. It's also the most famous spot so expect it to be crowded. The colours, shapes, and patterns are absolutely unique. Do yourself a huge favour and visit this at sunrise or sunset! Unfortunately, we couldn't do that due to our tight schedule. Remember to take lots of photos, and make sure they're good - don't rush.\n\nA few general tips for Death Valley:\n- Death Valley holds the record for the highest reliably recorded air temperature in the world (134°F / 56.7°C). Therefore, make sure you have lots of food and especially water. Wear breathable clothes.\n- If your car doesn't have a GPS, use real maps or offline Google maps since you won't be able to connect to the internet. We used offline Google maps.\n- Bring a nice camera so you get some unforgettable photos!\n\nAbout our road trip:\n- 3 friends, 8 days, 14 states, and over 5000 miles.\n- Since we knew our trip would be very hectic, we only visited what we thought were the best places at each location.\nShow less"], ["Reviewed June 25, 2017", 5.0, "Great view", "Great place to get salt flats pictures. It is a fairly steep walk up to the top. It was very hot so we were hustling to get to the top. Not a bad walk if you take your time."], ["Reviewed June 25, 2017", 4.0, "Drive on the loop was as good as the point", "Thought the point was great, but the drive - occasionally though small canyons - was surprisingly nice too. The road is in great condition. It is one way, narrow, and twisty at times, but a lot of fun and enjoyable."], ["Reviewed June 23, 2017", 5.0, "Unique Views but crowds", "Close from Furnace creek, unique views , require short walk to main view points. usually a lot people there, plus it can be very windy and hot"], ["Reviewed June 23, 2017", 4.0, "Hot, Hot, Hot but worth the walk for the view.", "It was 131 the day we did this 2-3 minute walk from the carpark to the top of Zabriske Point, it was hot, but so worth it to read the history and see the view. Been there, done that. ? Ticked that box."], ["Reviewed June 23, 2017", 5.0, "A Highlight and Must-See in Death Valley. Great Place to Stargaze! 10 Minute Drive from Furnace Creek Ranch.", "Definitely a highlight and must-see in Death Valley. We went there on our last day on our way out of the park. Park in the parking lot and then walk up a short winding hilly road. At the top you are surprised by a stunning geological site of folds of colored earth! There are sign boards describing what you can see. Great place for photographers and star-gazers!\n\nTen minute drive from Furnace Creek Ranch. Protect yourself from the sun with a hat, sunglasses and sunscreen and wear comfy shoes.\n\nIf you found this review useful, please click the THANK button. Happy travels. ;)\nShow less"], ["Reviewed June 23, 2017", 5.0, "Guided excursion to Death Valley", "Beautiful place to take pictures from. Wonderful view on different colorful mountains and the salt lake. Gives a great impression about how the Death Valley looks like.\nInteresting to read/hear the story about the place.\nSee pictures made with my Relonch camera for a better impression.\nShow less"], ["Reviewed June 21, 2017", 4.0, "A short walk for a great view", "A great overlook of Death Valley. Probably one of the prettiest places to get a cool, due to elevation, viewing of the valley. Worth the short drive to see."], ["Reviewed June 21, 2017", 5.0, "Busy!", "This is the first main stop in Death Valley if your coming from Las Vegas and very busy! The views are great but the large amount of people kind of take away from the experience."], ["Reviewed June 9, 2017", 5.0, "Must See Spot", "Many films have used this spot for various scenes. The Twilight Zone used the area, and Star Wars filmed nearby in Golden Canyon and Artists Drive. Kinda cool to find the same spots. Rock formations are fantastic to see. Hiking trails lead from the point into Golden Canyon. One of the iconic features of Death Valley!\nShow less"], ["Reviewed June 6, 2017", 5.0, "Stunning first stop as you go through Death Valley", "Even if you're just driving through Death Valley, you must, absolutely must, stop here for 15 minutes or so. My grown children and I thought it the most beautiful of all the sites we visited in the park. The colors and shapes of the mountainsides are amazing--just as wonderful, I think, as the glorious national parks in Utah.\nShow less"], ["Reviewed June 5, 2017", 5.0, "Visit at sunrise or sunset", "When first arriving, we stopped here and were impressed with the view however, it was an incredible sight when we went back at sunset. There were many people there for sunset pictures and the sight was so breaktaking, you could almost hear a pin drop."], ["Reviewed June 5, 2017", 3.0, "INTERESTING EROSION PATTERNS", "Located along the highway into/out of the park on the eastern side. Can get quite busy at times (crowded parking lot and path to observation area). Short, steep hike up paved path to viewing area. Best colours are early morning/late afternoon, also cooler at these times depending on time of year (no shade). If you visit Death Valley, definitely take the time for a stop (15 - 20 minutes if more than enough)\nShow less"], ["Reviewed June 4, 2017", 5.0, "Fantastic Views of Formations", "Our first stop in Death Valley. It was breath taking for us as we didn't expect this kink of landscape in the valley. Completely changed what we thought about Death Valley. Good explanation of the area and an intro to Borax mining in the area. A must stop while touring Death Valley\nShow less"], ["Reviewed June 3, 2017", 5.0, "Stunning views of natural formations", "This visit was not planned originally, but a talk with a local guide and fellow foodie at the Panamint Resort changed our driving plans. It would have been a bad miss if we had not viitied this place."], ["Reviewed June 2, 2017", 5.0, "Visit at sunset!", "Zabriskie Point is an amazing place. You park and then walk up a little hill to get a beautiful view of many rock formations. I have visited in the heat of the day and at sunset--both are great, but sunset was amazing. There are benches to sit and enjoy the views!\nShow less"], ["Reviewed May 31, 2017", 4.0, "Easy access photo shoot of a beautiful landscape", "Much easier walk about than Dante and more busy. Good signs that explain the history. Death Valley was more beautiful than i would have imagined."], ["Reviewed May 29, 2017", 5.0, "A study in geology", "Hike the short hill to an elevated overlook of colorful, undulating gullies and mud hills at the edge of the Black Mountains."], ["Reviewed May 28, 2017", 5.0, "Fantastic view", "Beautiful view, easy parking, hiking with various degrees of exertion. A view of old Borax mining site. A geologists wonderland. One of my favorite spots in the Park"], ["Reviewed May 25, 2017", 5.0, "A must see if you are in Death Valley National Park", "We recently visited Death Valley and the whole thing was spectacular. Zabriskie Point had some of the most beautiful natural desert scenery we've ever seen. The dunes are amazing, the various colors of the rock formations were beautiful. We got lots of great pictures. There is a good walk way to a great overall view point. Parking is good. We are glad we saw this and would go again, and recommend it to others.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Best seen at sunrise", "Beautiful area - well worth getting up early for. It can be a crowded area if seen in peak season. Its a very easy hike up to the view point and there are areas to hike if you're up for more. One of the highlights of the trip.\nShow less"], ["Reviewed May 25, 2017", 4.0, "Popular", "Most popular viewpoint in the park probably because of its accessibility. It is indeed beautiful but I think our expectations were higher. Still worth visiting."], ["Reviewed May 25, 2017", 5.0, "Good view of the terrain", "Very easy access to the parking lot and a short walk to the point. The path is paved for wheelchair access. The tarrain contours and colors are very apparent. Great view"], ["Reviewed May 25, 2017", 5.0, "Amazing landforms and great views!", "With parking right at the base of Zabriskie Point this is a great place to visit as you pass through Death Valley. Stunning views and only takes 5 minutes or so to walk from the car to the top. You won't want to be out the car more than 10 minutes or so as the heat is pretty intense.\nShow less"], ["Reviewed May 24, 2017", 5.0, "Zabriskie point", "It is very beautiful. We went there to see sun rise early in the morning, it was beautiful. But I think sunset might be better appropriated there. I guess it's one of the highlights of Death Valley. Don't miss it. It's very close to visitors center.\nShow less"], ["Reviewed May 23, 2017", 4.0, "Hot but Beautiful", "Zabriskie Point offer a spectacular view of the many different colors offered in Death Valley. With the high temperatures and inclined walkway it takes a little stamina to see the beauty. It is well worth the effort."], ["Reviewed May 23, 2017", 5.0, "Sunrise is quite nice", "We came here at sunrise and it is great to see the colors change and all come into view. It is quite busy and lots of cameras set up, but worth it."], ["Reviewed May 22, 2017", 5.0, "Amazing vista within a short distance from the road", "Simply amazing viewpoint in Death Valley. One can see the badlands in foreground, salt basin in the middle and mountains of Panamint range further out. Must see attarction given it is so close to the road. We tried hiking down into the badlands but found ourself slipping and sliding on gravel, so returned. There is trail that goes to Golden canyon on the other side of badlands. This is touted to be ideal spot for sunrise pictures. What I found was that after sunrise there was a nice glow in the sky but once the sun cleared the high range of mountains to the east, it was already too high in the sky and too strong and contrasty for good photographs.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Amazing formations and colours", "Zabriskie Point s easy to reach by car, it is just 10 min. from Furnace Creek. From the parking lot there is a paved walkway to the viewpoint (3-5 min.). There is also a toilet at the parking.\n\nThe Zabriskie Point is us for is one of the highlights in the Death Valley. The coloured rock formations are beautiful.\nShow less"], ["Reviewed May 22, 2017", 5.0, "Climbed up one of the hills and had difficulty getting down", "Climbed up one of the hills and had difficulty getting down so slid down on my bottom. Big mistake in the heat."], ["Reviewed May 21, 2017", 5.0, "Incredible at sunset", "This is a pretty iconic place for a reason, and that reason is a combination of the interesting rock formations and the way the sun lights them up and makes the striations in the rock stand out, particularly at sunset or sunrise."], ["Reviewed May 18, 2017", 5.0, "Awesome", "This is easily accessible. Great view. Uplifted hills. Hills in foreground with mountains behind. Don't miss"], ["Reviewed May 17, 2017", 3.0, "Just OK", "Its pretty but everything seemed to blend into itself to me. I didn't do the hiking that is available due to lack of time but it looked fun."], ["Reviewed May 13, 2017", 4.0, "We always get a good photo here", "Walk a little way up an embankment and you'll get a view you won't forget. Being a dark sky park, this is an excellent place on a moonless night to get milky way photos, or just sky shoots. The darkness will enhance your photography and slow F-stops and holding for a countdown will gift you with a sky photo.\nShow less"], ["Reviewed May 10, 2017", 5.0, "Extraordinary!", "It's a moonscape! Must see at sunrise when the beautiful formations get touched by the sun. The colors are spectacular. Expect crowds.. before sunrise the photographers are Competing for a spot-- there's more more than enough room for everyone! A Must See!"], ["Reviewed May 3, 2017", 4.0, "Breathtaking", "Amazing views of Death Valley and some of the geological formations in and around it. Good access and great photo ops, if people stayed on the trails."], ["Reviewed May 3, 2017", 5.0, "My Favorite Place", "Death Valley is huge. There is a lot to see. Zabriskie is highest on my list. My ashes will be tossed here when I die. (not before) There is a wonderful hike from golden canyon to Zabriskie which I have done a couple times. A great 1.7 mile walk. These \"badlands\" are a must see and are totally accessible from 190. don't missZP!\nShow less"], ["Reviewed May 2, 2017", 5.0, "Gorgeous view", "Great views of basin ! Winding drive up . Nice parking. Hike around to see all the views . Looks different all times of day"], ["Reviewed May 1, 2017", 5.0, "Go a couple hours after sunset", "You might want a flashlight or cell phone although the path is paved and a little elevation but easy\nStars are amazing\nIf you can plan a night will new moon you will be blown away how vibrant and close the Milky Way looks\nBut good view point for stars anytime\nShow less"], ["Reviewed May 1, 2017", 5.0, "coming closer to the Valley", "good spot to look over the basin. It is dry and hot. Bring plenty water. About 10min climbing to lookout point."], ["Reviewed April 29, 2017", 5.0, "More than a view point", "We very much enjoyed this site as it wasn't just a view point, we had hike/trail options. We did the Badlands Loop, had the trail all to ourselves at that time of day, took ridiculous/funny pics, laughed out loud without being heard and had a great time!\nShow less"], ["Reviewed April 29, 2017", 5.0, "Glad we went", "Please take the time to visit. A geologist's dream. A bit of a challenge for senior walkers, but we made it."], ["Reviewed April 28, 2017", 5.0, "Spectacular Panoramic View from Zabriskie Point!", "We visited Zabriskie Point whilst staying at Furnace Creek Ranch about 10 minutes drive away.\nThere is a large car park with a concrete path up to the viewpoint.\nIt is quite a steep walk, in the blistering heat, but highly recommended because the panoramic views at the top are very spectacular.\nIt is also worth going back to the car park at night because the sight of millions of stars are amazing when viewed in complete darkness!\nShow less"], ["Reviewed April 27, 2017", 4.0, "Wonderful scenery", "Magnificent view and harmonic atmosphere. Respect for Mother Earth increasing - how many wonders have happened. Wherever you look there are fascinating things to see and absorb. A great place to stopover."], ["Reviewed April 27, 2017", 5.0, "Must Drive up here if you are in Death Valley!", "If you are exploring Death Valley, take the time to drive up to this point. The views are amazing and there are some nice hikes from this parking lot."], ["Reviewed April 26, 2017", 5.0, "Loved this hike!", "Don't walk out to the point... Take the trail to the right and climb upward! Be very careful as many parts can be quite dangerous and slick... be sure to have great hiking shoes with excellent traction, poles may be helpful too... Turn back if unsure, don't risk it! Happy Hiking!\nShow less"], ["Reviewed April 25, 2017", 5.0, "Phenomenal start to a day trip at Death Valley", "What a breath taking spot to see after arriving from Las Vegas for a full day of exploring. The walk from the parking lot to the look out point is short with multi-hued peaks that will amaze you. Easy access to more strenuous hiking through, up and down the peaks.\nShow less"], ["Reviewed April 24, 2017", 5.0, "A Surreal View of amazing rock formations in a dramatic location", "We visited Zabriskie Point on two occasions - once during the day, and a second time at sunset. On a clear day, sunset or sunrise provide incredibly beautiful views of this very special place. If the National Park Service had the smarts to set up a wine bar at this location they would discover the a way of subsidizing their budget that might exceed their expectations.\nShow less"], ["Reviewed April 23, 2017", 5.0, "Amazing Scenery", "Zabriskie Point is absolutely beautiful like most places in Death Valley N.P.\nThere's a really good vewing point with plenty of parking. Great photo ops to be had. Try to get there as the sun is setting as it casts beautiful shadows as well as colours across the hills and dunes. It really is quite magnificent and right by the highway so easily accessed.\nFantastic scenery.\nShow less"], ["Reviewed April 22, 2017", 5.0, "Gorgeous", "We stopped at Zabriskie Point as we were leaving Death Valley National Park. The views are spectacular. I cannot even describe just how beautiful it is. I highly recommend visitors to Death Valley to stop and enjoy the beauty of Zabriskie Point."], ["Reviewed April 20, 2017", 5.0, "Cool overlook", "This is an easy pull-off on the main highway. Unique rock formations with sweeping views over the park. Short uphill walk...very windy!"], ["Reviewed April 19, 2017", 5.0, "beautiful views and option to hike", "so easy to get to (just a mile or so from Furnace creek) and well worth the trip! We just came for the view but another time taking a hike from here would have been great."], ["Reviewed April 18, 2017", 4.0, "obvious stop", "This view is very easy to get to, just pull of the highway and make teh short walk to the viewpoint. Wonderful views, especially near sunrise and sunset."], ["Reviewed April 18, 2017", 5.0, "Wow", "This was our first stop in the park driving there from Las Vegas. Large parking lot with a couple of bathrooms, small uphill walk on a paved trail. Great view of the hills and valleys down below over all had a wow factor."], ["Reviewed April 18, 2017", 5.0, "zabriskie point, an excellent view point", "whilst driving down to furnace creek in death valley, we (from the uk in rented RV), my girlfriend and i stopped at zabriskie point for a photo opportunity\nthe car park is quite large with a toilet block, with space for coaches and plenty of cars, and there are several view points on the way up to the highest point\nit is quite a steep walk, but manageable for most people with wheel chairs or buggy's etc.\nthe views across and down the valley are quite spectacular, and well worth the visit.\nShow less"], ["Reviewed April 17, 2017", 5.0, "Great short stop.", "This was our second stop on our one day trip in DVNP. It´s a small uphill climb but well worth it. Great place to take photos of the geological features."], ["Reviewed April 16, 2017", 5.0, "short walk", "enjoyed the different terrain on this very short uphill walk to a photo opportunity. Parking is limited and at a premium near sunrise and sunset."], ["Reviewed April 15, 2017", 4.0, "More interesting geologic features", "Any stop in Death Valley is interesting and informative. This is a really diverse park, so every place is quite different"], ["Reviewed April 14, 2017", 5.0, "Beautiful views", "Quite short walk uphill and the whole valley is at your feet. The views are unrivaled. One of the first stops on the way to the valley itself"], ["Reviewed April 14, 2017", 5.0, "Glorious!", "This was the first DVNP attraction we stopped at during the drive from LAS to Stovepipe Wells Village. What a glorious view! Crowded, noisy, yet glorious and captivating nonetheless. There were hiking trails starting at Zabriskie Point. We plan to take the hikes in future visits.\nDVNP: Death Valley National Park\nShow less"], ["Reviewed April 14, 2017", 4.0, "Good intro to Death Valley", "Stop on your way into the park . .1/4 mile walk to the viewpoint .. ya gotta do it . .very famous overlook. There is a 5 mile or so loop trail that is awesome too . .highly recommend the trail."], ["Reviewed April 11, 2017", 5.0, "One of Death Valley's Top sights", "I asked a friend for advice as he had just visited Death Valley before us and Zabriskie Point and Dante's View were on the top of his list, and rightly so. We had intended to go to Zabriskie Point at dawn but a dust storm the previous afternoon and continuing wind changed our plans. We got there between 9 and 10 am and we were lucky that there was a cloud cover and the sun was just peeking out from behind the clouds illuminating Manly Beacon first, before the other areas. It was very dramatic. The access is all paved from the parking lot area and was easy for us, not so active seniors but might be hard for some as it is a little climb to the best viewing area. We passed by the area in the afternoon and noted that there were buses and so many people up on the top viewing area, We were glad we had come fairly early as there were only a very few people sharing out time on top. Put it on your list of top sights.\nShow less"], ["Reviewed April 11, 2017", 5.0, "Best view", "This lookout has gorgeous views of the national park. It was just breathtaking! By far our Favourite spot in Death Valley!"], ["Reviewed April 11, 2017", 5.0, "Best view of Manly Beacon", "This is another early morning spot. The mountains across the valley light up first at sunrise. Eventually Manly Beacon is bathed in sunlight. Easy walk from the parking lot."], ["Reviewed April 10, 2017", 5.0, "Zabriskie Point Hike", "There are multiple hiking options and great views and badlands formations to see. The hikes are fairly easy and short."], ["Reviewed April 10, 2017", 4.0, "Hot and Beautiful!", "It's hot, it's dry and it's beautiful. The colors are amazing. But be forewarned that it can get very hot in the sun, and there is no shade to be had. It's a great place to stop and take pictures, but be careful. Water is a must, and people with health issues should be very, very careful. The heat is not to be taken lightly.\nShow less"], ["Reviewed April 10, 2017", 5.0, "A great starting point", "While most people come to see the sunrise and sunset - both spectacular - Zabriskie Point is a great place to start a hike through the badlands of Death Valley. If it is not too hike (in Death Valley!?$) and you are strong of legs and lungs, consider a hike down to Golden Canyon. About 2 1/2 miles of up and down trail, it gives you an up close and personal experience - the colors and formations are not to be missed. Ideally, you would have a friend drive down from ZP to the parking lot at Golden Canyon - otherwise you have a long, hard and uphill trip back to the ZP parking lot.\nShow less"], ["Reviewed April 8, 2017", 4.0, "Great sunset view", "Small hill up to the top on a paved walkway(supposedly handicap accessible) but slightly steep, great for pictures all times of day but great sunset views. Next to it is a path thru to the other side near the salt flats."], ["Reviewed April 6, 2017", 5.0, "Sunrise Splendor", "A short drive from Furnace Creek, there's a reason this spot is so popular with professional photographers. The views at sunrise are genuinely awesome. Watch as the sunlight sets the mountains surrounding the dried lake bed and Manly Beacon alight with color. Connects to a pair of trails for hikers who want to explore the area up close. Whether you visit for an hour or spend the better part of a day here, any visit to DVNP would be incomplete without seeing this spectacular destination.\nShow less"], ["Reviewed April 6, 2017", 5.0, "Outstanding!", "Zabriskie Point is easily my favorite part of Death Valley. It's easy to get to and the views are outstanding. It can get a little crowded because it's a popular spot; so, go early or late in the day to avoid the heat and all of the people.\nShow less"], ["Reviewed April 5, 2017", 5.0, "Beautiful formations", "We went to Zabriskie Point in Death Valley on April 1, 2017 at about 10:00am. The view is a spectacular formations of colorful mountains. We would have loved to hike down to the valley, but did not have time for it. This place will look beautiful at sunset and sunrise.\nShow less"], ["Reviewed April 4, 2017", 5.0, "A must see", "Beautiful view of the most unusually colored rock formations. This is one of the must see sights in Death Valley. It's very easy to get to, great parking, paved walkway to the view point."], ["Reviewed April 3, 2017", 4.0, "Short walk to awesome views", "From the bottom it doesn't look that good,but after a short (100 yes) hike you get to these fabulous rock formations. Each way you look ,the colours and formations are different. A short walk,a short visit but great memories."], ["Reviewed March 30, 2017", 5.0, "Famous views that deserve to be famous", "Go late afternoon and wait for sunset. If you're lucky enough to have a few clouds in the sky the sunset can be stunning. If you elect to stay until dark you'll be able to see stars like you might never have seen before. I can highly recommend that you stay or at least come back on another occasion when there's a clear night. The path to the viewpoints is a short climb and can be treacherous in the dark, so bring a flashlight for the climb down to the parking light. If you can manage it, bring a light with a red lens to avoid wrecking the dark adaptation of other viewers (and there will be others, I promise). Failing that, shield the light with your fingers.\nShow less"], ["Reviewed March 29, 2017", 5.0, "Zabriskie Point", "The views from this point are awesome at sunrise. The colors are accentuated by the morning sun with an array of golds, reds, browns, etc. There is a parking lot at the start of the trail to the viewpoint and it is an easy hike to the top. Photos of this point are found in books, posters, photo magazines.\nShow less"], ["Reviewed March 28, 2017", 5.0, "Nice stop", "We did not spend much time in the park. This was one of our short stops. Our pictures turned out pretty nice and we're glad we took the short, uphill walk to the lookout."]]}}